{
    "id": "2020-Army-PB-2040-JBOOK-637b9179439d133187084d0d58542f7e073fb0df2918c7dd6e5b31158e975014-34",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA7-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0303140A"
        },
        "ProgramElementTitle": {
            "val": "Information Systems Security Program"
        },
        "R1LineNumber": {
            "val": "239"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "108.755"
            },
            "CurrentYear": {
                "val": "42.520"
            },
            "BudgetYearOne": {
                "val": "29.185"
            },
            "BudgetYearOneBase": {
                "val": "29.185"
            },
            "BudgetYearTwo": {
                "val": "29.299"
            },
            "BudgetYearThree": {
                "val": "28.855"
            },
            "BudgetYearFour": {
                "val": "21.245"
            },
            "BudgetYearFive": {
                "val": "17.125"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Information Systems Security Program funding line supports the Army's Network Modernization Strategy Line of Effort (LOE) 1, Unified Network.\n\nProject 491: Information Assurance (IA) Development supports the implementation of the National Security Agency (NSA) developed Communications Security (COMSEC) technologies within the Army by providing COMSEC system capabilities through encryption, trusted software or standard operating procedures, and integrating these mechanisms into specific systems in support of securing the Army Tactical and Enterprise Networks. This entails architecture studies, system integration and testing, developing installation kits, and certification and accreditation of Automation Information Systems. The program assesses, develops and integrates Cyber Security (CS)\/COMSEC tools (hardware and software) which provide protection for fixed infrastructure post, camp and station networks as well as tactical networks. The cited work is consistent with Strategic Planning Guidance (SPG) and the Army Modernization and Strategy Plan (AMSP).  \n\nIA Development funding implements and establishes functional and technical boundaries of cryptographic, key management and IA capabilities in coordination with the NSA, the DISA, and Joint Services, to secure National Security Systems (NSS), and National Security Information (NSI). Technical evaluations assess the security, operational effectiveness and network interoperability of advanced concept technologies to develop policies, standards, and fundamental building blocks for Army COMSEC capabilities that reduce the risk of future material solutions that could underperform and disrupt classified operations. Develop and publish the COMSEC Implementation Planning Guidance to identify, standardize, and govern the insertion of CS capabilities to bridge operational gaps and support the DoD and NSA mandated requirements to enhance network capacity while providing for secure information exchange of voice, video, and data in accordance with the Army Network Campaign Plan. This will be accomplished by interoperability evaluation, standards testing, and CS, System of System Network Vulnerability Assessments (SoS NVA) for Army Capability Sets for CS\/COMSEC capabilities that provide protections for tactical and fixed infrastructure post, camp, and station networks.\n\nThe Defensive Cyberspace Operations (DCO) program provides initial capabilities that enable passive and active cyberspace defense operations to preserve friendly cyberspace capabilities and protect data, networks, net-centric capabilities, and other designated systems. Big Data Pilot provides an advanced analytics capability capable of ingesting structured, semi-structured, and unstructured data from multiple data sources (e.g., Joint Regional Security Stacks (JRSS), intrusion detection systems, intrusion prevention systems, network device log files, trouble tickets, firewalls, proxies, web and applications server log files, etc) and proves situational awareness of cyberspace battlefield. It provides the computer network defense provider with common analytic platform which informs and reduces risk associated with future material solutions and forms a blueprint for future Big Data Analytics. Big Data (analysis-of-all DoD Information Network sensor data) provides two optimized and accredited clusters deployed in support of JRSS and Defense Research and Engineering Network (DREN) with a tools suite accessible to Cyber Mission Forces via secure remote access. The Army's DCO activities are a construct of active cyberspace defenses which provide synchronized, real-time capability to discover, detect, analyze, and mitigate threats to and vulnerability of DoD networks and systems.\n\nProject DV4 & DV5: COMSEC is governed by the Chairman of the Joint Chiefs of Staff Instruction (CJCSA) 6510. In order to ensure Warfighters continue to have secured communications (i.e., encrypted data and voice), Army communications systems are required to support modern cryptographic capabilities by implementing modern algorithms. The Army's Mission Command Network Modernization implementation Plan, date 17 April 2018, states that LOE 1 to be a Unified Network which includes the attributes of being, \"Protected, Resilient, Survivable\" (p. 11) COMSEC is the Army's implementation of NSA protections to achieve LOE 1.\n\nProject DV4: The Army Key Management Infrastructure (AKMI) is the Army's implementation of the NSA KMI ACAT IAM program, automating the functions of COMSEC electronic key management, control, planning, and distribution. AKMI supports the Army's ability to communicate and distribute Cryptographic data on the Army's tactical and strategic networks by limiting adversarial access to, and reducing the vulnerability of, Army Command, Control, Communications, Computers, Intelligence (C4I) systems. The AKMI System of Systems (SoS) systems components are the Management Client (MGC), Automated Communications Engineering Software (ACES) and Next Generation Load Device (NGLD) Family of fill devices. The AKMS SoS components are the Local COMSEC Management Software (LCMS), ACES, and Simple Key Loader (SKL).\n\nProject DV5: The Army COMSEC program supports using NSA developed COMSEC technologies within the Army providing encryption, trusted software, or standard operating procedures, and integrating these mechanisms into National Security Systems (NSS), and National Security Information (NSI)systems in support of securing the Army network (which is made up of tactical and enterprise networks). This entails architecture studies, system integration and testing, developing installation kits, and certification and accreditation of Automation Information Systems. The program assesses, develops and integrates emerging COMSEC tools (hardware and software) which provide protection for fixed infrastructure post, camp, and station networks as well as tactical networks. The cited work is consistent with SPG and the AMSP.\n\nProject ET9: Embedded Cryptographic Modernization Initiative (ECMI) program was cancelled FY 2018. No FY 2020 funding is requested.\n\nProject FF8: User activity monitoring (UAM) automation\/analytics will provide technical capability to enhance Army UAM analysis effectiveness and efficiency. The UAM mission is to observe and record the actions and activities of an individual, at any time, on any device accessing Army information on classified networks in order to detect insider threats and to support authorized investigations. Army UAM is a component of the Army Insider Threat (InT) Program. Army's InT Program and UAM are conducted in accordance with the National Defense Authorization Act for Fiscal Year 2012, section 922., Insider Threat Detection; Presidential Memorandum, National Insider Threat Policy and Minimum Standards for Executive Branch Insider Threat Programs, dated 21 November 2012; Executive Order 13587, Structural Reforms to Improve the Security of Classified Networks and the Responsible Sharing and Safeguarding of Classified Information, (Reference b) dated 7 October 2011, and Army Directive 2013-18 (Army Insider Threat Program), 31 July 2013. Innovative enhancements are required to improve UAM analysis productivity, data visualization, and workflow management. The analysis productivity objective is to develop and implement user behavior models that use UAM and other network data to identify anomalous user behavior over time, and to integrated new data sources into the UAM analytical data store and processing system. Data visualization advances will present UAM analysts behavior model processing results in an intuitive format that reduce the time required to review the results. Workflow management improvements will add new capabilities to the UAM workflow management system with the objective of enhancing analysis reporting productivity and metrics collection."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "132.438"
                },
                "CurrentYear": {
                    "val": "68.533"
                },
                "BudgetYearOne": {
                    "val": "54.714"
                },
                "BudgetYearOneBase": {
                    "val": "54.714"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "108.755"
                },
                "CurrentYear": {
                    "val": "42.52"
                },
                "BudgetYearOne": {
                    "val": "29.185"
                },
                "BudgetYearOneBase": {
                    "val": "29.185"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-23.683"
                },
                "CurrentYear": {
                    "val": "-26.013"
                },
                "BudgetYearOne": {
                    "val": "-25.529"
                },
                "BudgetYearOneBase": {
                    "val": "-25.529"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.074"
                    },
                    "CurrentYear": {
                        "val": "-0.013"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-38"
                    },
                    "CurrentYear": {
                        "val": "-26"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "18"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.609"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-25.529"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-25.529"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2020 funding is reduced by $25.529 million due to the cancellation of the Embedded Cryptographic Modernization Initiative (ECMI) program.\nFY 2019 Congressional Reduction of $26.000 million for program delay ($25.000 million) and crypto modernization inaccurate contract awards ($1.000 million).\nFY 2018 Congressional Reduction of $38.000 million for excess growth (13.000 million) and excess embedded crypto modernization funding due to program delay ($25.000 million); Congressional Add of $18.000 million for Cybersecurity operations center."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "491"
                    },
                    "ProjectTitle": {
                        "val": "Information Assurance Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.787"
                        },
                        "CurrentYear": {
                            "val": "10.159"
                        },
                        "BudgetYearOne": {
                            "val": "8.368"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.368"
                        },
                        "BudgetYearTwo": {
                            "val": "8.017"
                        },
                        "BudgetYearThree": {
                            "val": "7.604"
                        },
                        "BudgetYearFour": {
                            "val": "7.645"
                        },
                        "BudgetYearFive": {
                            "val": "5.6"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "57.180"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "PE 0303140A, project 491 includes funding for the Army CIO\/G6, Project Lead (PL) Network Enablers (Net E), and Project Lead (PL) Enterprise Services (ES)."
                        },
                        "ProjectMissionDescription": {
                            "val": "Project 491: Information Assurance (IA) Development supports the implementation of National Security Agency (NSA) developed Communications Security (COMSEC) technologies within the Army enterprise and tactical networks by ensuring COMSEC devices\/systems are cryptographically interoperable and standard based. This entails architecture studies, technology assessments, secured devices testing, system integration and installation kits development to provide protections for fixed infrastructure post, camps and station networks as well as tactical networks.  The cited work is consistent with Army's Mission Command Implementation Plan LOE 1, Network Enable Functions. \n\nIA Development funding Implements, establishes functional and technical boundaries of cryptographic, key management and IA capabilities In Coordination With (ICW) the NSA, the Defense Information Systems Agency (DISA), and Joint Services, to secure National Security Systems (NSS), and National Security Information (NSI).  Technical evaluations assess the security, operational effectiveness and network interoperability of advanced concepts\/technologies to develop policies, standards, and fundamental building blocks for Army COMSEC capabilities that reduce the risk of future materiel solutions that could underperform and disrupt classified operations. \n\nDevelop and publish the COMSEC Implementation Planning Guidance to identify, standardize, and govern the insertion of IA capabilities that will bridge operational gaps and support the DoD and NSA mandated requirements to enhance network capacity while providing secure information exchange of voice, video, and data IAW the Army Network Campaign Plan.  This will be accomplished by interoperability test and evaluation, standards development, and System of System Network Vulnerability Assessments (SoS NVA) to provide protections for the Army Integrated Tactical Networks. \n\nThe Defensive Cyberspace Operations (DCO) program provides initial capabilities that enable passive and active cyberspace defense operations to preserve friendly cyberspace capabilities and protect data, networks, net-centric capabilities, and other designated systems.  Big Data Pilot provides an advanced analytics capability capable of ingesting structured, semi-structured, and unstructured data from multiple data sources (e.g., Joint Regional Security Stacks (JRSS), intrusion detection systems, intrusion prevention systems, network device log files, trouble tickets, firewalls, proxies, web and applications server log files, etc) and provides situational awareness of the cyberspace battlefield.  It provides the computer network defense provider with a common analytic platform which informs and reduces risk associated with future material solutions and forms a blueprint for future Big Data Analytics.  Big Data (analysis-of-all DoD Information Network sensor data) provides two optimized and accredited clusters deployed in support of JRSS and Defense Research and Engineering Network (DREN) with a tools suite accessible to Cyber Mission Forces via secure remote access.  The Army's DCO activities are a construct of active cyberspace defenses which provide synchronized, real-time capability to discover, detect, analyze, and mitigate threats to and vulnerability of DoD networks and systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Assessing emerging COMSEC hardware and software systems and products (PL Net E)"
                                    },
                                    "Description": {
                                        "val": "Conduct research and analyses as well as basic testing for meeting specific focused goals that will enhance the functions and support of cryptographic systems improving the security and usability of the Army tactical and enterprise networks. (PL Net E)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.466"
                                            },
                                            "Text": {
                                                "val": "As the Army implements new network technology, Secure Voice (SV) and In-line Network Encryption (INE) devices must continue to be identified and tested for effectiveness and suitability. Key areas of investigation include cyber security, interoperability, and standards compliance. (PL Net E)"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Oversight and implementation guidance of emerging Cryptographic and CS capabilities to ensure interoperability to maintain compliance with DoD, NSA, and Army policies and regulations. (CIO\/G6)"
                                    },
                                    "Description": {
                                        "val": "The program provides oversight and guidance for technical research and evaluation of Cryptographic Modernization (CM) and Key Management (KM) capabilities to ensure IA compliance and interoperability.  This effort improves operational effectiveness, ensures efficient implementation, and enhances network performance by deploying standardized COMSEC capabilities that are interoperable and supportable in Army, coalition and Joint operating environments. This program enables the Army to collaborate and participate in Joint and Army Capability Technology Demonstrations to define, improve, develop and publish Cyber Security (CS) standards for new\/modernized technology insertion to support the LWN 2025 and Beyond.  This effort assesses and defines risk mitigation of CS network vulnerabilities in end-to-end Army network operations and Common Operating Environment. (CIO\/G6)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.321"
                                            },
                                            "Text": {
                                                "val": "Performed technical analysis in support of DoD enterprise JIE\/JRSS and Army S-ICAN network\/Integrated Tactical Network (ITN) architectures developments.  Identified Army cryptographic requirement  and worked with NSA\/DISA\/DoD CIO and Army CIO G-6 to develop interoperable specifications and cryptographic solutions for HAIPE VLAN and Ethernet Data Encryption. Developed guidance memos and EXORDs in support of Army NetMod and Advance Cryptographic Capabilities(ACC) efforts. Developed updated version of the Army COMSEC Modernization (CM) Planning Guidance to guide Army CM efforts. Provided technical inputs to NSA in support of  DoD CryptoMod CM2 CBA efforts support. Reviewed AR 25-2 and AR 380-40 COMSEC service authority\/responsibilities analysis and purposed changes to Army G-2's AR 380-40.Developed Commercial Solutions for Classified (CSfC) radio, SWLAN and MACP Lab testbed\/whitepaper and performed interoperability testing.  Developed MilBook site publish overall CSfC guidance, CP updates, technology upgrades, configuration changes, and lessons learned. Developed standard CSfC images and configurations for MACP and SWLAN for the Army.  Developed whitepapers including: Use of KMI-Aware Devices within the Army, Army Wireless Personal Access Network (WPAN) user requirement and CONOPS\/policy, KMI C-3 requirements Management, iApp Evaluation and Quick Look Report, iApp Overview and Use Cases and  Trusted Cyber Sensor (TCS) evaluation.  Reviewed and provided comments on Army KCMP, KER  and KMI CI-3 Technical Requirements Packages. Performed DoD Mobility BYOD study\/investigation in support of CIO\/G-6 senior leadership. Supported NC3 LSTDM IP migration activities. Provided technical inputs to DoD and Army working groups. Reviewed and submitted comment on KCMPs, DA PAMs, CNSS, ARs, CPDs and Procurement Strategies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.787"
                                            },
                                            "Text": {
                                                "val": "Continue to provide oversight for the executions of the Army's COMSEC Modernization initiatives. Identify and evaluate new CM, TRANSEC and KM technologies for Army implementation in support of ACC updates, KMI migration and S-ICAN\/ITN architecture development. Develop end-to-end, tactical-to-strategic COMSEC standardization to meet Army?s operational requirements.  Test and assess CM and KM technologies to determine the maturity and viability for Army use to protect and strengthen the Army Network posture. Document new fundamental building blocks for IA solutions, perform risk reduction testing of commercial products prior to insertion into Army for use to increase operational availability with documented operational value and rapid integration. Collaborate with the NSA, DoD CIO and Joint Staff to continue to support the ACC device testing and fielding.  Provide timely test and evaluate results to enable the Army to make sound investment strategic decisions and to reduce or eliminate duplications.Participate in operational assessment of NSA, DoD, Joint Staff and Service led Joint Capability Technology Demonstrations to align new technologies to documented Army and Service capability gaps and requirements for protecting National Security Systems and National Security Information. Develop strategies and policies to posture Army?s operations to implement innovative cryptographic and key management tools and services. Continue to support DoD CM2 efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.368"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.368"
                                            },
                                            "Text": {
                                                "val": "Will Continue to provide oversight for the executions of the Army's COMSEC Modernization initiatives. Identify and evaluate new CM, TRANSEC and KM technologies for Army implementation in support of ACC updates, KMI migration and S-ICAN\/ITN architecture development. Develop end-to-end, tactical-to-strategic COMSEC standardization to meet Army?s operational requirements.  Test and assess CM and KM technologies to determine the maturity and viability for Army use to protect and strengthen the Army Network posture. Document new fundamental building blocks for IA solutions, perform risk reduction testing of commercial products prior to insertion into Army for use to increase operational availability with documented operational value and rapid integration. Collaborate with the NSA, DoD CIO and Joint Staff to continue to support the ACC device testing and fielding.  Provide timely test and evaluate results to enable the Army to make sound investment strategic decisions and to reduce or eliminate duplications. Participate in operational assessment of NSA, DoD, Joint Staff and Service led Joint Capability Technology Demonstrations to align new technologies to documented Army and Service capability gaps and requirements for protecting National Security Systems and National Security Information. Develop strategies and policies to posture Army?s operations to implement innovative cryptographic and key management tools and services. Continue to support DoD CM2 efforts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 is in direct support to test and evaluate the maturity of Army's CM devices to meet the ACC standards to provide the Warfighter with the ability to secure, maintain compliance, interoperability and protect National Information.  The CM effort will employ common standards and technologies to reduce redundancies and maximize scalable solutions that can respond to cyber threats, mission changes and interoperability.  This is IAW the Army Communications Security (COMSEC) Modernization Implementation Planning Guidance FY 2019\/2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.372"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "DV5"
                                    },
                                    "Title": {
                                        "val": "Crypto Modernization (Crypto Mod)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "26.055"
                                        },
                                        "CurrentYear": {
                                            "val": "7.943"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.63"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.63"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.812"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.9"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.187"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.048"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "ET9"
                                    },
                                    "Title": {
                                        "val": "Embedded Crypto Modernization (CRYPTO MOD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "48.914"
                                        },
                                        "CurrentYear": {
                                            "val": "20.745"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "69.659"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "B96002"
                                    },
                                    "Title": {
                                        "val": "CRYPTOGRAPHIC SYSTEMS (CRYPTO SYS)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "47.536"
                                        },
                                        "CurrentYear": {
                                            "val": "26.35"
                                        },
                                        "BudgetYearOne": {
                                            "val": "72.457"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "72.457"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "36.113"
                                        },
                                        "BudgetYearThree": {
                                            "val": "26.399"
                                        },
                                        "BudgetYearFour": {
                                            "val": "30.776"
                                        },
                                        "BudgetYearFive": {
                                            "val": "39.721"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "B96006"
                                    },
                                    "Title": {
                                        "val": "Embedded Cryptographic Modernization"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "3.52"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "3.520"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "BS9716"
                                    },
                                    "Title": {
                                        "val": "NON PEO-SPARES"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.135"
                                        },
                                        "CurrentYear": {
                                            "val": "3.131"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.857"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.857"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.901"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.939"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.94"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "25.903"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The objective of the Cryptographic Systems program is to provide adaptive, flexible, and programmable cryptographic solutions using best practices, lessons learned and programmatic management to meet the challenge of modernizing the Army's aging cryptographic systems. Associated documents include CDD, approved by CIO\/G6, 15 Jul 2010; ICD, approved by JROC, 25 Mar 2011; AAO; approved by G3, 15 Dec 2011 and revised and approved, 19 Jun 2015."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "System Engineering (PL Net E)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "LH"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM RDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "CECOM RDEC APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "80.317"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.466"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "81.783"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Big Data Pilot (PL ES-CYBER)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "FT BELVOIR, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.725"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.725"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Information Assurance System Engineering Support (PL Net E)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DSCI Consulting"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.106"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.106"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Support (PL Net E)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CACI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.018"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.018"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Support (PL Net E)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.408"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.408"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Support (PL Net E)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CSC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "16.448"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "16.448"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test Support (PL Net E)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.598"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.598"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Support (CIO\/G-6)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CACI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.433"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.196"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.377"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.5"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.5"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "System Engineering (CIO\/G-6)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "LH"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFC CERDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.857"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.496"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.682"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.297"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.297"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Support (CIO\/G-6)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.449"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.737"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.89"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.355"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.355"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Support (CIO\/G-6)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AASKI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Edgewood, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.427"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.813"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.4"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.4"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Service (CIO-G-6)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "LH"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ARL\/SLAD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "White Sand Missile Range (WSMR)"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.972"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.079"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.09"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.816"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.816"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190304_0_443332_491.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "TEST & EVALUATION OF CRYPTOGRAPHIC SYSTEMS (PL Net E)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "STUDY OF CURRENT AND EMERGING CRYPTO ALGORITHMS AND TECHNOLOGIES (PL Net E)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TEST OF INE AND WIRELESS  SOLUTION (PL Net E)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "BIG DATA PILOT (PD ES-CYBER)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TECHNOLOGY TEST & EVALUATION (CIO\/G6)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DEFINE SECURITY & INTEROPERABILITY STANDARDS (CIO\/G6)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "COMSEC STRATEGY & CRYPTO TECHNOLOGY ROADMAP (CIO\/G6)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DV4"
                    },
                    "ProjectTitle": {
                        "val": "Key Management Infrastructure (KMI)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.508"
                        },
                        "CurrentYear": {
                            "val": "2.702"
                        },
                        "BudgetYearOne": {
                            "val": "13.187"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.187"
                        },
                        "BudgetYearTwo": {
                            "val": "13.47"
                        },
                        "BudgetYearThree": {
                            "val": "13.351"
                        },
                        "BudgetYearFour": {
                            "val": "3.413"
                        },
                        "BudgetYearFive": {
                            "val": "3.477"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "A. Mission Description and Budget Item Justification\n\nProject DV4, Key Management Infrastructure (KMI) supports the Army's Network Modernization Strategy Lines of Effort (LOE) 1 Network Enablers Functions.\n\nCommunications Security (COMSEC) is governed by the Chairman of the Joint Chiefs of Staff Instruction (CJCSA) 6510. In order to ensure Warfighters continue to have secured communications (i.e., encrypted data and voice), Army communications systems are required to support modern cryptographic capabilities by implementing modern algorithms. The Army's Mission Command Network Modernization Implementation Plan states that LOE 1 to be a Unified Network which includes the attributes of being, \"Protected, Resilient, Survivable\" which Communications Security (COMSEC) is the Army's implementation of NSA protections to achieve LOE 1. KMI is foundational to the Army's Network Enabling Functions (Key Management Infrastructure).\n\nThe Army Key Management Infrastructure (AKMI) is the Army's implementation of the National Security Agency's (NSA) Key Management Infrastructure (KMI) ACAT IAM program. AKMI supports Department of Defense (DoD) Global Information Grid (GIG) Net Centric and Cryptographic Modernization Initiatives (CMI) and supports emerging requirements transitioned from the Army Key Management System (AKMS). AKMI automates the functions of Communications Security (COMSEC) electronic key management, control, planning, and distribution. AKMI supports the Army's ability to communicate and distribute data on the Army's tactical and strategic networks by limiting adversarial access to, and reducing the vulnerability of, Army Command, Control, Communications, Computers, Intelligence (C4I) systems.\n\nThe AKMI Program includes the Management Clients (MGC) nodes, Automated Communications Engineering Software (ACES) and Next Generation Load Device (NGLD) Family of devices to include the NGLD Small, Medium and Large. AKMI provides an integrated, operational environment that brings essential key management functions in-band. Objective AKMI will leverage NSA KMI program to provide secure software provisioning, will support legacy and modern End Cryptographic Units (ECU)s, simplifies all aspects of key provisioning and ECU management with traceability to individuals, expands operations to DoD unclassified networks, North Atlantic Treaty Organization (NATO) and Coalition users, automates manual business processes to increase Soldier efficiency, transforms key delivery from manual to an automate enterprise service and will provide an Over the Network Keying (OTNK) capability to support CMI.\n\nOne of the major enhancement in the AKMI architecture is the ability to leverage the various capabilities and services from NSA KMI. The end state for the Army is to leverage AKMI capabilities (OTNK, Mission Plan\/Mission Support System (MP\/MSS), Delivery Only Client (DOC), Client Host Only (CHO)) to increase automation, reduce soldier oversight, manage, and deliver key products to the tactical edge up through strategic ECU's. The objective AKMI capabilities will be found in all of the products across the AKMI product line to include MGC, ACES and NGLD family of fill devices. NGLD family will be an enduring solution to bridge the gap until legacy ECUs are fully modernized.\n\nThe Next Generation Load Device - Medium (NGLD-M) is scheduled to replace the AN\/PYQ-10A and AN\/PYQ-10A(C), Simple Key Loader (SKL). The NGLD-M will conduct the Army's key fill mission by issuing, filling, and managing Cryptographic keys to both legacy and future KMI aware End-Cryptographic Units (ECUs). This technology requires RDT&E investment to meet the requirements outlined in the NGLD Capability Production Document (CPD). This effort is proposed as an Acquisition Category III (ACAT III). Program of Record (POR). Testing of this device will also require development funds and culminate in a user test during FY22. \n\nThe NGLD-Medium (NGLD-M) is reliant on the Reprogrammable Single Chip Universal Encryptor (RESCUE), a new KMI-compliant cryptographic engine that is currently being developed by CERDEC S&TCD. This product culminates in a government owned technical data package supporting Cryptographic Modernization requirements. The NGLD-M is a key transition partner for this technology. Further uses of this product are anticipated across Army and other services require reprogrammable Cryptographic requirements. NSA certification is expected during FY19."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RESCUE Development, Evaluation, and NSA Certification"
                                    },
                                    "Description": {
                                        "val": "RESCUE creates a secure, reprogrammable cryptographic engine in providing Cryptographic Modernized Capabilities including future Over the Network Keying (OTNK) to Fill Devices and End Cryptographic Units (ECU)s. Fill Devices and ECUs will receive, authenticate, and decrypt OTNK messages and increase WarFighter survivability by minimizing the need for Soldiers to travel to obtain keys. Additionally, Cryptographic Modernization decreases probability of key compromise and therefore, network survivability. Redesign and developmental efforts using modern and readily available components for use in the Army's Next Generation Load Devices (NGLDs) are currently underway. NGLD ? M  will also address requirements codified in the NGLD CPD and the AKMI CPD that were technologically unachievable with the legacy KOV 21 card as used in the Army?s SKL."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.508"
                                            },
                                            "Text": {
                                                "val": "The RESCUE technology development will complete in FY2018. RESCUE development will provide the ability to upgrade legacy ECUs, enabling a KMI aware fully developed PDE-enabled ECU fleet. The KOV-21 Replacement effort lays the foundation for AKMI capabilities that can be inserted into the SKL to make it an NGLD Medium."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.702"
                                            },
                                            "Text": {
                                                "val": "The follow-on RESCUE technology will continue in FY2019."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.187"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.187"
                                            },
                                            "Text": {
                                                "val": "The follow-on RESCUE technology will continue through end of FY2020."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Requirements include increased projected developmental and operational test requirement in support of NGLD-M."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NGLD Medium Development and NSA Certification"
                                    },
                                    "Description": {
                                        "val": "The NGLD-M will conduct the Army?s key fill mission by issuing, filling, and managing Cryptographic keys to both legacy and future KMI aware End-Cryptographic Units (ECUs). This technology requires RDT&E investment to meet the requirements outlined in the NGLD Capability Production Document (CPD). This effort is proposed as an Acquisition Category III (ACAT III). Program of Record (POR)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.5"
                                            },
                                            "Text": {
                                                "val": "Contract award for development, production, and sustainment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Requirements include updated projected developmental support for NGLD-M."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NGLD-M Test & Evaluation"
                                    },
                                    "Description": {
                                        "val": "The NGLD-M will conduct the Army?s key fill mission by issuing, filling, and managing Cryptographic keys to both legacy and future KMI aware End-Cryptographic Units (ECUs). Operational testing of this device will require development funds and culminate in a user test during FY22."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.5"
                                            },
                                            "Text": {
                                                "val": "NGLD-M test and evaluation required for development."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "NGLD-M operational test and evaluation requirements were reevaluated and adjusted."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "B96004"
                                    },
                                    "Title": {
                                        "val": "KEY MANAGEMENT INFRASTRUCTURE"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "56.948"
                                        },
                                        "CurrentYear": {
                                            "val": "35.71"
                                        },
                                        "BudgetYearOne": {
                                            "val": "88.442"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "88.442"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "89.912"
                                        },
                                        "BudgetYearThree": {
                                            "val": "81.432"
                                        },
                                        "BudgetYearFour": {
                                            "val": "98.363"
                                        },
                                        "BudgetYearFive": {
                                            "val": "99.012"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "549.819"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Line Item & Title:\nB96004: Key Management Infrastructure (OPA2)\n153140: ISSP (TSEC-AKMS) (OMA)"
                        },
                        "AcquisitionStrategy": {
                            "val": "Army Key Management Infrastructure (AKMI) is a Non Program of Record (POR) under Project Lead Network Enablers (PL Net E). AKMI is the Army's implementation of the National Security Agency (NSA) Key Management Infrastructure (KMI) ACAT IAM Program of Record. The AKMI will allow the Army to manage, control, plan, and distribute electronic key for the ~1.5M End Cryptographic Units (ECU)s necessary to communicate and distribute data on the Army's tactical and strategic networks.\n\nAKMI initial Army Acquisition Program Baseline (APB) was approved 2QFY12. The AKMI Program will include the Management Clients (MGC) nodes, Automated Communications Engineering Software (ACES) and Next Generation Load Device (NGLD) Family. Each component of the AKMI Program is in a different phase of the acquisition cycle.\n\nThe NSA KMI Program is replacing the NSA Electronic Key Management System (EKMS) program. As the DoD Key Management Lead, NSA is dictating the change from EKMS to KMI by a sunset date of December 2017. Components of the AKMI Program will be retained and adapted from the legacy AKMS program while others will be developed and fielded to meet AKMI requirements.\n\nThe NGLD family of devices will become the primary Army Tier 3 component of the AKMI Program. The NGLD Capability Production Document (CPD) was signed 4QFY13. The NGLD CPD calls for a family of 3 devices (small, medium and large) to meet the AKMI requirements. The AKMI program has partnered with RDECOM CERDEC to develop a KMI compliant cryptographic engine, the Reprogrammable Single Chip Universal Encryptor (RESCUE). The NGLD-M will undergo full-and-open competition for development, production, and sustainment during FY19 with a projected FY20 award. NGLD-M development will be conducted during FY20-22 culminating in NSA certification and an operational event. NGLD-M projects LRIP and FRP during FY22."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "KMI Awareness (RESCUE Development and NSA Certification"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Dynamics Research Corporation\/Engility"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.529"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.508"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.702"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.187"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.187"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "KMI Awareness"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CERDEC, S&TCD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.451"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.451"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "NGLD Development and NSA Certification"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CERDEC STCD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "8.5"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "8.5"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "NGLD-M Testing & Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CERDEC, S&TCD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.5"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.5"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.500"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190304_0_443332_DV4.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "RESCUE"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGLD-M Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGLD-M Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Milestone B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Development, Production, Sustainment Contract"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fielding and Sustainment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Simplified Acquisition Management Plan"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DV5"
                    },
                    "ProjectTitle": {
                        "val": "Crypto Modernization (Crypto Mod)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "26.055"
                        },
                        "CurrentYear": {
                            "val": "7.943"
                        },
                        "BudgetYearOne": {
                            "val": "7.63"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.63"
                        },
                        "BudgetYearTwo": {
                            "val": "7.812"
                        },
                        "BudgetYearThree": {
                            "val": "7.9"
                        },
                        "BudgetYearFour": {
                            "val": "10.187"
                        },
                        "BudgetYearFive": {
                            "val": "8.048"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project DV5, Crypto Modernization (Crypto Mod) supports the Army's Network Modernization Strategy Line of Effort (LOE) 1 Network Enablers Functions.\n\nCommunications Security (COMSEC) is governed by the Chairman of the Joint Chiefs of Staff Instruction (CJCSA) 6510. In order to ensure Warfighters continue to have secured communications (i.e., encrypted data and voice), Army communications systems are required to support modern cryptographic capabilities by implementing modern algorithms. Crypto Modernization necessitates the utilization of the latest NSA cryptographic capabilities in order to defeat adversarial efforts to decrypt, disrupt, or exploit US Army networks. The Army's Mission Command Network Modernization Implementation Plan states that LOE 1 to be a Unified Network which includes the attributes of being, \"Protected, Resilient, Survivable\" which Communications Security (COMSEC) is the Army's implementation of NSA protections to achieve LOE 1.  Crypto Modernization is foundational to the Army's LOE 1: Network Enabling Functions.\n\nThis program supports using National Security Agency (NSA) developed Communications Security (COMSEC) technologies within the Army providing encryption, trusted software, or standard operating procedures, and integrating these mechanisms into specified systems in support of securing the Army Tactical and Enterprise Networks.  \n\nThis entails architecture studies, system integration and testing, developing installation kits, and certification and accreditation of Automation Information Systems.  The program assesses, develops and integrates emerging Information Assurance (IA)\/COMSEC tools (hardware and software) which provide protection for fixed infrastructure post, camp, and station networks as well as tactical networks.  The cited work is consistent with Strategic Planning Guidance and the Army Modernization and Strategy Plan.\n\nThe Embedded Cryptographic Modernization Initiative (ECMI) is designed to investigate Courses Of Action, conduct a Material Solution Analysis, and execute upgrade activities to ensure all enduring Army communications and data equipment that employ embedded cryptographic hardware will utilize modern cryptographic algorithms and keys."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "VINSON\/ANDVT (Advanced Narrowband Digital Voice Terminal) Cryptograph Modernization (VACM) program"
                                    },
                                    "Description": {
                                        "val": "This program researches, assesses, tests, plans and works to integrate VACM products for the Army.  The VACM program is a NSA mandated program established to replace legacy external cryptographic devices such as the KY-57, KY-99A, KY-58, KY-99, KY-100 and CV- 3591 \/ KYV-5. In order to ensure the confidentiality, integrity and availability of classified communications, the cryptographic modules must be tested for interoperability and form fit to ensure a successful fielding.  Each software release will require testing to insure comparability and interoperability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.82"
                                            },
                                            "Text": {
                                                "val": "Continued to test and evaluate engineering changes to Full Rate Production (FRP) of VACM devices to confirm continued capability and interoperability on Army networks and tactical systems as well as identifying new risk areas for compliance with COMSEC regulations and procedures. The program will begin fielding, performing site surveys and installing at both CONUS and OCONUS locations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.625"
                                            },
                                            "Text": {
                                                "val": "Continue to test and evaluate any engineering changes to Full Rate Production (FRP) of VACM devices (the KYV-5M) to confirm continued capability and interoperability on Army networks and tactical systems as well as identifying new risk areas for compliance with COMSEC regulations and procedures. The program will continue fielding, performing site surveys and installing at both CONUS and OCONUS locations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.746"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.746"
                                            },
                                            "Text": {
                                                "val": "The program will continue to test and evaluate any engineering changes to Full Rate Production (FRP) of VACM devices to confirm continued capability and interoperability on Army networks and tactical systems as well as identifying new risk areas for compliance with COMSEC regulations and procedures. The program will continue fielding, performing site surveys and installing at both CONUS and OCONUS locations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Additional Devices to be fielded in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cryptographic Systems Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "This program supports the Army Cryptographic Modernization Transformational Initiative. This is accomplished by providing test and evaluation capabilities to the COMSEC community in order to assess emerging technologies before being released and approved for Army use; testing will be performed on hardware, software and network systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.91"
                                            },
                                            "Text": {
                                                "val": "The program continued testing and evaluation of COMSEC devices to confirm capability and interoperability on Army networks and tactical systems as well as identifying risk areas for compliance with COMSEC regulations and procedures.  The program will test and evaluate Crypto Systems compliant devices, Suite B IPSec devices built on commercial standards, CHVP, CSfC- Guidance, and new software releases to HAIPE 4.X devices in accordance with AR 700-142 Rapid Action Revision dated October 16, 2008.  The program tests interoperability and provides ways to insert data at rest (DAR) and data in transit (DIT) technology within the existing and future network infrastructure. Additionally, this program evaluates performance of technologies and provides direction to ensure the lowest impact on performance while providing the greatest protection from loss of sensitive data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.372"
                                            },
                                            "Text": {
                                                "val": "The program continues testing and evaluation of COMSEC devices to confirm capability and interoperability on Army networks and tactical systems as well as identifying risk areas for compliance with COMSEC regulations and procedures. The program will test and evaluate Crypto Systems compliant devices, Suite B IPSec devices built on commercial standards, CHVP, CSfC Guidance, and new software releases to HAIPE 4.X devices in accordance with AR 700-142 Rapid Action Revision dated October 16, 2008. The program tests interoperability and provides ways to insert data at rest (DAR) and data in transit (DIT) technology within the existing and future network infrastructure. Additionally, this program evaluates performance of technologies and provides direction to ensure the lowest impact on performance while providing the greatest protection from loss of sensitive data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.938"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.938"
                                            },
                                            "Text": {
                                                "val": "The program will continue the testing and evaluation of COMSEC devices to confirm capability and interoperability on Army networks and tactical systems as well as identifying risk areas for compliance with COMSEC regulations and procedures. The program will test and evaluate Crypto Systems compliant devices, Suite B IPSec devices built on commercial standards, CHVP, CSfC Guidance, and new software releases to HAIPE 4.X devices in accordance with AR 700-142 Rapid Action Revision dated October 16, 2008. The program tests interoperability and provides ways to insert data at rest (DAR) and data in transit (DIT) technology within the existing and future network infrastructure. Additionally, this program evaluates performance of technologies and provides direction to ensure the lowest impact on performance while providing the greatest protection from loss of sensitive data."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Reduction of Test and Evaluation on HAIPE devices."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Assurance Internet Protocol Encryption (HAIPE) extension manager"
                                    },
                                    "Description": {
                                        "val": "A management tool to configure the new extensions to the HAIPE standard and process the resulting data to provide early indications of cyber attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.748"
                                            },
                                            "Text": {
                                                "val": "Continued software development efforts that will provide configuration and management of the HAIPE extensions and the user interface for collecting and analyzing the data that results from implementation of these HAIPE extensions. This will facilitate the upgrade of the Army HAIPEs to include new cyber-sensor functionality for the tactical cyber cell."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.946"
                                            },
                                            "Text": {
                                                "val": "Continue software development efforts that will provide configuration and management of the HAIPE extensions and the user interface for collecting and analyzing the data that results from implementation of these HAIPE extensions. This will facilitate the upgrade of the Army HAIPIES to include new cyber sensor functionality for the tactical cell."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.946"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.946"
                                            },
                                            "Text": {
                                                "val": "Will continue software development efforts that will provide configuration and management of the HAIPE extensions and the user interface for collecting and analyzing the data that results from implementation of these HAIPE extensions. This will facilitate the upgrade of the Army HAIPIES to include new cyber sensor functionality for the tactical cell."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 Recission"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.577"
                                            },
                                            "Text": {
                                                "val": "FY 2018 Recission with amount of $20.577M."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "491"
                                    },
                                    "Title": {
                                        "val": "Information Assurance Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.787"
                                        },
                                        "CurrentYear": {
                                            "val": "10.159"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.368"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.368"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.017"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.604"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.645"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.6"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "ET9"
                                    },
                                    "Title": {
                                        "val": "Embedded Crypto Modernization (CRYPTO MOD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "48.914"
                                        },
                                        "CurrentYear": {
                                            "val": "20.745"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "69.659"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "B96002"
                                    },
                                    "Title": {
                                        "val": "CRYPTOGRAPHIC SYSTEMS (CRYPTO SYS)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "47.536"
                                        },
                                        "CurrentYear": {
                                            "val": "26.35"
                                        },
                                        "BudgetYearOne": {
                                            "val": "72.457"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "72.457"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "36.113"
                                        },
                                        "BudgetYearThree": {
                                            "val": "26.399"
                                        },
                                        "BudgetYearFour": {
                                            "val": "30.776"
                                        },
                                        "BudgetYearFive": {
                                            "val": "39.721"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "B96006"
                                    },
                                    "Title": {
                                        "val": "Embedded Cryptographic Modernization"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "3.52"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "3.520"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "BS9716"
                                    },
                                    "Title": {
                                        "val": "NON PEO-SPARES"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.135"
                                        },
                                        "CurrentYear": {
                                            "val": "3.131"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.857"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.857"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.901"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.939"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.94"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "25.903"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Line Item & Title:\n491 - Information Assurance Development - RDTE - funding executed by PL Net E, CIO\/G6 and PL ES-CYBER\nET9 - Embedded Crypto Modernization - RDTE   \nB96002 - Cryptographic Systems - OPA2 \nB96006 - Embedded Cryptographic Modernization - OPA2\nBS9716 - NON PEO-SPARES  - OPA4"
                        },
                        "AcquisitionStrategy": {
                            "val": "The objective of this program is to integrate and validate hardware and software solutions to provide COMSEC superiority in order to protect against threats, increase battlefield survivability\/lethality, and enable critical Mission Command activities. The objective of the Cryptographic Systems program is to provide adaptive, flexible, and programmable cryptographic systems using best practices, lessons learned and programmatic management to meet the challenge of modernizing the Army's aging cryptographic systems. The effort will support the network operations from end-to-end throughout the force and the Common Operating Environment (COE) thus mitigating networked vulnerabilities to Army information security systems.  CDD, approved by CIO\/G6, 15 Jul 2010; ICD, approved by JROC, 25 Mar 2011; AAO; approved by G3, 15 Dec 2011 and revised and approved, 19 Jun 2015."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "System Engineering"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "LH"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM RDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.687"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.896"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.809"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.809"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.809"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CACI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen Maryland"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.88"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.761"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.75"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.65"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.65"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton (BAH)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.336"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.996"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.034"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-09"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.934"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.934"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AASKI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Edgewood, Maryland"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.324"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.982"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.959"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-09"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.846"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.846"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Information Assurance System Engineering Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Envision"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, Maryland"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.583"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.383"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.391"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.391"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.391"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Embedded Crypto Modernization Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "LH"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "19.733"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "18.037"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190304_0_443332_DV5.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "VACM INTEROPERABILITY"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TEST AND EVALUATION OF LINK\/TRUNK ENCRYPTORS SW"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TEST AND EVALUATION OF SECURE VOICE SW & HW"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TEST AND EVALUATION OF INE SW & HW"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HAIPE EXTENSION MANAGER"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ECMI GPR SW UPGRADE"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ECMI DEVELOPMENT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ET9"
                    },
                    "ProjectTitle": {
                        "val": "Embedded Crypto Modernization (CRYPTO MOD)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "48.914"
                        },
                        "CurrentYear": {
                            "val": "20.745"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "69.659"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project ET9, Embedded Crypto Modernization (Crypto Mod) supports the Army's Network Modernization Strategy Lines of Effort (LOE) 1 Network Enablers Functions.\n\nModernize the AN\/ARC-201D Single Channel Ground and Airborne Radio Systems (SINCGARS) to meet CJCSI mandated cryptographic requirements through the execution of an engineering change effort to provide a bridging radio solution for Army Aviation rotary wing platforms. Support the Unified Network key near term imperative of achieving air-ground integration. Crypto modernization will ensure compliance with Key Management Infrastructure (KMI), add algorithms that address cyber vulnerabilities, improve 'secure but unclassified' network support, and provide better support to coalition interoperability.\n\nEmbedded Cryptographic Modernization Initiative (ECMI) is an upgrade activity that will ensure Army radios remain secure by operating with modern cryptographic algorithms. Tactical radios using legacy embedded cryptographic systems will no longer be able to communicate securely after cease key dates documented in the Chairman of the Joint Chiefs Staff instruction (CJCSI) 6510. In order to ensure Warfighters continue to have secured communications (i.e., encrypted data and voice), Army tactical radios are required to support modern cryptographic capabilities by implementing modern algorithms. If cease key dates are not met, the Army will be forced to communicate at risk."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Embedded Cryptographic Modernization Initiative (ECMI) Development Contracts"
                                    },
                                    "Description": {
                                        "val": "ECMI Non Recurring Engineering (NRE) Contract Prep Work and Execution"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.761"
                                            },
                                            "Text": {
                                                "val": "FY 2018 Rescission of $48.153 million"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.745"
                                            },
                                            "Text": {
                                                "val": "Support NRE development of ECMI efforts for vendor developmental and production contracts which supports NSA mandated Cease Key Date IAW CJCSI 6510.02E. This capability will ensure Army tactical radios operate with the latest cryptographic solutions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of FY 2020 funding is due to change in Air-to-Ground radio acquisition strategy. The ARC-201D crypto modernization is no longer required."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 Rescission"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "48.153"
                                            },
                                            "Text": {
                                                "val": "FY 2018 Rescission with amount of $48.153M."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "491"
                                    },
                                    "Title": {
                                        "val": "Information Assurance Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.787"
                                        },
                                        "CurrentYear": {
                                            "val": "10.159"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.368"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.368"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.017"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.604"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.645"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.6"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DV5"
                                    },
                                    "Title": {
                                        "val": "Crypto Modernization (Crypto Mod)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "26.055"
                                        },
                                        "CurrentYear": {
                                            "val": "7.943"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.63"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.63"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.812"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.9"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.187"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.048"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "B96002"
                                    },
                                    "Title": {
                                        "val": "CRYPTOGRAPHIC SYSTEMS (CRYPTO SYS)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "47.536"
                                        },
                                        "CurrentYear": {
                                            "val": "26.35"
                                        },
                                        "BudgetYearOne": {
                                            "val": "72.457"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "72.457"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "36.113"
                                        },
                                        "BudgetYearThree": {
                                            "val": "26.399"
                                        },
                                        "BudgetYearFour": {
                                            "val": "30.776"
                                        },
                                        "BudgetYearFive": {
                                            "val": "39.721"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "B96006"
                                    },
                                    "Title": {
                                        "val": "Embedded Cryptographic Modernization"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "3.52"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "3.520"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "BS9716"
                                    },
                                    "Title": {
                                        "val": "NON PEO-SPARES"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.135"
                                        },
                                        "CurrentYear": {
                                            "val": "3.131"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.857"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.857"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.901"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.939"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.94"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "25.903"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Line Item & Title:\n491 - Information Assurance Development - RDTE - funding executed by PL Net E, CIO\/G6 and PL ES-CYBER\nDV5 - Crypto Modernization - RDTE\nB96002 - Cryptographic Systems - OPA2\nB96006 - Embedded Cryptographic Modernization - OPA2\nBS9716 - NON PEO-SPARES - OPA4"
                        },
                        "AcquisitionStrategy": {
                            "val": "The objective of the ECMI program is to provide adaptive, flexible, and programmable embedded cryptographic solutions using best practices, lessons learned and programmatic management to meet the challenge of modernizing the Army's aging cryptographic tactical radios. ECMI will design, develop, and execute upgrade activities to ensure non modernized Army tactical radios will be able to accept and utilize modern cryptographic algorithms.\n\nApplicable documents affecting Tactical Radio ONS, ORD, & CPDs requiring crypto:\nCDD for Cryptographic Equipment and Services Modernization, Increment 1, dated March 2010.\nCJCSI 6510.02E - \"Cryptographic Modernization Planning\", 01 April 2014.\nCNSSP-15 - \"National Information Assurance Policy on the Use of Public Standards for the Secure Sharing of Information Among National Security Systems\", 01 October 2012.\nNSA CSS 3-9 - \"Cryptographic Modernization Initiative Requirements for Type 1 Cryptographic Products\", dated 28 March 2013.\nMemorandum from Army Acquisition Executive with subject \"Management and Procurement of Communications Security (COMSEC) Capability, dated 28 Feb 2012."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "AMF-ARC-201D Crypto Mod - SE\/PM"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.639"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.639"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PM TR Program Mgmt Personnel"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.985"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.968"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.037"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.990"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PM TR Program Mgmt Personnel"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BAH"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.424"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.424"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "AMF-ARC-201D Crypto Mod - Dev Engineering & Prototyping"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "22.752"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "19.708"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "42.460"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "AMF-ARC-201D Crypto Mod - Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "19.555"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "19.555"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190304_0_443332_ET9.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Market Research"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FF8"
                    },
                    "ProjectTitle": {
                        "val": "Unit Activity Monitoring (UAM)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.491"
                        },
                        "CurrentYear": {
                            "val": "0.971"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "20.462"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "User activity monitoring (UAM) automation\/analytics will provide technical capability to enhance Army UAM analysis effectiveness and efficiency. The UAM mission is to observe and record the actions and activities of an individual, at any time, on any device accessing Army information on classified networks in order to detect insider threats and to support authorized investigations. Army UAM is a component of the Army Insider Threat (InT) Program. Army's InT Program and UAM are conducted in accordance with the National Defense Authorization Act for Fiscal Year 2012, section 922., Insider Threat Detection; Presidential Memorandum, National Insider Threat Policy and Minimum Standards for Executive Branch Insider Threat Programs, dated 21 November 2012; Executive Order 13587, Structural Reforms to Improve the Security of Classified Networks and the Responsible Sharing and Safeguarding of Classified Information, (Reference b) dated 7 October 2011, and Army Directive 2013-18 (Army Insider Threat Program), 31 July 2013. Innovative enhancements are required to improve UAM analysis productivity, data visualization, and workflow management. The analysis productivity objective is to develop and implement user behavior models that use UAM and other network data to identify anomalous user behavior over time, and to integrated new data sources into the UAM analytical data store and processing system. Data visualization advances will present UAM analysts behavior model processing results in an intuitive format that reduce the time required to review the results. Workflow management improvements will add new capabilities to the UAM workflow management system with the objective of enhancing analysis reporting productivity and metrics collection."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unit Activity Monitoring"
                                    },
                                    "Description": {
                                        "val": "FY 2019 Base funds in the total amount of $.971 million are provided for software engineering development and testing resources to enhance the Army? UAM data processing, analysis, and data visualization capabilities, and its workflow management system, plus the integration of new data sources into the data processing component. All work is focused on the development of new capabilities.\n\nThe details of this program are reported in accordance with Title 10, United States Code, Section 119(a)(1)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.491"
                                            },
                                            "Text": {
                                                "val": "Unit Activity Monitoring"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.971"
                                            },
                                            "Text": {
                                                "val": "Continue Unit Activity Monitoring"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program receives no funding in FY 2020"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "FY 2019: The planned acquisition strategy to acquire UAM Automation\/Analytics software engineering services is to award through the use of competitive acquisition,\na Base plus three-option year firm-fixed price contract.\n\nFY 2019: The planned acquisition is to exercise next option year of the software engineering services contract."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Engineering Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "19.491"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.971"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "20.462"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190304_0_443332_FF8.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}