{
    "id": "2020-DefenseTechnicalInformationCenter-PB-0400-JBOOK-3f1fbbf0c5c0fd2c30cedebaf431cf346efafb487cefa1c7194d115dafb47017-1",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-DTIC-U_RDTE_JustificationBook_Defense_Technical_Information_Center_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Defense_Technical_Information_Center_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Defense Technical Information Center",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0605998KA"
        },
        "ProgramElementTitle": {
            "val": "Management HQ - Defense Technical Information Center (DTIC)"
        },
        "R1LineNumber": {
            "val": "173"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Technical Information Center"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "4.400"
            },
            "PriorYear": {
                "val": "4.187"
            },
            "CurrentYear": {
                "val": "4.124"
            },
            "BudgetYearOne": {
                "val": "3.027"
            },
            "BudgetYearOneBase": {
                "val": "3.027"
            },
            "BudgetYearTwo": {
                "val": "2.779"
            },
            "BudgetYearThree": {
                "val": "3.432"
            },
            "BudgetYearFour": {
                "val": "3.367"
            },
            "BudgetYearFive": {
                "val": "3.453"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.187"
                },
                "CurrentYear": {
                    "val": "4.124"
                },
                "BudgetYearOne": {
                    "val": "3.927"
                },
                "BudgetYearOneBase": {
                    "val": "3.927"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.187"
                },
                "CurrentYear": {
                    "val": "4.124"
                },
                "BudgetYearOne": {
                    "val": "3.027"
                },
                "BudgetYearOneBase": {
                    "val": "3.027"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.900"
                },
                "BudgetYearOneBase": {
                    "val": "-0.900"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Changes"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.900"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.900"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Program Change:  In comparing the Current President’s Budget FY 2020 Base program against the Previous President’s Budget FY 2020 PB Base, there is a decrease of $0.900 Million.  This reduction is the result of the Department’s “Civilian Direct Hire Efficiency” effort, which directs a realignment of agency manpower positions to staff other organizations, based on DoD priorities.  This effort directed the decrease of five DTIC full time equivalents (FTEs) in FY 2020.  The $0.900 Million reflects the payroll expense decrease associated with the five FTEs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "001"
                    },
                    "ProjectTitle": {
                        "val": "Management HQ - Defense Technical Information Center (DTIC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "4.400"
                        },
                        "PriorYear": {
                            "val": "4.187"
                        },
                        "CurrentYear": {
                            "val": "4.124"
                        },
                        "BudgetYearOne": {
                            "val": "3.027"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.027"
                        },
                        "BudgetYearTwo": {
                            "val": "2.779"
                        },
                        "BudgetYearThree": {
                            "val": "3.432"
                        },
                        "BudgetYearFour": {
                            "val": "3.367"
                        },
                        "BudgetYearFive": {
                            "val": "3.453"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program element (PE) provides funding for the Management Headquarters (HQ) element of the Defense Technical Information Center (DTIC), currently a DoD Field Activity assigned to the Under Secretary of Defense for Research and Engineering (USD(R&E)).  During FY 2019, DTIC is slated to realign to the DoD Chief Management Officer (CMO).  The PE supports personnel compensation for HQ-assigned civilians, along with related administrative support costs.  This second DTIC PE, established in FY 2017, is designed to track activities deemed as headquarters functions, with no operational efficiencies or enhancement to mission.\n\nThe PE supports the following HQ functions and mission essential activities critical to the success of DTIC’s business operations, and mandated by law or regulation: \n- Activity leadership, strategic planning, and Front Office support staff.\n-- The front office staff represents a small component of this PE.  Most of the specialized functions and skill-sets described below are centralized activities within the PE, yet support the larger organization and its employees.  These activities were consolidated as a means to improve efficiencies throughout DTIC, and are essential to the operation of DTIC’s primary PE 0605801KA.\n-- Reductions to DTIC’s HQ staffing levels continue, reducing civilian full time equivalents (FTEs) below FY 2017-2019 levels. \n- Financial Management and Comptroller.  Provides integrated resource management at the Agency level to obtain, control, and execute budget and manpower authorities to support the organization's mission requirements.  Develops and prepares agency budget documents and exhibits for submission to both OSD and Congress.\n-- Accounting support to DTIC’s mission operations; partners with the Defense Finance and Accounting Service to present accurate financial reporting and Fund Balance with Treasury. \n-- Financial Improvement and Audit Remediation (FIAR) activities and oversight in compliance with the Department’s audit goals, objectives, and milestones.\n- Human Resources (HR) Liaison Support.  Provides the DTIC enterprise with payroll processing and “Hire to Retire” mission support; oversees and organizes employee training, professional development, and certification programs (e.g., Acquisition, Financial Management, and IT programs).\n-- Coordinates recruitment placement and classification action for the mission areas; liaison to the Defense Finance and Accounting Service for HR servicing and the Defense Logistics Agency (DLA) for Equal Employment Opportunity (EEO) program maintenance.\n- Mandatory Records Management compliance activities and administration programs.\n- IT Management\/Chief Information Officer (CIO).  Collects, analyzes, and reports information necessary to effectively and efficiently manage enterprise IT resources; CIO functions are performed in compliance with DoD-CIO guidance, instructions and mandates. \n- IT Service Desk\/Local Area Network (LAN).  DTIC’s Service Desk was replaced with an in-house application, developed to manage support tickets and encourage a self-service approach for routine requests.  Office automation activities supports--on a part-time basis--desktop computing customers; resolves IT-related equipment or system incidents; provides assured system and network availability, info delivery, and secure IT solutions to support current and future business and mission requirements.  Beginning in FY 2020, this IT service will be performed by the Defense Information Systems Agency (DISA)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Management HQ - Defense Technical Information Center"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.187"
                                            },
                                            "Text": {
                                                "val": "- Execute the program, activities and functions as described above in Section A, Mission Description of PE 0605998KA."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.124"
                                            },
                                            "Text": {
                                                "val": "- Execute the program, activities and functions as described above in Section A, Mission Description of PE 0605998KA."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.027"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.027"
                                            },
                                            "Text": {
                                                "val": "- Execute the program, activities and functions as described above in Section A, Mission Description of PE 0605998KA."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The change between FY 2019 and the FY 2020 Base (a net decrease of $1.097 Million in FY 2020) reflects a net reduction in the number of civilian authorizations assigned to the Management Headquarters element of DTIC."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}