{
    "id": "2020-Army-PB-2040-JBOOK-bbfb861aa2459c788128b03572c321536da98358a56d59849bf889b375dfd80d-29",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603734A"
        },
        "ProgramElementTitle": {
            "val": "Military Engineering Advanced Technology"
        },
        "R1LineNumber": {
            "val": "70"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "96.586"
            },
            "CurrentYear": {
                "val": "101.438"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "198.024"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) is being realigned, with continuity of effort realigned to the following PEs:\n* PE 0603119A Ground Advanced Technology Projects\n* PE 0603462A Next Generation Combat Vehicle Advanced Technology\n* PE 0603463A Network C3I Advanced Technology\n* PE 0603465A Future Vertical Lift Advanced Technology\n* PE 0603466A Air and Missile Defense Advanced Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) demonstrates data and information architectures and software applications, as well as sensing systems, that can be used to provide Warfighters with timely, accurate, easily interpretable data and information for the operational and tactical mission environments, focusing on physical and human terrain and weather; methodologies, software applications, and hardware for improving ground vehicle mobility and countermobility to support ground force operations including manned-unmanned teaming; demonstrates material technologies and tools for force projection, and sustainment. This PE also demonstrates subsystems and systems to increase the survivability of personnel, critical assets, and facilities through structures, shields, and barriers to combat highly adaptive and increasingly severe threats; and systems and interoperable systems of systems for detecting threats, assessing situations, defending against threats, and communicating information and warnings for force protection.\n\nThis work is fully coordinated with and complementary to PE 0602784A (Military Engineering Technology).\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is led by the Army Engineering Research and Development Center (ERDC)"
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "32.448"
                },
                "CurrentYear": {
                    "val": "25.864"
                },
                "BudgetYearOne": {
                    "val": "26.236"
                },
                "BudgetYearOneBase": {
                    "val": "26.236"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "96.586"
                },
                "CurrentYear": {
                    "val": "101.438"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "64.138"
                },
                "CurrentYear": {
                    "val": "75.574"
                },
                "BudgetYearOne": {
                    "val": "-26.236"
                },
                "BudgetYearOneBase": {
                    "val": "-26.236"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.022"
                    },
                    "CurrentYear": {
                        "val": "-0.026"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "65.2"
                    },
                    "CurrentYear": {
                        "val": "75.6"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.04"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-26.236"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-26.236"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY18 congressional adds for: Additive Manufacturing\/3D Printing; Advanced Polymer Development; Bathymetric-topographic LIDAR Research; demo of ultra-high efficiency natural gas techniques; emerging natural gas techniques; energy efficient window insulation research; heavy vehicle simulator research; inferential sensing on tactical wheeled vehicles; reliable distributed generation in austere environments; and sensor protection form underground threats.\nFY19 congressional adds for: secure management of energy generation and storage; rapid low energy mobile manufacturing; additive manufacturing\/3-D printing; advanced polymer development; bathymetric-topographic LiDAR research; centrifuge enabled research; energy technology research in cold and arctic regions; ERDC collaboration; extreme terrain research; natural gas technology; reliable distributed energy in austere environments; research facility modernization; research in the permafrost environment; resilient energy systems; secure and resilient power generation in cold region environments; silicon anode technology; and transportation infrastructure evaluation system.\nFY20 reduction - PE eliminated due to Science and Technology portfolio Financial Restructuring."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "T08"
                    },
                    "ProjectTitle": {
                        "val": "Combat Eng Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "31.386"
                        },
                        "CurrentYear": {
                            "val": "25.838"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "57.224"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY20 this Project is being realigned to:\nProgram Element (PE) 0603119A Ground Advanced Technology, Projects:\n* BL6 Expedient Passive Protection for Critical Assets Advanced Technology\n* BL8 Power Projection in A2\/AD Environments Advanced Technology\n* BM1 Protection from Advanced Weapon Effects Advanced Technology\nPE 0603462A Next Generation Combat Vehicle Advanced Technology, Projects:\n* BF2 Autonomous Ground Resupply (AGR) Advanced Technology\n* BG3 Modeling & Simulation for MUMT Advanced Technology\nPE 0603463A Network C3I Advanced Technology, Projects:\n* AO9 Information Trust Advanced Technology\n* AS9 Asymmetric Vision by Persistent Geophysical Sensing and Infrasound Advanced Technology\n* AT3 Subterranean Detection and Monitoring Advanced Technology\n* AU4 Geospatially Enabled Operational Design (GEOD) Advanced Technology\n* AT8 Network-Enabled GeoSpatial and GEOINT Services Advanced Technology\n* AU6 Automated Analytics for Understanding the Operational Environment Advanced Technology\n* AU1 Tactical GeoSpatial Information Capabilities Advanced Technology\nPE 0603465A Future Vertical Lift Advanced Technology, Project:\n* AL3 High Performance Computing for Rotorcraft Applications Advanced Technology\nPE 0603466A Air and Missile Defense Advanced Technology, Project:\n* AE3 Unconventional Countermeasures & Survivability Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates software and architectures for geospatial mapping applications and decision aids for the Warfighter. Project components, systems, system of systems, and decision aids enable ground vehicle mobility (freedom of movement), including force projection, and counter-mobility to impede movement of threat forces. Additional components, systems, system of systems for survivability support protection of personnel, facilities, and assets through design and reinforcement of structures, and for force protection to detect, assess, and defend against threats for troops and critical fixed and semi-fixed assets. Protection measures support force projection in areas such as air and sea ports of debarkation, dispersed small units, and units operating in complex and urban environments, which may include subterranean challenges. Work is in support of current and future ground force operations and future vertical lift. Software and architectures for geospatial projects mature and validate geospatial decision tools in support of operations planning and decision making to advance utility of geospatial capability and techniques across the Army, services, and coalition, and to advance and mature the information architecture that supports the total Army's discovery and access to data, geospatial information, and analytical tool suites. Methods to characterize and visualize behavior and population dynamics mature and validate efforts to portray the operational environment including culture, demographics, terrain, climate, and infrastructure, into geospatial frameworks. Force protection activities are focused on filling critical gaps in protecting forces operating in disbursed small units over complex and urban terrain and include maturation, integration, and demonstration of components, systems, and systems of systems for rapidly deployable threat detection in direct line-of-site and nonline-of-site environments; situation assessment to help reduce false alarms and decrease manpower required to monitor the environment; and passive protection to mitigate blast and weapon effects from advanced and emerging threats. Work in survivability and force protection also includes maturing and demonstrating software to characterize blast effects generated from explosive events, such as improvised explosive device detonation in soils, and supports design and decision aids. Force protection activities are also focused on protection of critical assets and infrastructure required to project forces into denied access areas. Work in mobility and force projection includes maturing and demonstrating software and hardware to assess and improve freedom of movement for ground forces, including autonomous ground resupply and manned-unmanned teaming and demonstrates infrastructure health monitoring assessment technologies to support emerging projection challenges in complex, contested environments such as distributed sustainment over large distances. Engineered Resilient Systems (ERS) activities focus on developing capabilities for \"upfront engineering\" that will result in more operationally efficient and resilient systems that are more affordable in a more rapid fashion. This effort develops and demonstrates an end-to-end thread involving analysis to inform requirements, reduce risk, and assess lifecycle cost pre-milestone A through tradespace analytics for selected systems of interest. \n\nThis work is being fully coordinated and is complementary to the ERS work described in the Office of the Secretary of Defense (OSD) Program Element (PE) 0603832\/Project D8Z.\n\nThis work is fully coordinated with and complementary to PE 0602784A (Military Engineering Technology). Geospatial activities are coordinated with the National Geospatial Intelligence Agency (NGA). Autonomous ground resupply activities are coordinated with PEs 0603005A (Combat Vehicle and Automotive Advanced Tech) \/ Project 515 (Robotic Ground Systems), and PE 0602601A (Combat Vehicle and Automotive Technology) \/ Project H77 (National Automotive Center), and 0602601A (Combat Vehicle and Automotive Technology) \/ H91 (Ground Vehicle Technology) in collaboration with the Tank and Automotive Research, Development and Engineering Center (TARDEC). Autonomous ground resupply activities are also coordinated with PEs 0603001A (Warfighter Advanced Technology) \/ Project 543 (Ammunition Logistics), PE 0604639A (Weapons and Munitions - Advanced Development) \/ EC3 (Ammunition Logistics Prototyping), and 0605805A (Munitions Standardization, Effectiveness and Safety) \/ Project 297 (Mun Survivability & Log). Unconventional Countermeasure activities are coordinated with PE 0602720A (Environmental Quality Technology) \/ Project 835 (Mil Med Environ Crit) and PE 0603728 (Environmental Quality Technology Demonstrations) \/ Project 03E (Environmental Restoration Technology).\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is led by the Army Engineering Research and Development Center (ERDC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Geo-Enabled Mission Command Enterprise"
                                    },
                                    "Description": {
                                        "val": "This effort matures methods and demonstrates data, information, and software tools and architectures to bring physical and human terrain and effects data into decision frameworks for consistent and accurate implementation in the Army Geospatial Enterprise (AGE). This provides ready-access of low-overhead, light-weight, analytic tools to other Services and the Department of Defense (DoD) and increases situational awareness of the operational environment in support of mission planning and operations."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.832"
                                            },
                                            "Text": {
                                                "val": "Mature a flexible Army geospatially-enabled planning environment that enables mission analysis and development of staff estimates (such as Intelligence Preparation of the Battlefield) at the tactical level that enables data synchronization with the Command Post Computing Environment systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20, this effort is realigned to PE0603463A, Project AU4, (Geospatially Enabled Operational Design (GEOD) Advanced Technology)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Map-Based Planning Services (MBPS)"
                                    },
                                    "Description": {
                                        "val": "This effort matures geospatially enabled, collaborative mission planning capabilities providing services, data, and information to Army planners, staffs, and leaders. These mission planning capabilities will allow collecting, processing, storing, displaying, and sharing of authoritative data and information in a geo-temporal context. Work will leverage a Standard Shareable Geospatial Foundation provided by the AGE and incorporate Geo-Enabled Mission Command tools and analytical capabilities. This effort continues work that was part of Geo-Enabled Mission Command Enterprise and matures work in PE 0602784A\/Project 855."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.568"
                                            },
                                            "Text": {
                                                "val": "Demonstrated a globally accessible, collaborative, map-based web environment which enables simultaneous viewing, editing, and sharing of information within and between military planners enabling a digitally supported military decision making process including supporting analytics and services; matured and demonstrated capability to collect, process, store, display, and share authoritative data from Joint sources in a map-based environment; matured and demonstrated Joint mission planning capabilities that allow concurrent and collaborative planning by operational, logistics, and intelligence staffs to crate, compile, and consolidate Operational Plans."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "GeoIntelligence - Enabling Technology Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort provides demonstration of analytic tools and algorithms that use multi-source (e.g. optical, Light detection and ranging (LiDAR)), multiplatform (e.g. satellite, light Unmanned Aerial Vehicle (UAV)), multi-temporal image sources to build urban tactical decision aids suitable for use on mobile devices to provide geospatial analysis to the Army, other Services, and DoD, in support of mission planning and operations (such as small units in an urban setting). This effort continues work that was part of Geo-Enabled Mission Command Enterprise."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated an environmental scenario generator to provide weather and terrain effects to mobility and sensor performance models when exercising analysis of multiple courses of action within the military decision making process; developed and enhanced tactical decision aid execution operating on three dimensional terrain datasets within a browser-based visualization environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.938"
                                            },
                                            "Text": {
                                                "val": "Develop man\/machine learning algorithms to automate production processes, to enable change detection, and to support learning by manned and autonomous systems with the capability to collect and\/or complete 3D high-resolution common operating picture of complex and urban terrain."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20, this effort is realigned to PE0603463 Project AU1 (Tactical GeoSpatial Information Capabilities Advanced Technology), and Project AT8 (Network-Enabled GeoSpatial and GEOINT Services Advanced Technology)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Geography Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates the integration of behavior and population dynamics research and analysis into geospatial frameworks to depict aspects of the operational environment including culture, demographics, terrain, climate, and infrastructure for mission planning and awareness. Efforts include exploitation of existing open source text, leveraging multi-media and cartographic materials, and data collection methods from the tactical edge to characterize parameters of social, cultural, and economic geography of special interest to the Warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Demonstrated high-resolution population modeling, including adaptation of urban growth models, supporting Army Component Command major consequence assessments, and generating analysis of populations affected by catastrophic events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.969"
                                            },
                                            "Text": {
                                                "val": "Demonstrate methods for military assessment of population vulnerability and resilience disruptors as a result of combat, disasters, disease, etc., within dense urban and complex environments; demonstrate computational models to support a federated model approach for complex urban systems; and will develop methodologies to support the military decision making process addressing the impacts of the physical, ecological, and sociocultural environments relative to contingency base site selection, design, operations and maintenance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort ends in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Austere Entry and Maneuver Support Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates improved means for achieving force projection in in austere and complex environments and integrated sensing and simulation systems for predicting physical conditions in these operational environments. This effort matures and demonstrates technologies to assess, construct, or repair infrastructure required to support entry, sustainment, and maneuver operations in complex and contested battlespaces. This effort matures and demonstrates simulation technology for manned-unmanned teaming maneuver."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.889"
                                            },
                                            "Text": {
                                                "val": "Demonstrated technologies for planning and conducting Anti-Access\/Area Denial (A2\/AD) entry operations without airfields\/ports and with damaged\/destroyed airfields\/ports; optimized and provide persistent monitoring technologies and an integrated seismic-infrasound-acoustic-meteorological (SIAM) array for remote structural health monitoring to produce near-real-time awareness of critical infrastructure and connecting lines of communication; matured and demonstrated simulation and decision support tools to ensure both manned and unmanned ground vehicle mobility in complex, urban, and constantly changing environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.682"
                                            },
                                            "Text": {
                                                "val": "Mature real-time hardware-in-the-loop simulator to validate autonomous vehicle maneuver configurations and will demonstrate performance through field experiments. Demonstrate obstacle detection software to support real-time mobility decisions in urban environments. Mature and demonstrate near-real time infrastructure monitoring technology that automates analyses of seismic-infrasound-acoustic-meteorological (SIAM) data to eliminate subject matter expert requirement and will mature toolkits to support littoral zone maneuver and vehicle operating surfaces assessment. Mature all-season austere entry and sustainment node decision support tools for site selection."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20, this effort is realigned to PE0603463 Project AS9 (Asymmetric Vision by Persistent Geophysical Sensing and Infrasound Advanced Technology); and PE0603462 Project BG3 (Modeling & Simulation for MUMT Advanced Technology), and Project BF2 (Autonomous Ground Resupply (AGR) Advanced Technology); and PE0603119A Project BL8 (Power Projection in A2\/AD Environments Advanced Technology)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Protection Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort validates protection solutions for facilities and critical assets, including fixed and semi-fixed. A focus will be on technologies to defeat new and emerging advanced weapons threats. Technologies include: low-logistics protective construction and facility protection, use of indigenous materials, innovative structural hardening and retrofit, and the synergistic use of unconventional countermeasures to increase the effectiveness of protection to critical assets. This effort also demonstrates rapidly deployable protective measures and retrofit technologies for use in urban environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.929"
                                            },
                                            "Text": {
                                                "val": "Demonstrated modeling & simulation tools to predict structural response\/damage to support regional tradespace analysis; provided an initial version of an urban building protection assessment tool and mature rapidly deployable protective technologies for dismounted urban operations; demonstrated unconventional countermeasures that hinder target acquisition, thus interrupting the threat system kill-chain of advanced threat systems; optimized linear sensing systems (LSS) for perimeter security in complex geo-environments; matured technologies to detect subterranean activities for protection of forces and critical assets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.794"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate urban building assessment tool and mature retrofit technologies to ensure safe building occupation decisions for dismounted soldiers in urban environments. Mature and demonstrate rapid signature reduction methods to increase critical asset survivability. Mature perimeter security and surveillance monitoring and detection systems to detect, track, and classify subterranean and other threat activities. Mature and demonstrate new protective technologies to defeat future near-peer adversarial threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20, this effort is realigned to PE0603463 Project AT3 (Subterranean Detection and Monitoring Advanced Technology); PE0603466 Project AE3 (Unconventional Countermeasures & Survivability Advanced Technology); and PE0603119A Project BL6 (Expedient Passive Protection for Critical Assets Advanced Technology), and Project BM1 (Protection from Advanced Weapon Effects Advanced Technology)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineered Resilient Systems"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates capabilities (tools and methodologies) to rapidly create high-fidelity environmental data to support the simulation of system performance for different Army missions in various geographic settings worldwide; provide input to and obtain output from combat simulations for different echelons pertaining to system performance; and conduct system trades that consider system performance in different operational environments and mission contexts. The Engineered Resilient Systems (ERS) initiative has been identified as a Science and Technology emphasis area by the Assistant Secretary of Defense for Research and Engineering, ASD(R&E). This effort focuses on Army systems of interest and on high-fidelity environmental data for the associated battlespace, on linkages to force-on-force combat simulations representing the systems of interest, and on tools to explore trades in order to help inform requirements, reduce risk, and assess lifecycle cost pre-milestone A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5"
                                            },
                                            "Text": {
                                                "val": "Provided a simulation workflow manager tool that facilitates the linkages between data sources and computational models during simulation; validated design and tradespace analysis implementation tools; conducted tradespace analyses of candidate sensors to demonstrate environmental effects on sensor performance among other analyses in support of Warfighter systems development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.844"
                                            },
                                            "Text": {
                                                "val": "Validate environmental effects as they relate to the acquisition of Army aviation, ground vehicle, and sensor platforms; develop workflow automation processes for these platforms; integrate mission effectiveness into the resulting tradespaces; leverage emerging data analytics techniques and machine learning algorithms to optimizes insight prior to acquisition decision points; develop novel  methodologies through the use of environmental simulation, tradespace analytics, and computational prototyping of Army systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20, this effort is realigned to PE0603465 \/ Project AL3 (High Performance Computing for Rotorcraft Applications Advanced Technology)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.779"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T15"
                    },
                    "ProjectTitle": {
                        "val": "MILITARY ENGINEERING TECHNOLOGY DEMONSTRATION (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "65.2"
                        },
                        "CurrentYear": {
                            "val": "75.6"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "140.800"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This is a Congressional Interest Item for Military Engineering Technology Demonstrations."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Resilient Energy Systems"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "1"
                                        },
                                        "Text": {
                                            "val": "Resilient Energy Systems"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "1"
                                        },
                                        "Text": {
                                            "val": "Resilient Energy Systems"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Visualization Research and Asset Characterization"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "2"
                                        },
                                        "Text": {
                                            "val": "Visualization Research and Asset Characterization"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Remote Soil Analysis"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "2"
                                        },
                                        "Text": {
                                            "val": "Remote Soil Analysis"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Passive Remote Sensing from Underground Threats"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "3"
                                        },
                                        "Text": {
                                            "val": "Passive Remote Sensing from Underground Threats"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Novel Technologies"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "2"
                                        },
                                        "Text": {
                                            "val": "Novel Technologies"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Additive Manufacturing\/3D Printing"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "2"
                                        },
                                        "Text": {
                                            "val": "Additive Manufacturing\/3D Printing"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "2"
                                        },
                                        "Text": {
                                            "val": "Additive Manufacturing\/3D Printing"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Polymer Development"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Advanced Polymer Development"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "20"
                                        },
                                        "Text": {
                                            "val": "Advanced Polymer Development"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Bathymetric-topographic LIDAR Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8"
                                        },
                                        "Text": {
                                            "val": "Bathymetric-topographic LIDAR Research"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8.2"
                                        },
                                        "Text": {
                                            "val": "Bathymetric-topographic LIDAR Research"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Demonstration of Ultra-high Efficiency Natural Gas Technologies"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4"
                                        },
                                        "Text": {
                                            "val": "Demonstration of Ultra-high Efficiency Natural Gas Technologies"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Emerging Natural Gas Technologies"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Emerging Natural Gas Technologies"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energy Efficient Window Insulation Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Energy Efficient Window Insulation Research"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Heavy Vehicle Simulator Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8.2"
                                        },
                                        "Text": {
                                            "val": "Heavy Vehicle Simulator Research"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Inferential Sensing on Tactical Wheeled Vehicles"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Inferential Sensing on Tactical Wheeled Vehicles"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Reliable Distributed Generation in Austere Environments"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "3"
                                        },
                                        "Text": {
                                            "val": "Reliable Distributed Generation in Austere Environments"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensor Protection from Underground Threats"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Sensor Protection from Underground Threats"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extreme Terrain Research"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4"
                                        },
                                        "Text": {
                                            "val": "Extreme Terrain Research"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Secure Management of energy generation and storage"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "3"
                                        },
                                        "Text": {
                                            "val": "Secure Management of energy generation and storage"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid low energy mobile manufacturing"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "3"
                                        },
                                        "Text": {
                                            "val": "Rapid low energy mobile manufacturing"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Centrifuge Enabled Research"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "2.5"
                                        },
                                        "Text": {
                                            "val": "Centrifuge Enabled Research"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energy and technology research in cold and arctic regions"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4"
                                        },
                                        "Text": {
                                            "val": "Energy and technology research in cold and arctic regions"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ERDC Collaboration (Transportation System Assessment Technologies)"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "2"
                                        },
                                        "Text": {
                                            "val": "ERDC Collaboration (Transportation System Assessment Technologies)"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Natural Gas technology"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4"
                                        },
                                        "Text": {
                                            "val": "Natural Gas technology"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Reliable Distributed Energy in Austere Environments"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "3"
                                        },
                                        "Text": {
                                            "val": "Reliable Distributed Energy in Austere Environments"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Research Facility Modernization"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "2"
                                        },
                                        "Text": {
                                            "val": "Research Facility Modernization"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Research in the Permafrost environment"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4"
                                        },
                                        "Text": {
                                            "val": "Research in the Permafrost environment"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Secure and resilient power generation in cold region environments"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Secure and resilient power generation in cold region environments"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Silicone anode technology"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4"
                                        },
                                        "Text": {
                                            "val": "Silicone anode technology"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Transportation infrastructure evaluation system"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "3.9"
                                        },
                                        "Text": {
                                            "val": "Transportation infrastructure evaluation system"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}