{
    "id": "2020-Army-PB-2040-JBOOK-6862ccffed1a667db11cb620e9184b2662501ed68aad7c3c768162a310d4d712-23",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0606002A"
        },
        "ProgramElementTitle": {
            "val": "Ronald Reagan Ballistic Missile Defense Test Site"
        },
        "R1LineNumber": {
            "val": "199"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "59.042"
            },
            "CurrentYear": {
                "val": "62.94"
            },
            "BudgetYearOne": {
                "val": "62.069"
            },
            "BudgetYearOneBase": {
                "val": "62.069"
            },
            "BudgetYearTwo": {
                "val": "68.786"
            },
            "BudgetYearThree": {
                "val": "59.244"
            },
            "BudgetYearFour": {
                "val": "59.676"
            },
            "BudgetYearFive": {
                "val": "69.489"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "441.246"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Ronald Reagan Ballistic Missile Defense Test Site (RTS), with its remote location and one-of-a-kind instrumentation systems, provides a valuable strategic test environment that cannot be replicated. Its function is to: 1) support test and evaluation of major Army and DoD acquisition programs of strategic importance to the national defense; and 2) provide space operations and intelligence data (Space Situational Awareness, object tracking & identification) in support of U.S. Strategic Command (USSTRATCOM), acting as a high value contributing sensor to the U.S. Space Surveillance Network. Due to its unique geography and instrumentation, RTS is able to provide unmatched data collection capabilities that provide critical test data for programs of national interest to include: Army Missile Defense; Defense Advanced Research Projects Agency hypersonic Boost-Glide developmental tests; Air Force and Navy Intercontinental Ballistic Missile (ICBM) developmental and operational tests; Army, Air Force, Navy, and Missile Defense Agency (MDA) operational, demonstration, and validation tests; National Aeronautics and Space Administration (NASA) scientific and unique space programs; NASA ionospheric studies; space debris tracking; and data collection in support of space experiments. \n\nFunding in this Program Element (PE) covers management and contracting personnel support (salaries and travel) to enable the management of the test and evaluation of major Army and Department of Defense (DoD) missile systems for the Ronald Reagan Ballistic Missile Defense Test Site (RTS). Funds also provide contracting support for end item procurement, life cycle acquisition planning, and solicitation, negotiation, award, execution and management for weapon systems contracts. This PE provides contractors to accomplish key operations and maintenance functions for RTS instrumentation suites and also provides mission essential bandwidth via a fiber optic cable system. Funds provide the expertise required for operating and maintaining a number of one-of-a-kind radar, optical, telemetry, command\/control\/communications, safety, and data reduction systems. These systems include: the four unique radars of the Kiernan Reentry Measurement Site; Super Recording Automatic Digital Optical Tracker long range video-metric tracking systems; high density data recorders for high data-rate telemetry collected by ten antennas; an underwater acoustic impact location system; and data analysis\/reduction hardware\/software and Continental United States (CONUS) based mission control center. The Advanced Research Project Agency Long-Range Tracking and Instrumentation Radar and the Target Resolution Discrimination Experiment radars located at RTS are the only radars in this area of operation that have deep-space tracking capability. The Millimeter Wave Radar is one of the highest resolution imaging radars in the world, providing critical intelligence data. Funding also enables weapon system assessment of operational effectiveness and suitability for the Army, Air Force, Navy and MDA, which all have programs planned that have significant test and data gathering requirements at RTS. This test data cannot be obtained except through the use of technical facilities available on and in the vicinity of RTS. Program supports Army's PATRIOT air defense system; Air Force's Minuteman III ICBM and the Space and Missile Center's associated programs; MDA's Ballistic Missile Defense System, ICBM Targets, and Layered Ballistic Missile Defense operational tests (including: PATRIOT, Terminal High-Altitude Area Defense , and Aegis Weapon System), and NASA's space experiments."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "61.254"
                },
                "CurrentYear": {
                    "val": "63.011"
                },
                "BudgetYearOne": {
                    "val": "62.752"
                },
                "BudgetYearOneBase": {
                    "val": "62.752"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "59.042"
                },
                "CurrentYear": {
                    "val": "62.94"
                },
                "BudgetYearOne": {
                    "val": "62.069"
                },
                "BudgetYearOneBase": {
                    "val": "62.069"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.212"
                },
                "CurrentYear": {
                    "val": "-0.071"
                },
                "BudgetYearOne": {
                    "val": "-0.683"
                },
                "BudgetYearOneBase": {
                    "val": "-0.683"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.045"
                    },
                    "CurrentYear": {
                        "val": "-0.071"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.167"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.683"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.683"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "XW9"
                    },
                    "ProjectTitle": {
                        "val": "Reagan Test Site"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "59.042"
                        },
                        "CurrentYear": {
                            "val": "62.94"
                        },
                        "BudgetYearOne": {
                            "val": "62.069"
                        },
                        "BudgetYearOneBase": {
                            "val": "62.069"
                        },
                        "BudgetYearTwo": {
                            "val": "68.786"
                        },
                        "BudgetYearThree": {
                            "val": "59.244"
                        },
                        "BudgetYearFour": {
                            "val": "59.676"
                        },
                        "BudgetYearFive": {
                            "val": "69.489"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "441.246"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project covers operations and mission support functions at the Ronald Reagan Ballistic Missile Defense Test Site and is managed by Program Executive Office Missiles & Space.\n\nThe Reagan Test Site (RTS) with its remote location and one of kind instrumentation systems provides a valuable strategic test environment that cannot be replicated. Its function is to: 1) support test and evaluation of major Army and DoD acquisition programs of strategic importance to the national defense; and 2) to provide space operations and intelligence data (Space Situational Awareness; object tracking & identification) in support of U.S. Strategic Command (USSTRATCOM), acting as a high value contributing sensor to the U.S. Space Surveillance Network. Due to its unique geography and instrumentation, RTS is able to provide unmatched data collection capabilities to provide critical test data for programs of national interest to include: Army Missile Defense; Defense Advanced Research Projects Agency hypersonic Boost-Glide developmental tests; Air Force and Navy Intercontinental Ballistic Missile (ICBM) developmental and operational tests; Army, Air Force, Navy, and Missile Defense Agency (MDA) operational\/ demonstration\/ validation tests; National Aeronautics and Space Administration (NASA) scientific and unique space programs; NASA ionospheric studies; space debris tracking; and data collection in support of space experiments. \n\nFunding in this Program Element (PE) covers management and contracting personnel support (salaries and travel) to enable the management of the test and evaluation of major Army and Department of Defense (DoD) missile systems for the Ronald Reagan Ballistic Missile Defense Test Site (RTS). Funds also provide contracting support for end item procurement, life cycle acquisition planning, and solicitation, negotiation, award, execution and management for weapon systems contracts. This PE provides contractors to accomplish key operations and maintenance functions for RTS instrumentation suites and also provides mission essential bandwidth via a fiber optic cable system. Funds provide the expertise required for operating and maintaining a number of one-of-a-kind radar, optical, telemetry, command\/control\/communications, safety, and data reduction systems. These systems include the four unique radars of the Kiernan Reentry Measurement Site; Super Recording Automatic Digital Optical Tracker long range video-metric tracking systems; high density data recorders for high data-rate telemetry collected by ten antennas; an underwater acoustic impact location system; and data analysis\/reduction hardware\/software and Continental United States (CONUS) based mission control center. The Advanced Research Project Agency Long-Range Tracking and Instrumentation Radar and the Target Resolution Discrimination Experiment radars located at RTS are the only radars in this area of operation that have deep-space tracking capability. The Millimeter Wave Radar is one of the highest resolution imaging radars in the world, providing critical intelligence data. Funding also enables weapon system assessment of operational effectiveness and suitability for the Army, Air Force, Navy and MDA, which all have programs planned that have significant test and data gathering requirements at RTS. This test data cannot be obtained except through the use of technical facilities available on and in the vicinity of RTS. Program supports Army's PATRIOT air defense system; Air Force's Minuteman III ICBM and the Space and Missile Center's associated programs; MDA's Ballistic Missile Defense System, ICBM Targets, and Layered Ballistic Missile Defense operational tests (including: PATRIOT, Terminal High-Altitude Area Defense , and Aegis Weapon System), and NASA's space experiments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Civilian Pay (RTS)"
                                    },
                                    "Description": {
                                        "val": "Funding covers civilians to perform management oversight of Army and DOD Missile Test programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.435"
                                            },
                                            "Text": {
                                                "val": "All government civilian positions were fully funded."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.114"
                                            },
                                            "Text": {
                                                "val": "Continue to provide government personnel support (salaries) to enable the management of the test and evaluation of major Army and DoD missile systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.793"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.793"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide government personnel support (salaries) to enable the management of the test and evaluation of major\nArmy and DoD missile systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to inflation"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Temporary Duty (TDY)\/Training\/Supplies - Military and Civilian"
                                    },
                                    "Description": {
                                        "val": "Funding will provide for travel and training for civilians and military to assist in the testing of the Army and DoD Missile system Programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.075"
                                            },
                                            "Text": {
                                                "val": ".Reagan Test Site successfully PCS employees stationed at Kwajalein.  Employees traveled in support of  RTS?s mission."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.639"
                                            },
                                            "Text": {
                                                "val": "Continue to provide government personnel support (training and travel) to enable the management of the test and evaluation of major Army and DoD missile systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.009"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.009"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide government personnel support (training and travel) to enable the management of the test and evaluation of major Army and DoD missile systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to expected need for TDY \/ training \/ supplies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Outside Obligations\/Other Government Agencies (OGAs)"
                                    },
                                    "Description": {
                                        "val": "Funding provided to other Government Agencies for reimbursable-type work efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.807"
                                            },
                                            "Text": {
                                                "val": "Reagan Test Site was successfully supported by other Army and DoD agencies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.129"
                                            },
                                            "Text": {
                                                "val": "Continue to provide support to test and evaluation of major Army and DoD missile systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.255"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.255"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide support to test and evaluation of major Army and DoD missile systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to reduced support required from OGAs"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fiber Optic Cable (Kwajalein Cable System (KCS))\/Inner Ring Submarine"
                                    },
                                    "Description": {
                                        "val": "Fiber Optic Cable is Provides lease cost for Fiber Optic Cable between Kwajalein and Guam."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.347"
                                            },
                                            "Text": {
                                                "val": "Reagan Test Site continued to fund the Kwajalein Cable System (KCS)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.443"
                                            },
                                            "Text": {
                                                "val": "Continue to provide funding for lease of the KCS fiber optic cable between Kwajalein Island and Guam, and for backup satellite. Will fund annual fiber maintenance agreement."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.877"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.877"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide funding for lease of the KCS fiber optic cable between Kwajalein Island and Guam, and for backup satellite. Will fund annual fiber maintenance agreement."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to change in requirement\/scope."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RTS Contractor Prime Pay (KRS)"
                                    },
                                    "Description": {
                                        "val": "Provide funding for Prime contractor to perform technical Operation and Maintenance support to support test and space missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.42"
                                            },
                                            "Text": {
                                                "val": "Reagan Test Site funded the prime contractor for operation and maintenance of the range."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.525"
                                            },
                                            "Text": {
                                                "val": "Continue to provide technical O&M support (test planning, instrumentation operations and maintenance, systems engineering, flight safety, and launch ordnance) to assure the capability of the Range to support test and space missions. Begins buydown of critical maintenance backlog."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.274"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.274"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide technical O&M support (test planning, instrumentation operations and maintenance, systems engineering, flight safety, and launch ordnance) to assure the capability of the Range to support test and space missions. Continues the buy-down of critical maintenance backlog."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase aligns with expected workload for FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Contractor Material"
                                    },
                                    "Description": {
                                        "val": "Provide for materials to maintain range capabilities and support test operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.97"
                                            },
                                            "Text": {
                                                "val": "RTS purchases parts and materials to operate and maintain range equipment and instrumentation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.963"
                                            },
                                            "Text": {
                                                "val": "Continue to provide critical non-labor materials to maintain critical range capabilities and prevent obsolescence in support of test operations. Begins buydown of critical maintenance backlog."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.042"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.042"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide critical non-labor materials to maintain critical range capabilities and prevent obsolescence in support of test operations. Continues the buy-down of critical maintenance backlog."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to inflation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Federally Funded Research and Development Centers (FFRDC) Contractor Pay (MIT\/LL)"
                                    },
                                    "Description": {
                                        "val": "Provide for technical expertise to RTS leadership for the overall performance of Range Operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.6"
                                            },
                                            "Text": {
                                                "val": "Massachusetts Institute of Technology\/Lincoln Laboratory continued to provide scientific advice and range support to Reagan Test Site on national defense capabilities and technologies for test instrumentation and range assets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.432"
                                            },
                                            "Text": {
                                                "val": "Continue to provide technical advice to RTS leadership in support of Range operations, strategic planning, and technical execution of critical technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.411"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.411"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide technical advice to RTS leadership in support of Range operations, strategic planning, and technical execution of critical technology."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to reduced support from Massachusetts Institute for Technology (MIT) Lincoln Laboratory."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Contractor Pay Meteorological"
                                    },
                                    "Description": {
                                        "val": "Provide capability for weather sensing capability which allows for test planning and execution of the program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.118"
                                            },
                                            "Text": {
                                                "val": "Reagan Test Site provided meteorological support and weather sensing capabilities for U. S. Army Kwajalein."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.15"
                                            },
                                            "Text": {
                                                "val": "Continue to provide support for sustained weather sensing capabilities, including weather reporting via radar data. This capability provides critical data to test planning and execution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.203"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.203"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide support for sustained weather sensing capabilities, including weather reporting via radar data. This   \ncapability provides critical data to test planning and execution."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to inflation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Transportation"
                                    },
                                    "Description": {
                                        "val": "Provide transportation of material and passenger between Kwajalein and continental U.S. (CONUS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.505"
                                            },
                                            "Text": {
                                                "val": "Reagan Test Site successfully transported material and passenger between Kwajalein and continental U.S. (CONUS)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.861"
                                            },
                                            "Text": {
                                                "val": "Continuing to provide mission specific material and passenger transportation via air (Air Mobility Command) and sea (Surface Deployment and Distribution Command) between Kwajalein Atoll and CONUS."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.525"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.525"
                                            },
                                            "Text": {
                                                "val": "Continuing to provide mission specific material and passenger transportation via air (Air Mobility Command) and sea (Surface Deployment and Distribution Command) between Kwajalein Atoll and CONUS."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Change due to historical use."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission Specific Environmental"
                                    },
                                    "Description": {
                                        "val": "Ensures Range Readiness and all regulatory environmental requirements are compliant with range and test requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.654"
                                            },
                                            "Text": {
                                                "val": "Reagan Test Site ensured compliance with environmental standards for U. S. Army Kwajalein."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.552"
                                            },
                                            "Text": {
                                                "val": "Continue to provide the capability to assess and maintain the Range Readiness and compliance with environmental requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.68"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.68"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide the capability to assess and maintain the Range Readiness and compliance with environmental requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to public environmental meetings held every two years"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "USNS Worthy - Shipyard"
                                    },
                                    "Description": {
                                        "val": "Provide for maintenance to keep all parts of the ship operational for testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.48"
                                            },
                                            "Text": {
                                                "val": ".Reagan Test Site completed overhaul of the Worthy OCCM during its triennial maintenance schedule."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Contracting Command (ACC) Support"
                                    },
                                    "Description": {
                                        "val": "Contracting support to administrator the contract vehicle for the program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.631"
                                            },
                                            "Text": {
                                                "val": "Provided contracting support (salaries, training, travel, etc) to test and evaluation of major Army and DoD Missile System."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY2019 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "SBIR\/STTR adjustment"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.132"
                                            },
                                            "Text": {
                                                "val": "SBIR\/STTR Adjustment"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "SBIR\/STTR adjustment"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}