{
    "id": "2020-Army-PB-2040-JBOOK-caa98a5fe7b001fc6e9636b55add742024da70b1a5204a85a180c10adbb25455-19",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602601A"
        },
        "ProgramElementTitle": {
            "val": "Combat Vehicle and Automotive Technology"
        },
        "R1LineNumber": {
            "val": "25"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "78.759"
            },
            "CurrentYear": {
                "val": "104.404"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "183.163"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020, this Program Element (PE) is realigned with continuity of effort to:\n* PE 0602145A (Next Generation Combat Vehicle Technology)."
        },
        "ProgramElementMissionDescription": {
            "val": "This PE researches, designs, and evaluates combat and tactical vehicle automotive technologies that enable the Army to have a lighter, more survivable, more mobile and more deployable force. Project C05 (Armor Applied Research) investigates, researches, and evaluates advanced ground vehicle design and occupant protection technologies in such areas as armor concepts, ballistic defeat mechanisms, blast mitigation, survivability modeling and simulation (M&S), hit avoidance, kill avoidance, safety, sensors, counter measures, instrumentation, and survivability packaging concepts to achieve superior survivability\/protection for Soldiers and military ground vehicles. Survivability technologies will be designed for integration into\/with the Modular Active Protection System (MAPS). Project H77 (National Automotive Center), which was chartered by the Secretary of the Army to conduct shared government and industry, or \"dual use\", technology programs to leverage commercial investments in automotive technology research and development for Army ground combat and tactical vehicle applications. Project H91 (Ground Vehicle technology) designs, matures, and evaluates a variety of innovative and enabling technologies in the areas of electrical power, thermal management, propulsion, mobility, power for advanced survivability, vehicle diagnostics, fuels, lubricants, water purification, intelligent systems, autonomy enabled systems, and other component technologies to enhance the mobility, power and energy, and reduce the logistic chain of combat and tactical vehicles. This PE executes the Army's Combat Vehicle Prototyping (CVP) program to mature, integrate, and demonstrate ground vehicle leap ahead technologies in support of future combat vehicles.\n\nIn FY18\/FY19 work in this PE is related to, and fully coordinated with, PEs 0602105A (Materials Technology), 0602618A (Ballistics Technology, Robotics Technology), 0602705A (Electronics and Electronic Devices), 0602716A (Human Factors Engineering Technology), 0603005A (Combat Vehicle and Automotive Advanced Technology), 0603125A (Combating Terrorism Technology Development), 0603734A (Military Engineering Advanced Technology), and 0708045A (Manufacturing Technology).  Beginning in FY20, work in this PE is related to, and fully coordinated with PE 0602145A (Next Generation Combat Vehicle Technology) and PE 0603462A (Next Generation Combat Vehicle Advanced Technology). \n\nWork in this PE is coordinated with the United States Marine Corps, the Naval Surface Warfare Center, and other ground vehicle developers within the Defense Advanced Research Projects Agency (DARPA) and the Departments of Energy, Commerce, and Transportation.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nThe Ground Portfolio technology investments are creating a layered vehicle protection suite including Active Protection (Hard-Kill and Soft-Kill) capabilities supported by robust advanced armor (Enhanced Survivability)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "67.232"
                },
                "CurrentYear": {
                    "val": "70.45"
                },
                "BudgetYearOne": {
                    "val": "69.169"
                },
                "BudgetYearOneBase": {
                    "val": "69.169"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "78.759"
                },
                "CurrentYear": {
                    "val": "104.404"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "11.527"
                },
                "CurrentYear": {
                    "val": "33.954"
                },
                "BudgetYearOne": {
                    "val": "-69.169"
                },
                "BudgetYearOneBase": {
                    "val": "-69.169"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.028"
                    },
                    "CurrentYear": {
                        "val": "-0.046"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "10"
                    },
                    "CurrentYear": {
                        "val": "34"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.882"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.327"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-69.169"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-69.169"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY18 increase related to Congressional add of $10 Million\nFY19 increase related to Congressional add of $34 Million\nFY20 increase related to Science and Technology financial restructuring"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "C05"
                    },
                    "ProjectTitle": {
                        "val": "Armor Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.999"
                        },
                        "CurrentYear": {
                            "val": "21.474"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "40.473"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, the Project will be realigned to:\nProgram Element (PE) 0602145A Next Generation Combat Vehicle Technology:\n* Project BG6 Advanced Concepts for Active Defense Technology\n* Project BH9 Protection for Autonomous Systems Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates, researches, and evaluates advanced ground vehicle design and occupant protection technologies in such areas as armor concepts, ballistic defeat mechanisms, blast mitigation, survivability modeling and simulation (M&S), improved situational awareness, hit avoidance, kill avoidance, safety, sensors for blast, crash and rollovers, instrumentation and survivability packaging concepts to achieve superior survivability\/protection for Soldiers and ground combat and tactical vehicles. Survivability\/protection technologies are being investigated to meet anticipated ground combat and tactical vehicle survivability objectives. Additionally, this project focuses on analysis, modeling, and characterization of potential survivability solutions that could protect against existing and emerging threats. This analysis is used to aid in the identification of technologies to enter maturation and development in PE 0603005A (Combat Vehicle and Automotive Advanced Technology) \/ Project 221 (Combat Vehicle Survivability).\n\nThis Project supports Army Science and Technology efforts in the Ground Maneuver portfolio.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Armor Development:"
                                    },
                                    "Description": {
                                        "val": "The objective of this effort is to design, integrate and validate performance of advanced armor systems to defeat single and multiple chemical energy (CE) and kinetic energy (KE) emerging threats for combat and tactical vehicles. These systems include base armor (small arms \/ medium caliber, opaque and transparent B-kits), applique armor (passive \/ reactive \/ active multi-threat C-kits), multifunctional armor, and adaptive and cooperative armors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.417"
                                            },
                                            "Text": {
                                                "val": "Matured attachment designs for subsystem integration of advanced passive and reactive armor technologies; verified performance of subsystem integration design for advanced passive and reactive armor technologies through finite element modeling; investigated various adaptive armor solutions in relevant environment; began the design of adaptive armor subsystem for system integration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.826"
                                            },
                                            "Text": {
                                                "val": "Will mature design of adaptive armor subsystem for system integration; will complete experiments on system attachments to validate component integration; will use the integration experiment results to identify and design the desired attachment approach for follow-on integration of those technologies; will verify performance of subsystem integration design for adaptive armor technologies through experimentation and finite element modeling; will begin design and development of hybrid multi-threat armor subsystem."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort realigns to PE 0602145A (Next Generation Combat Vehicle Technology) \/ Project BG6 (Advanced Concepts for Active Defense Technology) in FY20 as part of the financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blast Mitigation:"
                                    },
                                    "Description": {
                                        "val": "This effort designs, fabricates and evaluates advanced survivability and protection capabilities, tools and technologies to improve protection against vehicle mines, improvised explosive devices (IEDs) and other underbody threats and crash events. This effort also designs and evaluates technologies purposed for protecting the occupant such as seats and restraints. Blast and crash mitigation technologies are further investigated and matured in such areas as active and passive exterior\/hull\/cab\/kits, interior energy absorbing capabilities for seats, floors, restraints, sensors for active blast mitigating technologies and performance evaluation, M&S, experimentation and instrumentation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.324"
                                            },
                                            "Text": {
                                                "val": "Designed subsystem concepts for integration of armor and Modular Active Protection System (MAPS) surrogate hardware; validated design of subsystem components required for integration of seats, restraints, flooring and structures through structural and blast analysis; matured WIAMan certification test procedures based on test results."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.441"
                                            },
                                            "Text": {
                                                "val": "Will develop and document best practices (multi-material, cost-conscious, lightweight design) for optimization of structural subsystem technologies that will provide platform ballistic protection.  Will complete individual component performance testing of seats, restraints, flooring, and structures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This program ends in FY19.."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved Situational Awareness for Ground Platforms"
                                    },
                                    "Description": {
                                        "val": "This effort investigates situational awareness (SA) technologies and architectures to improve occupant and vehicle survivability in all conditions and environments to include degraded visual environments (DVE) for ground vehicles. This effort also investigates and analyzes electronic architectures to enable the efficient integration of DVE systems such as intra-vehicle data and video networks, SA input\/output devices, and associated software architectures and interfaces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.001"
                                            },
                                            "Text": {
                                                "val": "Validated increased SA in DVE to enable indirect vision driving maneuverability, driving aids to reduce accidents & threat detection to improve survivability. Improved operational tempo (OPTEMPO) in DVE to maintain OPTEMPO and decrease occupant injury.\nOptimized aviation capabilities provided by the Degraded Visual Environment Mitigation (DVE M) program to provide a complete sensor that is scalable to the mission and vehicle family."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.499"
                                            },
                                            "Text": {
                                                "val": "Will mature increased local SA components in DVE using scalable low cost Local Situational Awareness (LSA) sensors and a digital video architecture system.  Will investigate advanced vehicle crew stations with scalable Warfighter-Machine Interface (WMI), augmented reality and crew aids.  Will conduct experiments to validate decreased visual latency, increased SA, increased target detection, and increased operational tempo in DVE."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This program ends in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vision Protection"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops protection materials, concepts, and devices to protect vehicle occupants' eyes, vehicle cameras and electro-optical fire control systems against emerging laser threats. This effort also evaluates methods to apply the advanced protection materials, concepts, and devices onto vehicle cameras and electro-optical systems to prevent lasers from destroying sighting systems, disabling cameras that provide situational awareness, and damaging or disorienting Warfighter vision."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.257"
                                            },
                                            "Text": {
                                                "val": "Conducted experiments to mature protected day cameras for near term threat protection; designed and matured concepts for future systems to protect against current and future laser threats; improved laboratory capability to enable integration and testing of vision protection concepts on ground vehicles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Protection for Autonomous Systems"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops materials, concepts, and devices to protect autonomous systems against emerging threats. This effort also evaluates methods to apply the advanced protection materials, concepts, and devices onto autonomous systems to prevent disabling or destroying sensors, electronics, and mechanical components, or physical exploitation of subsystems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.384"
                                            },
                                            "Text": {
                                                "val": "Will investigate concepts for protection of autonomous systems in forecasted operational environments. Will identify technologies that address projected threats and hazards."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort realigns to PE 0602145A (Next Generation Combat Vehicle Technology) \/ Project BH9 (Protection for Autonomous Systems Tech) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Defense Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, analyzes, and designs active hard-kill (physical countermeasure) and soft-kill (non-kinetic countermeasure such as electronic jamming or spoofing) protection Active Protection System (APS) components for future integration onto tactical and combat vehicle platforms. This effort also investigates, designs, and development active, modular components and controls for APS vehicle protection and associated architectures and interfaces."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.762"
                                            },
                                            "Text": {
                                                "val": "Will investigate and analyze future hard-kill and soft-kill active defense concepts for use with combat vehicles. Will investigate and design modular components according to architecture and interface requirements. Will develop and assess advanced soft-kill technologies that will defeat higher-level and emerging threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort realigns to PE 0602145A (Next Generation Combat Vehicle Technology) \/ Project BG6 (Advanced Concepts for Active Defense Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.562"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H77"
                    },
                    "ProjectTitle": {
                        "val": "National Automotive Center"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.347"
                        },
                        "CurrentYear": {
                            "val": "12.082"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "29.429"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, funding for this Project is realigned to \nProgram Element (PE) 0602145A Next Generation Combat Vehicle Technology:\n* Project BJ3 (Hydrogen Based Combat System Technology) \n* Project BI9 (Vehicle System Security Technology)\n* Project BH5 (Platform Electrification and Mobility Tech)\n* Project BI4 (Materials Application and Integration Tech)"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project funds the National Automotive Center (NAC), which was chartered by the Secretary of the Army to conduct shared government and industry (dual use) technology programs to leverage commercial investments in automotive technology research and development for Army ground combat and tactical vehicle applications. Primary thrusts for this activity include advanced power and energy technologies for tactical and non-tactical ground vehicles, electric infrastructure and alternative energy for installations and bases, vehicle networking and connectivity to maximize overlap between commercial and military requirements. Active outreach to industry, academia and other government agencies develops new thrust areas for this Project to maximize shared commercial and government investment.\n\nThis Project supports Army Science and Technology efforts in the Ground Maneuver portfolio.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nThe Ground Portfolio technology investments are maturing powertrain technologies to provide a fuel efficient engine\/power plant capability that is common across the fleet to reduce fuel, training, maintenance and parts requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Power, Energy and Mobility:"
                                    },
                                    "Description": {
                                        "val": "This effort investigates dual use power, energy, and mobility technologies leveraging commercial and academic investment to military application. This effort focuses on technologies such as lightweight composite materials, electrification of engine accessories, alternative fuels, hybrid vehicle architectures, and compact electrical power generation in order to maximize common investment to meet Army ground vehicle requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.076"
                                            },
                                            "Text": {
                                                "val": "Continued to investigate new computer aided engineering tools for vehicle batteries that can accurately predict the combined structural, electrical, and thermal responses to military usage conditions. Continued to investigate new computer aided engineering tools for vehicle engines that accurately model fuel injection spray, cavitation within fuel injectors, flash boiling, spray\/wall interaction, super critical fuel injection, in cylinder radiation and heat transfer, engine knock and soot emissions. Continued to investigate alternate integrated starter generator motors that achieve the required power and torque densities without Rare Earth materials. Continued to collaborate with automotive industry and Department of Energy in fuel cell technology maturation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.224"
                                            },
                                            "Text": {
                                                "val": "Will continue to leverage commercial and academic investments into dual use power, energy, and mobility technologies.  Will investigate advances in battery design and safety.  Will conduct fuel-cell experimentations, in order to mature component designs, and investigate alternative base fuels.  Will research into electrification of parasitic powertrain and vehicle loads that promise weight savings in addition to more efficient use of onboard power. Will identify feasible material options to reduce weight and\\or increase structural integrity which would improve mobility in areas such as: aluminum, composites, joining technologies, and design optimization."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort realigns to PE 0602145A (Next Generation Combat Vehicle Technology) \/ Project BJ3 (Hydrogen Based Combat System Technology) and Project BI9 (Vehicle System Security Technology) as part of the financial restructuring"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dual Use Technologies:"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, researches and evaluates ground vehicle technologies with both military and commercial applications such as renewable energy technologies, electrical power management between vehicles and the grid, alternative fuels, new human machine interfaces, and advanced vehicle networking, automation, and secure communication (telematics). This effort maximizes commercial technology investment for military applications in line with the National Automotive Center's Charter. Collaborations with industry, universities and other government agencies on standards writing for joint applications will facilitate this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.271"
                                            },
                                            "Text": {
                                                "val": "Continued to leverage commercial automotive and trucking research and development centers to transition reliable, affordable technology solutions to our military ground vehicle fleet. Continued dual use collaborative investigations of military & commercial ongoing open vehicle architecture standards, electrification standards, autonomous systems technologies and integration, vehicle security engineering best practices, and communication systems integration challenges through collaborative mechanisms such as the Society of Automotive Engineers, Automation Alley, the Center for Automotive Research (CAR), and the HTUF. Conducted integration of autonomy systems on international vehicles and demonstrate an autonomous convoy with advanced vehicle behaviors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.497"
                                            },
                                            "Text": {
                                                "val": "Will research ground vehicle technologies with both military and commercial applications. Will conduct experiments with innovative human machine interfaces, advanced vehicle networking, and vehicle automation technologies. Will focus on vehicle security engineering best practices that prevent detriment to crew and vehicles from cyber-attacks. Will research of autonomy systems on coalition international vehicles.  Will further the advancement of tactics, training, and procedures (TTPs) for inclusion of autonomous systems and studies on vehicle networking and cyber security. Will mature concepts to increase logistics fleet affordability and reduce logistics footprint through autonomy."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort realigns to PE 0602145A (Next Generation Combat Vehicle Technology) \/ Project BJ3 (Hydrogen Based Combat System Technology) and Project BI9 (Vehicle System Security Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.361"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H91"
                    },
                    "ProjectTitle": {
                        "val": "Ground Vehicle Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "32.413"
                        },
                        "CurrentYear": {
                            "val": "36.848"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "69.261"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project realigns to \nProgram Element (PE) 0602145A Next Generation Combat Vehicle Technology:\n* Project BH5 Platform Electrification & Mobility Tech \n* Project BF1 Autonomous Ground Resupply Tech \n* Project BF3 Combat Vehicle Robotics Tech)\n* Project BF6 Crew Augmentation and Optimization Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs, develops, and evaluates a variety of innovative enabling technologies in the areas of vehicle concepts, virtual prototyping, electronic controls, electrical power, thermal management, propulsion, mobility, survivability, vehicle diagnostics, fuels, lubricants, water purification, intelligent systems, autonomy enabled systems, and other component technologies for application to combat and tactical vehicles.\n\nThis Project supports Army Science and Technology efforts in the Ground Maneuver portfolio.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Propulsion and Thermal Systems:"
                                    },
                                    "Description": {
                                        "val": "This effort researches, designs and evaluates high power density engines and transmission systems needed to offset increasing combat vehicle weights (armor), improved fuel economy (fuel cost & range), and reduced cooling system burden (size, heat rejection). This effort also researches and matures thermal management technologies and systems including heat energy recovery, propulsion and cabin thermal management sub systems to utilize waste heat energy and meet objective power and mobility requirements on all ground vehicles. Lastly, this effort maximizes efficiencies within propulsion and thermal systems to reduce burden on the vehicle while providing the same or greater performance capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.039"
                                            },
                                            "Text": {
                                                "val": "Matured advanced heat exchanger, efficient fan, and waste heat recovery system into advanced thermal management system. Matured advanced thermal management system concept design in preparation of integration into advanced combat vehicle propulsion system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.909"
                                            },
                                            "Text": {
                                                "val": "Will conduct experiments on advanced heat exchanger, efficient fan, and waste heat recovery system in the advanced thermal management system. Will validate advanced thermal management system design.  Will improve the component and system design based on test results.  Will complete subsystem testing of high power density engine and transmission."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort realigns to PE 0602145A (Next Generation Combat Vehicle Technology) \/ Project BH5 (Platform Electrification & Mobility Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power Management Technologies:"
                                    },
                                    "Description": {
                                        "val": "This effort investigates power management technologies, software, and implementation approaches. Technologies include Alternating Current (AC) to Direct Current (DC) inverters, DC converters, solid state circuit protection, power distribution, and automated control of complete power systems. Special emphasis has been placed on developing high temperature capable power electronics, leading to the use of Silicon Carbide (SiC) in the above technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.258"
                                            },
                                            "Text": {
                                                "val": "Completed testing of Gallium Nitride (GaN) and SiC based leap ahead electrical power system in the SIL to troubleshoot issues in preparation for future combat vehicle integration. Continued environmental, EMI, reliability performance, and other testing of vehicle power architecture system components and software to prepare for future combat vehicle testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.586"
                                            },
                                            "Text": {
                                                "val": "Will validate power architecture control software functionality in order to confirm power quality, prioritization and optimization algorithms that maximize available power on the vehicle. Will validate environmental, EMI, reliability performance, and other testing of high operating temperature vehicle power architecture system Silicon Carbide components and software to ensure readiness for future combat vehicle testing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort realigns to PE 0602145A (Next Generation Combat Vehicle Technology) \/ Project BH5 (Platform Electrification & Mobility Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power Electronics, Hybrid Electric and Onboard Vehicle Power (OBVP) Components:"
                                    },
                                    "Description": {
                                        "val": "This effort researches, develops and evaluates technologies to increase onboard vehicle electric power to enable vehicle systems such as advanced survivability systems, situational awareness systems, advanced computing, and the Army network. This effort researches, designs and evaluates high temperature and efficient power generation components to provide increased electrical power and reduced thermal loads using high operating temperature switching devices and advanced electrical generation components such as integrated starter generators and integrated starter alternators. This effort also researches, designs and evaluates advanced control techniques for power generation components to make these systems more efficient, increase electrical power output and reduce thermal loads."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.323"
                                            },
                                            "Text": {
                                                "val": "Completed testing of integrated starter generator system in brass board configuration. Began analysis and system design optimization on an advanced combat vehicle propulsion system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.233"
                                            },
                                            "Text": {
                                                "val": "Will complete analysis and system design optimization on an advanced combat vehicle propulsion system. Will evaluate the increase in onboard vehicle power availability and fuel efficiency with no negative impact to vehicle mobility."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort realigns to PE 0602145A (Next Generation Combat Vehicle Technology) \/ Project BH5 (Platform Electrification & Mobility Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Non-Primary Power Systems:"
                                    },
                                    "Description": {
                                        "val": "This effort researches, investigates, conducts experiments and validates Auxiliary Power Units (APUs) technologies such as modular\/scalable engine based APUs, fuel cell reformer systems to convert JP 8 to hydrogen, sulfur tolerant JP 8 fuel cell APUs and novel engine based APUs for military ground vehicle and unmanned ground systems. This effort also determines inputs for APU interface control documents, as well as investigates solutions for reducing APU acoustic signature for silent operation during mounted surveillance missions. This effort investigates the use of small engines and JP 8 fuel cell systems for use as prime power solutions for unmanned ground systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.9"
                                            },
                                            "Text": {
                                                "val": "Investigated advanced APU to verify performance, control strategy and advanced noise control. Continued to optimize active noise cancellation, isolation and muffling to decrease auditory detection during mounted surveillance missions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Elastomer Improvement Program:"
                                    },
                                    "Description": {
                                        "val": "This effort researches, formulates and tests new elastomer (rubber) compounds for vehicle track systems to increase track system durability, reduce track system failures and reduce Operations & Sustainment (O&S) costs related to premature track system failures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.236"
                                            },
                                            "Text": {
                                                "val": "Formulated final compounds for selection and inclusion on the advanced running gear demonstration platform. Molded compounds for the track pad, bushing and road wheels. Performed final laboratory evaluations on selected finished product compounds and then produce quantity for demonstrator evaluations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Intelligent Systems Technology Research:"
                                    },
                                    "Description": {
                                        "val": "This effort investigates improved operations of manned platforms through the application of sensing and autonomy technologies developed for unmanned systems such as maneuver and tactical behavior algorithms, driver assist techniques, autonomy kits, advanced navigation and planning, vehicle self-protection, local situational awareness, advanced perception, vehicle and pedestrian safety, active safety, and robotic command and control."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.49"
                                            },
                                            "Text": {
                                                "val": "Continued to design and develop the Warfighter Machine Interface for scalability and driver\/crew aids. Matured the increased reliability of robotic technologies to produce trust and confidence of autonomous vehicles. Improved standardized data collection tools and methodologies to mature Department of Defense (DoD) ground robotic requirements, development, technology investments and procurement decisions. Conducted experiments to validate that these tools and technologies are increasing our capabilities of protecting the force, reducing burden on soldiers, and mission command & tactical intelligence."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.919"
                                            },
                                            "Text": {
                                                "val": "Will develop advanced vehicle behaviors to transition to autonomy-enabling kits for tactical wheeled vehicles in leader-follower convoy operations.  Will continue to develop and design common user interfaces and open architecture design.  Will continue to research automation software and algorithms, increased robotic reliability and autonomous testing methodologies and procedures. Will continue to advance capabilities to enable operations in increasingly challenging environments like off-road terrain and reduced communication areas."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort realigns to PE 0602145A (Next Generation Combat Vehicle Technology) \/ BF1 (Autonomous Ground Resupply Tech) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energy Storage:"
                                    },
                                    "Description": {
                                        "val": "This effort investigates novel advanced ground vehicle energy storage devices such as advanced chemistry batteries and ultra-capacitors for starting, lighting, and ignition and silent watch requirements for powering vehicle electronics and communications systems with main engine off. Develop and test energy storage devices to meet harsh military requirements that far exceed commercial requirements such as extreme temperature operation (46 to +71C), ballistic shock and vibration, and electromagnetic interference (in accordance with Military Standard 810G). Designs and develops advanced batteries to reduce battery volume and weight while improving battery energy and power densities within the same footprint and standardized form factor of current batteries (6T) to enhance logistics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.093"
                                            },
                                            "Text": {
                                                "val": "Completed design and mature battery cells into modules. Designed and matured battery packs built around the modules. Conducted durability and performance testing at the module level for advanced Li ion chemistries."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.451"
                                            },
                                            "Text": {
                                                "val": "Will conduct durability and performance experimentation at the battery pack level for advanced Li-ion chemistries to validate improved energy density, starting, lighting, propulsion system ignition, silent watch, reliability, battery safety management,  for military vehicles."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort realigns to PE 0602145A (Next Generation Combat Vehicle Technology) \/ BH5 (Platform Electrification and Mobility Tech) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Tamper"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops mature anti tamper methodologies and technologies in combat and tactical vehicles. Technologies such as controllers and tactical information systems for autonomous appliques, active protection systems, and Command, Control, Communications, Computers & Intelligence (C4I), will be designed for enhanced protection against current and evolving threats. This includes: enhancing and defending technologies used to secure data in vehicle systems; defending against the threat of unwanted behavioral changes in multi agent systems; the prevention of unauthorized control of, or denying service to a targeted platform; reverse engineering and conducting vehicle digital forensics; and responding to active attacks that have penetrated anti tamper defenses in a platform."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.074"
                                            },
                                            "Text": {
                                                "val": "Developed measurement, analysis and verification methods to identify vulnerabilities of combat and tactical vehicle software based technologies; capitalized on currently available virtual (Modeling & Simulation) toolsets to design and virtually conduct experiments of potential safeguards and solutions of the vehicle architecture, and began to evaluate methods and toolsets on ground vehicle hardware. Investigated applications of anti-tamper that are applicable to both current and future vehicles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Crew Station"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on crew size reduction and crew stations tailored to mission and soldier needs through the utilization of emerging human interaction technologies, automations, machine intelligence and the provision of cohesive domain personalization to permit soldiers to achieve leap ahead performance beyond today?s constrained ground vehicle environment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.69"
                                            },
                                            "Text": {
                                                "val": "Will conduct experiments to provide data to improve early warning detections, reduce response times and shorten task durations for future crewstation programs. Will investigate crew size reduction to determine if the same overall performance can be produced by performing simulations to provide data, reports and analysis to the future fighting vehicles."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort realigns to PE 0602145A (Next Generation Combat Vehicle Technology) \/ Project BF6 (Crew Augmentation and Optimization Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unmanned Ground Systems Research"
                                    },
                                    "Description": {
                                        "val": "This effort researches, designs, and develops technologies that enable scalable integration of multi domain teamed robotic and autonomous system capabilities supporting Army combat formations. Investigate behaviors and algorithms to mature functions that detect and classify risks and threats, reduce burden on the Soldier operator, and validate initial safety procedures for armed Unmanned Ground Vehicles (UGVs) in contested, austere and congested environments. Investigates increased situational awareness needed for a high degree of survivability and lethality for complex maneuvers. Mature government owned autonomy architecture to enable iterative software capability upgrades for systems. Conduct experiments in static environment with multiple live and simulated manned unmanned vehicles with evolving threats. Investigate behaviors and hardware needed to rapidly learn, adapt & reason faster than the adversary."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.478"
                                            },
                                            "Text": {
                                                "val": "Will investigate vehicle behaviors to enable teamed robotic and autonomous systems to support specific capabilities supporting Army combat formations.  Will research and design common user interfaces for remote lethality with limited targeting assist.  Will research automation software and algorithms, increased robotic reliability and function, and determine certified safety procedures for soldier-operated armed UGVs. Will conduct experiments using various commercial network solutions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort realigns to PE 0602145A (Next Generation Combat Vehicle Technology) \/ Project BF3 (Combat Vehicle Robotics Technology) as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.582"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T26"
                    },
                    "ProjectTitle": {
                        "val": "Ground Vehicle Technologies (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10"
                        },
                        "CurrentYear": {
                            "val": "34"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "44.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional increase."
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Ground Vehicle Technology applied research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Program Increase"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "34"
                                        },
                                        "Text": {
                                            "val": "Program Increase"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}