{
    "id": "2020-Army-PB-2040-JBOOK-6862ccffed1a667db11cb620e9184b2662501ed68aad7c3c768162a310d4d712-16",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605718A"
        },
        "ProgramElementTitle": {
            "val": "Army Modeling & Sim X-Cmd Collaboration & Integ"
        },
        "R1LineNumber": {
            "val": "192"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "1.756"
            },
            "CurrentYear": {
                "val": "2.798"
            },
            "BudgetYearOne": {
                "val": "2.527"
            },
            "BudgetYearOneBase": {
                "val": "2.527"
            },
            "BudgetYearTwo": {
                "val": "2.574"
            },
            "BudgetYearThree": {
                "val": "2.667"
            },
            "BudgetYearFour": {
                "val": "2.72"
            },
            "BudgetYearFive": {
                "val": "2.775"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "17.817"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) promotes the Army's Modeling and Simulation (M&S) strategy, defined by five guiding priorities: (1) formulate Army M&S policies; (2) develop and employ management processes for models, simulations and data; (3) develop M&S standards, architectures, networks and environments; (4) develop\/employ new M&S tools and simulation technology; (5) develop an M&S workforce. Specifically, this PE focuses on priorities 3 and 4.\n\nM&S Standards, Architectures, Networks and Environments: The consistent use of standards, architectures, networks and environments advances the goal of interoperability. The Army coordinates with Joint, Interagency, Intergovernmental, and Multinational (JIIM) partners along with industry and academia to develop\/employ standards that promote collaboration and facilitate the sharing of tools, data and information. The Army oversees procedures and processes for the appropriate use of standards to foster common formats and increase M&S and data reuse. The Army ensures these standards, architectures, networks and environments are readily accessible and can be reliably applied by users.\n\nM&S Tools and Simulation Technology: The Army must have credible M&S tools and data to support the full range of Army organizational missions and functional responsibilities. M&S results that are timely and credible enhance decision making. The Army must develop and accredit reliable M&S tools so that decision makers and senior leaders benefit from the results and thus support the continued development, integration and use of such tools. To ensure credibility and reliability of results, M&S managers, developers and users must make the capabilities, constraints, limitations and assumptions of their M&S tools readily accessible. PE 0605718A provides for the development and employment of tools in the form of models, simulations and data that support the full range of Army interests and deliver timely information to enhance effective decision making. Moreover, these tools can be documented, verified, validated and accredited for their intended purpose in order to provide timely, credible results."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "1.829"
                },
                "CurrentYear": {
                    "val": "2.801"
                },
                "BudgetYearOne": {
                    "val": "2.527"
                },
                "BudgetYearOneBase": {
                    "val": "2.527"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "1.756"
                },
                "CurrentYear": {
                    "val": "2.798"
                },
                "BudgetYearOne": {
                    "val": "2.527"
                },
                "BudgetYearOneBase": {
                    "val": "2.527"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.073"
                },
                "CurrentYear": {
                    "val": "-0.003"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.001"
                    },
                    "CurrentYear": {
                        "val": "-0.003"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.072"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S03"
                    },
                    "ProjectTitle": {
                        "val": "Analysis M&S Tools and Services"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.756"
                        },
                        "CurrentYear": {
                            "val": "2.798"
                        },
                        "BudgetYearOne": {
                            "val": "2.527"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.527"
                        },
                        "BudgetYearTwo": {
                            "val": "2.574"
                        },
                        "BudgetYearThree": {
                            "val": "2.667"
                        },
                        "BudgetYearFour": {
                            "val": "2.72"
                        },
                        "BudgetYearFive": {
                            "val": "2.775"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "17.817"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project has two functions: \n\nFunction 1 (Priority 3 of the \"Army Modeling and Simulation (M&S) Strategy\") -- Develop M&S standards, architectures, networks and environments that promote sharing, interoperability, access, and reliable application of tools, formats, data and information among\/for users.\n\nFunction 2 (priority 4 of the \"Army M&S Strategy\") -- Develop and improve tools and technology in the form of models, simulations and data that support the full range of Army interests and deliver timely information to enhance effective decision making.  These tools can be documented, verified, validated and accredited for their intended purpose.  \n\nResources under Project S03 support the five M&S communities (Acquisition, Analysis, Experimentation, Test & Evaluation, Training) at the enterprise level through enabling efforts. These efforts include the following: (a) design models, simulations, data and tools that are resident within one organization but reusable and trusted by M&S users and specialists across the Army M&S enterprise; (b) leverage industry and academia; (c) promote interoperability within M&S and between M&S and operational capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Develop M&S standards, architectures, networks and environments"
                                    },
                                    "Description": {
                                        "val": "Develop M&S standards, architectures, networks and environments that promote sharing, interoperability, access, and reliable application of  tools, formats, data and information among\/for users."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.58"
                                            },
                                            "Text": {
                                                "val": "Fiscal Year (FY) 2018 funds were distributed among activities that promote the third priority of the Army M&S strategy: develop M&S standards, architectures, networks and environments. Specific FY 2018 accomplishments include: a.) development of an open modular cyber simulation architecture, b.) development of cyber\/electronic warfare effects on large scale simulation environments, c.) development of a universal terrain production architecture, d.) development of a tactical level cyber\/electronic warfare modeling and simulation descriptive framework. FY2018 M&S standards, architectures, networks and environment plans are designed to maximize reuse across the five Army M&S-enabled communities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.84"
                                            },
                                            "Text": {
                                                "val": "Fiscal Year (FY) 2019 funds will be distributed among activities that promote the third priority of the Army M&S Strategy: develop M&S standards, architectures, networks and environments. Specific FY 20019 plans include: a.) development and access to cyber\/electronic warfare simulated environments, b.) development of an enhanced fires training and testing environment, c.) development of an Operational Environment (OE) signal architecture, d.) enhancement and access to a network modeling architecture that bridges multiple modeling and simulation environments. FY2019 M&S standards, architectures, networks and environment plans were developed to maximize reuse across the five Army M&S-enabled communities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.842"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.842"
                                            },
                                            "Text": {
                                                "val": "Fiscal Year (FY) 2020 funds will be distributed among activities that promote the third priority of the Army M&S Strategy: develop M&S standards, architectures, networks and environments. Specific FY 2020 plans include: a.) development and access to cyber\/electronic warfare simulated environments, b.) development of an enhanced fires training and testing environment, c.) development of an Operational Environment (OE) signal architecture, d.) enhancement and access to a network modeling architecture that bridges multiple modeling and simulation environments. FY2020 M&S standards, architectures, networks and environment plans will be developed to maximize reuse across the five Army M&S-enabled communities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease in requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Develop M&S tools and technology"
                                    },
                                    "Description": {
                                        "val": "Develop and improve tools and technology in the form of models, simulations and data that support the full range of Army interests and deliver timely information to enhance effective decision making. These tools can be documented, verified and validated for their intended purpose."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.176"
                                            },
                                            "Text": {
                                                "val": "Fiscal Year (FY) 2018 funds are distributed among activities that promote the fourth priority of the Army M&S strategy: develop M&S tools and technology. Specific FY 2018 plans include: a.) development of a cyber\/electronic warfare effects tool within the Mission Command Information Systems (MCIS); b.) development of a signals and emissions model for sensor applications; c.) development of an aircraft thermal detection model; d.) development of a fires cumulative damage and small precision munitions model; e.) development of a world-wide terrain discovery and access tool. FY 2018 M&S tools and technology plans were developed to maximize reuse across the five Army M&S-enabled communities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.868"
                                            },
                                            "Text": {
                                                "val": "Fiscal Year (FY) 2019 funds will be distributed among activities that promote the fourth priority of the Army M&S Strategy: develop M&S tools and technology. Specific FY 2019 plans include: a.) development of an Army Fires Community Army Effectiveness Model (AEM); b.) development of network modeling scenarios and models for the test\/evaluation and analysis network communities; c.) update and enhance intelligence models for existing simulations and Mission Command Information Systems (MCIS). FY 2019 M&S tools and technology plans were developed to maximize reuse across the five Army M&S-enabled communities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.685"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.685"
                                            },
                                            "Text": {
                                                "val": "Fiscal Year (FY) 2020 funds will be distributed among activities that promote the fourth priority of the Army M&S Strategy: develop M&S tools and technology. Specific FY 2019 plans include: a.) development of an Army Fires Community Army Effectiveness Model (AEM); b.) development of network modeling scenarios and models for the test\/evaluation and analysis network communities; c.) update and enhance intelligence models for existing simulations and Mission Command Information Systems (MCIS). FY 2019 M&S tools and technology plans will be developed to maximize reuse across the five Army M&S-enabled communities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease in requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY19 SBIR\/STTR adjustment"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.09"
                                            },
                                            "Text": {
                                                "val": "FY19 SBIR\/STTR adjustment"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 SBIR\/STTR adjustment"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}