{
    "id": "2020-Army-PB-2040-JBOOK-57289821184020429f22b377c8d8ec2b7ea1aa2758df17e0ae58ba36035ae75c-14",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA4-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603827A"
        },
        "ProgramElementTitle": {
            "val": "Soldier Systems - Advanced Development"
        },
        "R1LineNumber": {
            "val": "87"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "60.774"
            },
            "CurrentYear": {
                "val": "31.022"
            },
            "BudgetYearOne": {
                "val": "22.113"
            },
            "BudgetYearOneBase": {
                "val": "22.113"
            },
            "BudgetYearTwo": {
                "val": "26.161"
            },
            "BudgetYearThree": {
                "val": "30.974"
            },
            "BudgetYearFour": {
                "val": "33.992"
            },
            "BudgetYearFive": {
                "val": "28.562"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE), Advanced Component Development and Prototypes, manages the Soldier as a system to increase combat effectiveness, test and deliver tangible products that save Soldiers lives and improve combat capability.  The PE provides funding for evaluating, developing, and testing emerging technologies and critical Soldier support systems to reduce technology risk.\n\nCF2\nThe Integrated Squad effort includes the completion of the Adaptive Squad Architecture (ASA) and Squad Performance Model (SPM) programs.  Both of these efforts are Program Executive Office-Soldier (PEO-S) led and will develop a full system architecture for the Soldier and the Squad.  This will be accomplished by developing Interface Control Documents (ICDs) in order to provide common established interfaces for internal and external stakeholders who will interface on or with the Soldier platform.  A critical part of this effort is development of the \"Squad as an Integrated Platform\" vision based on threat, operational environment and collaboration with internal and external stakeholders to inform investment decisions out to FY2050.  The ASA will develop a metric-based approach that will include live, virtual and constructive evaluations and tools across the DoD, academia and industry which will be used for senior leaders to make deliberate decisions based on the analysis of Soldier\/ Squad performance\n\nET8\nPersonnel Airdrop System, supports efforts to improve Low Altitude and High Altitude personnel parachutes and associated equipment to include canopy improvement based on integration of new technology with the goal of enhancing the insertion capability of the airborne Soldier and increasing the performance, safety, and durability of personnel airdrop equipment.\n\nS53\nThis Project supports efforts to evaluate and integrate technologies and representative or prototype systems that help expedite Soldier Clothing and Individual Equipment technology transition from the laboratory to operational use. Efforts focus on proving out commonality across as broad a spectrum of users as possible to provide a modular, integrated uniform\/clothing system from skin out and head-to-toe. It funds efforts to transition new technologies and domestically available fabrics with Flame Resistant (FR), moisture wicking, insect protection and camouflage technologies, including integration of fabrics appropriate for uniforms and equipment used in jungle\/tropical and arctic environments. New technologies are indentified to monitor health and improve Soldier survivability, reduce weight, and improve affordability, mobility and comfort in combat and training\/administrative environments. Includes integration and interface on the Soldier system.\n\nS54\nThe Small Arms Improvement Advanced Component Development and Prototypes (ACD&P) program provides funds to mature, demonstrate, test and evaluate emerging technology from Joint Service Small Arms Program (JSSAP), Project 627, Program Element 0603607A, (Budget Activity 3), Defense Advanced Research Projects Agency (DARPA), Department of Energy National Laboratories, Research Development & Engineering Centers (RDECs) and other domestic and foreign sources for small arms weapon systems and technology. Small arm weapon systems include weapons ranging up to 40 millimeter in caliber. Current and future efforts focus on improvements designed to enhance lethality, target acquisition and tracking, fire control, usability, training effectiveness and reliability of weapons to include ammunition when developing and\/or evaluating standard and non-standard weapons. Focus areas include the maturing of technology through testing and evaluation of sub-system or system prototypes which demonstrates light weight materials, wear resistant\/protective\/anti-reflective coatings, observation\/situational awareness improvements, human-systems integration, robotic armament capability, non-lethal capability, and equipment enhancements.  Benefits include continuous improvements to small arms weapon systems, fire control equipment, optics, gun barrels, training devices, suppressors, component mounts, weapon mounts, and weapon\/ammunition interface. Includes costs associated with efforts for integration and interface of products on Soldiers' head, body and weapons.\n\nVS4\nThis Project supports efforts to evaluate integrated technologies and representative or prototype systems that help expedite Personal Protective Equipment (PPE) technology transition from the laboratory to operational use."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.239"
                },
                "CurrentYear": {
                    "val": "18.044"
                },
                "BudgetYearOne": {
                    "val": "16.165"
                },
                "BudgetYearOneBase": {
                    "val": "16.165"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "60.774"
                },
                "CurrentYear": {
                    "val": "31.022"
                },
                "BudgetYearOne": {
                    "val": "22.113"
                },
                "BudgetYearOneBase": {
                    "val": "22.113"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "40.535"
                },
                "CurrentYear": {
                    "val": "12.978"
                },
                "BudgetYearOne": {
                    "val": "5.948"
                },
                "BudgetYearOneBase": {
                    "val": "5.948"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.014"
                    },
                    "CurrentYear": {
                        "val": "-0.022"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "35"
                    },
                    "CurrentYear": {
                        "val": "13"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "6.248"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.699"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "5.948"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.948"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018 funding includes a $20.000 million congressional add for Project S54 and a $15.000 million congressional add for Project VS4.\nFY 2019 funding includes a $13.000 million congressional add for Project VS4.\nFY 2020 funding request reflects an increase of $5.948 million to account for the new start of Project CF2 and increased funding in Project S53."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CF2"
                    },
                    "ProjectTitle": {
                        "val": "Integrated Soldier Systems Prototyping (SL CFT)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "1.959"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.959"
                        },
                        "BudgetYearTwo": {
                            "val": "2.543"
                        },
                        "BudgetYearThree": {
                            "val": "3.152"
                        },
                        "BudgetYearFour": {
                            "val": "3.774"
                        },
                        "BudgetYearFive": {
                            "val": "3.847"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "15.275"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Project CF2 is a new start beginning in FY 2020.  This program supports the Cross Functional Team (CFT)."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Integrated Squad effort includes the completion of the Adaptive Squad Architecture (ASA) and Squad Performance Model (SPM) programs.  Both of these efforts are Program Executive Office-Soldier (PEO-S) led and will develop a full system architecture for the Soldier and the Squad.  This will be accomplished by developing Interface Control Documents (ICDs) in order to provide common established interfaces for internal and external stakeholders who will interface on or with the Soldier platform.  A critical part of this effort is development of the \"Squad as an Integrated Platform\" vision based on threat, operational environment and collaboration with internal and external stakeholders to inform investment decisions out to FY2050.  The ASA will develop a metric-based approach that will include live, virtual and constructive evaluations and tools across the DoD, academia and industry which will be used for senior leaders to make deliberate decisions based on the analysis of Soldier\/ Squad performance.\n      FY20 RDTE funding in the amount of $1.959M will finalize an initial ASA and SPM, consisting of 3 critical products: the Configuration Database (CD), the Architectural Assessment Tool (AAT) and the SPM."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Integrated Soldier Systems Prototyping"
                                    },
                                    "Description": {
                                        "val": "Verify and maintain tools that provide Systems Engineering, Configuration Management, and Evaluations in a virtual and physical environment. Verify and maintain the ASA and SPM with emphasis on development of ICDs, specifically to support the rapid integration of the Soldier Lethality Cross Functional Team (SL CFT) priority programs with all other equipment the dismounted Soldier will use. Provide prototyping of capabilities for evaluation and integration.  Execute evaluation of new measurements and methodologies from the S&T community, execute system level evaluation environments, and support Soldier system modeling."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.959"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.959"
                                            },
                                            "Text": {
                                                "val": "FY 2020 Plans:\nFinalize operational version of ASA and SPM"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "New start.  Critical task of Adaptive Squad Architecture will be to allow Army Futures Command, Soldier Lethality Cross Functional Team, and PEO Soldier leadership to make immediate quantitative analysis of proposed components (ie next-gen weapons, future body-armor, etc) for acquisition."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CF3"
                                    },
                                    "Title": {
                                        "val": "Integrated Soldier Systems (SL CFT)"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "4.504"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.504"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.601"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.429"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.502"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.584"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "22.620"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Develop and validate  the verification and operation of the ASA tools (Configuration Database (CD), Architectural Assessment Tool (AAT), Squad Performance Model (SPM)) under full and open competition.  Attempt to utilize one vendor for, at a minimum, maintenance of the CD and AAT.  Conduct evaluations to support the SPM, with the Government acting as the lead developer."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Adaptive Soldier Architecture (ASA) Squad Performance Model (SPM)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.5"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.5"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "ASA\/SPM Test & Eval"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.459"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.459"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190306_0_444560_CF2.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Soldier Lethality Support"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ET8"
                    },
                    "ProjectTitle": {
                        "val": "Personnel Airdrop System Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.476"
                        },
                        "CurrentYear": {
                            "val": "0.396"
                        },
                        "BudgetYearOne": {
                            "val": "0.297"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.297"
                        },
                        "BudgetYearTwo": {
                            "val": "1.267"
                        },
                        "BudgetYearThree": {
                            "val": "1.265"
                        },
                        "BudgetYearFour": {
                            "val": "1.813"
                        },
                        "BudgetYearFive": {
                            "val": "1"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This program supports the Cross Functional Team (CFT)."
                        },
                        "ProjectMissionDescription": {
                            "val": "Project ET8, Personnel Airdrop System, supports efforts to improve Low Altitude and High Altitude personnel parachutes and associated equipment to include canopy improvement based on integration of new technology with the goal of enhancing the insertion capability of the airborne Soldier and increasing the performance, safety, and durability of personnel airdrop equipment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Personnel Airdrop System Development"
                                    },
                                    "Description": {
                                        "val": "Effort to improve Low Altitude and High Altitude personnel parachutes and associated equipment to include canopy improvements based on integration of new technology with the goal of enhancing the insertion capability of the airborne soldier and increasing the performance, safety and durability of personnel airdrop equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.476"
                                            },
                                            "Text": {
                                                "val": "Investigated and initiated T-11 improvements to address improved packability and weight reduction to include packing methods as agreed to during Army Airborne Board. Validated average oxygen consumption during high altitude\/high opening assessment to verify future oxygen requirements prior to integration into the Parachutists Oxygen Delivery System (PODS).  Procured PODS pre-breath prototype assets for evaluation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.396"
                                            },
                                            "Text": {
                                                "val": "Continue to investigate and initiate improvements to address reduced signature of parachute systems for high altitude operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.297"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.297"
                                            },
                                            "Text": {
                                                "val": "Evaluate Low Altitude Static Line Automatic Activation Devices as well as Universal Static Line smart snap hook and Jumper Recovery Systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change in Personnel Airdrop System Development portfolio is due to anticipated requirement changes in FY 2019 and FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "ES9"
                                    },
                                    "Title": {
                                        "val": "Advanced Tactical Parachute System"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.607"
                                        },
                                        "CurrentYear": {
                                            "val": "6.702"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.617"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.617"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.829"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.965"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.964"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "29.684"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MA7801"
                                    },
                                    "Title": {
                                        "val": "Advanced Tactical Parachute System"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "28.44"
                                        },
                                        "CurrentYear": {
                                            "val": "41.104"
                                        },
                                        "BudgetYearOne": {
                                            "val": "43.622"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "43.622"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "53.077"
                                        },
                                        "BudgetYearThree": {
                                            "val": "47.805"
                                        },
                                        "BudgetYearFour": {
                                            "val": "39.849"
                                        },
                                        "BudgetYearFive": {
                                            "val": "39.017"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "292.914"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Programs pursue technology maturation and prototype development, culminating in the transition of mature technologies (Technology Readiness Level (TRL) 6-7) to system development and demonstration (SDD)."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Developmental Contracts"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.098"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.098"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "2.605"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.703"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSRDEC Natick, MA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.234"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.226"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.1"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.1"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "1.404"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.964"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM SCIE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Belvoir"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.18"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.065"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.099"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.099"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "1.336"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.720"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Bench top testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.25"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.185"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.356"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.791"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190306_0_444560_ET8.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "20190306_1_444560_ET8.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Evaluate component and subsystem technologies"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RA-1 Signature Reduction Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SL Canopy Release Assembly Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Next Generation O2 Laboratory Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Transition S&T for USL snap hook towed Jumper recovery system"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Evaluate USL & Jumper Recovery Systems"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "S&T transition of Alternative Materiel Hardware for RA-1, T-11 & MC-6"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Evaluate new composite material for lighter weight parachute hardware"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Evaluate Transition Parachutist Non-GPS Navigation Aid"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2026"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Transition High Altitude Combo Drops"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Evaluate High Altitude Combo Drops"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Transition S&T for Low Altitude Static Line Automatic Activation Devices"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Evaluate Low Altitude Static Line Automatic Activation Devices"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S53"
                    },
                    "ProjectTitle": {
                        "val": "Clothing And Equipment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.532"
                        },
                        "CurrentYear": {
                            "val": "1.823"
                        },
                        "BudgetYearOne": {
                            "val": "2.466"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.466"
                        },
                        "BudgetYearTwo": {
                            "val": "1.81"
                        },
                        "BudgetYearThree": {
                            "val": "2.416"
                        },
                        "BudgetYearFour": {
                            "val": "4.478"
                        },
                        "BudgetYearFive": {
                            "val": "5.078"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This program supports the Cross Functional Team (CFT)."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project supports efforts to evaluate and integrate technologies and representative or prototype systems that help expedite Soldier Clothing and Individual Equipment technology transition from the laboratory to operational use. Efforts focus on proving out commonality across as broad a spectrum of users as possible to provide a modular, integrated uniform\/clothing system from skin out and head-to-toe. It funds efforts to transition new technologies and domestically available fabrics with Flame Resistant (FR), moisture wicking, insect protection and camouflage technologies, including integration of fabrics appropriate for uniforms and equipment used in jungle\/tropical and arctic environments. New technologies are indentified to monitor health and improve Soldier survivability, reduce weight, and improve affordability, mobility and comfort in combat and training\/administrative environments. Includes integration and interface on the Soldier system."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier Uniforms and Clothing"
                                    },
                                    "Description": {
                                        "val": "Develop superior and sustainable integrated clothing for the Soldier in a rapidly changing global environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.962"
                                            },
                                            "Text": {
                                                "val": "Conducted evaluation and integration of fabrics appropriate for uniforms and extremity protection used in arctic environment.  Continued to evaluate and integrate technologies to support the development of accurate digital objective color assessment to provide pass\/fail shade assessments for quality control and transition to Defense Logistics Agency Troop Support (DLA-TS). Evaluated improved lighter weight textiles which incorporate improved vector protection, Flame Resistant (FR) protection, and environmental protection while providing comfort, utility, and functionality. Evaluated next to skin uniform items using new no melt\/no drip test methodology transitioning from Science and Technology (S&T) community.  Continued evaluation of new technologies to mitigate spectral reflectance Short Wave Infrared (SWIR) for combat uniforms. Conducted evaluation and integration of insulated fabrics and technologies appropriate for handwear and footwear worn in extreme cold weather environments to be incorporated into hand and footwear systems transitioning from S&T community.  Evaluated applicability of Flame\/Heat Resistant thread technology transitioned from S&T for applicability in all FR uniforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.765"
                                            },
                                            "Text": {
                                                "val": "Develop improved Boot Water Absorption test methodology. Evaluate improved lighter weight textiles which incorporate improved vector protection, FR protection, and environmental protection while providing comfort, utility, and functionality.  Evaluate materials to support extreme cold temperature protection for military free fall parachutists.  Standardize test methodology for cold weather glove system.  Improve Hot Weather Combat Uniform Female (IHWCU-F) Pattern adjustment for creation of female sizes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.972"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.972"
                                            },
                                            "Text": {
                                                "val": "Continue Flame Resistant clothing upgrades.  Continue Signature Management evaluation in Camouflage equipment.  Continue to evaluate improved lighter weight textiles which incorporate improved vector protection, FR protection, and environmental protection while providing comfort, utility, and functionality.  Also, continue to evaluate materials to support extreme cold temperature protection for military free fall parachutists.  The S&T transition for environmental cold\/wet protection clothing system is planned."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change in Soldier Uniforms and Clothing portfolio is due to anticipated requirement changes in FY 2019 and FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Individual Equipment"
                                    },
                                    "Description": {
                                        "val": "Develop and provide superior and sustainable integrated individual equipment for the Soldier in a rapidly changing global environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.57"
                                            },
                                            "Text": {
                                                "val": "Continued evaluation of new technologies to mitigate spectral reflectance of Short Wave Infrared (SWIR) of nylon used in load carriage."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.494"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.494"
                                            },
                                            "Text": {
                                                "val": "Develop process and procedures for the Dyeing of Aramid Blends, used in environmental clothing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor increase to support testing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR\/STTR TRANSFER"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR\/STTR TRANSFER"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.058"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR\/STTR TRANSFER"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR\/STTR TRANSFER"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "S60"
                                    },
                                    "Title": {
                                        "val": "Clothing & Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.78"
                                        },
                                        "CurrentYear": {
                                            "val": "8.348"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.453"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.453"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.724"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.015"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.85"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.7"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "41.870"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Programs pursue technology maturation and prototype development, culminating in the transition of mature technologies (Technology Readiness Level (TRL) 6-7) to Systems Development and Demonstration.  This Project continues to exercise competitively awarded contracts using best value source selection procedures."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM SPIE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Belvoir, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "15.287"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.208"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.235"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.296"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.296"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSRDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "15.928"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.41"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.441"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.441"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Development Contracts"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "33.725"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.724"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.588"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.588"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2019 SBIR \/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.058"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.058"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Misc Support Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Natick,MA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.077"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.325"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.725"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.296"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.296"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Testing Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "26.049"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.865"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.805"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.845"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.845"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190306_0_444560_S53.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "UNIFORM CLOTHING"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "IHWCU-F"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Flame Resistant Clothing Upgrades"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Improve Signature Mgmt (IR) Eval & Camo in Clothing & Equipment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CW\/ECW Clothing Improvements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CW\/ECW Handwear"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CW\/ECW Footwear"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "INDIVIDUAL EQUIPMENT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S54"
                    },
                    "ProjectTitle": {
                        "val": "Small Arms Improvement"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "27.832"
                        },
                        "CurrentYear": {
                            "val": "7.677"
                        },
                        "BudgetYearOne": {
                            "val": "14.555"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.555"
                        },
                        "BudgetYearTwo": {
                            "val": "16.097"
                        },
                        "BudgetYearThree": {
                            "val": "19.232"
                        },
                        "BudgetYearFour": {
                            "val": "17.439"
                        },
                        "BudgetYearFive": {
                            "val": "10.487"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "113.319"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This program supports the Cross Functional Team (CFT).\n\nFY 2020 New starts include the following programs: Individual Non-Lethal System (funded in FY 2017), Non-Standard Weapons Assessments (funded in FY 2017), Solid State Active Denial System, Current and Legacy Weapon Improvements, and Next Generation Optics.\n\nName change:  Next Generation Squad Automatic Rifle is renamed Next Generation Squad Weapon-Automatic Rifle (NGSW-AR) and Small Arms Fire Control (SAFC)-Squad combined with SAFC-Crew are now referred to as Next Generation Fire Control.\n\nPreviously funded efforts in this Project:  Recoil Reduction Mechanisms, Lightweight Rifle\/Machine Gun Barrel Evaluations, and Rifle\/Machine Gun Suppressor Evaluations, Protective Weapons Coatings, and Weapon Upgrades and Accessories are now funded under Current and Legacy Weapon Improvements.  Armaments for Robots is now funded under Externally Powered Weapon.  Optics Upgrades is now covered under Next Generation Optics.  Sniper Missed Distance Corrective Offset, Small Arms Fire Control Crew Enhancements, Small Arms Fire Control Precision Enhancements, and Fire Control Upgrades are now funded under Next Generation Fire Control."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Small Arms Improvement Advanced Component Development and Prototypes (ACD&P) program provides funds to mature, demonstrate, test and evaluate emerging technology from Joint Service Small Arms Program (JSSAP), Project 627, Program Element 0603607A, (Budget Activity 3), Defense Advanced Research Projects Agency (DARPA), Department of Energy National Laboratories, Research Development & Engineering Centers (RDECs) and other domestic and foreign sources for small arms weapon systems and technology. Small arm weapon systems include weapons ranging up to 40 millimeter in caliber. Current and future efforts focus on improvements designed to enhance lethality, target acquisition and tracking, fire control, usability, training effectiveness and reliability of weapons to include ammunition when developing and\/or evaluating standard and non-standard weapons. Focus areas include the maturing of technology through testing and evaluation of sub-system or system prototypes which demonstrates light weight materials, wear resistant\/protective\/anti-reflective coatings, observation\/situational awareness improvements, human-systems integration, robotic armament capability, non-lethal capability, and equipment enhancements.  Benefits include continuous improvements to small arms weapon systems, fire control equipment, optics, gun barrels, training devices, suppressors, component mounts, weapon mounts, and weapon\/ammunition interface. Includes costs associated with efforts for integration and interface of products on Soldiers' head, body and weapons."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "New Weapon Systems"
                                    },
                                    "Description": {
                                        "val": "Development of new small arms weapon systems"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.2"
                                            },
                                            "Text": {
                                                "val": "Next Generation Squad Automatic Rifle is renamed Next Generation Squad Weapon-Automatic Rifle (NGSW-AR): Supported development and staffing of the Next Generation Squad Weapon-Automatic Rifle Capability Development Document (CDD) and supporting documents. Developed Simplified Acquisition Management Plan (SAMP) and Security Classification Guide for the NGSW-AR. Awarded 6 Prototype Opportunity Notice (PON) Other Transaction Authority (OTA) contracts for NGSW-AR system demonstrators and ammunition.\n\nExternally Powered Mounted Machine Gun: FY 2018 funding reallocated to support the Army's modernization priorities in support of the National Defense Strategy.\n\nNew Weapons Evaluations and Assessments: Performed initial evaluation and assessment of new weapons."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.8"
                                            },
                                            "Text": {
                                                "val": "Next Generation Squad Automatic Rifle (NGSAR):  Transition of technologies from Program Element 0603827A, Project S54 to Program Element 0604601A, Project EW4. Coordinating and developing the Capability Development Document (CDD), Acquisition Strategy, Capability Production Document (CPD), and provide data from various technologies to better inform stakeholders. Beginning EMD phase for the Next Generation Squad Automatic Rifle.\n\nExternally Powered Mounted Machine Gun renamed to Externally Powered Weapon (EPW).  Continuing to support the development of the Capability Development Document (CDD) with Maneuver Center of Excellence and Maneuver Support Center of Excellence. Intent is to leverage information gathered from prototype testing and develop a demonstrator to better evaluate and inform the CDD and the various platforms that may include the EPW as their Armament System. \n\nNew Weapons Evaluations and Assessments:  Continuing to perform initial evaluation and assessment of new weapons."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.505"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.505"
                                            },
                                            "Text": {
                                                "val": "Externally Powered Weapon (EPW):  Will continue to support the development of the Capability Development Document (CDD) with Maneuver Center of Excellence and Maneuver Support Center of Excellence. Intend to leverage information gathered from prototype testing and develop a demonstrator to better evaluate and inform the CDD and the various platforms that may include the EPW as their Armament System. Will initiate the intelligence\/networking and weapons design and functions for a man-in-the-loop, small caliber defensive armaments system on an unmanned ground vehicle including the Warfighter\/Robot interface.\n\nNew Weapon Systems Evaluations and Assessments:  Will continue to perform initial evaluation and assessment of new weapon systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 Increase in funds required to reduce technology risk and to determine the appropriate set of technologies required to complete the Next Generation Squad Weapons technology development phase."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Arms Weapon Systems Enhancements"
                                    },
                                    "Description": {
                                        "val": "Enhancements and developments of small arms weapon systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.1"
                                            },
                                            "Text": {
                                                "val": "Recoil Reduction Mechanisms:  Continuing to assess and evaluate selected Recoil Reduction Mechanisms prototypes to be fabricated and tested for both individual and crew served weapons.\n\nArmaments for Robots:  Continuing to initiate the intelligence\/networking and weapons design and functions for a man-in-the-loop, small caliber defensive armaments system on an unmanned ground vehicle including the Warfighter\/Robot interface.\n\nIncreased Barrel Life\/Replace Chrome:  Continuing test and evaluation of prototype barrels delivered in FY 2017 to pursue barrel and liner designs that can withstand higher pressures per the Small Arms Ammunition Configuration Study outputs.  Further investigate and mature additive manufacturing and cold spray methodology for barrels.\n\nNon-Standard Weapons Assessments:  Continuing to conduct baseline testing of commercial weapon systems and perform capability analysis of unique weapon characteristics.   Continuing to utilize test information to conduct trade off assessments of Non-Developmental Item solutions for pending requirements as well as establish safety parameters for the training mission of Regionally Aligned Forces and establish a sustainment strategy for long term support of weapons procured to support the Regionally Aligned Forces training mission.  Continuing to conduct market research of commercially available weapon systems.\n\nSmall Business Innovative Research Enhancements:  Continuing to focus on improvements designed to enhance lethality, target acquisition and tracking, fire control, training effectiveness and reliability of weapons.\n\nProtective Weapons Coatings: (includes Adaptive Lubricious Coatings):    Continuing to develop manufacturing technology to support production of super hydrophobic and other coatings in support of Small Arms Weapons. Assessing and evaluating current manufacturing process studies and assessments to adapt the coating technology into weapon Original Equipment Manufacturer manufacturing processes.\n\nWeapon Upgrades and Accessories:  Continuing to test, evaluate and analyze ongoing and new activities to enhance small arms weapons."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.65"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.65"
                                            },
                                            "Text": {
                                                "val": "FY2020 New Start: Current and Legacy Weapon Improvements:  Will assess and evaluate selected capabilities and improvements for all current and legacy weapon systems.\n\nFY2020 New Start: Solid State Active Denial System:  Will work to complete maturation of design, continue to monitor status of Capability Development Document and provide input into programmatic documents as necessary.\n\nFY2020 New Start: Individual Non-Lethal System:  Will work to complete maturation of design and get it ready for prove out test at Government facility in support of Milestone B.  Previously funded in FY 2017.\n\nFY2020 New Start: Non-Standard Weapons Assessments:  Will continue to conduct baseline testing of commercial weapon systems and perform capability analysis of unique weapon characteristics. Continue to utilize test information to conduct trade off assessments of Non-Developmental Item solutions for pending requirements as well as establish safety parameters for the training mission of Regionally Aligned Forces and establish a sustainment strategy for long term support of weapons procured to support the Regionally Aligned Forces training mission. Continues to conduct market research of commercially available weapon systems.  Previously funded in FY 2017.\n\nSmall Business Innovative Research Enhancements:  Will continue future efforts continues to focus on improvements designed to enhance lethality, target acquisition and tracking, fire control, training effectiveness and reliability of weapons."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 Increase in funds required to reduce technology risk and to determine the appropriate set of technologies required to complete the Next Generation Squad Weapons technology development phase."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ammunition"
                                    },
                                    "Description": {
                                        "val": "Small arms ammunition improvement."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.1"
                                            },
                                            "Text": {
                                                "val": "Ammunition Upgrades:  Continuing to evaluate the effect of new ammunition on small arms weapons."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.1"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.1"
                                            },
                                            "Text": {
                                                "val": "Ammunition Upgrades:  Will continue to evaluate the effect of new ammunition on small arms weapon systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Optics"
                                    },
                                    "Description": {
                                        "val": "Improvement of small arms combat optics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.508"
                                            },
                                            "Text": {
                                                "val": "Optics Upgrades: Evaluated state of the art advances in optical component technologies for inclusion in future products, including Mounted Machinegun Optic Capability Production Document, Fire Control Capability Development Document, and its associated annexes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.1"
                                            },
                                            "Text": {
                                                "val": "Optics Upgrades:  Continuing to evaluate state of the art advances in optical component technologies for inclusion in future products, including Mounted Machinegun Optic Capability Production Document, Fire Control Capability Development Document, and its associated annexes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.1"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.1"
                                            },
                                            "Text": {
                                                "val": "FY2020 New Start: Next Generation Optics:  Will integrate current and emerging target acquisition component technologies into a variable magnification spotting scope and into binoculars."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fire Control"
                                    },
                                    "Description": {
                                        "val": "Small arms fire control."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.124"
                                            },
                                            "Text": {
                                                "val": "Next Generation Spotting Scope: Funding reallocated to support the Army's modernization priorities in support of the National Defense Strategy.\n\nNext Generation Binocular: Funding reallocated to support the Army's modernization priorities in support of the National Defense Strategy.\n\nSniper Missed Distance Corrective Offset: Funding reallocated to support the Army's modernization priorities in support of the National Defense Strategy.\n\nSmall Arms Fire Control - Crew Program of Record: Supported requirement development and staffing (CDD).  Initiated purchase description and laser filter unit specification development.  Began Other Transaction Authority (OTA) contract package development.  Executed optical architecture study to determine the best placement for unity power optics on dismounted crew served weapons.\n\nSmall Arms Fire Control - Squad Program of Record: Conducted prototyping activities to advance fire control technologies on carbine and rifle weapon platforms. Addresses Size, Weight, and Power trade space challenges associated with fire control on the individual squad weapons.\n\nSmall Arms Fire Control - Crew Enhancements: Funding reallocated to support the Army's modernization priorities in support of the National Defense Strategy.\n\nSmall Arms Fire Control - Precision Enhancements: Funding reallocated to support the Army's modernization priorities in support of the National Defense Strategy.\n\nFire Control Upgrades: Initiates testing of advanced fire control systems for small arms platforms to define the acquisition strategy in support of the Capability Development Document consisting of individual weapons, sniper\/precision, crew served weapons, low and high velocity 40mm."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.095"
                                            },
                                            "Text": {
                                                "val": "FY 2019 New start:  Next Generation Fire Control (Crew Served and Squad) Technology Enhancements:  Continuing support and oversight for exploring future fire control applications for Next Generation Squad Weapons objective requirements, Small Business innovation Research, and digital enhancements. Future applications specifically address aim augmentation, target tracking and handoff, automatic target detection\/identification\/recognition, integrated day\/night capability, integrated wind sensor, secure wireless transmission, environmental sensing, and optical enhancements.\n\nNext Generation Spotting Scope:  Continuing to consolidate readily available and mature fire-control\/target acquisition component technologies into a variable magnification spotting scope.\n\nNext Generation Binocular:  Continuing to assess and evaluate incorporating existing target acquisition\/fire control component technologies into binoculars.\n\nSniper Missed Distance Corrective Offset:  Continuing to assess and evaluate from a sniper team (shooter's) location, tracks sniper's bullet trace to target to derive a missed distance correct offset for a follow-on shot.\n\nNext Generation Fire Control:  Continuing to conduct prototyping activities to advance fire control technologies on carbine and rifle weapon platforms. Will address Size, Weight, and Power trade space challenges associated with fire control on the individual squad weapons.  Transitioning to Program Element 0604601A Project FF2 Small Arms Fire Control.\n\nSmall Arms Fire Control-Precision\/Enhancements:  Continuing to support and explore future precision fire control enhancements which includes: target detection to improve battlefield reconnaissance and intelligence gathering capabilities, improve target acquisitions at extended ranges in all battlefield conditions, improve anti-reflection (AR) coating  to minimize scope glints, and counter optical augmentation that can disclose soldiers? location, target tracking, down range wind sensing technology, bullet tracking, weapon bore sensor, automated muzzle velocity tracker to improve fire control accuracy, far-target location, battlefield networking, and augmented reality. To provide support to Small Business Innovative Research efforts that will explore the feasibility, scientific merit, research and development, and commercialization of future Precision fire control system.\n\nFire Control Upgrades:  Continuing to test advanced fire control systems for small arms platforms to define the acquisition strategy in support of the Capability Development Document consisting of individual weapons, sniper\/precision, crew served weapons, low and high velocity 40mm."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4"
                                            },
                                            "Text": {
                                                "val": "Next Generation Fire Control Technology Enhancements:  Will continue to support technology integration with Next Generation Squad Weapons, and specifically address decrease soldier aim error, decrease engagement time and increase probability of hit.  Prototype demonstrations will have application in individual and crew served weapons to enhance and upgrade Fire Control."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 Increase in funds required to reduce technology risk and to determine the appropriate set of technologies required to complete the Next Generation Squad Weapons technology development phase."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Research and Analysis"
                                    },
                                    "Description": {
                                        "val": "Research and analysis of small arms."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.2"
                                            },
                                            "Text": {
                                                "val": "Continuing to initiate Market Research and Benefit Analysis of 360 degree situational awareness, active stabilization, advanced kinetic weapons, low flying drone engagement, and other small arms research."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.2"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.2"
                                            },
                                            "Text": {
                                                "val": "Will continue to initiate Market Research and Benefit Analysis of 360 degree situational awareness, active stabilization, advanced kinetic weapons, low flying drone engagement, and other small arms research."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.282"
                                            },
                                            "Text": {
                                                "val": "FY2019 SIBR\/STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2019 SIBR\/STTR"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "EW4"
                                    },
                                    "Title": {
                                        "val": "Crew Served Weapons Engineering Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "12.999"
                                        },
                                        "CurrentYear": {
                                            "val": "11.102"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.589"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.589"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "15.767"
                                        },
                                        "BudgetYearThree": {
                                            "val": "14.789"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.927"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.029"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "80.202"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "FF2"
                                    },
                                    "Title": {
                                        "val": "Small Arms Fire Control"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "17.914"
                                        },
                                        "CurrentYear": {
                                            "val": "10.188"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.463"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.463"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.163"
                                        },
                                        "BudgetYearThree": {
                                            "val": "11.254"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8"
                                        },
                                        "BudgetYearFive": {
                                            "val": "10"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "88.982"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "FI2"
                                    },
                                    "Title": {
                                        "val": "Lightweight 30mm Cannon"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.28"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.384"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.384"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "9.664"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "FM4"
                                    },
                                    "Title": {
                                        "val": "Next Generation Squad Weapons"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "33.08"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "33.08"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "36.88"
                                        },
                                        "BudgetYearThree": {
                                            "val": "13.78"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.47"
                                        },
                                        "BudgetYearFive": {
                                            "val": "16.06"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "115.270"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "S63"
                                    },
                                    "Title": {
                                        "val": "Individual Weapons Engineering Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.664"
                                        },
                                        "CurrentYear": {
                                            "val": "5.749"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.076"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.076"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "15.377"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.918"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.284"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.974"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "53.042"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "FL4"
                                    },
                                    "Title": {
                                        "val": "Small Caliber Ammo for Next Gen Squad Weapons"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "22.88"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "22.88"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "30.63"
                                        },
                                        "BudgetYearThree": {
                                            "val": "28.75"
                                        },
                                        "BudgetYearFour": {
                                            "val": "25"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11.75"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "119.010"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "627"
                                    },
                                    "Title": {
                                        "val": "Jt Svc Sa Prog (JSSAP)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.628"
                                        },
                                        "CurrentYear": {
                                            "val": "5.879"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "11.507"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "In support of Small Arms Initial Capability and Capability Development Requirements, advanced technology of small arms weapon systems is transitioned from Joint Service Small Arms Program (JSSAP), Project 627, Program Element 0603607A, (Budget Activity 3) to Small Arms Improvement, Project S54, Program Element 0603827A, (Budget Activity 4).  After the technology is demonstrated and\/or validated, the program transitions to Infantry Support Weapons, Program Element 0604601A, (Budget Activity 5) for engineering and manufacturing development."
                        },
                        "AcquisitionStrategy": {
                            "val": "Primary strategy is to study, develop, demonstrate and evaluate emerging technologies that ultimately lead to enhancing\/improving the small arms inventory."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM Soldier Weapons,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.838"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.066"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.57"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.59"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.59"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY2019 SBIR \/ STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "FFRDC"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Budget Office"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pentagon, Washington DC"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.282"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Hardware Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Research Development Engineering Centers,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.375"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "22.348"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.68"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.755"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.755"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Research Development Engineering Centers,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "24.78"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.271"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.45"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.24"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.24"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Developmental Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Test and Evaluation Centers,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "13.861"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.147"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.695"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.97"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.97"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190306_0_444560_S54.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "20190306_1_444560_S54.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "NEW WEAPON SYSTEMS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Next Generation Squad Weapon-Automatic Rifle"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Next Generation Squad Weapon-Rifle"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Externally Powered Weapon (EPW)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "New Weapon Systems Evaluations and Assessments"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMALL ARMS WEAPON SYSTEMS ENHANCEMENTS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Solid State Active Denial System"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Current and Legacy Weapon Improvements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Individual Non-Lethal System"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Non-Standard Weapon Assessments"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Small Business Innovative Research"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Protective Weapons Coatings (includes Adaptive Lubricious Coatings)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Weapons Upgrades and Accessories"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AMMUNITION"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Ammunition Upgrades"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "COMBAT OPTICS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Next Generation Optics"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Optics Upgrades"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FIRE CONTROL"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Next Generation Fire Control Technology Enhancements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Next Generation Fire Control"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Small Arms Fire Control Precision\/Enhancements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Small Arms Fire Control Upgrades"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RESEARCH AND ANALYSIS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Research and Analysis of Small Arms"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VS4"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Protective Equipment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "29.934"
                        },
                        "CurrentYear": {
                            "val": "21.126"
                        },
                        "BudgetYearOne": {
                            "val": "2.836"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.836"
                        },
                        "BudgetYearTwo": {
                            "val": "4.444"
                        },
                        "BudgetYearThree": {
                            "val": "4.909"
                        },
                        "BudgetYearFour": {
                            "val": "6.488"
                        },
                        "BudgetYearFive": {
                            "val": "8.15"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This program supports the Cross Functional Team (CFT)."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project supports efforts to evaluate integrated technologies and representative or prototype systems that help expedite Personal Protective Equipment (PPE) technology transition from the laboratory to operational use."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier Protective Equipment (SPE)"
                                    },
                                    "Description": {
                                        "val": "Effort to increase Warfighter lethality and mobility by optimizing Soldier protection while effectively managing all life cycle aspects of Personal Protective Equipment (PPE)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.934"
                                            },
                                            "Text": {
                                                "val": "Initiated Technology\/Maturation and Risk Reduction efforts across the Personal Protection Equipment (PPE) portfolio (extremities, torso and vital torso, head, eye and face protection) to support Soldier Protection System (SPS) requirements for lighter weight ballistic materials with improved performance and manufacturing\/testing process improvements. If ready, initiated proof-of-principle demonstrations on promising new materials, technologies and or appliqu? in simulated and instrumented field exercises to evaluate SPS upgrades and inform stakeholders of new operational capabilities to enhance SPS. Continued efforts to characterize and increase durability and functional service life of existing personal protective systems at the subsystem\/component level. Continued to develop the methodology for PPE shelf and service life, and to advance the novel modeling method for PPE performance. Continued the development of improved projectile yaw and velocity measurement for existing systems and emerging requirements including evaluation of subsystem technologies to counter Explosive Ordnance Disposal (EOD) threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.828"
                                            },
                                            "Text": {
                                                "val": "Will continue Technology\/Maturation and Risk Reduction efforts across the PPE portfolio to support the Soldier Protection System (SPS) requirements for lighter-weight ballistic materials with improved performance and manufacturing\/testing process improvements. If ready, initiate proof-of-principle demonstrations on promising new and advanced materials, and in simulated and instrumented field exercises, evaluate upgrades and inform stakeholders of new operational capabilities. Continue efforts to characterize and increase durability, shelf life, and functional service life of existing personal protective systems at the subsystem\/component level. Continue the development of improved measurement processes for existing systems and emerging requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.836"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.836"
                                            },
                                            "Text": {
                                                "val": "Project, at a reduced level of effort from FY19, will continue Technology\/Maturation and Risk Reduction efforts across the PPE portfolio: Torso and Extremity Protection (TEP); Vital Torso Protection (VTP); Integrated Head Protection System (IHPS); and Transition Combat Eye Protection (TCEP) to support SPS requirements for lighter-weight ballistic materials with improved performance and manufacturing\/ testing process improvements. If new materials are ready, the Product Management Office will evaluate upgrades and inform stakeholders of new operational capabilities and then incorporate them into SPS designs as appropriate. Continue efforts to characterize and increase durability, shelf life, and functional service life of existing personal protective systems at the subsystem\/component level. Continue the development of improved measurement processes for existing systems and emerging requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change in Soldier Protective Equipment portfolio is due to anticipated requirement changes in FY19 and FY20 that result in a reduced level of effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR\/STTR TRANSFER"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR\/STTR TRANSFER"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.298"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR\/STTR TRANSFER"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR\/STTR TRANSFER"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "VS5"
                                    },
                                    "Title": {
                                        "val": "Soldier Protective Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.725"
                                        },
                                        "CurrentYear": {
                                            "val": "6.05"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.627"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.627"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.327"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.666"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.49"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.507"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "50.392"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Programs pursue technology maturation and prototype development, culminating in the transition of mature technologies (Technology Readiness Levels (TRL) 6-7) to Engineering and Manufacturing Development. This Project continues to exercise competitively awarded contracts using best value source selection procedures where applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM SPIE Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.35"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.862"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.934"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.4"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.4"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Dev\/Sys Engineering Spt"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.059"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.443"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.4"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.75"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.75"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dev\/Integ Contracts"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "33.363"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "26.805"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "18.219"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2019 SBIR \/ STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.298"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.298"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Misc Support Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.925"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.832"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.662"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.2"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.2"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Ballistic\/Blast\/Nonballistic Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "16.79"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.992"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.613"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.486"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.486"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190306_0_444560_VS4.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "SPS Technology Upgrade Insertion"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TCEP Authorized Protective Eyewear (APEL) Update"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "VTP LRIP Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "VTP RFP Submission"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "VTP FRP Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "VTP Technology Upgrade Insertion"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TEP Technology Upgrade Insertion"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Helmet Technology Upgrade Insertion"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "VTP SSEB"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Next Gen IHPS Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Next Gen IHPS Deliveries"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}