{
    "id": "2020-AirForce-PB-3600-MJBOOK-3-0-dae65ec315c4e8a6016da9aad32868ad9d723aca22c2ec6866c6d33ef17d1a4a-27",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-AIRFORCE_V2-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0305207F"
        },
        "ProgramElementTitle": {
            "val": "Manned Reconnaissance Systems"
        },
        "R1LineNumber": {
            "val": "256"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "14.297"
            },
            "CurrentYear": {
                "val": "14.223"
            },
            "BudgetYearOne": {
                "val": "11.787"
            },
            "BudgetYearOneBase": {
                "val": "11.787"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "14.738"
            },
            "BudgetYearThree": {
                "val": "15.044"
            },
            "BudgetYearFour": {
                "val": "15.319"
            },
            "BudgetYearFive": {
                "val": "15.595"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "14.269"
                },
                "CurrentYear": {
                    "val": "14.223"
                },
                "BudgetYearOne": {
                    "val": "14.487"
                },
                "BudgetYearOneBase": {
                    "val": "14.487"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "14.297"
                },
                "CurrentYear": {
                    "val": "14.223"
                },
                "BudgetYearOne": {
                    "val": "11.787"
                },
                "BudgetYearOneBase": {
                    "val": "11.787"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.028"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-2.700"
                },
                "BudgetYearOneBase": {
                    "val": "-2.700"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.028"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.700"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.700"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "There is a $2.7M FY20 reduction being used for other Air Force priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "674754"
                    },
                    "ProjectTitle": {
                        "val": "RC-135 Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.297"
                        },
                        "CurrentYear": {
                            "val": "14.223"
                        },
                        "BudgetYearOne": {
                            "val": "11.787"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.787"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "14.738"
                        },
                        "BudgetYearThree": {
                            "val": "15.044"
                        },
                        "BudgetYearFour": {
                            "val": "15.319"
                        },
                        "BudgetYearFive": {
                            "val": "15.595"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The RC-135 operational systems development and enhancement activities support the design studies, engineering analysis, non-recurring engineering, and other efforts associated with the integration and modification of the RC-135 programs and their specialized mission systems, both air and ground.  Associated ground systems include RIVET JOINT Mission Trainers (RJMT, a.k.a. mission crew simulators), Ground Data Processing Systems (GDPS), Distributed Mission Shelters (DMS), Mission Crew Training Systems (MCTS), Airborne Capabilities Extension System (ACES), and the Operational Flight Trainers (OFT, a.k.a. flight deck simulators).  Extensive utilization of Commercial-Off-The-Shelf (COTS) based solutions allows rapid fielding of needed capabilities through upgrades and supports Diminishing Manufacturing Sources (DMS)\/Vanishing Vendor Items (VVI) logistics mitigation efforts.  The results of these efforts provide for preliminary assessments of technical feasibility, operability, or military utility as well as specific engineering implementations for integration into the various systems baseline configurations.  \n\nThese activities are managed by the Air Force through the 645th Aeronautical Systems Group (645 AESG).  The 645 AESG (a.k.a. BIG SAFARI Systems Program Office or SPO) manages engineering, ground and support systems modifications, integration, flight testing, product assurance, acceptance testing, logistics, and training activities.  \n\nAircraft, sensor systems, and associated ground support system engineering planned for FY 2020 budget includes developmental planning, execution and support for the RC-135V\/W RIVET JOINT Baselines 12 and 13 (BL-12 and BL-13), the RC-135U COMBAT SENT Baselines 5 and 6 (BL-5 and BL-6), and the RC-135S COBRA BALL BL-5 and BL-6 configurations.  The world-wide challenge of keeping pace against technologically agile targets used by both nation and non-nation-state adversaries and the rapid evolution of COTS technologies demands a responsive and adaptive acquisition strategy for fielding incremental spiral upgrades and baseline capabilities that are logistically supportable at all locations.  The 645 AESG uses an incremental baseline strategy to mitigate risk, find affordable solutions and field needed capabilities on the aircraft and associated ground support and training systems.  Obsolescence and DMS\/VVI logistical concerns are addressed with each baseline upgrade strategy and assessed annually as part of the fleet sustainment responsibilities.  \n\nRIVET JOINT BL-12 upgrades consist of, but are not limited to, increased digital signal exploitation, increased digital signal recorder bandwidth, enhanced spatial processing\/exploitation, enhanced weather radar, digitally enhanced electronic flight instrument system (EFIS), continued Communications, Navigation, Surveillance\/Air Traffic Management (CNS\/ATM) compliant cockpit avionics enhancements, Air Force Distributed Common Ground System (AF-DCGS) interoperability, operator work station 3-D map projection, enhanced operator reporting management tools, modernized communications security (COMSEC) protocols, and a new steerable beam antenna.  RIVET JOINT BL-13 upgrades consist of, but are not limited to, providing a continuous recording capability, Super Wideband Compressive Receiver (SWCR) and Nyquist Folding Receiver (NYFR), CNS\/ATM avionics upgrades such as new autopilot, automated data system-broadcast (ADS-B) and Mode 5 identify friendly or foe (IFF) systems, and family of beyond-line-of-sight terminals (FAB-T) advanced extremely high frequency (AEHF) communications suite. \n\nCOMBAT SENT BL-5 upgrades consist of, but are not limited to, active ranging and theater networked geo-location (TNG) capability, cooling duct and lighting improvements, RJ Baseline 11\/12 (BL-11\/12) communications intelligence (COMINT), upgraded computer architecture, wideband global satellite (WGS) communications enhanced integration, development of an airborne tracking system, communications upgrade to include Multifunctional Information Distribution System Joint Tactical Radio System (MIDS-J), and continued CNS\/ATM compliant cockpit avionics enhancements.  COMBAT SENT BL-6 developmental enhancements consist of, but are not limited to, steerable beams for the COMINT sub-system, improved SWCR capability and specific emitter identification (SEI) electronic intelligence (ELINT) sub-system, Primary Sensor Measurement System (PRISMS) merge with manual precision collections, millimeter wave and low band capabilities with PRISMS, digitizing antennas, direction finding of High Frequency signals and expanded streaming audio services and 360 degree aircraft tracking system. BL-6 RDT&E is funded via PE 0305206G.\n\nCOBRA BALL BL-5 upgrades consist of, but are not limited to, RJ BL-11\/12 COMINT, WGS communications enhanced integration, communications upgrades to include MIDS-J and an intercom system (FORCE), and continued CNS\/ATM compliant cockpit avionics enhancements.  COBRA BALL BL-6 developmental enhancements consist of, but are not limited to, high gain S-Band antenna, large format Sapphire windows, RJ BL-13 COMINT capability, foreign instrumentation signals intelligence (FISINT) analog to digital receiver, and Brave version of the digital cockpit avionics systems to continue CNS\/ATM compliance initiatives. BL-6 RDT&E is funded via PE 0301314F. \n\nGround Systems Baseline upgrades add the capabilities found in the corresponding RIVET JOINT Baseline upgrades (i.e., RIVET JOINT BL-11 corresponds to Ground System BL-11, RIVET JOINT BL-12 corresponds to Ground System BL-12, RIVET JOINT BL-13 corresponds to Ground System BL-13) to the Ground Systems to ensure crews receive training on the appropriate mission system configurations.\n\nActivities also include studies and analysis to support both current program planning and execution and future program planning.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver RC-135 capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, 0605898F, and 0605833F.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Manned Reconnaissance Systems"
                                    },
                                    "Description": {
                                        "val": "Non-recurring engineering (NRE) for Baseline system developments and enhancements to improve mission capabilities of the RIVET JOINT BL-12 and BL-13, COMBAT SENT BL-5 and BL-6, COBRA BALL BL-5 and BL-6, and Ground Systems BL-11 and BL-12"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.297"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.223"
                                            },
                                            "Text": {
                                                "val": "• Continue Engineering Analysis \n• Continue NRE and other efforts associated with the integration and modification of the RC-135 primary mission equipment\n• Continue Specialized Mission Systems development for the collection of both air and ground signals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.787"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.787"
                                            },
                                            "Text": {
                                                "val": "Will initiate contracts to:\n• Continue Engineering Analysis \n• Continue NRE and other efforts associated with the integration and modification of the RC-135 primary mission equipment\n• Continue Specialized Mission Systems development for the collection of both air and ground signals."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is a $2.7M FY20 reduction being used for other Air Force priorities."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF 05 Line Item DARP01"
                                    },
                                    "Title": {
                                        "val": "RC-135"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "204.559"
                                        },
                                        "CurrentYear": {
                                            "val": "394.532"
                                        },
                                        "BudgetYearOne": {
                                            "val": "227.673"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "227.673"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "205.440"
                                        },
                                        "BudgetYearThree": {
                                            "val": "203.642"
                                        },
                                        "BudgetYearFour": {
                                            "val": "205.519"
                                        },
                                        "BudgetYearFive": {
                                            "val": "86.108"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 06 Line Item DARP01"
                                    },
                                    "Title": {
                                        "val": "Initial Spares\/Repair Parts"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "45.831"
                                        },
                                        "CurrentYear": {
                                            "val": "49.520"
                                        },
                                        "BudgetYearOne": {
                                            "val": "50.448"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "50.448"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "51.352"
                                        },
                                        "BudgetYearThree": {
                                            "val": "52.380"
                                        },
                                        "BudgetYearFour": {
                                            "val": "53.332"
                                        },
                                        "BudgetYearFive": {
                                            "val": "24.730"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 07 Line Item DARP01"
                                    },
                                    "Title": {
                                        "val": "Aircraft Support Equipment & Facilities"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "29.700"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPAF 04 Line Item 846070"
                                    },
                                    "Title": {
                                        "val": "DARP RC-135"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "26.685"
                                        },
                                        "CurrentYear": {
                                            "val": "26.262"
                                        },
                                        "BudgetYearOne": {
                                            "val": "26.716"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "26.716"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "27.204"
                                        },
                                        "BudgetYearThree": {
                                            "val": "27.685"
                                        },
                                        "BudgetYearFour": {
                                            "val": "28.178"
                                        },
                                        "BudgetYearFive": {
                                            "val": "28.685"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE 07 PE 0304260F"
                                    },
                                    "Title": {
                                        "val": "Airborne SIGINT Enterprise"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "59.706"
                                        },
                                        "CurrentYear": {
                                            "val": "50.577"
                                        },
                                        "BudgetYearOne": {
                                            "val": "33.396"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "33.396"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "42.195"
                                        },
                                        "BudgetYearThree": {
                                            "val": "43.071"
                                        },
                                        "BudgetYearFour": {
                                            "val": "43.856"
                                        },
                                        "BudgetYearFive": {
                                            "val": "44.646"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The RC-135 RIVET JOINT, COBRA BALL, and COMBAT SENT configured aircraft are maintained and kept technologically relevant through a baseline or incremental upgrade acquisition strategy.  Technology upgrades and Quick Reaction Capability (QRC) developments are acquired through the 645 AESG in accordance with the BIG SAFARI Program Management Directive (PMD) and Class Justification and Approval (J&A) document for acquisition of supplies and services using an \"other than full and open competition\" criteria.  The supplies and services procured by 645 AESG satisfy National Security requirements (FAR 6.302-6) through the use of their standing J&A or address Unusual and Compelling Urgency requirements (FAR 6.302-2) through an individually prepared J&A supported by the BIG SAFARI Life Cycle Management Plan (LCMP) across the full spectrum of system life cycle management from developmental engineering to system retirement (\"cradle to grave\") support.  Due to the ever changing threat and rapidly evolving electromagnetic combat environment encountered during our prolonged commitment to Overseas Contingency Operations (OCO), the acquisition program manager has the authority to redirect funding as necessary to meet current stated and emerging Combatant Command (CCMD) and\/or Intelligence Community (IC) requirements to better meet the war fighting objectives."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "All activity is based around the Programmed Depot Maintenance (PDM) airframe and missions systems schedule which includes multiple contracts and organizations with overlapping and continuous periods of performance.  Due to the rapidly changing threat environment encountered during our prolonged commitment to Overseas Contingency Operations (OCO), the acquisition program manager has the authority to redirect funding as necessary to meet current stated and emerging Combatant Command (CCMD) and\/or Intelligence Community (IC) requirements."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Operational Systems Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "L-3 Technologies"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Greenville, TX"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "14.297"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "14.223"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "11.787"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "11.787"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Baseline Spiral Development"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "RIVET JOINT Baseline 12 Integration, Test and Fielding"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "RIVET JOINT Baseline 13 Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "RIVET JOINT Baseline 13 Integration, Test and Fielding"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "RIVET JOINT Baseline 14 Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "RIVET JOINT Baseline 14 Integration, Test and Fielding"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "COMBAT SENT Baseline 5 Integration, Test and Fielding"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "COMBAT SENT Baseline 6 Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "COMBAT SENT Baseline 6 Integration, Test and Fielding"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "COBRA BALL Baseline 5 Integration, Test and Fielding"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "COBRA BALL Baseline 6 Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "COBRA BALL Baseline 6 Integration, Test and Fielding"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Ground Systems Baseline 11 Integration, Test and Fielding"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Ground Systems Baseline 12 Integration, Test and Fielding"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Ground Systems Baseline 13 Development, Integration, Test and Fielding"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Ground Systems Baseline 14 Development, Integration, Test and Fielding"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "Ground systems include the RIVET JOINT Mission Trainers (RJMT), Mission Crew Training Systems (MCTS), Ground Data Processing System (GDPS), Modular Processing System (MPS), Airborne Capabilities Extension Systems (ACES) and Operational Flight Trainers (OFT).  Baseline upgrades are determined by the aircraft programmed depot maintenance schedule.  Hardware, firmware or software enhancements to the ground systems are set up to match the aircraft baseline upgrades.  Typically, baseline configuration changes and enhancements are incorporated first into the RJMTs and OFTs, and then integrated into GDPS, MCTS, MPS, and ACES.  Delivery of the enhancements to the RJMTs and OFTs are planned to arrive concurrently, if not slightly prior, to the delivery of the first aircraft with an upgraded cockpit or mission system in a given baseline configuration to allow for aircrew and ground personnel training and qualification."
                        }
                    }
                }
            ]
        }
    }
}