{
    "id": "2020-Navy-PB-1319-MJBOOK-0-0-a56c7a9b227f9c34d6c2010c1b75789785589abe64a46931357add0057a031c6-19",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603651M"
        },
        "ProgramElementTitle": {
            "val": "JT Non-Lethal Wpns Tech Dev"
        },
        "R1LineNumber": {
            "val": "20"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "13.090"
            },
            "CurrentYear": {
                "val": "13.313"
            },
            "BudgetYearOne": {
                "val": "13.307"
            },
            "BudgetYearOneBase": {
                "val": "13.307"
            },
            "BudgetYearTwo": {
                "val": "13.301"
            },
            "BudgetYearThree": {
                "val": "13.564"
            },
            "BudgetYearFour": {
                "val": "13.840"
            },
            "BudgetYearFive": {
                "val": "14.116"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The DoD Non-Lethal Weapons Program was established by the FY96 National Defense Authorization Act. The Office of the Secretary of Defense designated the Commandant of the\nMarine Corps (CMC) as the DoD NLW Executive Agent (EA). The EA exercises centralized responsibility for joint research and development of non-lethal weapons and technology through the Joint Non-Lethal Weapons Program (JNLWP). The Office of the Under Secretary of Defense for Acquisition and Sustainment (A&S) serves as the OSD Principal Staff Assistant and oversees, in consultation with the Under Secretary of Defense for Policy, the DoD NLW Executive Agent.\n\nThe efforts described in this Program Element (PE) reflect science and technology (S&T) investment decisions by the Joint Non-Lethal Weapons (NLW) Integrated Product\nTeam, a multi-service flag level corporate board that provides executive oversight and management for the JNLWP for the CMC. This direction is based on the requirements and capabilities sought by the Services and the Coast Guard, as identified in the DoD's Non-Lethal Weapons Joint Capabilities Based Assessment Document. This coordinated joint S&T development approach addresses mutual capability gaps and assures the most relevant non-lethal technologies, capabilities and equipment are provided to the operating forces while eliminating duplicative service S&T investment. These advanced technology development initiatives feed non-lethal capabilities which directly support the National Defense Strategy (NDS) objective of strategic competition by providing options to the joint force in pursuit of national objectives in legal or policy constrained scenarios, as well as complementing the use of lethal effects in complex combat scenarios, for example, in urban environments with large civilian populations. Ongoing NLW studies, analyses and exercise efforts with NATO and Allies also support NDS objectives to strengthen alliances and partnerships. Resulting capabilities will facilitate a fully integrated non-lethal competency as a complement to lethal firepower, providing force application options for below lethal threshold engagements.\n\nThis program funds Advanced Technology Development of next-generation non-lethal capabilities and includes performing analysis, technology development efforts, and modeling and simulation necessary to ensure optimum weaponization and use of these capabilities. Investment areas include research and development of next-generation NLWs such as: non-lethal directed energy weapons (lasers, millimeter wave and high power microwave) for counter-personnel and counter-materiel missions; non-lethal counter-personnel technologies (acoustic, optical, and human electro-muscular disruption technologies), and advanced non-lethal materials (including materials for vehicle\/vessel stopping and counter-facility applications). Next generation non-lethal systems focus on long-range localized non-lethal effects to identified threat individuals (or groups of individuals) and\/or their threat weapons systems operating in complicated environments such as urban areas, crowds, buildings, vehicles, vessels, and also in close proximity to high-value civilian facilities.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "13.448"
                },
                "CurrentYear": {
                    "val": "13.313"
                },
                "BudgetYearOne": {
                    "val": "13.307"
                },
                "BudgetYearOneBase": {
                    "val": "13.307"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "13.090"
                },
                "CurrentYear": {
                    "val": "13.313"
                },
                "BudgetYearOne": {
                    "val": "13.307"
                },
                "BudgetYearOneBase": {
                    "val": "13.307"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.358"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.358"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3022"
                    },
                    "ProjectTitle": {
                        "val": "Joint Non Lethal Weapons"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "13.090"
                        },
                        "CurrentYear": {
                            "val": "13.313"
                        },
                        "BudgetYearOne": {
                            "val": "13.307"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.307"
                        },
                        "BudgetYearTwo": {
                            "val": "13.301"
                        },
                        "BudgetYearThree": {
                            "val": "13.564"
                        },
                        "BudgetYearFour": {
                            "val": "13.840"
                        },
                        "BudgetYearFive": {
                            "val": "14.116"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds the research and development of next-generation Non-Lethal Weapons and includes performing analysis, technical development efforts, and modeling and simulation necessary to ensure optimum weaponization and use of these NLWs.  Investment areas include research and development of next-generation Non-Lethal Weapons (NLW) such as: non-lethal directed energy weapons (lasers, millimeter wave and high power microwave) for counter-personnel and counter-materiel missions; non-lethal counter-personnel technologies (acoustic, optical, and human electro-muscular disruption technologies), and advanced non-lethal materiels (including materiels for vehicle\/vessel stopping and counter-facility applications). Next-generation Non-Lethal Weapon systems focus on long-range localized Non-Lethal effects to identified threat individuals (or groups of individuals) and\/or their threat weapons systems operating in complicated environments such as urban areas, crowds, buildings, vehicles, vessels, and also in close proximity to high-value civilian facilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JOINT NON-LETHAL WEAPONS"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.090"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assessed the general utility, effect, and effectiveness of technologies for incapacitating personnel, clearing facilities, stopping vehicles and vessels, and denying enemy access to protected areas. Developed prototypes and transitioned to higher levels of technology development of advanced payloads for candidate technological capabilities with applications relevant to emerging capability gaps. Transitioned to higher levels of technology development and demonstrated the most promising directed energy technologies under consideration for counter-personnel and counter-materiel applications. Non-lethal effects characterization through modeling and effects testing for joint advanced technology development using Human Effects Modeling Analysis Program.  Evaluated alternative non-lethal prototype technologies offering operational utility and transitioned best candidates to higher levels of technology development and acquisition. Continued advanced prototype development and demonstration of a smaller, lighter active denial technology demonstrator based on the most promising and mature 95 Gigahertz source technology.  Prototype development, demonstration and transition to higher levels of technology development of the most promising candidate technologies addressing the extended range\/duration incapacitation capability gap.  Modular prototyping of High Power Microwave (HPM) component hardware meeting development objectives for subsequent integration into an HPM-capable system configuration.  Developed technologies to deliver emerging novel counter-materiel and counter-personnel payloads to target while minimizing risk to the operator. Developed a laboratory\/benchtop High-Power Radio-Frequency  directed energy system to validate short pulse counter-materiel effects. Refined, integrated and demonstrated breadboard system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.313"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the development, integration, and demonstration of advanced technologies and payloads capable of addressing non-lethal counter-personnel and counter-materiel capability gaps while minimizing risk to the operator.  Development efforts include the prototyping of advanced payloads, delivery systems, alternative technologies, and high power microwave component hardware and modular systems for non-lethal vehicle and vessel stopping applications. Development and integration of advanced solid-sate and vacuum-tube based millimeter wave technologies for counter-personnel directed energy effects.  Continue to reduce weapon system size, weight, power consumption, thermal cooling requirements, and overall system cost to improve military utility.  Continue human effects modeling and analysis efforts to incorporate knowledge gained from applied research studies into a suite of programs and surrogates that enable assessment and prediction of injury risk and effectiveness for NLW stimuli. Transition prototype technologies offering operational utility to higher levels of technology development and acquisition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.307"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.307"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Advance the development, integration, and demonstration of advanced technologies and payloads capable of addressing non-lethal counter-personnel and counter-materiel capability gaps while minimizing risk to the operator.  Development efforts include the prototyping of: (1) a next-generation long range - long duration wireless Human Electro-Muscular Incapacitation munition; (2) short pulse source and other high power microwave waveforms that are effective against threat vehicle, vessel, and other target with embedded electronic systems; (3) longer range but more compact millimeter wave technologies capable of being integrated and tested on future escalation of force platforms; and (4) improved sound and light and non-lethal laser technologies.  This includes the development and integration of advanced solid-state and vacuum-tube based millimeter wave technologies for counter-personnel directed energy effects.  Continue human effects modeling and analysis efforts to incorporate risk of significant injury knowledge of specific next-generation NLWs currently under development and utilizing new non-lethal stimuli and phenomenologies.  Transition prototype technologies offering operational utility to higher levels of technology development and acquisition."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The primary objective of this Program Element is the development of technologies that lead to the next-generation of Non-Lethal Weapons which address identified and prioritized joint Non-Lethal Weapon capability gaps.  The program consists of a collection of projects for the development and evaluation of feasibility demonstration models.  Individual project metrics reflect the technical goals of each specific project.  Typical metrics include both the effectiveness of the technology, human effects and effectiveness, mitigation of high priority joint NLW capability gaps, and potential for compliance with policy and legislation.  Overarching considerations include the advancement of related Technology Readiness Levels and Human Effects Readiness Levels, the degree to which project investments are leveraged with other performers, reduction in life cycle cost upon application of the technology, and the identification of opportunities to transition technology to higher categories of development."
                        }
                    }
                }
            ]
        }
    }
}