{
    "id": "2020-Navy-PB-1319-MJBOOK-3-0-a56c7a9b227f9c34d6c2010c1b75789785589abe64a46931357add0057a031c6-23",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0902498N"
        },
        "ProgramElementTitle": {
            "val": "Management Headquarters (Departmental Spt Acts)"
        },
        "R1LineNumber": {
            "val": "197"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "1.749"
            },
            "CurrentYear": {
                "val": "1.579"
            },
            "BudgetYearOne": {
                "val": "1.460"
            },
            "BudgetYearOneBase": {
                "val": "1.460"
            },
            "BudgetYearTwo": {
                "val": "1.484"
            },
            "BudgetYearThree": {
                "val": "1.515"
            },
            "BudgetYearFour": {
                "val": "1.540"
            },
            "BudgetYearFive": {
                "val": "1.576"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) provides Commander, Operational Test and Evaluation Force (COMOPTEVFOR) general support funding and operating costs for Management Headquarter Activity (MHA) functions that support COMOPTEVFOR compliance with Secretary of Defense (SECDEF) and Secretary of the Navy (SECNAV) directives to conduct independent operational testing and evaluation as described in PE 0605865N Operational Test & Evaluation Capability."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "1.749"
                },
                "CurrentYear": {
                    "val": "1.579"
                },
                "BudgetYearOne": {
                    "val": "1.479"
                },
                "BudgetYearOneBase": {
                    "val": "1.479"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "1.749"
                },
                "CurrentYear": {
                    "val": "1.579"
                },
                "BudgetYearOne": {
                    "val": "1.460"
                },
                "BudgetYearOneBase": {
                    "val": "1.460"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.019"
                },
                "BudgetYearOneBase": {
                    "val": "-0.019"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.019"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.019"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Beginning in Fiscal Year 2018, Management Headquarter Activity (MHA) labor and operating costs in support of 14 Full Time Equivalents (FTEs) has been realigned from 0605865N Operational Test and Evaluation Capability into this program element 0902498N Management Headquarters (Departmental Support Accounts) to identify all MHA costs separately.  The funding decrease from FY 2019 to FY 2020 reflects a reduction in MHA support costs in accordance with the FY 2018 NDAA  Sec. 922 and 923 requirements for MHA reductions."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0831"
                    },
                    "ProjectTitle": {
                        "val": "OPTEVFOR Support"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.749"
                        },
                        "CurrentYear": {
                            "val": "1.579"
                        },
                        "BudgetYearOne": {
                            "val": "1.460"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.460"
                        },
                        "BudgetYearTwo": {
                            "val": "1.484"
                        },
                        "BudgetYearThree": {
                            "val": "1.515"
                        },
                        "BudgetYearFour": {
                            "val": "1.540"
                        },
                        "BudgetYearFive": {
                            "val": "1.576"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program element (PE) provides Commander, Operational Test and Evaluation Force (COMOPTEVFOR) general support funding and operating costs for Management Headquarter Activity (MHA) functions that support COMOPTEVFOR compliance with Secretary of Defense (SECDEF) and Secretary of the Navy (SECNAV) directives during the conduct independent operational testing and evaluation as described in PE 0605865N Operational Test & Evaluation Capability.  \n\nBeginning in Fiscal Year 2018, MHA labor and operating costs in support of 14 Full Time Equivalents (FTEs) has been realigned from 0605865N Operational Test and Evaluation Capability into this newly established program element 0902498N Management Headquarters (Departmental Support Accounts) as a result of SECDEF and SECNAV direction to identify all MHA costs separately."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "OPTEVFOR Support"
                                    },
                                    "Description": {
                                        "val": "Beginning in Fiscal Year 2018, MHA labor and operating costs in support of 14 FTE has been realigned from 0605865N Operational Test and Evaluation Capability into this program element 0902498N Management Headquarters (Departmental Support Accounts) to identify all MHA costs separately."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.749"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This project provided for the basic costs of the COMOPTEVFOR headquarters activities.  Specifically, it paid personnel salaries and support costs for civilian personnel who support COMOPTEVFOR compliance with directives during the conduct of independent operational testing and evaluation to determine the operational effectiveness, suitability, and cyber survivability of new and improved systems.\n\nMHA Functions supported more than 400 Programs and HQ support needs to include:\n \n\n-Financial Management Systems:  Fund execution was accomplished through the use of Standard Accounting Budgeting Reporting System(SABRS), Standard Accounting and Reporting system - Field Level (STARS-FL), Defense Travel System (DTS), Wide Area WorkFlow (WAWF), Electronic Business Suite (EB Suite), and Electronic Document Access (EDA) for current and prior year financial transactions.\n\n-Financial Management Analysis: The mission, functions, and tasks of the command were met through funds allocated from the following appropriations: RDT&E, OMN, APN, OPN, and DoD.  Funds were authorized, committed, obligated, and executed IAW Navy and DoD guidance.  In order to ensure fund integrity, transactions were monitored in accordance with FIAR and audit readiness requirements. \n\n-Budget Formulation, Justification, Presentation, Execution:  Supported current and future year requirements resulting in POM development, OPTAR management, and preparation of budget exhibits.\n\n-Management Internal Control Program:  Monitored the compliance of Navy Programs.\n\n-Facilities Management:  Coordinated the maintenance and repair of plant, property, and equipment and other base operating services."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.579"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This project will provide for the basic costs of the COMOPTEVFOR headquarters activities.  Specifically, it will pay for salaries and support costs of civilian personnel who support COMOPTEVFOR compliance with directives during the conduct of independent operational testing and evaluation to determine the operational effectiveness, suitability, and cyber survivability of new and improved systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.460"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.460"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This project will provide for the basic costs of the COMOPTEVFOR headquarters activities.  Specifically, it will pay for salaries and support costs of civilian personnel who support COMOPTEVFOR compliance with directives during the conduct of independent operational testing and evaluation to determine the operational effectiveness, suitability, and cyber survivability of new and improved systems."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2019 to FY 2020 reflects a reduction in MHA support costs in accordance with the FY 2018 NDAA Sec. 922 and 923 requirements for MHA reductions."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "As indicated in Section A above, funding is for general support and operating costs for Management Headquarter Activity (MHA) functions that support COMOPTEVFOR compliance with Secretary of Defense (SECDEF) and Secretary of the Navy (SECNAV) directives to conduct independent operational testing and evaluation as described in PE 0605865N Operational Test & Evaluation Capability.\n\nBeginning in Fiscal Year 2018, MHA labor and operating costs in support of 14 FTEs has been realigned from 0605865N Operational Test and Evaluation Capability into this newly established program element 0902498N Management Headquarters (Departmental Support Accounts) as a result of SECDEF and SECNAV direction to identify all MHA costs separately.\n\nMHA Functions support more than 400 Programs and HQ support needs to include:\n \n\n-Financial Management Systems:  Fund execution is accomplished through the use of Standard Accounting Budgeting Reporting System (SABRS), Standard Accounting and Reporting System - Field Level(STARS-FL), Defense Travel System (DTS), Wide Area WowrkFlow (WAWF), Electronic Business Suite (EB Suite), and Electronic Document Access (EDA) for current and prior year financial transactions.\n\n-Financial Management Analysis: The mission, functions, and tasks of the command are met through funds allocated from the following appropriations: RDT&E, OMN, APN, OPN, and DoD.  Funds are authorized, committed, obligated, and executed IAW Navy and DoD guidance.  In order to ensure fund integrity, transactions are monitored in accordance with FIAR and audit readiness requirements. \n\n-Budget Formulation, Justification, Presentation:  Supports current and future year requirements resulting in POM development, OPTAR management, and preparation of budget exhibits.\n\n-Acquisition\/Contracting:  Supports the acquisition of test and evaluation services and support requirements from various firm fixed price multiple award contracts.  Invoice payments are processed through the use of WAWF and Invoicing, Receipt, Acceptance and Property Transfer (iRAPT).\n\n-Management Internal Control Program:  Monitors the compliance of Navy Programs.\n\n-Facilities Management:  Coordinates the maintenance and repair of plant, property, and equipment and other base operating services."
                        }
                    }
                }
            ]
        }
    }
}