{
    "id": "2020-Army-PB-2040-JBOOK-bbfb861aa2459c788128b03572c321536da98358a56d59849bf889b375dfd80d-28",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603728A"
        },
        "ProgramElementTitle": {
            "val": "Environmental Quality Technology Demonstrations"
        },
        "R1LineNumber": {
            "val": "69"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "29.150"
            },
            "CurrentYear": {
                "val": "29.132"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "58.282"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) is being eliminated, with continuity of effort realigned to the following PEs:\n* PE 0603119A Ground Advanced Technology\n* PE 0603462A Next Generation Combat Vehicle Advanced Technology \n* PE 0603463A Network C3I Advanced Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE matures and demonstrates technologies that assist the Army to reduce or eliminate environmental impacts both in the United States and abroad, and provide science and technology solutions to Army environmental challenges as a force multiplier in mission planning, material acquisition and soldier preparedness. Project 002 demonstrates tools and methods for compliance with environmental laws relevant to conservation of natural and cultural resources while providing a flexible realistic training environment for mission activities. The Army also requires the ability to assess, establish, upgrade, and secure infrastructure while in theatre to enable deployed force operations. This project matures and demonstrates tools for robotic and autonomous agile infrastructure modification and custom designed construction for expeditionary structures on demand. Project 025 demonstrates pollution prevention tools and methods to minimize the Army's use and generation of toxic chemicals and hazardous wastes. Project 03E focuses on technologies for advanced life cycle analysis, advanced sensing, and technologies to empower rapid fielding of next generation energetics, propellants and munitions.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, the Army Modernization Strategy, and supports the Army Strategy for the Environment.\n\nFY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nThis PE is fully coordinated and complementary to PE 0602720A (Environmental Quality Technology).\n\nWork in this PE is performed by the Army Engineer Research and Development Center, Vicksburg, MS, and the Army Futures Command (AFC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "10.421"
                },
                "CurrentYear": {
                    "val": "9.136"
                },
                "BudgetYearOne": {
                    "val": "9.352"
                },
                "BudgetYearOneBase": {
                    "val": "9.352"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "29.15"
                },
                "CurrentYear": {
                    "val": "29.132"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "18.729"
                },
                "CurrentYear": {
                    "val": "19.996"
                },
                "BudgetYearOne": {
                    "val": "-9.352"
                },
                "BudgetYearOneBase": {
                    "val": "-9.352"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.005"
                    },
                    "CurrentYear": {
                        "val": "-0.004"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "19"
                    },
                    "CurrentYear": {
                        "val": "20"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.266"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-9.352"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-9.352"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018 congressional adds ($19.000 million) for autonomous transport innovation; depleted uranium cleanup; and rapid safe carbon nanotechnology research\nFY 2019 congressional adds ($20.000 million) for autonomous transport innovation; environmental sensors for explosives; rapid safe advanced carbon nanotechnology materials; and smart bases. \nFY 2020 reduction - PE eliminated due to Science and Technology (S&T) portfolio Financial Restructuring."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "002"
                    },
                    "ProjectTitle": {
                        "val": "Environmental Compliance Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.162"
                        },
                        "CurrentYear": {
                            "val": "2.352"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.514"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2020 this Project is being realigned to:\nProgram Element (PE) 0603462A Next Generation Combat Vehicle Advanced Technology, Project: \n* BK8 Robotics for Engineer Operations Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates technologies transitioned from PE 0602720A (Environmental Quality Technology), Projects 048 and 896, and PE 0602784 (Military Engineering), Projects T41 and T45. This Project assists Army installations and operations in achieving environmental compliance. Army facilities are subject to fines and facility shutdowns for violations of federal, state, and local environmental regulations. Efforts under this Project enable the Army to reduce environmental constraints at installations while complying with the myriad of federal, state, local, and host country environmental regulations and policy. In addition, this project matures capabilities to assess, establish, upgrade, and construct infrastructure to project power and enable deployed force operations. Current and planned efforts enable the Army to perform additive and advanced manufacturing for deployed force infrastructure, support robotic and autonomous engineering during combat operations, and ensure infrastructure resiliency. Technologies demonstrated aim to reduce the cost of resolving compliance issues for the Army, sustain the viability of testing and training ranges, protect critical resources, and expand capacity to perform construction and supporting tasks in high risk\/threat and dynamic environments.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, supports the Army Strategy for the Environment, and supports the Army Modernization Priority for Next Generation Combat Vehicle, Air Missile Defense and Network\/C3I.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project supports the Army Science and Technology Military Engineering and Environmental Technology, Simulation and Computing Portfolio. \n\nWork in this Project is performed by the Army Engineer Research and Development Center (ERDC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sustainable Ranges and Lands"
                                    },
                                    "Description": {
                                        "val": "This effort provides ecosystem vulnerability assessment and ecosystem analysis, monitoring, modeling, and mitigation technologies to support sustainable, unconstrained, realistic access and use of the Army's ranges and lands. This effort demonstrates environmentally safe and cost effective technologies to manage and reduce the increase in noise and pollution concerns associated with training ranges."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.065"
                                            },
                                            "Text": {
                                                "val": "Integrated and matured methodologies for high-resolution permafrost\/ground-ice mapping for improved risk characterization. Extended permafrost heat transfer models to account for near surface ground heterogeneity and provide a real-time feedback system for early warning of ground stability, including permafrost change development, for existing infrastructure."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Infrastructure for Combat Operations (Previous Titled: Adaptive & Resilient Installations)"
                                    },
                                    "Description": {
                                        "val": "The Army requires the ability to assess, establish, upgrade, and secure infrastructure while in theatre to enable deployed force operations. This effort matures and demonstrates tools for the assessment of physical and ecological impacts on operations, agile infrastructure modification, and custom designed construction for expeditionary structures on demand."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.097"
                                            },
                                            "Text": {
                                                "val": "Matured and validated representative hardware and software to assess the relative risk associated with autonomous construction activities, and the degree to which risk may be mitigated through the employment of innovative robotic construction methods."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotics for Engineer Operations"
                                    },
                                    "Description": {
                                        "val": "Mature and demonstrate robotic and autonomous technologies for Engineer operations supporting mobility, countermobility, and advanced construction methods for deployed operations."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.352"
                                            },
                                            "Text": {
                                                "val": "Mature risk mitigation frameworks associated with contingency autonomous construction methods and activities. Mature algorithms and decision making software for control processes (bandwidth needs, response time lag, and override response times) developed to facilitate autonomous methods necessary for expedient point of need construction."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned to PE 0603462 \/ Project BK8 (Robotics for Engineer Operations Advanced Technology) in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "025"
                    },
                    "ProjectTitle": {
                        "val": "Pollution Prevention Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.429"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.429"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Planned efforts in this Project were completed in Fiscal Year (FY) 2018."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates pollution prevention advanced technologies required for sustainable operation of Army weapon systems, to include compliance with regulations mandated by federal, state, and local environmental and health laws. Technology thrusts under this Project include demonstration of advanced technologies to enable sustainment of propellant, explosive, and pyrotechnic production and maintenance facilities and training ranges through elimination or significant reduction of environmental impacts. These technologies will ensure that advanced energetic materials required for the future force's high performance munitions are developed that meet weapons lethality and survivability goals and that are compliant with environmental and health laws. Technology thrusts also include demonstration of more sustainable technologies for surface finishing processes, paints and coatings, cleaning solvents, refrigerants, and fire suppressants.  \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.  \n\nThe Project is fully coordinated and complementary to Program Element (PE) 0602720A, Project 895."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Pollution Prevention Technology"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates pollution prevention advanced technologies required to sustain operation of Army weapons systems to comply with state, federal, and local environmental and health laws and regulations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.429"
                                            },
                                            "Text": {
                                                "val": "Matured and characterized nanoporous silicon-based energetic materials as potential alternatives to lead-based primary explosives; demonstrated the use of Chemical Agent Resistant Coating formulations that replace hazardous isocyanate compounds with polysiloxane-based resins; demonstrated alternative refrigerants with low global warming potential in military environmental control unit applications."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "03E"
                    },
                    "ProjectTitle": {
                        "val": "Environmental Restoration Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.559"
                        },
                        "CurrentYear": {
                            "val": "6.78"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "13.339"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0603463A Network C3I Advanced Technology, Projects: \n* AR4 Intelligent Environmental Battlefield Awareness Advanced Technology \n* AR6 Understanding the Environment as a Threat Advanced Technology\nPE 0603119A Ground Advanced Technology, Project:\n* BM1 Protection from Advanced Weapon Effects Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates technologies transitioned from PE 0602720A (Environmental Quality Technology) Projects 835 and 896 that address the management and mitigation of hazardous materials and chemicals, with a focus on mitigating impacts of new materiel that will enter the Army inventory within the next decade and beyond. This Project will shape and protect Army investments in next generation fires by delivering proactive, scientifically sound risk and environmental impact management strategies. Efforts in this Project assess environmental factors in mission planning activities that impact the battlefield landscape of future threats while also identifying opportunities and impacts to mission success in sparse data environments. These efforts will enable mission planners to identify the industrial\/commercial resources used as components of weapons development. Technologies matured within this Project: inform the Army of potential environmental threats, opportunities, and mission impacts; help decision makers understand environmental threats in urban and industrial contested environments; and provide rapid sensing and assessment of the presence and extent of dangerous compounds in battlefield environments. \n\nA key aspect of this work is the enhancement of risk assessment and life cycle analysis techniques that can more accurately predict and identify the environmental liabilities associated with fielding new systems and technologies. Efforts also identify ways to economically comply with myriad federal, state, and host country regulations dealing with contaminated soil and water. This Project includes pilot-scale field studies to demonstrate technological feasibility and optimize performance and productivity of risk mitigation techniques.\n\nFY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, the Army Modernization Strategy, and supports the Army Strategy for the Environment. \n\nWork in this Project is performed by the Army Engineer Research and Development Center (ERDC), Vicksburg, Mississippi."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hazard Assessment for Military Materials"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates tools to assess hazard and risk of Army-unique chemicals and materials. The tools provide for rapid environmental baseline survey reporting and screening assessments of existing and future militarily relevant compounds and allow for improved predictive risk assessment and provide environmental life cycle assessment capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.398"
                                            },
                                            "Text": {
                                                "val": "Demonstrated a novel passive chemical sensor to detect multiple contaminants (copper, arsenic, and nitrate) in water to provide sensing devices that are rapid, robust, and cost-efficient for real time water quality monitoring."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.273"
                                            },
                                            "Text": {
                                                "val": "Characterize environmental fate, degradation and transport of obscurants and tone-down materials in different environments ranging from open lands to dense urban areas."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned to PE 0603119A \/ Project BM1(Protection from Advanced Weapon Effects Advanced Technology) in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technologies for Sustainable and Green Operations and Acquisition"
                                    },
                                    "Description": {
                                        "val": "This effort exploits and matures technologies to control contaminant transport in environmental media on Army lands and mission spaces as well as assesses and demonstrates novel detection, remediation, and mitigation capabilities for existing and emerging contaminants."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.16"
                                            },
                                            "Text": {
                                                "val": "Demonstrated an operational field effluent treatment system that will minimize water demand, decontaminated waste, and reduce logistic demands. Validated computationally developed environmentally relevant physical and chemical properties of emerging and traditional munitions compounds essential to predict their fate and transport in natural water. Validated an artificial intelligence model that will predict adverse outcomes based on chemical-biological interactions for assessment of military compounds."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Risk Prediction and Decision Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and provides integrated science and technology solutions to Army environmental challenges with a focus on predicting the environmental attributes of emerging chemicals and materials, predictions that inform acquisition lifecycle models in order to minimize impacts to the mission and to the Soldier."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.001"
                                            },
                                            "Text": {
                                                "val": "Validated an environmental lifecycle forecasting tool designed to provide quantitative environmental impact assessment for emerging materials and technologies. Matured qualitative and quantitative methods for assessing synthetic biology environmental impacts of military relevance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Risk Analysis of Fires"
                                    },
                                    "Description": {
                                        "val": "This effort is focused on health implications of new, to-be fielded munitions and investigates the overall life cycle of the materials to shape and protect Army investments in next generation fires supporting Army Modernization Priority Long Range Precision Fires."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.822"
                                            },
                                            "Text": {
                                                "val": "Demonstrate proactive environment, safety, and occupational health risk assessment tools to ensure rapid fielding of energetics, propellants, and munitions. Validate models to predict chemical impacts on select species using embryo gene expression, and demonstrate new computational technologies with high potential for meeting the Army?s needs to predict the toxicity of new and novel chemical agents used in munitions, smoke screens, and energetics."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Advanced technologies within this effort are realigned to PE 0603116A \/ Project AI3 (Rapid Risk Analysis of Fires Technology) in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Understanding the Environment as a Threat"
                                    },
                                    "Description": {
                                        "val": "This effort provides environmental conditions and hazards in contested environments to enable operational planning and decisions to understand environmental threats from informed modeling and simulation supporting Modernization Priority Network\/C3I Mission Planning Applications."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.903"
                                            },
                                            "Text": {
                                                "val": "Demonstrate predictive tools to inform engineer reconnaissance and provide environmental situational awareness for mission planning. Demonstrate in silico prediction of physical, chemical and biological properties of insensitive munitions compounds and their transformation products in the natural water, arid and semi-arid environments, and mature models capable of predicting chemical behavior in complex environments to support scientifically defensible knowledge, tools, and guidance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort is realigned to PE 0603463A \/ Project AR6 (Understanding the Environment as a Threat Advanced Technology) in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Chemical Sensing in Contested Environments"
                                    },
                                    "Description": {
                                        "val": "This effort provides robust tools for environmental reconnaissance missions and environmental sensing technologies for mission readiness. Supports Modernization Priority C3I Persistent Surveillance. Enhanced situational understanding reduces surprise, and can prevent detection, acquisition and engagement."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.662"
                                            },
                                            "Text": {
                                                "val": "Demonstrate advanced environmental sensor technologies to enable rapid collection and data analysis of environmental information. Demonstrate printed, functionalized carbon nano-tube sensor elements to promote properties critical for sensing contaminants of interest (e.g., copper, arsenic, and nitrites), and demonstrate\/validate experimental protocols for improved selectivity for passive samplers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned to PE 0603463A \/ Project AR8 (Sensing in Contested Environments Advanced Technology) in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.12"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "03F"
                    },
                    "ProjectTitle": {
                        "val": "Environmental Quality Tech Demonstrations (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19"
                        },
                        "CurrentYear": {
                            "val": "20"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "39.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional increases supporting the maturation and demonstration of technologies that assist the Army in becoming environmentally compliant and limiting future liability without compromising readiness or training assets critical to the success of the future force.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Army Engineer Research and Development Center (ERDC), Vicksburg, Mississippi."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Autonomous Transport Innovation"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Autonomous Transport Innovation"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Autonomous Transport Innovation"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Depleted Uranium Cleanup"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4"
                                        },
                                        "Text": {
                                            "val": "Depleted Uranium Cleanup"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Safe Carbon Nanotechnology Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Rapid Safe Carbon Nanotechnology Research"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8"
                                        },
                                        "Text": {
                                            "val": "Rapid Safe Carbon Nanotechnology Research"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Smart Bases"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Smart Bases"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Sensors for Explosives"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "2"
                                        },
                                        "Text": {
                                            "val": "Environmental Sensors for Explosives"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}