{
    "id": "2020-DefenseThreatReductionAgency-PB-0400-MJBOOK-0-0-67ad91f46a6dcf91a754c4069dfe875e2921c382638202f3d667d581e18015dc-1",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-DTRA-U_RDTE_MasterJustificationBook_Defense_Threat_Reduction_Agency_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Threat_Reduction_Agency_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602134BR"
        },
        "ProgramElementTitle": {
            "val": "Improvised Threat Reduction Applied Research"
        },
        "R1LineNumber": {
            "val": "10"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "1.677"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearOneOCO": {
                "val": "1.677"
            },
            "BudgetYearTwo": {
                "val": "1.711"
            },
            "BudgetYearThree": {
                "val": "1.745"
            },
            "BudgetYearFour": {
                "val": "1.780"
            },
            "BudgetYearFive": {
                "val": "1.815"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Overseas Contingency Operations (OCO) for Enduring Requirements ($1.677M):  OCO for Enduring Requirements are enduring in-theater and in-CONUS costs that will likely remain after combat operations cease.  This OCO program element is a new start.  Funds enable and provide for urgent and emergent warfighter requirements from Combatant Commands (CCMDs) and Warfighter Senior Integration Group."
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Threat Reduction Agency (DTRA) Counter Improvised-Threat Simulation Advanced Technology Development program element funds Technology Outreach as well as development of modeling-and-simulation and analysis support tools that enhance counter-improvised explosive devices (C-IED) and counter improvised threat (C-IT) efforts.\n\nEnable Rapid Capability Delivery. This activity is driven by current threat activities. It enables the timely validation, resourcing, research (basic or applied), and rapid prototype development and delivery to counter booby-trapped structures, buried IEDs, home-made explosives, person\/suicide-borne IEDs, and radio-controlled IEDs that continue to impact deployed US Joint force maneuverability and force protection. This includes Science, Technology, Engineering, and Mathematics (STEM) manpower and also enables coordination with other stakeholders and all supporting test and evaluation activities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.677"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "1.677"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.677"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "1.677"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "1.677"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "1.677"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The increase in FY 2020 supports investment in applied research looking for disruptive technologies that will provide a greater than 70% solution to the following investment areas: Stand-Off Detection, Anti-Armor IED (AAIED), System Attributes across the Portfolio (Machine Learning, & Artificial Intelligence), as well as increased investment in future-threat forecasting and innovative analytical research studies leveraging expertise from academia and research institutions in government and industry. These areas of investment continue to be identified time and again as challenging problem sets for the warfighters as identified by the CCMDs and warfighting commands in the CCMD integrated priority lists and JUONs. This is all in support of Assistant Secretary of Defense for Research & Engineering ASD(R&E) guidance and congressional testimony to provide the technological foundation that ensures the U.S. military of both today and tomorrow is the most capable in the fight against IEDs and emerging improvised threats. These resources will be applied to the following: designing and fabricating ultra-light weight auxetic structures that significantly reduce damage to vehicles through reducing deflection upon impact from mine blast; developing the Light Detection and Ranging (LiDAR) and unmanned aerial vehicle cameras needed to create a 3D map of an environment; developing explainable artificial intelligence (XAI) methodologies to enable human understanding of Machine Learning decisions; developing fusion strategies to improve Machine Learning algorithms by including human-in-the- loop knowledge into its learning strategies; developing methods to optimize algorithms through artificial intelligence and machine learning; and forecasting future threat scenarios and threat network resiliency."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "JC"
                    },
                    "ProjectTitle": {
                        "val": "Enable Rapid Capability Delivery"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.502"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.502"
                        },
                        "BudgetYearTwo": {
                            "val": "0.512"
                        },
                        "BudgetYearThree": {
                            "val": "0.522"
                        },
                        "BudgetYearFour": {
                            "val": "0.533"
                        },
                        "BudgetYearFive": {
                            "val": "0.543"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Defense Threat Reduction Agency's (DTRA) takes a deliberate, structured, and proactive approach to meet future capability gaps and requirements through a continuous survey of the research realm. DTRA enables early identification and cultivation of technologies and concepts that are essential in meeting and staying ahead of the evolving improvised threats.\n\nImprovised Threat Reduction Applied Research will fund technology outreach and investigate new technologies and scientific discoveries to progress the US into fields of study that will propel DTRA forward in countering improvised explosive devices (IEDs) and other improvised threats that will impact US Joint Force maneuverability and force protection.   \n\nEnable Rapid Capability Delivery. This activity enables the timely validation, resourcing, research, and rapid prototype development and delivery to anti-armor IEDs (i.e., explosively formed projectiles) for which a solution has never been realized."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JC:  Enable Rapid Capability Delivery"
                                    },
                                    "Description": {
                                        "val": "This project seeks to assess and understand current and emerging technologies to take a proactive approach to rapidly address the constantly evolving environment of the warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.502"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.502"
                                            },
                                            "Text": {
                                                "val": "- Deliver technical reports in response to Requests for Information (RFIs) submitted by DTRA program\/system Integrators and initiative evaluation team members.\n- Convene Joint Lab Board to evaluate the feasibility and practicality of proposed solutions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2019 to FY 2020 supports investment in applied research to gain a better understanding of current and emerging technologies that will improve the warfighter’s capability to detect, defeat, identify, neutralize, and mitigate the adversary’s improvised threat to better prepare for and meet the needs of the warfighter."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "27\/0603134BR\/JC"
                                    },
                                    "Title": {
                                        "val": "Counter Improvised-Threat Simulation"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "23.366"
                                        },
                                        "CurrentYear": {
                                            "val": "13.648"
                                        },
                                        "BudgetYearOne": {
                                            "val": "49.528"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "49.528"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "50.110"
                                        },
                                        "BudgetYearThree": {
                                            "val": "50.250"
                                        },
                                        "BudgetYearFour": {
                                            "val": "47.887"
                                        },
                                        "BudgetYearFive": {
                                            "val": "48.194"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "94\/0604134BR\/JC"
                                    },
                                    "Title": {
                                        "val": "Counter Improvised-Threat Technology Demonstration, Prototype Development, and Testing"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "117.640"
                                        },
                                        "CurrentYear": {
                                            "val": "148.772"
                                        },
                                        "BudgetYearOne": {
                                            "val": "103.793"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "103.793"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "59.860"
                                        },
                                        "BudgetYearThree": {
                                            "val": "109.236"
                                        },
                                        "BudgetYearFour": {
                                            "val": "105.258"
                                        },
                                        "BudgetYearFive": {
                                            "val": "106.598"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive selection of most appropriate performers to fulfill science and technology development needs. Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "The percentage of new technological research papers that bring forward new initiatives to the DTRA portfolio."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "JS"
                    },
                    "ProjectTitle": {
                        "val": "Assist Situational Understanding"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "1.175"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "1.175"
                        },
                        "BudgetYearTwo": {
                            "val": "1.199"
                        },
                        "BudgetYearThree": {
                            "val": "1.223"
                        },
                        "BudgetYearFour": {
                            "val": "1.247"
                        },
                        "BudgetYearFive": {
                            "val": "1.272"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This funding represents Defense Threat Reduction Agency's (DTRAs) Directed Studies effort, which manages and funds analytical research studies\/projects to counter improvised explosive devices (C-IEDs) and emerging improvised threats. This project sponsors innovative studies which leverage expertise from academia and world-class research institutions in government and industry. The program cultivates research community partnerships and is forward-looking to: help understand the environment, threats and vulnerabilities; anticipate and plan for emerging improvised threats; and leverage innovative approaches for future counter improvised threat (C-IT) solutions to prevent or mitigate battlefield operational surprise in support of Combatant Commands (CCMDs) and deployed Warfighters."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JS: Assist Situational Understanding"
                                    },
                                    "Description": {
                                        "val": "This project conducts analytical research studies to counter IEDs and emerging improvised threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.175"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "1.175"
                                            },
                                            "Text": {
                                                "val": "- Conduct 3-5 research studies to support counter C-IED and emerging improvised threat efforts. \n- Support collaborative relationships with the analytical community.\n- Conduct annual project reviews to ensure progress toward study objectives.\n- Assess the focus and scope of C-IT challenges within our internal portfolio and across the broader analytic community to synchronize efforts and ensure successful partnerships."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2019 to FY 2020 supports increased investment in applied research to support analytical research studies to gain a better understanding of new technologies and scientific discoveries to counter emerging improvised threats."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "94\/0604134BR\/JS"
                                    },
                                    "Title": {
                                        "val": "Counter Improvised-Threat Technology Demonstration, Prototype Development, and Testing"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "17.504"
                                        },
                                        "CurrentYear": {
                                            "val": "13.141"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.797"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.797"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.090"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.286"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.585"
                                        },
                                        "BudgetYearFive": {
                                            "val": "10.887"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive selection of most appropriate performers to fulfill analytical development needs. Performer base includes best-of-breed researchers across the Department of Defense and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Project performance is measured via the number of deliverables\/publications, number of participating research organizations, and percentage of studies transitioned for further development."
                        }
                    }
                }
            ]
        }
    }
}