{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-5a07dc0699c01ee0aa0e25e1d703a9926ea45842c064a371eb5a85ab7f6935f0-33",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604055D8Z"
        },
        "ProgramElementTitle": {
            "val": "Operational Energy Capability Improvement"
        },
        "R1LineNumber": {
            "val": "65"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "39.788"
            },
            "CurrentYear": {
                "val": "45.478"
            },
            "BudgetYearOne": {
                "val": "70.536"
            },
            "BudgetYearOneBase": {
                "val": "70.536"
            },
            "BudgetYearTwo": {
                "val": "41.261"
            },
            "BudgetYearThree": {
                "val": "41.897"
            },
            "BudgetYearFour": {
                "val": "42.657"
            },
            "BudgetYearFive": {
                "val": "43.562"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The basic mission of this program element (PE) is to fund innovation to improve the Department of Defense’s (DoD) operational effectiveness via targeted operational energy science and technology (S&T) investments.  The Operational Energy Capability Improvement Fund (OECIF) incentivizes S&T to promote long term change in DoD capabilities so they are better aligned with the Operational Energy Strategy.  OECIF generally fosters innovation to improve operational energy performance and has two key mission aspects:  first, to develop operational energy technologies and practices that will improve DoD military capabilities and possibly reduce costs; and second, to establish within and among the military Services institutional momentum to continue those innovations.  \n\nOECIF funds serve as “seed money” to start or consolidate promising operational energy innovation to be sustained by the Services; therefore, OECIF generally emphasizes supporting or establishing transitions rather than one-off projects.  OECIF investments also show areas of Departmental level interest.  The increase in OECIF funding for FY 2020 is aimed to help shape Service investments across six core functional areas within this operational energy domain:  Space Solar Collection, Power Beaming Transmission, Power Beaming Reception, Receiver Power Distribution, Architecture Analytics, and Supporting Technologies.\n\nIt is imperative that DoD sustain a competitive position to innovate and manage stealthy and portable power beaming initiatives which provide freedom of movement for the warfighter.  OECIF projects are selected annually from Service and Combatant Command proposals that align with the Department’s 2016 Operational Energy Strategy and support that fiscal year’s OECIF theme.  The theme reflects the Department's priorities and focuses S&T investments.  The Department is due for a new Operational Energy Strategy, and OECIF is actively shaping and contributing to the Innovation sections.  Ultimately, the true value of an OECIF project is dependent on a successful transition to the Warfighter.  The benefits may be realized through materiel efforts (fielded equipment, enhanced sub-systems) or non-materiel improvements (i.e., modeling and simulations capabilities, education and training, and development of standards).  The overall aim is to improve the operational effectiveness of the Joint Force."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "38.403"
                },
                "CurrentYear": {
                    "val": "40.582"
                },
                "BudgetYearOne": {
                    "val": "40.652"
                },
                "BudgetYearOneBase": {
                    "val": "40.652"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "39.788"
                },
                "CurrentYear": {
                    "val": "45.478"
                },
                "BudgetYearOne": {
                    "val": "70.536"
                },
                "BudgetYearOneBase": {
                    "val": "70.536"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "1.385"
                },
                "CurrentYear": {
                    "val": "4.896"
                },
                "BudgetYearOne": {
                    "val": "29.884"
                },
                "BudgetYearOneBase": {
                    "val": "29.884"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "2.500"
                    },
                    "CurrentYear": {
                        "val": "5.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.041"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.074"
                                },
                                "CurrentYear": {
                                    "val": "-0.104"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FY 2020 Program Enhancement"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "30.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "30.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.116"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.116"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Program adjustments are consistent with higher priority DoD requirements.  The increase in OECIF funding for FY 2020 is aimed to help shape Service investment in Space Solar Advanced Technology.  Near-peer competitors are overmatching DoD in power beaming and space solar technologies for battlefield advantage, necessitating a critical OECIF effort to address the shortfalls.  Per the findings and recommendations of the recent DoD study “Opportunities and Challenges for Space Solar for Remote Installations,\" measured, comprehensive investments in Advanced Technology Development will be made in six focus areas:  (1) Space Solar Collection; (2) Power Beaming Transmission; (3) Power Beaming Reception; (4) Receiver Power Distribution; (5) Architecture Analytics; and (6) Integrating Technologies."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "455"
                    },
                    "ProjectTitle": {
                        "val": "Operational Energy Capability Improvement"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "39.788"
                        },
                        "CurrentYear": {
                            "val": "45.478"
                        },
                        "BudgetYearOne": {
                            "val": "70.536"
                        },
                        "BudgetYearOneBase": {
                            "val": "70.536"
                        },
                        "BudgetYearTwo": {
                            "val": "41.261"
                        },
                        "BudgetYearThree": {
                            "val": "41.897"
                        },
                        "BudgetYearFour": {
                            "val": "42.657"
                        },
                        "BudgetYearFive": {
                            "val": "43.562"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Operational Energy Capability Improvement Fund (OECIF) incentivizes science and technology (S&T) to promote long-term change in DoD capabilities so they are better aligned with the Operational Energy Strategy.  OECIF generally fosters innovation to improve operational energy performance and has two key mission aspects:  first, to develop operational energy technologies and practices that will improve DoD military capabilities and possibly reduce costs; and second, to establish within the military Services institutional momentum to continue those innovations.  OECIF serves as “seed money” to start or consolidate promising operational energy innovation to be sustained by the Services.  Accordingly, OECIF generally emphasizes supporting or establishing programs rather than one-off projects.\n\nIn FY 2018, the OECIF program was realigned from the Office of the Under Secretary of Defense for Acquisition, Technology, and Logistics (OUSD(AT&L)) to the Office of the Under Secretary of Defense for Research and Engineering (OUSD(R&E))."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Operational Energy Capability Improvement Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "2.500"
                                        },
                                        "Text": {
                                            "val": "The FY 2018 appropriation included a $2.500 million program increase for the Operational Energy Capability Improvement program."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "The FY 2019 appropriation included a $5.000 million program increase for the Operational Energy Capability Improvement program."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational Energy Capability Improvement Fund (OECIF)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "37.288"
                                            },
                                            "Text": {
                                                "val": "The TMSC program, which began in FY13, will still be active.  TMSC will incorporate DoD and Service comments and publish the final draft for DoD approval.\n\nJ-DEPLOI, which began in FY14, will still be active.  J-DEPLOI plans to complete software development and testing, MBPS integration, and plan transition of the program to MPBS management and PACOM users.\n\nThe FY15 vehicles program will continue.  The Thermally Efficient Cylinders program will test the single-cylinder engine with an optimized coating and piston and will begin laboratory preparations for multi-cylinder testing.  The TVEK program will complete the SIL testing with all sub-systems integrated into the vehicle, evaluate the sub-system fuel savings and M&S results from the Matlab Simulink and the Army Joint Operational Energy Initiative (JOEI) model to determine optimal kit architecture, start integration of kits in the HEMTT and LVSR vehicles, initiate electromagnetic interference testing of sub-systems, and develop vehicle test plans and agreements with testing facilities.  The Automation\/Smart Cruise Control program will complete Phase II by conducting convoy testing, deliver a final report, and provide the developed technology.  The M&S for Light-Weighting program will incorporate novel materials for analysis and compare with the baseline system model.\n\nThe FY16 unmanned vehicles programs will continue.  The Reliable, Efficient, Tactical UAS Power System program will test the second generation engine for power output, specific fuel consumption, altitude, and product reliability.  The Hybrid Tiger team will begin the flight testing phase validating the performance models and tuning flight controller gains, and refine software to emphasize optimal hybrid mode transitions and increased autonomy for soaring.  The HTVE-UE program will continue base tasks related to component fabrication and breadboard assembly and testing, execute at-sea test planning, and perform initial system deployment; and continue studies and analyses related to FDECO interoperability, HTV characterization\/environmental considerations, and CONOPS.  The Aluminum Seawater Power program will go through the next round of component development and testing, and begin integration testing.  The Small Turboprop Engine Range\/Power Enhancement program will begin engine detailed design and acquire long lead materials for engine fabrication.  The JP-8 Based Fuel Cell Power program will conduct physical integration of the JP-8 reformer and solid oxide fuel cell and all supporting hardware, and conduct the first two iterations of system level testing to determine weak parts of the system design.   \n\nThe programs begun in FY17 will continue to ramp up during this fiscal year. \n\nNew programs will start in FY18.  The focus of these new programs is likely to reflect input from the Services, various research Communities of Interest within DoD, such as Energy and Power, Ground and Sea Platforms, and Air Platforms, and any developing gaps or opportunities identified by ODASD(OE)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "40.478"
                                            },
                                            "Text": {
                                                "val": "Fund new OECIF initiatives and continue established efforts.  OECIF will self-fund necessary overhead from the program baseline, approximately $5.000 million annually, to include program management, business reform tools, and strategic partnerships, etc.  \n\nEstablished efforts include:\n• The FY 2013 OECIF project, Tactical Microgrid Standardization, will submit a draft Military Standard (MIL-STD) to the Defense Standardization Program Office for approval.  A multi-national demonstration is planned for inter-operability among the North Atlantic Treaty Organization (NATO) partners showing applicability of the standard as part of the Capable Logistician 2019 exercise.\n\n• FY 2014 OECIF projects are focused on analytical methods and tools for considering operational energy in DoD planning and decision processes.  Analytic tools were developed to consider energy vulnerability during the Joint Planning Process. Spring warfighter evaluations and training are planned.  DoD-wide model, scenario, and data updates continue with new model versions scheduled to be released in October 2019.  Analytical tool investment underpins the Congressionally mandated energy key performance parameter in addition to warfighting battlefield tools.\n\n• FY 2015 OECIF tactical vehicle improvement projects completed the final year of OECIF funding.  One effort completed a critical milestone for procurement testing and successfully identified Program Manager Terminal High Altitude Area Defense (PM THAAD) as its first transition partner.  A system demonstration is planned for FY 2019.  Battlefield electrification yields increased operating longevity in addition to decreased mean-time between failure and significantly less frequent refueling requirements.\n\n• FY 2016 OECIF projects focused on improving the operational energy performance of unmanned aerial, surface, undersea and ground vehicles.  Multiple projects will conclude in FY 2019 with efforts resulting in improved engine design, energy hybridization for increased performance capabilities, and fuel efficiencies.  These projects are expected to transition in FY 2020-2021.\n\n• FY 2017 OECIF projects support two main topics:  Thermal and Power Management Technologies for High Pulse Power Systems; and Wireless Transmission of Energy in the Far-Field.  These investments focus on the energy and power sub-systems that enable directed energy weapons as well as future warfighting concepts with unlimited power and communications.  Efforts are demonstrating early success and pushing technology forward across wireless transmission in far-field, laser beaming, space solar, and photovoltaic testing.\n\nIncreased lethality of directed energy weapons is enabled by advanced power and thermal innovation in: \n• Lab-based prototypes of thermal management systems to bolster mission-success of DEW systems;\n• Hybrid energy storage module units to enable continuous firing of pulse load capability and reduced logistics; and\n• Energy management systems for high power payloads that increase fuel savings as well as improve power and thermal transient capability.\n\nResiliency is bolstered by far field wireless energy development of: \n• Alternative manufacturing methods for lightweight flexible high efficiency III-V solar cells that provide a breakthroughs in cost reduction as well as decreased production time for the next generation space solar concepts;\n• Alternative solar cell materials, such as perovskites that increase mobile power generation capability by a factor of three as well as decreasing weight and increasing efficiency; and\n• Mobile power meters for preventative maintenance and agile logistics.\n\nInnovative operational concepts can be realized with new battlefield technologies including: \n• Advances in novel space solar collection and wireless power beaming technologies which lead to increased energy resiliency and assured energy supply;\n• Studies on space solar on energy resupply capability that provide knowledge towards future investment strategies;\n• Laser light power beaming technologies including the receiver, transmitter and safety system that enable infinite persistence communications and ISR assets;\n• Millimeter wave power beaming technologies including rectenna and sterling engine prototypes to enable persistent operations; and\n• Free-space optical communication system that provides a highly directional, jam-resistant, secure communications via an energy stream.\n\nFinally, business reform is driven by the development of an artificial intelligence portfolio analysis tool that will speed operational energy S&T developments and improve investment decisions.\n\nInnovative advances in power and thermal management as well as wireless transmission of energy underpin lethal warfighting capability and are expected to contribute to increased power generation and distribution capabilities, reduced energy supply line burdens, and new autonomous power paradigms.  The breadth of applications include directed energy \/ electronic weaponry, persistent autonomous systems, power generation and distribution on the ground and in space, and advanced communication systems. \n\n• FY 2018 OECIF projects are one-year studies to identify operational energy S&T gaps in the near-, mid-, and far-term.  The studies will deliver community vetted, operational energy investment roadmaps.  Once these projects are completed, they will be the pathway to feed the next operational energy strategy and they will inform the topic selection for FY 2020 OECIF proposals.\n\n• FY 2019 OECIF projects directly support \"Enhanced Energy Storage to Improve Lethality and Warfighting Performance\" consistent with the National Defense Strategy.  Investments focus on standardization, safety, and advanced performance of energy storage solutions with consideration for business reform opportunities. \n\nBusiness reform is driven by rapid demonstration of:\n• The use of rapidly manufactured and field expendable logistics: surface\/sub-surface vehicles for bulk fuel delivery;\n• Demonstration of innovative inverter technology for vehicle-to-grid energy storage and micro-gridding enabling technology for autonomous vehicle recharging;\n• Application of artificial intelligence and machine learning to demonstrate increased development speeds for rapid-recharge antiferroelectric capacitors;\n• Unique aerodynamic designs for on-board UAS energy fuel storage;\n• Hybrid power management and storage for Group 3 UAS; and\n• Mechanical demonstrations of in-flight energy storage for both platforms and weapon systems.  \n\nOECIF supports storage safety innovation in:\n• Novel aqueous battery chemistries that do not burn and have no fixed dependence on form factor, offering the warrior and platforms greater safety and flexibility;\n• Energy storage devices to support expeditionary basing requirements; and\n• Novel Li-Ion internal short detection system which senses at extremely low sensitivity levels allowing early warning to mitigate malfunctions or dangers.\n\nEnergy storage is also a key component of energy resiliency and FY 2019 OECIF investments support:\n• Innovative hydrogen energy storage at bases;\n• Mobile power monitoring of energy storage and loads for preventative maintenance and agile logistics;  \n• Integration of monolithically integrated, ultra-thin solar powered solid state lithium energy storage for space solar applications; and\n• Mechanical developments supporting flywheel storage technology.\n\nFinally, FY 2019 OECIF emphasizes standardization with the potential to save the department millions of dollars including:\n• Standardization of Li-Ion 6T drop-in replacement batteries;\n• Standardization of Li-Ion storage containers for world-wide shipping and development of a DoD-wide Li-Ion database; and\n• Standardization of high voltage energy storage module to support Directed Energy\/Electronic Warfare.\n\nInnovative advances in energy storage underpins lethal warfighting capability and the FY 2019 efforts are expected to significantly contribute to silent watch, greater and safer on-board power for payloads, increased unrefueled range and endurance, reduced energy supply line burdens, and the ability to support autonomous operations.  The breadth of applications includes directed energy \/ electronic weaponry, the dismounted warfighters combat load, long range and endurance of autonomous systems, and storage of energy in and from space.\n\nThe Services submitted a record $175.000 million in prioritized proposal requests for energy storage types (batteries, fuel cells, ultra-capacitors, flywheels, compressed gases, thermal storage, betavoltaics, pumped hydro energy\/power density, safety, standardization, hybridization, reliability, cyclic behavior, and efficiency).  Concerted industry outreach efforts with the Defense Innovation Unit and Manufacturing Technology programs increase the likelihood of near-term transition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "70.536"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "70.536"
                                            },
                                            "Text": {
                                                "val": "• FY 2017 funding for OECIF programs, as mentioned above, will conclude and projects will transfer to their transition partners. \n• FY 2019 programs will continue with their technology development efforts, demonstrations, and deliverables.\n\nOUSD(R&E) emphasizes modernization to shape the future force.  In FY 2020, OECIF projects are expected to emphasize space, weapons, and electronic warfare as emerging capabilities and will be shaped by FY 2018 Operational Energy S&T gaps and roadmaps.  Near-peer competitors are overmatching DoD in power beaming and space solar technologies for battlefield advantage, necessitating a critical OECIF effort to address the shortfalls.  Per the findings and recommendations of the recent DoD study “Opportunities and Challenges for Space Solar for Remote Installations,\" measured, comprehensive investments at the Advanced Technology Development (Budget Activity 3) level will be made in six focus areas:\n \n(1) Space Solar Collection – Low-cost, lightweight photovoltaics through revolutionary production methods are key to manufacturing at scale.  Once produced, thermal, radiation, and space qualification testing is needed.  FY 2020 investment level:  $7.200 million.\n(2) Power Beaming Transmission – High-efficiency, compact microwave\/millimeter-wave\/optical source integration with power transmitters is needed.  High specific power transmitters, particularly in the short-wave infrared, will be built and tested.  FY 2020 investment level:  $5.900 million.\n(3) Power Beaming Reception – Tactically deployable ground receivers for power beaming do not currently exist.  Variable power density-compatible, portable, ruggedized, modular receivers will be developed and tested.  FY 2020 investment level:  $6.100 million.\n(4) Receiver Power Distribution – Deployed microgrid and storage integration for power receiver usage is required for effective utilization. Operations scenarios for crewed and autonomous users will be formulated and hardware prototypes implemented.  FY 2020 investment level:  $2.400 million.\n(5) Architecture Analytics – Campaign modeling and examination of the implications of different means of energy conversion and ground and space segment approaches will critically focus investments and drive Conops development.  FY 2020 investment level:  $3.000 million.\n(6) Integrating Technologies – Leap ahead technologies in large area metrology, high-altitude receiver craft, thermal management, high voltage management, and airborne tether technologies are critical to ensuring integration of the final capability.  FY 2020 investment level:  $5.400 million.\n\nThese elements kick-off efforts for power beaming and space solar capabilities to increase warfighter lethality and reduce logistical burdens.  For contexts of ground-to-ground, elevated, high-altitude, low earth orbit, and higher orbits, the progression of power beaming capabilities to include longer links and higher powers will provide a credible path to an operational capability.  OECIF will continue engagement with OSD, Services, and CCMDs for validation of development strategies for FY 2021 and beyond."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The $30.000 million increase in OECIF funding for FY 2020 aims to help shape Service investment across six core functional areas within the operational energy domain:  Space Solar Collection, Power Beaming Transmission, Power Beaming Reception, Receiver Power Distribution, Architecture Analytics, and Supporting Technologies.  These areas are highlighted in the FY 2020 plan above."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Projects provide a detailed work schedule with technical objectives and tasks for the duration of funding.  Monthly financial and quarterly technical meetings are held to ensure milestones, testing, and demonstrations are progressing.  Twice a year the projects showcase their progress:  once at an annual technology exchange; and again with the Office of the Secretary of Defense and Component\/Service energy office.  During the annual assessment with the energy office, each stated objective is evaluated and, based on the outcome, the project is given a go\/no-go determination for continued funds."
                        }
                    }
                }
            ]
        }
    }
}