{
    "id": "2020-AirForce-PB-3600-MJBOOK-3-0-dae65ec315c4e8a6016da9aad32868ad9d723aca22c2ec6866c6d33ef17d1a4a-51",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-AIRFORCE_V3B-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0708611F"
        },
        "ProgramElementTitle": {
            "val": "Support Systems Development"
        },
        "R1LineNumber": {
            "val": "280"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "11.362"
            },
            "CurrentYear": {
                "val": "4.497"
            },
            "BudgetYearOne": {
                "val": "0.539"
            },
            "BudgetYearOneBase": {
                "val": "0.539"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "11.860"
            },
            "BudgetYearThree": {
                "val": "13.746"
            },
            "BudgetYearFour": {
                "val": "12.707"
            },
            "BudgetYearFive": {
                "val": "10.448"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Logistics, Installations and Mission Support - Enterprise View (LIMS-EV) capability provides a Business Intelligence (BI) and Decision Support (DS) solution for the A4 community. USAF decision-makers, maintainers and planners require increased access to comprehensive data related to platform mission, operational status, support equipment availability and parts. This data is required to be accessible in a number different configurations ranging from preformatted executive dashboards to highly customizable ad-hoc reporting to enable improved decision making based on accurate, near-real-time data available in a simple self-service environment that provides detailed supply chain data from lowest levels all the way up to operational planners and senior leadership. By aggregating and exposing data from over 130 data sources, LIMS-EV provides warfighters with timely, authoritative information to make informed decisions.\n\nThe LIMS-EV capability is migrating, along with the rest of AF Data Services, from GCSS-AF heritage to a commercial government cloud-configured environment. That move will result in improved performance, greater scalability and reliability, enhanced ability to leverage Software as a Service (SAAS), and reduced operational costs from utilization of common infrastructure. This move will also result in implementation of new system engineering processes based on agile software development\/rapid prototyping via the CCE 2.0 dev\/test\/production environments and Data Services development laboratories and will leverage cloud best practices including streamlined promotion and deployment processes, automating previously manual code reviews, security testing, and deployment.  \n\nLIMS-EV funding supports the ability to more effectively work in the cloud environment and to exploit emerging technology to enhance existing capabilities, extend access to mobile users, expand the amount of data accessible, and incorporate more predictive capabilities into the current reporting capability. This will extend existing BI capabilities to provide configurable alerting, predictive\/what-if analysis, mobile applications and better integrate functionality based on priority requirements as defined\/approved by the A4 governance bodies.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver our integrated logistics capability. The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, 0605898F, and 0605833F.\n\nThe FY 2019 funding request was reduced by $5.034 million to account for the availability of prior year execution balances.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.362"
                },
                "CurrentYear": {
                    "val": "4.497"
                },
                "BudgetYearOne": {
                    "val": "12.648"
                },
                "BudgetYearOneBase": {
                    "val": "12.648"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "11.362"
                },
                "CurrentYear": {
                    "val": "4.497"
                },
                "BudgetYearOne": {
                    "val": "0.539"
                },
                "BudgetYearOneBase": {
                    "val": "0.539"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-12.109"
                },
                "BudgetYearOneBase": {
                    "val": "-12.109"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "2.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-12.109"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-12.109"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY18 MRK-Investment Mark for Vehicle View lower-carbon solutions effort $2.000M"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "675042"
                    },
                    "ProjectTitle": {
                        "val": "Log Application Logisitics Integration (LALI)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.362"
                        },
                        "CurrentYear": {
                            "val": "4.497"
                        },
                        "BudgetYearOne": {
                            "val": "0.539"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.539"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "9.875"
                        },
                        "BudgetYearThree": {
                            "val": "13.746"
                        },
                        "BudgetYearFour": {
                            "val": "12.707"
                        },
                        "BudgetYearFive": {
                            "val": "10.448"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Logistics, Installations and Mission Support - Enterprise View (LIMS-EV) capability provides a Business Intelligence (BI) and Decision Support (DS) solution for the A4 community.  USAF decision-makers, maintainers and planners require increased access to comprehensive data related to platform mission, operational status, support equipment availability and parts.  This data is required to be accessible in a number different configurations ranging from preformatted executive dashboards to highly customizable ad-hoc reporting to enable improved decision making based on accurate, near-real-time data available in a simple self-service environment that provides detailed supply chain data from lowest levels all the way up to operational planners and senior leadership.  By aggregating and exposing data from over 130 data sources, LIMS-EV provides warfighters with timely, authoritative information to make informed decisions.\nThe LIMS-EV capability is migrating, along with the rest of AF Data Services, from GCSS-AF heritage to a commercial government cloud-configured environment.  That move will result in improved performance, greater scalability and reliability, enhanced ability to leverage Software as a Service (SAAS), and reduced operational costs from utilization of common infrastructure.  This move will also result in implementation of new system engineering processes based on agile software development\/rapid prototyping via the CCE 2.0 dev\/test\/production environments and Data Services development laboratories and will leverage cloud best practices including streamlined promotion and deployment processes, automating previously manual code reviews, security testing, and deployment.  \nLIMS-EV funding supports the ability to more effectively work in the cloud environment and to exploit emerging technology to enhance existing capabilities, extend access to mobile users, expand the amount of data accessible, and incorporate more predictive capabilities into the current reporting capability.   This will extend existing BI capabilities to provide configurable alerting, predictive\/what-if analysis, mobile applications and better integrate functionality based on priority requirements as defined\/approved by the A4 governance bodies.         \n \n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver our integrated logistics capability. The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, 0605898F, and 0605833F."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "LIMS-EV Version 2.0"
                                    },
                                    "Description": {
                                        "val": "Minor change requests for the Vehicle Management, Supply, Maintenance, Avionics, Propulsion, Repair Network, Support Equipment and Communication Security (COMSEC) communities while refactoring LIMS-EV to native cloud services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.362"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "LIMS-EV Version 3.0 Business Capability Acquisition Cycle (BCAC) Phase 3"
                                    },
                                    "Description": {
                                        "val": "Expanded, Scalable, Portable, Enterprise Logistics Data Accessibility"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.497"
                                            },
                                            "Text": {
                                                "val": "Four Major Enhancements and 11 Minor change requests for the Vehicle Management, Supply, Maintenance, Avionics, Propulsion, Repair Network, Support Equipment and Communication Security (COMSEC) communities to build the foundation and support targeted initial offerings of the following capabilities: \n- Enable secure, elastic capability that automatically scales to on-demand peak needs, provides reliable response and reduces scale and time of outages\n- Provide tiers of data storage efficiently tailoring data accessibility based on needs and costs\n- Provide greater control to functional representatives to transform data by revising reference tables and business rules without developer intervention\n- Provide greater functional self service provisioning capability\n- Implement Mobile Capability to support initiatives (i.e. Flight line of the Future)\n- Enabling federation of data across multi-security and functional domains.  \n- Expand ADHOC reporting capability without needing special data universes\n- Modernize expanded visualization capability, with greater consistency across application views. \n- Expand access to new data feeds as well as unstructured and semi-structured data\n- Provide foundation infrastructure for Logistics Data Environment\nImproved Forecasting Capability\n- Forecasting future health of weapon system and equipment with constraint analysis\n- Improve trend analysis\n- Implementation of Statistical Process Control with anomaly detection\n- Root cause and fault analysis\n- Future data projections with high degree of confidence"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.539"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.539"
                                            },
                                            "Text": {
                                                "val": "Eight Major Enhancements and 23 Minor change requests for the Vehicle Management, Supply, Maintenance, Avionics, Propulsion, Repair Network, Support Equipment and Communication Security (COMSEC) communities that build on prior development to enable advanced Predictive Enterprise Logistics Reporting and Analytics in the following areas:\n- Implement a modeling & simulation Capability \n- Big Data analytics \n- Actuarial capability and reliability analysis\n- Incorporation of operational data such as flight profile data to support deep performance analysis of weapon system components and supporting predictive modeling\n- Ability to configure and simulate different logistics outcomes based on known factors"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decreased from FY19 to FY20 due to late obligations and expenditures in FY18."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "LIMS-EV will utilize services provided by the Air Force Common Computing Environment (CCE) Government Cloud Framework, migrating from the End-of-Life GCSS-AF Integration Framework. AFLCMC\/HNII Data Services Program Management Office (PMO), as LIMS-EV Program Manager, is responsible to competitively acquire additional LIMS-EV capabilities using a variety of fixed price, labor hour, time and material, and cost plus contracts through the environment migration and within the CCE Framework.\nLIMS-EV capabilities utilize services provided by the GCSS-AF Integration\/CCE Framework. AFLCMC\/HNII Data Services PMO, as LIMS-EV Program Manager, manages LIMS-EV development projects following the Agile\/Rapid Prototyping software development release process.  \nLIMS-EV development projects will be implemented via the CCE development contract under oversight by AFLCMC\/HNII Data Services Program Management Office, Wright-Patterson Air Force Base, Ohio."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "LALI LIMS-EV Systems Engineering Contractor Support (Product Development) LIMS-EV Version 2.0"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Leidos"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "11.362"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "LALI LIMS-EV Systems Engineering Contractor Support (Product Development) LIMS-EV Version 3.0 - Business Capability Acquisition Cycle"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Leidos"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.497"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.539"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.539"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Support Systems Developments PE 0708611F"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "LIMS-EV Version 2.0"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "LIMS-EV Version 3.0 - Business Capability Acquisition Cycle (BCAC) 3"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "LIMS-EV Version 3.0 - Business Capability Acquisition Cycle (BCAC) 3 period of performance end date is 2Q 2025. IDECS limits schedule to 4Q 2024."
                        }
                    }
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "675044"
                    },
                    "ProjectTitle": {
                        "val": "Logistics Systems Development (LSD)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.985"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.985"
                        }
                    },
                    "R2aExhibit": []
                }
            ]
        }
    }
}