{
    "id": "2020-DefenseThreatReductionAgency-PB-0400-MJBOOK-0-8-20c9efcf6d605b32d3d5f083f831185effe1f78c53559fcdc9809c2a22add379-0",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-VOL5_ALL-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601000BR"
        },
        "ProgramElementTitle": {
            "val": "DTRA Basic Research"
        },
        "R1LineNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "288.938"
            },
            "PriorYear": {
                "val": "36.369"
            },
            "CurrentYear": {
                "val": "37.023"
            },
            "BudgetYearOne": {
                "val": "26.000"
            },
            "BudgetYearOneBase": {
                "val": "26.000"
            },
            "BudgetYearTwo": {
                "val": "25.500"
            },
            "BudgetYearThree": {
                "val": "24.500"
            },
            "BudgetYearFour": {
                "val": "24.000"
            },
            "BudgetYearFive": {
                "val": "24.481"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Basic Research for Countering WMD project, as the nation’s primary basic research portfolio solely dedicated to countering weapons of mass destruction (CWMD), is a core strategic investor in future scientific progress across the spectrum of the Defense Threat Reduction Agency's (DTRA) CWMD mission areas. This project concentrates on high risk, high-payoff research, leveraging world-class expertise in academia, government, and industry to increase the foundational body of scientific knowledge supporting DTRA’s Applied Research and Advanced Technology Development budget projects.\n\nThis project aligns with DTRA’s strategic objectives that support policy and planning guidance from the Office of the President, the Department of Defense (DoD), and the broader WMD threat reduction and consequence management communities. The portfolio addresses this guidance through S&T investments that support CWMD and reduce global nuclear dangers. Program managers drive interdisciplinary portfolios primarily drawing from physics, chemistry, biology, mathematics, and information and network sciences. The portfolios themselves are broadly focused on fundamental, exploratory research to support the development of: standoff radiological\/nuclear detection capabilities; countermeasures and defenses to non-traditional agents; nuclear detection in-depth understanding of the capabilities, values, intent, and decision making of potential adversaries, whether they are states, networks, or individuals; WMD agent defeat technologies; and biologically-based and -inspired materials for DoD applications.\n\nThis project maintains a robust, forward-looking portfolio targeting mission-focused research demonstrating scientific merit, technical quality, and the potential for breakthrough discoveries."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "37.201"
                },
                "CurrentYear": {
                    "val": "37.023"
                },
                "BudgetYearOne": {
                    "val": "37.229"
                },
                "BudgetYearOneBase": {
                    "val": "37.229"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "36.369"
                },
                "CurrentYear": {
                    "val": "37.023"
                },
                "BudgetYearOne": {
                    "val": "26.000"
                },
                "BudgetYearOneBase": {
                    "val": "26.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.832"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-11.229"
                },
                "BudgetYearOneBase": {
                    "val": "-11.229"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.832"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-11.229"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-11.229"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The decrease in FY 2020 is due to reduced investment in basic research to fund increased investment in technical reachback and quick reaction capabilities in Project RA-CWMD Cross-Cutting Technical and Information Sciences in Program Element 0603160BR.  The Basic Research portfolio was restructured to establish a University Partnership (UP) model with a new prioritization process. This process will focus novel UP research on high-priority CWMD gaps, to include energetics and reactives, nuclear data, weapons effects, materials science, machine learning, radiation biology, advanced analytics, and other critical areas.  This model reduces administrative burdens and increases technical collaboration with partners focused on current and emerging areas of interest thereby allowing for reduced investment in FY 2020."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "RU"
                    },
                    "ProjectTitle": {
                        "val": "Basic Research for Countering WMD"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "288.938"
                        },
                        "PriorYear": {
                            "val": "36.369"
                        },
                        "CurrentYear": {
                            "val": "37.023"
                        },
                        "BudgetYearOne": {
                            "val": "26.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "26.000"
                        },
                        "BudgetYearTwo": {
                            "val": "25.500"
                        },
                        "BudgetYearThree": {
                            "val": "24.500"
                        },
                        "BudgetYearFour": {
                            "val": "24.000"
                        },
                        "BudgetYearFive": {
                            "val": "24.481"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Basic Research for Countering WMD project, as the nation’s primary basic research portfolio dedicated to countering weapons of mass destruction (CWMD), is a core strategic investor in future scientific and technological progress across the full spectrum of the Defense Threat Reduction Agency's (DTRA's) mission areas. This project concentrates on high risk, high-payoff basic research, leveraging world-class expertise in academia, government, and industry, to increase the foundational body of scientific knowledge supporting DTRA’s Applied Research and Advanced Technology Development projects.\n\nThis project aligns with DTRA’s strategic objectives that support policy and planning guidance from the Office of the President, the Department of Defense (DoD), and the broader WMD threat reduction community. The portfolio addresses this guidance through capability enhancements, projects, and Science and Technology (S&T) investments that support CWMD and reduce global nuclear dangers. Specifically, they include: accelerating the development of standoff radiological\/nuclear detection capabilities; researching countermeasures and defenses to non-traditional agents; securing vulnerable materials; developing an in-depth understanding of the capabilities, values, intent, and decision making of potential adversaries, whether they are states, networks, or individuals; defeating WMD agents; researching biologically-based and inspired materials for DoD applications; and leveraging science, technology, and innovation through domestic and international partnerships and agreements.\n\nThis project solicits, coordinates, and conducts research to build a robust, forward-looking fundamental research portfolio targeting strategic, mission-focused, basic research with high potential impact for CWMD. The research projects are selected for scientific merit, technical quality, and the potential for innovation. Each research project offers opportunities to expand the knowledge base to help the warfighter, to bring to bear new science solutions with a fresh approach, or to leverage revolutionary approaches to technical surprise, building a foundation for future CWMD solutions. This research will enable new capabilities to: better understand the environment, threats and vulnerabilities; control, defeat, disable, and\/or dispose of WMD threats; and safeguard the force by managing consequences."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Project RU: Basic Research for Countering WMD"
                                    },
                                    "Description": {
                                        "val": "Project RU funds the exploration and discovery of fundamental scientific knowledge related to DTRA’s CWMD mission by research performers from academia, government, and industry."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "36.369"
                                            },
                                            "Text": {
                                                "val": "- Shape and oversee the CWMD Basic Research portfolio, comprised of approximately 150 active basic research awards on a three to five year cycle. This portfolio continues to address the DoD priority on CWMD science and technology, and supports specific priorities on Autonomy, Data-driven Decisions, Electronic Protection, System Resiliency and other emerging areas of interest.\n- Support world-class talent in WMD research at universities and laboratories to bolster the development of the future Science, Technology, Engineering, and Mathematics workforce.\n- Assess entire CWMD Basic Research portfolio on an annual basis.  \n- Assure progress toward technical objectives and support collaborative relationships within the scientific community through an annual technical review of each grant to assess scientific advancement.\n- Assess the focus and scope of the program related to CWMD challenges and assess the coordination of CWMD basic research across the DoD mission space and the broader basic research community to avoid duplication and ensure successful partnerships via an External Panel Review."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "37.023"
                                            },
                                            "Text": {
                                                "val": "- Manage and steer the CWMD Basic Research portfolio, comprised of approximately 150 active basic research awards on three- to five-year cycles. This portfolio continues to address DoD CWMD science and technology requirements, supporting specific priorities focused on current and emerging areas of interest.\n- Support collaborative relationships within the scientific community and ensure progress toward technical objectives through an annual technical review of each grant to assess scientific advancement.\n- Support the development of world-class talent in WMD research at universities and laboratories to foster the future Science, Technology, Engineering, and Mathematics (STEM) workforce.\n- Conduct an Internal Portfolio Review to assess the focus and scope of the portfolio related to CWMD challenges and assess the coordination of CWMD basic research across the DoD mission space and the broader basic research community to avoid duplication and ensure successful partnerships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.000"
                                            },
                                            "Text": {
                                                "val": "- Continue transition toward a university partnership model consisting of consortia focused on select topics. This model reduces administrative burdens and increases technical collaboration with partners focused on current and emerging areas of interest.\n- Strengthen collaborative relationships within the scientific community and ensure progress toward technical objectives through annual independent technical reviews.\n- Continue to support the long-term development of a world-class STEM workforce focused on CWMD research.\n- Continue to conduct an Internal Portfolio Review to assess the focus and scope of basic research related to CWMD challenges. Assess DTRA’s coordination of CWMD basic research across DoD and broader basic research community."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 is due to reduced investment in basic research to fund increased investment in reachback and quick reaction capabilities in Project RA-CWMD Cross-Cutting Technical and Information Sciences."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Procurement methods include competitive selection awards through university partnerships, DTRA’s Broad Agency Announcement, and collaborative funding through other organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Project performance is measured by the number of publications from active research projects, the number of students trained in science and engineering research supporting DTRA’s CWMD mission, the number of participating research organizations actively engaged in university partnerships, and the percentage of research projects transitioned to other programs for further development across DoD’s research and engineering enterprise."
                        }
                    }
                }
            ]
        }
    }
}