{
    "id": "2020-AirForce-PB-3600-MJBOOK-1-0-dae65ec315c4e8a6016da9aad32868ad9d723aca22c2ec6866c6d33ef17d1a4a-37",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-AIRFORCE_V1-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "1206730F"
        },
        "ProgramElementTitle": {
            "val": "Space Security and Defense Program"
        },
        "R1LineNumber": {
            "val": "68"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "41.385"
            },
            "CurrentYear": {
                "val": "45.542"
            },
            "BudgetYearOne": {
                "val": "56.385"
            },
            "BudgetYearOneBase": {
                "val": "56.385"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "56.414"
            },
            "BudgetYearThree": {
                "val": "68.759"
            },
            "BudgetYearFour": {
                "val": "79.703"
            },
            "BudgetYearFive": {
                "val": "80.686"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "41.385"
                },
                "CurrentYear": {
                    "val": "45.542"
                },
                "BudgetYearOne": {
                    "val": "46.453"
                },
                "BudgetYearOneBase": {
                    "val": "46.453"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "41.385"
                },
                "CurrentYear": {
                    "val": "45.542"
                },
                "BudgetYearOne": {
                    "val": "56.385"
                },
                "BudgetYearOneBase": {
                    "val": "56.385"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "9.932"
                },
                "BudgetYearOneBase": {
                    "val": "9.932"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "9.932"
                                },
                                "BudgetYearOneBase": {
                                    "val": "9.932"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY2020: increase of $9.932M for Adv Space Force Development"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "64A025"
                    },
                    "ProjectTitle": {
                        "val": "Space Protection Program"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "41.385"
                        },
                        "CurrentYear": {
                            "val": "45.542"
                        },
                        "BudgetYearOne": {
                            "val": "56.385"
                        },
                        "BudgetYearOneBase": {
                            "val": "56.385"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "56.414"
                        },
                        "BudgetYearThree": {
                            "val": "68.759"
                        },
                        "BudgetYearFour": {
                            "val": "79.703"
                        },
                        "BudgetYearFive": {
                            "val": "80.686"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This Program Element funds the Department of Defense (DoD)\/Air Force component of the Space Security and Defense Program (SSDP). The SSDP is a Joint DoD and Office of the Director of National Intelligence (ODNI) organization established to function as the center of excellence for options and strategies (materiel, non- materiel, cross-Title, cross-domain) leading to a more resilient and enduring National Security Space (NSS) Enterprise. The SSDP Operates under the authority of the Deputy Secretary of Defense (DEPSECDEF) and Principal Deputy Director of National Intelligence (PDDNI) to lead and collaborate on space protection vulnerability, susceptibility, and mitigation assessments of NSS services for the purpose of identifying, assessing, validating and introducing protection solutions into existing requirements, budgeting, acquisition, technology development and operational development processes. This unique mission provides an ongoing and crucial core protection competency that advances specific projects\/activities (including non-kinetic techniques) to deliver comprehensive, economical and actionable solutions for both programmatic and operational domains.\n\nThe SSDP scope spans multiple space missions and stakeholders including the DoD, Intelligence Community (IC), civil, commercial, and international space entities that support NSS missions in both peacetime and throughout all phases of conflict. It is focused on being responsive to NSS stakeholders in providing technical and operational assessments of emergent threat concepts, and developing near-term and far-term plans to address strategies, threats, and vulnerabilities. Specific SSDP Projects are structured\/designed to have an impact across all time horizons; near-term focused efforts to complicate adversary operations, mid-term focused efforts to improve system and enterprise survivability, and long-term focused efforts to render adversary capabilities ineffective.\n\nSpace acquisition must respond with speed and agility to emerging adversary threats. Space & Missile Systems Center (SMC) is transforming the organization and implementation of space acquisition to an enterprise approach, maximizing innovation and resiliency, leveraging international, commercial, and mission partnerships, and managing program\/project priorities according to an integrated unclassified\/classified enterprise space architecture. Expanding the appropriate acquisition authorities and contract mechanisms to deliver capability sooner, SMC will strategically execute experimentation, prototyping, risk reduction, and other efforts to develop new or repurpose capabilities.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver SSDP capability leading to a more resilient and enduring NSS enterprise.  The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 1206392F and 1206398F.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis effort is in Budget Activity 4, Advanced Component Development and Prototypes (ACD&P), because efforts are necessary to evaluate integrated technologies, representative modes or prototype systems in a high fidelity and realistic operating environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space Protection and Survivability"
                                    },
                                    "Description": {
                                        "val": "SSDP organizes, plans, and executes specific projects in three focus areas: Enterprise Capabilities & Solutions; Mission Area Protection Concepts & Architectures; and Operational Tactics, Experiments & Prototypes. Enterprise Capabilities & Solutions projects focus on identifying and advocating for NSS enterprise-level protection requirements and architecture updates\/modifications, informing\/assisting policy-makers and analyzing policy to enhance the space protection posture across the NSS Enterprise. Mission Area Protection Concepts & Architectures projects constitute Protect and Defend (P&D) efforts focused on specific mission areas and\/or systems. These projects entail the specific technical efforts, activities and engagements supporting capability and architecture development in mission areas such as Space Control, Command and Control (C2), Satellite Communication (SATCOM), Position-Navigation and Timing (PNT), Missile Warning (MW), Space Situational Awareness (SSA), Indications and Warning (I&W), and Intelligence - Surveillance - Reconnaissance (ISR). Finally, Operational Tactics, Experiments & Prototypes projects leverage operations expertise, experimentation and prototyping to improve operational capabilities and develop, refine, document and demonstrate Tactics, Techniques and Procedures (TTPs), Concepts of Operation (CONOPS), and associated C2 functions. Some of these projects hold the potential to leave-behind residual operational prototypes\/capabilities when partnered with the appropriate mission organization. Additionally, these projects will support development of TTPs and CONOPS for protection solutions developed by SSDP partners across the NSS Enterprise.  Projects in all three areas will include non-kinetic solutions for protecting specific capabilities and the NSS Enterprise."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "41.385"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "45.542"
                                            },
                                            "Text": {
                                                "val": "FY2019 activities will rapidly engage and provide timely, validated solutions throughout the year to high-priority DOD & IC space initiatives and evolving NSS Enterprise needs while maintaining focus on planned projects to address evolving threat and protection priorities to advance the spectrum of space protection and defense solutions at both system and enterprise levels.  The program will utilize in-depth technical analysis tailored modeling & simulation (M&S) and warfighter\/operator engagement along with other means\/methods as required to deliver actionable, timely and efficient protection solutions.  This includes the use of expanded in-house analytical capabilities (tailored\/adapted as necessary) and the fielding of high-fidelity M&S tools for additional space protection concepts, greater integration of physics-based tools into campaign-level models, and the employment of next-level analytical rigor essential for informing prototype selection and design to ensure the highest possible pay-off and mission impact.  Specific to FY2019, Enterprise Capabilities & Solutions projects will utilize the broad and robust physics-based M&S, engineering-based analysis, and campaign\/enterprise level rapid architecture analysis capabilities proved out during FY2018 to: 1) influence policy and guidance across the NSS enterprise and drive more resilient future architectures; 2) examine planned DoD & IC programs, experiments and demonstrations to provide program protection recommendations to preserve Blue capabilities; and 3) recommend architecture and policy solutions\/changes to enable the necessary C2 and optimize the deployment of new capabilities to deliver critical warfighting effects.  Finally, FY2019 Operational Tactics, Experiments & Prototypes projects will utilize in-house and mission-partner coordinated efforts to mature and shape CONOPS for programed and anticipated systems.  These projects will seek to incorporate C2, SSA and Space Control concepts, planned capabilities and TTPs into relevant\/targeted prototyping and experimentation activities.  Projects in this area will incorporate objectives to demonstrate Title 10\/50 space protection coordination, explore data fusion and, potentially, include the integration of commercial tools and services.  Continued expansion of SSDP concept development & visualization tools and prototypes into\/throughout FY2019 will provide the space C2 community toolsets to build, evaluate and select operational-level COAs (Courses of Actions).  SSDP will execute FY2019 projects with our mission partners both in-house and, when appropriate, in their facilities to ensure the best application and use of toolsets, expertise and technology.  These FY2019 projects will have the combined impact of continuing to mature and enhance the protection-oriented tools, policies, requirements and programs necessary to maintain and accelerate progress towards achieving resilience across the NSS community.  Increased FY2019 funding delivers the means to move forward with maturing the program's analysis and M&S capabilities to provide the fidelity and depth of analytic competency necessary to support the efficient and informed design, development and prototyping of protection-based alternatives and solutions.  In the face of an increasingly complex and contested space environment this increased capacity and capability is central to national space protection efforts and is a critical advancement for staying abreast and ahead of both current and next-generation threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "56.385"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "56.385"
                                            },
                                            "Text": {
                                                "val": "FY2020 projects will further the integration of DoD & IC space protection efforts through technical engineering-based analysis, modeling & simulation (M&S), and operator engagement to deliver targeted analysis, policy recommendations, and initiatives across the full spectrum of the program's chartered activities.  For FY2020 in support of Enterprise Capabilities & Solutions efforts the program will utilize Modeling, Simulation & Analysis (MS&A) tools to rapidly assess outcomes of integrated space and terrestrial scenarios for a variety of architectures to understand how protection options impact the outcome of a multi-domain scenario.  Design and execute demonstrations and changes necessary for tactically relevant SSA.  Integrate lower-cost, non-traditional data sources and determine their value for the protect and defend mission.  Conduct engineering and physics based M&S to inform selection of on-orbit demonstrations and develop the mission plan and correlating test objectives for the selected demonstrations.  Ensure activities track with National guidance on the proper protection for high profile next-generation, multi-mission, on-orbit experiments.  Additionally, in support of the Mission Area Protection Concepts & Architectures focus area, the program will demonstrate the capability to analyze mission specific architectures for their resilience attributes.  Develop a library of effective responses to adversary actions to speed decision making and improve response results for specific mission systems.  As well as provide resilience recommendations to program offices, and enterprise\/system requirements definition efforts in order to align resilience strategies with acquisition strategies.  Finally, for Operational Tactics, Experiments & Prototypes projects the program will develop force packages for Combatant Commanders providing them a first-of-its-kind ability to employ multiple options across all phases of conflict vs. specific adversary capabilities.  Leverage existing data-science software integration approaches to enable Operational Level Space C2 Course of Action (COA) planning and quantitative analysis of COA results, and demonstrate how this approach allows for quick prototyping of new tools, easy synchronization of existing tools, and risk reduction prior to transition of prototypes to programs of record.  Build a learning environment to rapidly close C2 technology knowledge gaps, develop a multi-domain C2 prototype\/test environment and identify\/refine C2 performance metrics and standards.  As well as develop Tactics, Techniques and Procedures (TTPs) to take full advantage of planned and programmed future capabilities along with the necessary technical detail to support their integration into Combatant Commander plans once fielded.  In addition to these and other planned activities, the program will utilize in-depth technical analysis, tailored M&S and warfighter\/operator engagement along with other means\/methods to deliver actionable, timely and efficient protection solutions in response to emerging and time-sensitive high-priority DoD & IC space initiatives and evolving NSS Enterprise needs.  These activities will frequently be executed with our mission partners, either in-house or in their facilities, to ensure the best application and use of toolsets, expertise and technology."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2020 increased compared to FY2019 by $9.932M due to funding of Adv Space Force Development and $911K for development of TTPs."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "All contracts funded in this program element will be awarded using competitive procedures to the maximum extent possible.  The program consists of numerous small projects."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Space Protection and Survivability"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "37.057"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "40.240"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "50.893"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "50.893"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Support and Infrastructure (Gov't PMA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.587"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.738"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.589"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.589"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Oversight, Advisory and other Technical Support (Contractor PMA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.741"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.564"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.903"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.903"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Space Protection and Survivability"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Enterprise Capabilities Solutions"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Mission Area Protection Concepts and Architectures"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Operational Tactics, Experiments and Prototypes"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}