{
    "id": "2020-DefenseLogisticsAgency-PB-0400-MJBOOK-0-0-1e647c413b24a5b4dff4ee0bb8975b28385192e916b243fc26cbddd6cc15d9dc-2",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-DLA-U_RDTE_MasterJustificationBook_Defense_Logistics_Agency_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Logistics_Agency_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603720S"
        },
        "ProgramElementTitle": {
            "val": "Microelectronics Technology Development and Support  (DMEA)"
        },
        "R1LineNumber": {
            "val": "52"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "480.635"
            },
            "PriorYear": {
                "val": "241.867"
            },
            "CurrentYear": {
                "val": "192.926"
            },
            "BudgetYearOne": {
                "val": "171.771"
            },
            "BudgetYearOneBase": {
                "val": "171.771"
            },
            "BudgetYearTwo": {
                "val": "156.427"
            },
            "BudgetYearThree": {
                "val": "159.082"
            },
            "BudgetYearFour": {
                "val": "169.077"
            },
            "BudgetYearFive": {
                "val": "172.651"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Department finds it critical to National Security to maintain an ability to produce low volume state-of-the-practice (SOTP) and legacy microelectronics that are unavailable from commercial foundries. The Defense Microelectronics Activity (DMEA) uniquely accomplishes this mission for the Department by providing a guaranteed and Trusted source of supply of microelectronics parts that are essential to combat operations. In addition DMEA provides the rare technology capability to bridge the gap between research and application allowing DMEA to develop, manage and implement innovative microelectronic solutions to enhance mission capability. This unique research and engineering capability will be leveraged to develop low-volume, high mix fabrication processes for state-of-the-art (SOTA) technologies that meet the Department’s performance and reliability needs.\n\nThis is a critical capability in an atmosphere of diminishing domestic semiconductor manufacturing capability and increasing worldwide supply chain risks with threats to defense microelectronics. Trusted access to SOTA technologies remains a major challenge and therefore it is most important to develop a long term Trusted source for the Department. Threats to Defense Microelectronics include counterfeiting, Trojan horses, specific reliability issues in military environments, and rapid obsolescence coming from an unpredictable and unsecured supply chain. As fiscal pressures force the Department to maintain its weapon systems longer than originally planned, extended combat use increases their attrition and increases the need for DMEA’s unique capabilities. \n\nMicroelectronics is a crucial technology and central for all operations within the Department. Yet, as vital as this technology is to Department operations, the defense market represents less than 0.1% share of the total global semiconductor market. The Department frequently requires low volume SOTP and legacy microelectronics long after commercial foundries have moved on to advanced technology levels. There is also the major challenge of the ability of Defense R&D Programs to access Trusted SOTA technologies when developing new systems. Consequently, the semiconductor industry does not respond to the Department’s particular needs of low volumes, long availability time frames, or its high-level security concerns. To meet these requirements, DMEA procures commercial licenses to organically produce semiconductor technologies that are no longer commercially manufactured or are unavailable due to no-bids owing to low volume requirements. These licenses enable DMEA to be the Department’s microelectronics supplier of last resort, providing the Department with a long-term, trusted, and guaranteed source of these critical parts. This proven model can be extended to SOTA technologies by acquiring advanced commercial process Intellectual Property (IP) and implementing it in a copy exact approach.\n\nDMEA provides increasingly rare microelectronics design and fabrication expertise to ensure that the Department can field systems capable of ensuring technological superiority over potential adversaries. DMEA provides decisive, quick turn solutions for defense, intelligence, special operations, cyber and combat missions as well as microelectronic components that are unobtainable in the commercial market. DMEA has established increased ties with the Intelligence Community (IC) and Combatant Commanders to understand their specific threats and opportunities that can be exploited by quicker, more resilient microelectronic solutions. This knowledge of varying requirements across a broad and diverse range of combatant environments and missions – along with its unique technical perspective – allows DMEA to develop, manage and implement novel microelectronic solutions to enhance mission capability. DMEA uses these cutting-edge technology capabilities and products in the solutions it develops for its military clientele. After many years of performing analogous efforts, the technical experience, mission knowledge, and practical judgment that are gained from preceding efforts are incorporated into subsequent technology maturation projects. DMEA has years of experience understanding the maturity of US and world microelectronics technology and knows what it takes to adapt the technology for the US warfighter. Based on the results of the knowledge DMEA acquires through technology forecasting, effective modeling\/simulation, prototyping and experimentation, DMEA influences program requirements with recommended improvements and advancements. DMEA’s capabilities make it a key tool that can be leveraged by the entire US Government in the intelligent and rapid development and application of advanced technologies to identified military needs. \n\nWorking alongside industry, DMEA utilizes a business model that establishes a pathway that accelerates the delivery of superior semiconductor technologies. DMEA’s uniquely flexible foundry supports the Department with a wide variety of integrated circuits using various processes that were developed by commercial manufacturers and which are now guaranteed to remain in one location for as long as they are needed. To obtain these processes, DMEA works closely with U.S. semiconductor industry partners to acquire process licenses. DMEA incorporates commercial technology, along with accelerated acquisition methods to accelerate delivery of needed capability. In this way, DMEA revolutionizes the way the Department leverages commercial technology by exploiting business-cycle opportunities to access these technologies. In this way, the government ensures perpetual access to this technology without bearing the high, upfront process development and qualification costs.\n\nThese Government-held licenses allow for the transfer to DMEA of industry-developed IP and the related processes for Department needs. These licenses ensure no commercial conflicts by including industry’s right to bid first on resulting production volumes. DMEA always looks to industry first to see if it can provide the required components. If industry cannot or will not, only then does DMEA provide the necessary prototypes and low volume production order. A critical element required to make this business model work effectively is protection of the industry partners’ valuable IP and processes. DMEA is Government owned and operated, providing the structure and confidence necessary to ensure them that their IP is protected from potential competitors. This strategic and cooperative industry partnership approach allows DMEA to use industry-developed IP and processes by acquiring, installing, and applying them toward meeting the immediate and long-term needs of the Department. This unique capability is essential to all major weapon systems, combat operations, and support needs. As such, DMEA serves the Department, other US Agencies, industry and Allied nations.\n\nDMEA assists hundreds of Department programs every year. DMEA has provided its specialized engineering assistance and capabilities to older systems, current systems, and even to programs not yet in the production phase. This includes the Counter-Rocket, Artillery, and Mortar (C-RAM) System, F-18 Super Hornet, F-22 Raptor, F-35, RQ-4 Global Hawk, MQ-9 Reaper, AEGIS Advanced Surface Missile System, Advanced Medium-Range Air-to-Air Missile (AMRAAM), HH-60G Pave Hawk Helicopter, Evolved Sea Sparrow Missile (ESSM), among many other programs. DMEA assists the Combatant Commands (COCOMs) including Special Ops, Cyber, Intelligence, and the Radiation-Hard communities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "219.803"
                },
                "CurrentYear": {
                    "val": "168.931"
                },
                "BudgetYearOne": {
                    "val": "172.442"
                },
                "BudgetYearOneBase": {
                    "val": "172.442"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "241.867"
                },
                "CurrentYear": {
                    "val": "192.926"
                },
                "BudgetYearOne": {
                    "val": "171.771"
                },
                "BudgetYearOneBase": {
                    "val": "171.771"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "22.064"
                },
                "CurrentYear": {
                    "val": "23.995"
                },
                "BudgetYearOne": {
                    "val": "-0.671"
                },
                "BudgetYearOneBase": {
                    "val": "-0.671"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "30.000"
                    },
                    "CurrentYear": {
                        "val": "30.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-7.936"
                    },
                    "CurrentYear": {
                        "val": "-6.005"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Fourth Estate IT Optimization Savings"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.278"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.278"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Inflation Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.393"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.393"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY2018 and FY2019 increases are for continued support of the top four FY2018 microelectronics initiatives, including full access to the GlobalFoundries Fab 8 (14 nm) foundry, associated upgrades to GlobalFoundries's ASIC design, tape-in, and test capabilities to facilitate 14 nm designs for weapon system program support (e.g., Military Global Positioning System (GPS) User Equipment (MGUE), and procurement of foundry process intellectual property. \n\nThe Small Business Innovation Research and Small Technology Transfer taxes amounted to $7.936 million and $6.005 million in FY2018 and FY2019 respectively. \n\nFY2020 baseline decreased in association with the Fourth Estate IT optimization savings as well as inflation adjustments for Civilian Pay."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "001"
                    },
                    "ProjectTitle": {
                        "val": "Technology Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "261.501"
                        },
                        "PriorYear": {
                            "val": "112.697"
                        },
                        "CurrentYear": {
                            "val": "71.819"
                        },
                        "BudgetYearOne": {
                            "val": "79.101"
                        },
                        "BudgetYearOneBase": {
                            "val": "79.101"
                        },
                        "BudgetYearTwo": {
                            "val": "58.429"
                        },
                        "BudgetYearThree": {
                            "val": "59.504"
                        },
                        "BudgetYearFour": {
                            "val": "60.439"
                        },
                        "BudgetYearFive": {
                            "val": "62.071"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Technology Development funds provide DMEA with the core resources to execute its primary mission of providing an in-house ability to quickly develop and execute appropriate solutions to keep a weapon system operational, elevate its sophistication level, or to meet new threats. These solutions use high mix, low volume, unique microelectronics that are endemic to military requirements but are not commercially available. These funds provide for the development and support necessary to ensure rapid prototyping, insertion, and support of microelectronics technologies into fielded systems, particularly as the technologies advance. Extending this mission to include assured access to Trusted state-of-the-art (SOTA) technologies will more comprehensively ensure the integrity of microelectronics in all critical defense systems. DMEA maintains critical microelectronics design and fabrication skills to ensure that the Department is provided with systems capable of ensuring technological superiority over potential adversaries. DMEA provides an in-house capability to support these strategically important microelectronics technologies with distinctive resources to meet the Department’s requirements across the entire spectrum of technology development, acquisition, and long-term support. This includes producing components to meet the Department’s requirements for ultra-low volume, an extended availability timeframe, and a trusted, guaranteed and secure supply of microelectronics. These funds provide basic infrastructure upgrades to acquire IP and manufacturing capabilities of SOTA technologies, including the CMOS9LP process as well as the technical services to ensure its successful installation via the copy exact model, as well as an in-house technical staff of skilled and experienced microelectronics personnel working in state-of-the-practice facilities providing technical and application engineering support for the implementation of advanced microelectronics research technologies from inspection and analysis through design, fabrication, test, assembly, integration and installation. These funds also provide for the recapitalization and modernization of aging microelectronic infrastructure, acquisition and implementation of design and test tools, the development of advanced techniques to inspect and analyze circuits, the adaptation of tools and processes to detect increasingly sophisticated counterfeit microelectronics in the defense supply chain, and the incorporation of the process technologies that are necessary to anticipate the needs of the Department as weapon system support requirements migrate toward current state-of-the-art technologies. DMEA’s capabilities make it a key resource in the intelligent and rapid application of advanced technologies to add needed performance enhancements in response to the newest asymmetric threats and to modernize aging weapon systems. DMEA designs, develops, and supports vital classified assets for ongoing and time-sensitive specialized intelligence operations and missions of the Department and the Special Operations Commands. \n\nToday’s weapon systems experience extended field operations and are required to remain in service beyond planned replacement schedules, driving the need for growth in DMEA’s unique capabilities. This need, along with the continual contraction of commercial resources, often makes DMEA the only available resource allowing many systems to remain operational."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Technology Development Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "112.697"
                                            },
                                            "Text": {
                                                "val": "DMEA will design, develop, and demonstrate microelectronics concepts, advanced technologies, and applications to solve operational problems. DMEA will apply advanced technologies to add performance enhancements in response to the newest asymmetric threats and to modernize aging weapon systems. The increased missions seen in the last several years by Combatant Commands (CCMDs) and Special Operations have caused those organizations to dramatically increase their demands for DMEA’s unique capability to provide quick technical solutions to immediate operational needs. To meet these increases, DMEA will add capacity and capability by recapitalizing and modernizing aging microelectronic infrastructure, extending and upgrading process IP, developing advanced techniques to inspect and analyze circuits, and adapting tools and processes to detect increasingly sophisticated counterfeit microelectronics to ensure a secure supply chain, all to meet quick turn solutions on which CCMDs and Special Operations can rely. DMEA will complete installation of the cleanroom in the 200mm facility, and will begin installation of semiconductor fabrication equipment in the completed cleanroom. DMEA will procure critical 200mm process IP for integration into the 200mm facility."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "71.819"
                                            },
                                            "Text": {
                                                "val": "DMEA will design, develop, and demonstrate microelectronics concepts, advanced technologies, and applications to solve operational problems and modernize key capabilities . DMEA will apply advanced technologies to add performance enhancements in response to the newest asymmetric threats and to modernize aging weapon systems. The increased missions seen in the last several years by Combatant Commands (CCMDs) and Special Operations have caused those organizations to dramatically increase their demands for DMEA’s unique capability to provide quick technical solutions to immediate operational needs. To meet these increases, DMEA will add capacity and capability by recapitalizing and modernizing aging microelectronic infrastructure, extending and upgrading process IP, developing advanced techniques to inspect and analyze circuits, and adapting tools and processes to detect increasingly sophisticated counterfeit microelectronics to ensure a secure supply chain, all to meet quick turn solutions on which CCMDs and Special Operations can rely. DMEA will complete installation of the cleanroom in the 200mm facility, and will begin installation of semiconductor fabrication equipment in the completed cleanroom. DMEA will start integration of the critical 200mm process IP into the 200mm facility."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "79.101"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "79.101"
                                            },
                                            "Text": {
                                                "val": "DMEA will design, develop, and demonstrate microelectronics concepts, advanced technologies, and applications to solve operational problems. DMEA will apply advanced technologies to add performance enhancements in response to the newest asymmetric threats and to modernize aging weapon systems. The increased missions seen in the last several years by Combatant Commands (CCMDs) and Special Operations have caused those organizations to dramatically increase their demands for DMEA’s unique capability to provide quick technical solutions to immediate operational needs. To meet these increases, DMEA will add capacity and capability by recapitalizing and modernizing aging microelectronic infrastructure, extending and upgrading process IP, developing advanced techniques to inspect and analyze circuits, and adapting tools and processes to detect increasingly sophisticated counterfeit microelectronics to ensure a secure supply chain, all to meet quick turn solutions on which CCMDs and Special Operations can rely. DMEA will continue installation of semiconductor fabrication equipment in the completed 200mm cleanroom. DMEA will continue integration of the critical 200mm process IP into the 200mm facility."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2020 program reflects a continuation in funding for FY2019 microelectronics initiatives, including the integration of 200mm foundry process intellectual property."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "003"
                    },
                    "ProjectTitle": {
                        "val": "Trusted Foundry"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "219.134"
                        },
                        "PriorYear": {
                            "val": "129.170"
                        },
                        "CurrentYear": {
                            "val": "121.107"
                        },
                        "BudgetYearOne": {
                            "val": "92.670"
                        },
                        "BudgetYearOneBase": {
                            "val": "92.670"
                        },
                        "BudgetYearTwo": {
                            "val": "97.998"
                        },
                        "BudgetYearThree": {
                            "val": "99.578"
                        },
                        "BudgetYearFour": {
                            "val": "108.638"
                        },
                        "BudgetYearFive": {
                            "val": "110.580"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department, other agencies, and the intelligence community require uninterruptible access to state-of-the-art design and manufacturing processes to produce custom integrated circuits designed specifically for military purposes. Under DoDI 5200.44, Application Specific Integrated Circuits (ASICs) in critical\/essential systems must be procured from Trusted sources in order to avoid altered or sabotaged parts. Worldwide competition from foreign, state-subsidized manufacturing facilities continues to greatly reduce the number of U.S. semiconductor fabrication facilities available to be Trusted sources. The prevalence of sophisticated offshore design and manufacturing facilities with economic incentives of state subsidies have resulted in the outsourcing of electronics component and integrated circuit services to these offshore facilities. This production capability is of increasing importance as domestic semiconductor manufacturing resources continue to decline, especially in the scarce domestic production capacity of high performance and state-of-the-art semiconductor technologies. Commercial sources of microelectronics remain inherently unpredictable and constitute a continued supply chain risk regardless of Government investment. This trend threatens the integrity and worldwide leadership of the U.S. semiconductor industry by eliminating many domestic suppliers and reducing access to Trusted fabrication sources for advanced technologies, and is of acute concern to the defense and intelligence communities. Secure communications and cryptographic applications, along with most other key defense technologies, depend heavily on high performance semiconductors where a generation of improvement often translates into significant force multipliers and capability advantages. Important defense technology investments and demonstrations carry size, weight, power, and performance goals that can only be met through the use of the most sophisticated semiconductors. \n\nThe Trusted Foundry program provides the Department with access to state-of-the-art microelectronics design and manufacturing capabilities with the added benefit of Trust, if necessary, to meet their confidentiality, integrity, availability, performance and delivery needs. The program also provides the Services and other agencies with a competitive cadre of accredited Trusted suppliers that can meet the needs of their mission critical\/essential systems for Trusted integrated circuit components. The Trusted Access Program Office has contracted with commercial sources to satisfy state-of-the-art semiconductor requirements. DMEA will foster all viable alternatives to continue the vital supply of Trusted microelectronics, including the work of the DMEA Trusted Access Program Office with commercial state-of-the-art industry, as well as the extension and implementation of key process technologies for trust at DMEA. It is imperative for a wide range of technologies in ongoing and future Department systems that access to Trusted suppliers continues. Most importantly, access to Trusted Microelectronics is absolutely necessary to meet secure communication and cryptographic needs requiring state-of-the-art semiconductor technologies."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Trusted Foundry"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "30.000"
                                        },
                                        "Text": {
                                            "val": "Sustained and accelerated capabilities to manufacture Trusted parts in accredited foundries. Developed and executed a long-term microelectronics modernization strategy for a specific case of DoD obsolescence as a pathfinder to diminish the occurrence of future obsolescence issues."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "30.000"
                                        },
                                        "Text": {
                                            "val": "Sustain and accelerate capabilities to manufacture trusted parts in accredited foundries."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Trusted Foundry"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "99.170"
                                            },
                                            "Text": {
                                                "val": "Facilitate the availability of Trusted state-of-the-art semiconductor technology to DoD weapon system programs, research organizations, and other federal agencies through the DMEA Trusted Access Program Office (TAPO) contracts. Initiate efforts to extend Trusted access to 14 nm technology, including the securing of mask manufacturing and upgrading of Trusted ASIC design and test capabilities and capacity to facilitate 14 nm ASIC services needed by multiple DoD programs. Enhance the cadre of Trusted suppliers for the critical trusted components and services needed for appropriate defense systems. Enhance Trusted Microelectronics products to include newly available leading edge technologies and other key specialty processes required by Department programs. Expand a line of trusted catalog components that can be purchased by Defense contractors. Continue activities that provide the Department's programs and other agencies with Trusted access to leading edge semiconductor technologies. Start implementation of an approach for the on-shore fabrication of a Trusted Field-Programmable Gate Array (FPGA). Continue the development of capabilities for the inspection and analysis of ASICs and continuously refine the utilized methods for efficiency, accuracy, and applicability to multiple processes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "91.107"
                                            },
                                            "Text": {
                                                "val": "Facilitate the availability of Trusted state-of-the-art semiconductor technology to DoD weapon system programs, research organizations, and other federal agencies through the DMEA Trusted Access Program Office (TAPO) contracts. Continue efforts to extend Trusted access to 14 nm technology for USG use through the TAPO contracts, and to provide access to other leading edge technologies. Enhance the cadre of trusted suppliers for the critical trusted components and services needed for appropriate defense systems. Enhance Trusted Microelectronics products to include newly available leading edge technologies and other key specialty processes required by Department programs. Expand a line of trusted catalog components that can be purchased by Defense contractors. Continue activities that ensure the Department has Trusted access to leading edge semiconductor technologies. Continue the development of new capabilities for the inspection and analysis of ASICs and continuously refine the utilized methods for efficiency, accuracy, and applicability to multiple processes. Implement a Trusted flow for new process technologies at DMEA."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "92.670"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "92.670"
                                            },
                                            "Text": {
                                                "val": "Facilitate the availability of Trusted and commercial state-of-the-art semiconductor technology to DoD weapon system programs, research organizations, and other federal agencies through the DMEA Trusted Access Program Office (TAPO) contracts. Continue efforts to extend Trusted access to 14 nm technology for USG use through the TAPO contracts, and to provide the Department and other USG-sponsored programs with access to this and other leading edge technologies. Enhance the cadre of trusted suppliers for the critical trusted components and services needed for appropriate defense systems. Enhance Trusted microelectronics products to include newly available leading edge technologies and other key specialty processes required by Department programs. Expand a line of trusted catalog components that can be purchased by Defense contractors. Continue activities that ensure the Department has Trusted access to leading edge semiconductor technologies. Continue the development of new capabilities for the inspection and analysis of ASICs and continuously refine the utilized methods for efficiency, accuracy, and applicability to multiple processes. Implement a Trusted flow for new process technologies at DMEA."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2020 program reflects a continuation in funding for FY2019 microelectronics initiatives, including access to the GlobalFoundries 14 nm foundry."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}