{
    "id": "2020-Army-PB-2040-JBOOK-6862ccffed1a667db11cb620e9184b2662501ed68aad7c3c768162a310d4d712-19",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605805A"
        },
        "ProgramElementTitle": {
            "val": "Munitions Standardization, Effectiveness and Safety"
        },
        "R1LineNumber": {
            "val": "195"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "65.709"
            },
            "CurrentYear": {
                "val": "72.279"
            },
            "BudgetYearOne": {
                "val": "44.458"
            },
            "BudgetYearOneBase": {
                "val": "44.458"
            },
            "BudgetYearTwo": {
                "val": "42.064"
            },
            "BudgetYearThree": {
                "val": "43.488"
            },
            "BudgetYearFour": {
                "val": "43.488"
            },
            "BudgetYearFive": {
                "val": "49.532"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "361.018"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) supports continuing technology investigations by providing a coordinated Tri-Service mechanism for the collection and free exchange of technical data on the performance and effectiveness of all non-nuclear conventional munitions and weapons systems in a realistic operational environment.  \n\nProject 296 - This Project will support research, development and testing to identify, characterize and resolve reliability, safety, storage and manufacturing issues that impact production availability and field use of demolitions, grenades, shoulder launched munitions, mines and mine clearing charges and pyrotechnics, including training realism.  Project will result in the development and demonstration of new, safe, reliable and environmentally acceptable munitions.\n\nProject 297 - Munitions Survivability & Logistics: This Project supports the future force by making Army units more survivable through the investigation, testing and demonstration of munitions logistics system improvements that prevent or minimize catastrophic explosive events and accelerate ammunition resupply. Key thrusts are munitions storage area survivability, Insensitive Munitions (IM) technology integration and compliance, ammunition management and asset visibility, weapon system rearm, munitions configured load enablers and advanced packaging and distribution system enhancements. Within each thrust, a broad array of solutions will be identified, tested, and evaluated against developed system measures of effectiveness. Optimum, cost effective and efficient solutions that enable the rapid projection of lethal and survivable forces will be demonstrated. The early stages of force deployment are especially critical. Theater ammunition storage areas are vulnerable and present the enemy with lucrative targets. These areas and distribution nodes contain the only available munitions stocks in theater. Loss of these munition stocks could cripple the force, jeopardize the mission, and result in high loss of life. This Project mitigates vulnerabilities and ensures a survivable fighting force.\n\nProject 857 - DoD Explosives Safety Standards: This Project supports the Research, Development, Test, and Evaluation efforts of the Department of Defense (DoD) Explosive Safety Standards Board. It supports explosive safety effects research and testing to quantify hazards and to develop techniques to mitigate those hazards in all DoD manufacturing, testing, transportation, maintenance, storage, disposal of ammunition and explosives operations, and also to develop risk based explosives safety standards. Results are essential to the development and improvement of quantity-distance standards, hazard classification procedures, cost effective explosion-resistant facility design procedures, and personnel hazard\/protection criteria.\n\nProject 858 - Army Explosives Safety Management Program: This Project establishes, validates or modifies explosives technical safety requirements per Department of Defense Manual 6055.09 and Department of the Army Pamphlet 385-64, Ammunition and Explosives Safety Standards. Project activities promote Research, Development, Test, and Evaluation (RDTE) of new and innovative explosives safety technologies that improve the survivability of Army personnel, facilities, and equipment as well as improve the health, safety and welfare of the general public (with highest priority directed to combat theater of operations).\n\nProject 859 - Life Cycle Pilot Process: This Project supports the implementation of the Single Manager for Conventional Ammunition (SMCA) Industrial Base Strategic Plan through technology investigations, model based process controls, pilot prototyping, and industrial assessments. It will assess life cycle production capabilities required for all ammunition families, address design for manufacturability to facilitate economical production, identify industrial and technology requirements, and address the ability of the production base to rapidly and cost effectively produce quality products. Cost reduction is an important part of the Life Cycle Pilot Process (LCPP). LCPP provides the resources to prototype critical technologies and develop the knowledge base to establish cost effective, environmentally safe and modern production processes in support of the munitions Industrial Base transformation. In addition, the LCPP program addresses Single Point Failures (SPFs) \/ No Source of supply within the National Technology Industrial Base (NTIB). LCPP provides support to reduce supply chain risk by investigating, developing and evaluating additional sources of supply for a known SPF.\n\nProject F21: The North Atlantic Treaty Organization (NATO) Ammunition Evaluation program funding ensures interchangeability of direct fire ammunition and weapons among all the NATO countries with all of the associated logistic, strategic and tactical advantages of the alliance. The Project involves development and testing compliance of NATO standardization agreements (STANAGS) and staffing of the North American Regional Test Center (NARTC). In addition, this Project supports small caliber ammunition, 40mm grenade munitions, medium caliber cannon ammunition, and large caliber ammunition enhancements to lethality, effectiveness, survivability, accuracy, and general product improvements. This Project also supports the standardization and interchangeability of legacy and new production U.S. weapons and ammunition with Allied Nations to maximize battlefield interchangeability\/compatibility under the auspices of the international Joint Ballistics Memorandum Of Understanding (JBMOU). Maximizing standardization, interchangeability, and exportability will also potentially increase Foreign Military Sales (FMS) of U.S. indirect fire Weapon and Munition products to support United States industrial base production and affordable Department of Defense pricing through increased economies of scale. FY 2020 funding will support NATO and JBMOU artillery and small arms ammunition interchangeability group meetings, documentation, and test operations.  \n\nProject F24: Conventional Munitions Demilitarization (Demil): The Conventional Munitions Demilitarization technology Project supports the Single Manager for Conventional Ammunition (SMCA) responsibility per Department of Defense Instruction (DoDI) 5160.68 to plan, program, budget and fund a Joint Service Research and Development (R&D) program that develops capability and capacity as well as technology and facilities to support the SMCA mission to demil and dispose of conventional ammunition stored in the SMCA Resource, Recovery and Disposition Account (B5A).  The program goals include SMCA efforts to increase efficiencies and effectiveness to reduce the demil stockpile; reduce processing costs including packaging, handling and crating; and increase capacity through improved demilitarization capabilities and processes. Project F24 includes activities: (1) to establish requirements and develop processes to focus investments, assess capabilities, analyze alternatives, and recommend and implement R&D projects; (2) to improve products and processes that support existing capabilities; (3) to develop or improve demil methods and processes related to advance the primary demilitarization core thrust areas of destruction, disassembly, removal, resource recovery and recycling, and waste stream treatment; (4) to ensure safe and environmentally acceptable demil operations; (5) to transition R&D products to United States Army depots or plants as well as commercial facilities performing demil; and (6) to mitigate risk and close-out project activities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "43.444"
                },
                "CurrentYear": {
                    "val": "42.332"
                },
                "BudgetYearOne": {
                    "val": "44.269"
                },
                "BudgetYearOneBase": {
                    "val": "44.269"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "65.709"
                },
                "CurrentYear": {
                    "val": "72.279"
                },
                "BudgetYearOne": {
                    "val": "44.458"
                },
                "BudgetYearOneBase": {
                    "val": "44.458"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "22.265"
                },
                "CurrentYear": {
                    "val": "29.947"
                },
                "BudgetYearOne": {
                    "val": "0.189"
                },
                "BudgetYearOneBase": {
                    "val": "0.189"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.036"
                    },
                    "CurrentYear": {
                        "val": "-0.053"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "29"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "30"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-5"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.699"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.189"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.189"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Fiscal Year (FY) 2018 increase includes $29.000 million in congressional adds for: polymer cased small arms ammunition ($5.000 million); and Life Cycle Pilot Process ($5.000 million); and two Program Increases ($5.000 million, $14.000 million).\nFY19 increase includes $30.000 Million in Congressional Adds for: transformative technologies for propulsion manufacturing processes ($11.000 million); industrial base resiliency ($5.000 million); life cycle pilot processes ($10.000 million); and polymer cased small arms ammunition ($4.000 million)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "296"
                    },
                    "ProjectTitle": {
                        "val": "Close Combat Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "5.087"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.087"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "ProjectNumber": {
                        "val": "297"
                    },
                    "ProjectTitle": {
                        "val": "Mun Survivability & Log"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.985"
                        },
                        "CurrentYear": {
                            "val": "31.637"
                        },
                        "BudgetYearOne": {
                            "val": "15.595"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.595"
                        },
                        "BudgetYearTwo": {
                            "val": "16.362"
                        },
                        "BudgetYearThree": {
                            "val": "17.062"
                        },
                        "BudgetYearFour": {
                            "val": "17.04"
                        },
                        "BudgetYearFive": {
                            "val": "17.247"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "130.928"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports the future force by making Army units more survivable through the investigation, testing and demonstration of munitions logistics system improvements that prevent or minimize catastrophic explosive events and accelerate ammunition resupply. Key thrust areas are munitions storage area survivability, Insensitive Munitions (IM) technology integration and compliance, ammunition management and asset visibility, weapon system rearm, munitions configured load enablers and advanced packaging and distribution system enhancements. Within each thrust area, a broad array of solutions will be identified, tested, and evaluated against developed system measures of effectiveness. Optimum, cost effective and efficient solutions that enable the rapid projection of lethal and survivable forces will be demonstrated. The early stages of force deployment are especially critical. Theater ammunition storage areas are vulnerable and present the enemy with lucrative targets. These areas and distribution nodes contain the only available munitions stocks in theater. Loss of these munition stocks could cripple the force, jeopardize the mission, and result in high loss of life. This Project mitigates vulnerabilities and ensures a survivable fighting force."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Congressional Add - Navy Polymer cased small arms ammunition"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "15"
                                        },
                                        "Text": {
                                            "val": "Congressional Add - Navy Polymer cased small arms ammunition"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Munitions Predictive Life"
                                    },
                                    "Description": {
                                        "val": "This activity will demonstrate technologies and algorithms that can help assess munitions serviceability based upon aggregate environmental exposures, system cycling and munition degradation models. The activity will provide life cycle management tools for risk mitigation strategies, while reducing testing, inspection & surveillance required as well as improving weapon system reliability and warfighter effectiveness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.514"
                                            },
                                            "Text": {
                                                "val": "Conducted qualification safety testing of a next generation ammunition container based temperature\/humidity exposure reliability sensor and completed data integration into Munitions History Program (MHP) and Stockpile reliability program Quality Assurance Specialist Ammunition Surveillance User Inspection Device. Conducted prototype engineering testing of a Multi Frequency Sensor Suite that will monitor munitions exposure to ambient radiation over their lifecycle for improved reliability knowledge. Conducted correlation testing on the passive time\/temperature exposure sensor with legacy ammunition items and integrate. Conducted market survey of passive Radio Frequency Identification and low cost active environmental sensors for legacy munitions, select viable candidates, and test. Integrated passive propellant temperature sensor with fire control systems and processes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.378"
                                            },
                                            "Text": {
                                                "val": "Conduct qualification safety testing of an integrated second generation prototype next generation ammunition container based temperature\/humidity exposure reliability sensor. Conduct qualification testing of a Multi Frequency Sensor Suite that will monitor munitions exposure to ambient radiation over their lifecycle for improved reliability knowledge. Conduct correlation testing on the passive time\/temperature exposure sensor with legacy ammunition items and integrate. Conduct market survey of passive Radio Frequency Identification and low cost active environmental sensors for legacy munitions, select viable candidates, and test.  Integrate passive propellant temperature sensor with fire control systems and processes.  Incorporate automation friendly health monitors into automation supply point - scalable and continue integration testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.26"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.26"
                                            },
                                            "Text": {
                                                "val": "Demonstrate concept of operations of an integrated second generation ammunition container based temperature\/humidity exposure reliability sensor.  Demonstrate Multi Frequency Sensor Suite in a training environment that will monitor exposure to ambient radiation over their lifecycle with legacy ammunition items.  Support qualification testing and required modifications of passive time\/temperature exposure sensor.  Conduct additional correlation testing on legacy ammunition items to prepare for broader stockpile integration.  Conduct market survey of passive Radio Frequency Identification and low cost active environmental sensors for legacy munitions, select and test viable candidates.  Conduct sensitivity analysis of near-real time propellant temperature on ballistic solutions.  Incorporate munition monitoring technologies into demonstrations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 funding level is lower than FY 2019 because multiple efforts are transitioning."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Insensitive Munitions (IM) Integration Program"
                                    },
                                    "Description": {
                                        "val": "Demonstrate multiple IM technologies and integrate into end item(s) to improve munitions survivability and warfighter safety. IM Technologies, using State-of-the-Art materials, will be developed in the areas of warhead, propulsion and propellants, explosives, packaging, and barriers. In addition, modeling and simulation will be used to reduce development and testing costs. Efforts will increase the number of IM compliant ammunition items fielded to mitigate munitions reaction to unplanned stimuli such as fire, fragments, enclosed heat build-up (cook-off), bullets, adjacent munitions reaction (sympathetic detonation), and shape charge jet attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.046"
                                            },
                                            "Text": {
                                                "val": "Continued to conduct integration testing of 30mm M788\/M789 IM technologies and planned transition to Project Manager Maneuver Ammunition Systems (PM-MAS). Validated reduced-sensitivity and high performance explosives in small and medium caliber munitions systems. Optimized the use of nano-energetic materials as reduced-sensitivity but high-output main fill explosives and boosters in small and medium caliber munition systems. Validated the use of high-energy output and reduced-sensitivity 3,4-dinitropyrazole (DNP) explosive in hand grenades and optimized booster configurations to accommodate enhanced fuzes. Continued to optimize the use of new packaging and dunnage materials that actively attract or pull heat away from vulnerable munition components in case of fire."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.321"
                                            },
                                            "Text": {
                                                "val": "Transition improvements from High Shear Mix project to qualified propellant materials to produce high-performing propellants with better fragment impact (FI) responses. Validate novel propellant technologies in medium and large caliber munitions to reduce hazards from FI threat. Demonstrate novel packaging heat management materials in mortars systems to delay catastrophic responses in Slow Cook Off (SCO) conditions. Validate packaging configurations that eliminate mass detonation events in tightly-packed medium caliber munitions. Optimize granulated melt-pour energetics to reduce mass-detonation hazards of tightly-packed medium caliber munitions while maintaining high-energy output."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.745"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.745"
                                            },
                                            "Text": {
                                                "val": "Conduct end item testing of a high energy pressed explosives to replace Comp A5 to reduce the reaction violence from shock and slow heating.  Continue development of medium caliber, foamed celluloid cartridge cases to create a novel venting solution for shock and thermal events.  Conduct fragment impact testing on new igniter formulations to replace Benite in 120mm tank munitions.  Perform IM testing on the M433E1 to integrate technologies for warhead and packaging venting along with impact mitigation technologies.  Continue optimization of plastic packaging containers for large caliber munitions to mitigate both fast and slow cook-off events."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 funding level is higher than FY 2019 due to anticipated increases in labor and testing costs."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved Munitions Packaging"
                                    },
                                    "Description": {
                                        "val": "This activity will demonstrate upgrades to existing packaging components and materials to improve legacy ammunition survivability. These upgrades will enhance ammunition survivability and reliability, improve field ammunition operations, and improve packaging."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.551"
                                            },
                                            "Text": {
                                                "val": "Developed prototypes and conducted sequential rough handling and environmental testing for the injection molded cylindrical container that integrates it for use with the M829A4 120mm tank and 120mm mortar munitions. Developed prototypes and conducted sequential rough handling and environmental testing for the plastic rectangular container to integrate it for use with legacy 5.56 small caliber ammunition. Developed several concepts geared to lighten the load and down selected concepts thru modeling and simulation and analysis.  Performed final hazard classification testing on M6 and M7 blasting cap container design with Mycofoam. Fully implemented Mycofoam as replacement dunnage design option for M6 and M7 blasting cap packaging design as part of the eco-friendly program. Conducted engineering and prototype testing of a small caliber ammunition bulk packaging container for improved distribution efficiency."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.076"
                                            },
                                            "Text": {
                                                "val": "Conduct verification testing on injection molded cylindrical container that integrates it for use with the M829A4 120mm tank and 120mm mortar munitions. Conduct verification testing for the plastic rectangular container to integrate it for use with legacy 5.56mm small caliber ammunition. Produce prototypes geared to ?lighten the load? and perform in-house engineering tests to validate.  Perform final hazard classification testing on M6 and M7 blasting cap container design with Mycofoam.  Conduct verification testing of a small caliber ammunition bulk packaging container for improved distribution efficiency. Facilitate implementation of new bulk container at LCAAP and identify other potential small caliber ammunition bulk container candidates.  Conduct developmental testing of the initial plastic mortar container prototype for use with all families of mortars.  Perform rough handling, drop testing, and other developmental testing on the rapid access container consolidator."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.133"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.133"
                                            },
                                            "Text": {
                                                "val": "Develop prototypes and perform engineering testing for the Rapid Access Container Consolidator (RACC) program for M2A2 containers.  Perform engineering and verification testing on the Bulk Pack Container program for 7.62MM linked ammunition and continue to facilitate implementation of new design with LCAAP.  Continue to conduct verification testing on injection molded cylindrical container for integration with the M829A4 120mm tank ammunition. Conduct qualification testing for the plastic rectangular container to integrate it for use with legacy 5.56mm small caliber ammunition. Conduct engineering and prototype testing on injection molded plastic mortar container for integration with 120mm mortar munitions.  Conduct engineering testing on the lightweight M2A2 container as part of the Lighten the Load program for use on small caliber ammunition."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 funding level is lower than FY 2019 because multiple efforts are transitioning."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ammo Provider"
                                    },
                                    "Description": {
                                        "val": "This activity demonstrates technologies that will assure a survivable munitions logistics system by increasing distribution velocity and protecting ammo storage areas. Technology areas to be investigated include ammunition asset visibility (including environmental sensors, marking technologies, and supply chain modeling), ammunition management (including improvements in stockpile surveillance and condition based management), sustainment (including pre-configured loads (soldier to unit size), field ammo reconfiguration capability, robotic handling, and improved load building capability), and force protection (including site planning software and field storage protection)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.874"
                                            },
                                            "Text": {
                                                "val": "Conducted Phase 1 demonstration of the enhanced speedbag with the Tactical Resupply Unmanned Aerial System ? Competitive (TRUC). Completed the design of a graphical user interface for the Ammunition Quality Decision Tool and conduct user evaluation of tool effectiveness. Completed Joint Modular Intermodal Container (JMIC)\/container Analysis of Alternatives and transition alternative prototype. Implemented software requirements for operating Expeditionary Munitions Survivability Software (EMSS) in a disconnected state. Added basic site surveying capability with a mobile hardware device. Expanded Configured Load Building Tool (CLBT) prototype capabilities to determine and visualize loads at the sub-pallet level on set of defined standard transportation conveyances. Matured 5K forklift and Rough Terrain Container Handler (RTCH) automation kit prototypes to include integration of maintenance and troubleshooting aids and conduct validation testing. Integrated applique interface kit for manually operated Material Handling Equipment (MHE) into the 5K forklift and RTCH, implemented software control subsystems, and performed subsystem testing. Conducted engineering and user testing of the automated pallet scanning and weighing system. Developed software links to Automated Supply Point-Scalable (ASP-S) for data transmission. Completed design for an integrated round counting sensor device that enables automatic capturing of fired ammunition data from weapon systems to facilitate anticipatory resupply. Completed requirements analysis and update design architecture of the Class V Adaptive Demand Estimation System (CADES) that will permit intelligent, anticipatory ammunition management on the battlefield with the ability to monitor consumption and supply node stock levels for forward warfighting units. Modified as necessary and conducted demonstration of the CADES prototype to provide theater level stockage objective to meet anticipated demand. Supported continued use of the Distribution & Retrograde APEX Management (DRAM) prototype in operational demonstrations. Completed the design of a multi-modal supply pallet that minimized the requirement for handling and reconfiguration of cargo in transit."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.252"
                                            },
                                            "Text": {
                                                "val": "Demonstrate multiple enablers including Ammunition Quality Decision Tool, Configured Load Building Tool, MHE applique interface kit and CADES as parts of an integrated ammunition scenario within ASP-S. Develop the design concept and down select sensor and scanning hardware for an automated truck scanning capability to enable conveyance level transfer of accountability and autonomous inspections of transported cargo in the ASP-S. Develop the design concept and down select platform, sensor and scanning hardware for a yard mule transport capability to enable local autonomous lift capability during the consolidation and put-away processes within the ASP-S.  Perform engineering evaluation of an integrated round counting sensor device that enables automatic capturing of fired ammunition data from weapon systems to facilitate anticipatory resupply. Support continued use of DRAM and the Class V Adaptive Demand Estimation System (CADES) prototypes in operational demonstrations.  Perform validation and verification testing for an integrated round counting sensor device that enables automatic capturing of fired ammunition data from weapon systems to facilitate anticipatory resupply.  Develop artificial intelligence concepts and apply to ammunition handling activities such as turn in and retrograde operations. Conduct operational assessment of expeditionary MSS enhancements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.457"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.457"
                                            },
                                            "Text": {
                                                "val": "Demonstrate multiple improved ammunition logistics enablers including Ammunition Quality Decision Tool, Configured Load Building Tool, MHE interface kit and Class V Adaptive Demand Estimation System (CADES), integrated through Cognitive Automated Supply Point Enhanced Robotics (CASPER), within Automated Supply Point-Scalable (ASP-S).  Perform testing and initial user assessment for continued development of integrated round counting sensor device.  Facilitates anticipatory resupply by enabling automatic reporting of quantity and type of fired ammunition through signature analysis from small and medium caliber weapon systems.  Support continued development and field trials of Distribution and Retrograde Adaptive planning and execution Management (DRAM) and CADES prototypes through operational demonstrations.  Develop artificial intelligence and mechanical systems to facilitate the turn in, inspection, and retrograde of small to medium caliber ammunition in forward tactical environments. Continue development and conduct incremental operational assessment of expeditionary Munitions Survivability Software (eMSS) enhancements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor program adjustment"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR\/STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.61"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR\/STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR\/STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "857"
                    },
                    "ProjectTitle": {
                        "val": "DoD Explosives Safety Standards"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.889"
                        },
                        "CurrentYear": {
                            "val": "1.84"
                        },
                        "BudgetYearOne": {
                            "val": "1.858"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.858"
                        },
                        "BudgetYearTwo": {
                            "val": "1.892"
                        },
                        "BudgetYearThree": {
                            "val": "1.93"
                        },
                        "BudgetYearFour": {
                            "val": "2.023"
                        },
                        "BudgetYearFive": {
                            "val": "1.984"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "13.416"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports continuing technology investigations related to Explosives Safety Standards. It provides a coordinated Tri-Service mechanism for the collection and free exchange of technical data on the performance and effectiveness of all non-nuclear conventional munitions and weapons systems in a realistic operational environment.\n\nThis Project supports the Research, Development, Test, & Evaluation (RDTE) efforts of the Department of Defense (DoD) Explosive Safety Standards Board. It supports explosive safety effects research and testing to quantify hazards and to develop techniques to mitigate those hazards in all DoD manufacturing, testing, transportation, maintenance, storage, disposal of ammunition and explosives operations, and also to develop risk based explosives safety standards. Results are essential to the development and improvement of quantity-distance standards, hazard classification procedures, cost effective explosion resistant facility design procedures, and personnel hazard\/protection criteria."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Explosive and Munitions Tests"
                                    },
                                    "Description": {
                                        "val": "Testing aimed at solving practical problems and increasing predictability of the effects of explosions and impacts on people, materials and structures. Additionally, testing provides data on the interaction of explosives in various configurations. Testing results are used to improve predictability of effects from explosive incidents and improve criteria to protect people, structures and the environment from the damaging effects of DoD munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.137"
                                            },
                                            "Text": {
                                                "val": "Research and planning for in-process (out-of-package) hazard classification testing, modeling and simulation program conducted; gaps in current testing methods identified and current industry test methods researched; technical results will ensure hazards from explosives in manufacturing and operating facilities are correctly identified and mitigated. Test planning completed for convective combustion experiments to address loading density versus vent area ratio; test results will validate combustion model with regard to time-dependent combustion characteristics, leading to definition of parameters to be considered for storage of HD 1.3 explosives. Finalized planning for earth-covered magazine test program to identify blast loads at inter-magazine distances, effects of reduced earth cover, and debris hazards at inhabited building distances; results will be incorporated into DoDM 6055.09."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.056"
                                            },
                                            "Text": {
                                                "val": "Continue testing of laboratory quantities, potential partnering effort for testing of underwater shock effects, further maturation of HD 1.3 testing and scaled testing of earth-covered magazines to determine blast pressures at intermagazine distance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.117"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.117"
                                            },
                                            "Text": {
                                                "val": "Conduct scaled and full-scale testing of earth-covered magazines, and continue test program to characterize thermal\/combustion hazards in explosives storage and operating facilities and develop models to predict these hazards."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increase for full-scale testing of earth-covered magazines."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Explosive Safety Standards (ESS) Implementation Methodologies & Tools"
                                    },
                                    "Description": {
                                        "val": "Provide tools to support site planning and risk assessment in the garrison and contingency environments. Provide tools and improvements for UFC 3-340-02 and Substantial dividing wall criteria. Provide methodologies and tools to perform site-specific analyses, databases for critical explosives safety information, and standardized designs to reduce design costs. Develop models to predict response for large scale explosion effects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.4"
                                            },
                                            "Text": {
                                                "val": "Completed coupled computations of the Kasun series tests, and 90% complete for Singaporean 2\/5 scale earth-covered magazine tests; if computational results validate the model?s accuracy, the model can then be used to predict the effects of explosions on other protective construction designs. Update of the Explosives Safety Siting (ESS) software to include risk analysis tools complete and software testing underway. Architecture definition for transition of ESS to a web-based application in work."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.375"
                                            },
                                            "Text": {
                                                "val": "Will continue effort on harmonization with NATO and UN policy resulting in seamless NATO and multi-national operations. Initial phase of work to develop more refined secondary debris hazards from explosives storage buildings."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.389"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.389"
                                            },
                                            "Text": {
                                                "val": "Finalize transition of ESS to web hosting, with full capability for quantity-distance and risk-based siting of explosives facilities DoD-wide. Develop expanded suite of tools to meet diverse needs of the DoD explosives safety community."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Finalizing transition of ESS to web hosting."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Standard Development & Improvement"
                                    },
                                    "Description": {
                                        "val": "Improve and revise all DoD Explosives Safety Standards (for hazard classification, quantity distance, and protective construction) to keep them current with changing technology and incorporate knowledge gained from the testing program. Shape and leverage with international community (NATO & UN). Develop Advanced (e.g. risk-based) siting criteria."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.352"
                                            },
                                            "Text": {
                                                "val": "Structural computations of legacy Type I and II flat-roof earth-covered magazines in work; results will be compared to UFC 3-340-02 blast load requirements to determine appropriate explosives safety criteria to apply to existing magazines of this design. Using Monte Carlo simulations for uncertainty analysis of explosives risk prediction algorithms, and updating probability of explosives event values based on accident data; both of which will be used to improve risk-based siting standards and models."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.35"
                                            },
                                            "Text": {
                                                "val": "Develop tools & models required to calculate, estimate and predict explosives safety hazards, associated standoff distances, fragmentation distribution, personnel risks and other parameters. Additionally tools are required to develop and maintain explosives safety site plans."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.352"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.352"
                                            },
                                            "Text": {
                                                "val": "Pursue update of NATO criteria to better address debris and thermal hazards from explosives, as indicated by results of multi-year US test and modeling programs. Incorporate test results of earth-covered magazine blast load testing into DoDM 6055.09 and UFC 3-340-02."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "To pursue update of NATO criteria."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY19 SBIR\/STTR adjustment"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.059"
                                            },
                                            "Text": {
                                                "val": "FY19 SBIR\/STTR adjustment"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 SBIR\/STTR adjustment"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "858"
                    },
                    "ProjectTitle": {
                        "val": "Army Explosives Safety Management Program"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.042"
                        },
                        "CurrentYear": {
                            "val": "0.991"
                        },
                        "BudgetYearOne": {
                            "val": "1.011"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.011"
                        },
                        "BudgetYearTwo": {
                            "val": "1.03"
                        },
                        "BudgetYearThree": {
                            "val": "1.047"
                        },
                        "BudgetYearFour": {
                            "val": "1.079"
                        },
                        "BudgetYearFive": {
                            "val": "1.076"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "7.276"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project establishes, validates or modifies explosives technical safety requirements per Department of Defense Pamphlet 385-64, Ammunition and Explosives Safety Standards. Project activities promote Research, Development, Test, & Evaluation (RDTE) of new and innovative explosives safety technologies that improve the survivability of Army personnel, facilities, and equipment as well as improve the health, safety and welfare of the general public. FY20 funding will support continued testing, validation, and regulatory integration for permanent, temporary and  mobile ammunition & explosives (A&E) facilities as well as operations. The Defense Ammunition Center\/US Army Technical Center for Explosives Safety (DAC\/USATCES) will team with and sponsor agencies (Joint Service, Academia, and Contractor) to improve the effectiveness of identifying, analyzing, and apply risk acceptance to A&E environments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Risk based explosives safety criteria"
                                    },
                                    "Description": {
                                        "val": "Development of risk based explosives safety criteria that will aid commanders and safety personnel in the transition from regulation to risk management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.15"
                                            },
                                            "Text": {
                                                "val": "Continued explosives testing and support of hazard research and exposure consequences."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.1"
                                            },
                                            "Text": {
                                                "val": "Continuing explosives testing and support of hazard research and exposure consequences."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.15"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.15"
                                            },
                                            "Text": {
                                                "val": "Will continue explosives testing and support of hazard research and exposure consequences."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase due to within-Project re-prioritization based upon holistic program assessment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Development of enhanced protective structure designs"
                                    },
                                    "Description": {
                                        "val": "Develop enhanced protective structure designs that improve the survivability of Army personnel, facilities and equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.425"
                                            },
                                            "Text": {
                                                "val": "Continued explosives testing and support for improving protective construction designs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.725"
                                            },
                                            "Text": {
                                                "val": "Continuing explosives testing and support for improving protective construction designs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.611"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.611"
                                            },
                                            "Text": {
                                                "val": "Will continue explosives testing and support for improving protective construction designs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decrease due to within-Project re-prioritization and adjustment for inflation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Development of explosive safety tools"
                                    },
                                    "Description": {
                                        "val": "Develop explosive safety tools for use by Army personnel. Explosive safety tools allow commanders and safety personnel to make explosive safety decisions using risk management methodologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.467"
                                            },
                                            "Text": {
                                                "val": "Continued development of new methods and tools for risk assessment to improve explosive safety risk management decisions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.134"
                                            },
                                            "Text": {
                                                "val": "Continuing development of new methods and tools for risk assessment to improve explosive safety risk management decisions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.25"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.25"
                                            },
                                            "Text": {
                                                "val": "Will continue development of new methods and tools for risk assessment to improve explosive safety risk management decisions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase due to within-Project re-prioritization based upon holistic program assessment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY19 SBIR\/STTR adjustment"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.032"
                                            },
                                            "Text": {
                                                "val": "FY19 SBIR\/STTR adjustment"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 SBIR\/STTR adjustment"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "859"
                    },
                    "ProjectTitle": {
                        "val": "Life Cycle Pilot Process"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "29.345"
                        },
                        "CurrentYear": {
                            "val": "20.434"
                        },
                        "BudgetYearOne": {
                            "val": "5.6"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.6"
                        },
                        "BudgetYearTwo": {
                            "val": "5.7"
                        },
                        "BudgetYearThree": {
                            "val": "5.8"
                        },
                        "BudgetYearFour": {
                            "val": "5.9"
                        },
                        "BudgetYearFive": {
                            "val": "5.9"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "78.679"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "To execute the Single Manager for Conventional Ammunition (SMCA) Industrial Base Strategic Plan, this project supports material and manufacturing technology investigations, assessments, modeling and simulation, pilot \/ scale-up prototype processes, and industrial assessments.  Projects support overall Army's sustainment and modernization efforts for armaments and ammunition industrial base.  Specifically, this project will assess life cycle production capabilities required for all ammunition families, address design for manufacturability to facilitate economical production, identify industrial and technology requirements and address the ability of the production base to rapidly and cost effectively produce quality products.  Life Cycle Pilot Process (LCPP) provides the resources to prototype critical technologies and develop the knowledge base to establish cost effective, environmentally safe and modern production processes in support of the munitions Industrial Base transformation.  In addition, the LCPP program addresses Single Point Failures (SPFs)\/No Source of supply within the National Technology Industrial Base (NTIB).  LCPP provides support to reduce supply chain risk by investigating, developing and evaluating additional sources of supply for a known SPF.  FY 2020 funding will be used to continue testing and evaluation for new materials, investigations and manufacturing technologies."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Congressional Add"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "24"
                                        },
                                        "Text": {
                                            "val": "Congressional Add"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "14.794"
                                        },
                                        "Text": {
                                            "val": "Congressional Add"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Product Cost Thrust Area"
                                    },
                                    "Description": {
                                        "val": "This thrust area seeks out new opportunities to reduce overall cost of armaments and ammunition components.  Efforts will review and analyze legacy manufacturing processing for opportunities to integrate improved technology and materials to lean manufacturing processes to reduce overall unit cost."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.686"
                                            },
                                            "Text": {
                                                "val": "Completed mortar fin blade cant measurement. Mortar fins have a canted angle to produce the necessary spin during flight. Defects have been detected for the canted angle. Identified techniques and data required to execute ECP to TDP for inspection of canted angle on mortar fin blades. Completed ultrasound inspection for propellant extrusion. Real-time inspection of extruded single strand single perforated M1 propellant. Correlated ultrasonic signal to detected voids and volatile solvents."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.261"
                                            },
                                            "Text": {
                                                "val": "Continue and transition insensitive munitions explosives (IMX) riser reclamation prototype process to NTIB.  Riser scrap is generated during the loading of melt pour ammunition.  This effort investigates and develops prototype equipment to reclaim and reuse the energetic waste.  Complete IMX waste solids for reprocessing.  Repurpose IMX constituents (DNAN and NA - Dinitroanisole (DNAN) and nitro guanidine) in solids waste stream from M795 artillery LAP."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.159"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.159"
                                            },
                                            "Text": {
                                                "val": "Continue to evaluate new materials, processes and technology to reduce overall production and end item costs for the Army.  Complete and transfer IMX riser reclamation project to Iowa Army Ammunition Plant.  Complete ultrasonic inspection of slurry coated explosives effort.  Effort seeks to monitor critical parameters of explosive manufacturing and increase production yield and reduce rework costs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase in product cost thrust area due to ultrasonic inspection effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Single Point Failures (SPFs)"
                                    },
                                    "Description": {
                                        "val": "This thrust area seeks to mitigate single source and\/or no source of supply to armaments and ammunition.  Thrust area tests or evaluates alternative materials and processes to mitigate SPFs.  These efforts are part of the overall strategy to reduce the number of SPFs in the NTIB.  Additionally, thrust area efforts will address ammunition manufacturing capability shortfalls.  This area leverages RDTE accomplishments and product knowledge to satisfy manufacturing requirements.  FY 2020 efforts will continue evaluation of manufacturing shortfalls and testing to reduce the number of SPFs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.303"
                                            },
                                            "Text": {
                                                "val": "Completed Tank Primer Tube SPF. Primer tube sealant, purple lacquer, has only one source. Down selected alternatives to evaluate a plastic sheath as a viable sealant. Successfully tested alternative for form, fit and function."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.925"
                                            },
                                            "Text": {
                                                "val": "Execute BDNA\/F (acetaldehyde bis(dinitropropyl)acetal - BDNPA) and formaldehyde bis(dinitropropyl)acetal - BDNPF) SPF Mitigation.  BDNA\/F is an energetic plasticizer used in PAX-3 explosive.  BDNA\/F has no supply for production.  Due to an increase in PAX-3 ammunition requirements, there is a requirement mitigate the SPF.  Execute alternative anti-seize material for artillery fuze plugs.  Currently there is one source of anti-seize material.  This effort will identify and characterize alternative anti-seize lubricant.  2019 plans also include continuing mitigation of liquid battery reserve SPF for artillery fuzes.  The cathode material on fuze batteries has only one source of supply.  Effort will test and evaluate alternative cathode materials.  Thrust area plans will also complete SPF densified basic magnesium carbonate (DBMC).  DBMC is single source constituent in smoke grenade formulations.  Effort will test and evaluate system performances of alternative supply sources."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.384"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.384"
                                            },
                                            "Text": {
                                                "val": "Continue to mitigate single source and\/or no source of supply for armaments and ammunition.  Transition mitigation plan to PM for their use in risk mitigation implementation supply strategies and assessing procurement strategies for affected end items.  Continue BDNA\/F SPF mitigation.  Complete liquid reserve SPF and alternative anti-seize materials for artillery efforts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease in SPF thrust area due to completion of BDNA\/F SPF mitigation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Manufacturing Technology for Industrial Base Transformation"
                                    },
                                    "Description": {
                                        "val": "Project thrust area matures ammunition manufacturing technologies and processes to enhance capabilities to legacy armaments and ammunition manufacturing operations.  Thrust area will pilot manufacturing technologies and transition technologies to affected industrial base for armaments and ammunition manufacturing operations.  The FY 2020 program will continue to evaluate manufacturing and processes to enhance capabilities for legacy manufacturing operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.356"
                                            },
                                            "Text": {
                                                "val": "Completed ultrasound inspection for propellant extrusion. Real-time inspection of extruded single strand single perforated M1 propellant. Correlated ultrasonic signal to detected voids and volatile solvents."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.255"
                                            },
                                            "Text": {
                                                "val": "Complete test and evaluation of lead free primer automated manufacturing process.  This effort will reduce operator exposure to hazardous materials and operations and improve product consistency and quality.  The FY 2019 plans include process prove-out.  Efforts also continue nitrocellulose fines treatment.  Manufacturing of nitrocellulose (NC) propellants results in the production of waste containing NC fines.  The current disposal method is open burning.  This effort evaluates and demonstrates a closed system disposal capability for NC fines.  FY 2019 efforts also complete ammonium nitrate solution (ANSOL) \/ flyash study.  To mitigate the cost of ANSOL disposal, effort will identify method to reuse ANSOL."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.057"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.057"
                                            },
                                            "Text": {
                                                "val": "Continue manufacturing technology assessments \/ investigations and develop technology transfer strategies for implementation to Army?s industrial base.  Complete ultrasonic inspection of slurry coated explosives effort.  Effort seeks to monitor critical parameters of explosive manufacturing and increase production yield and reduce rework costs.  Complete pre-cursor celluloid for foamed celluloid applications with OCONUS celluloid source.  Effort will develop improved method to support foam celluloid applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Slight decrease in manufacturing technology for industrial base transformation thrust area due to single point failure thrust area mission priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY19 SBIR\/STTR adjustment"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.199"
                                            },
                                            "Text": {
                                                "val": "FY19 SBIR\/STTR adjustment"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 SBIR\/STTR adjustment"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "F21"
                    },
                    "ProjectTitle": {
                        "val": "NATO Ammo Evaluation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.566"
                        },
                        "CurrentYear": {
                            "val": "0.741"
                        },
                        "BudgetYearOne": {
                            "val": "0.75"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.75"
                        },
                        "BudgetYearTwo": {
                            "val": "0.75"
                        },
                        "BudgetYearThree": {
                            "val": "0.75"
                        },
                        "BudgetYearFour": {
                            "val": "0.75"
                        },
                        "BudgetYearFive": {
                            "val": "0.75"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.057"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "North Atlantic Treaty Organization (NATO) Ammunition Evaluation program funding ensures interchangeability of ammunition and weapons among all the NATO countries with all of the associated logistic, strategic and tactical advantages of the alliance. This Project involves development and testing compliance of NATO standardization agreements (STANAGS) and staffing of the North American Regional Test Center (NARTC). In addition, this Project supports small caliber ammunition, 40mm grenade munitions, medium caliber cannon ammunition, and large caliber ammunition enhancements to lethality, effectiveness, survivability, accuracy, and general product improvements. This Project also supports the standardization and interchangeability of legacy and new production United States (U.S.) weapons and ammunition with Allied Nations to maximize battlefield interchangeability\/compatibility under the international Joint Ballistics Memorandum Of Understanding (JBMOU). Maximizing standardization, interchangeability, and exportability will also potentially increase Foreign Military Sales (FMS) of U.S. indirect fire Weapon and Munition products to support United States industrial base production and affordable Department of Defense pricing through increased economies of scale. FY 2020 funding will support NATO and JBMOU artillery and small arms ammunition interchangeability group meetings, documentation, and test operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "New Ammo Design Qualification & NATO Mission Support"
                                    },
                                    "Description": {
                                        "val": "This activity ensures complete interchangeability of small caliber, automated cannon-caliber, 40mm grenade ammunition, air burst capable 30mm\/40mm ammunition, and weapons among NATO countries to achieve the associated logistic, strategic and tactical advantages."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.143"
                                            },
                                            "Text": {
                                                "val": "Worked to support NATO small arms ammunition interchangeability group meetings, documentation and test operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.291"
                                            },
                                            "Text": {
                                                "val": "Continuing work to support NATO small arms ammunition, direct fire grenade, and large caliber interchangeability group meetings, documentation and test operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.3"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.3"
                                            },
                                            "Text": {
                                                "val": "Will continue work to support NATO small arms ammunition, direct fire grenade, and large caliber interchangeability group meetings, documentation and test operations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Small change in Project requirements and estimated inflation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Ballistics Program Support"
                                    },
                                    "Description": {
                                        "val": "The activity supports the maturation, validation, and risk reduction of battlefield interchangeability\/compatibility and associated enabling technologies between domestic U.S. and NATO\/Allied Nations Indirect Fires Weapons and Munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.423"
                                            },
                                            "Text": {
                                                "val": "FY 2018 activities included ballistic testing including firing tables, safety, reliability, and performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.45"
                                            },
                                            "Text": {
                                                "val": "FY 2019 continues ballistic testing including firing tables, safety, reliability, and performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.45"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.45"
                                            },
                                            "Text": {
                                                "val": "FY 2020 will continue interoperability testing and interchangeability group meetings."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "F24"
                    },
                    "ProjectTitle": {
                        "val": "Conventional Munitions Demil"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.882"
                        },
                        "CurrentYear": {
                            "val": "16.636"
                        },
                        "BudgetYearOne": {
                            "val": "19.644"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.644"
                        },
                        "BudgetYearTwo": {
                            "val": "16.33"
                        },
                        "BudgetYearThree": {
                            "val": "16.899"
                        },
                        "BudgetYearFour": {
                            "val": "16.696"
                        },
                        "BudgetYearFive": {
                            "val": "17.488"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "120.575"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Conventional Munitions Demilitarization Technology Project supports the Single Manager for Conventional Ammunition (SMCA) responsibility per Department of Defense Instruction (DoDI) 5160.68 to plan, program, budget and fund a Joint Service research and development program that develops capability and capacity as well as technology and facilities to support the SMCA mission to demilitarize and dispose of conventional ammunition stored in the SMCA Resource, Recovery and Disposition Account (B5A). Project goals include SMCA efforts to increase efficiencies and effectiveness to reduce the demil stockpile; reduce processing costs including packaging, handling and crating; and increase capacity through improved demil capabilities and processes. Project F24 includes several activities: (1) to establish requirements and develop processes to focus investments, assess capabilities, analyze alternatives, and recommend and implement RDT&E projects; (2) to improve products and processes that support existing capabilities; (3) to develop or improve demil methods and processes related to advance the primary demilitarization core thrust areas of destruction, disassembly, removal, resource recovery and recycling, and waste stream treatment; (4) to ensure safe and environmentally acceptable demil operations; (5) to transition RDT&E products to United States Army depots or plants as well as commercial facilities performing demil; and (6) to mitigate risk and close-out Project activities.   \n\nDuring Fiscal Year (FY) 2020 Project F24 will focus efforts on fielding alternative capabilities to open burn and open detonation. In FY20 Project F24 will also conduct conventional ammunition demilitarization operational testing on a Castalia system."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Destruction"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on developing capabilities and capacities for the destruction of munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.369"
                                            },
                                            "Text": {
                                                "val": "Conducted the final transition of Letterkenny Munitions Center (LEMC) Ammonium Perchlorate Rocket Motor Destruction (ARMD) resulting in Initial Operational Capability (IOC). Completed the Final Design for the Multiple Rocket Motor (MRM) Upgrade to the LEMC ARMD. Initiated Equipment Installation on the Multiple Rocket Motor (MRM) to the LEMC ARMD. Conducted the Operational Demonstration for the MCDF. Completed the MCDF transition to IOC. Completed fabrication and began installation of Rockeye download equipment at Crane Army Ammunition Activity (CAAA). Conducted an operational demonstration of the Rockeye Download Equipment. Completed Phase I operational testing of the Engine Starter Cartridge at McAlester Army Ammunition Plant (MCAAP) and initiate design of Phase II Engine Starter Cartridge equipment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.001"
                                            },
                                            "Text": {
                                                "val": "Verifying functionality of LEMC ARMD under FOC conditions. Completing MCDF FOC Transition. Conducting an operational demonstration of the Rockeye Download Equipment at CAAA. Completing Operational Demonstration of Rockeye download equipment. Completing testing on ARMD Multi Motor and Build fixturing to install at ARMD. Conducting safety and assessment effort on the obsolete Nike Herc Missile. Conducting Analysis of Alternatives and Talos Demil process."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.233"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.233"
                                            },
                                            "Text": {
                                                "val": "Will conduct operational testing of a static detonation chamber. Will conduct conventional ammunition operational testing on a Castalia System. Will conduct an operational test at MCAAP for Engine Starter Cartridges. Will conduct a static fire test of Nike Herc Missiles. Will conduct a safety and condition assessment on additional obsolete rocket motors"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from FY19 to FY20 resulting from MCDF Transition Occurring in FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resource Recovery and Recycling (R3)"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on enhancing existing methods of munitions R3."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.43"
                                            },
                                            "Text": {
                                                "val": "Conducted the factory acceptance testing for washout equipment for 16-inch Navy Gun projectiles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.212"
                                            },
                                            "Text": {
                                                "val": "Will conduct testing to determine cleanliness of ammunition scrap on the Automated Scrap Inspection System at an organic depot location. Will initiate a project for Improved Donor Recovery and conduct an operation test at MCAAAP.  Will initiate a project on WDU25\/B Tomahawk Warheads to recover explosive for use a donor material."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.679"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.679"
                                            },
                                            "Text": {
                                                "val": "Will initiate fabrication of components for Automated Scrap Inspection System.  Will conduct an operational test on RP Mortar Demil Capability at CAAA."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from FY19 to FY20 for operation testing of RP Mortar Demil Capability and Phase II Donor Recovery Operational Testing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Removal"
                                    },
                                    "Description": {
                                        "val": "This effort develops technology to remove propellant and energetics from munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.575"
                                            },
                                            "Text": {
                                                "val": "Initiated design modifications and built fixturing for the RP Demil line at CAAA. Developed a design for a capability to demil infrared (IR) munitions at CAAA. Transitioned the Copperhead Munitions Closed Disposal process at MCAAP."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.505"
                                            },
                                            "Text": {
                                                "val": "Conducting operational testing on IR Munitions Demil line at CAAA. Conducting Operational Testing of the 2.75-inch Rocket Demil Line at CAAA. Initiating design modifications and building fixturing to the RP demil line at CAAA to add RP Mortar Demil capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.036"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.036"
                                            },
                                            "Text": {
                                                "val": "Will transition an initial operational capability (IOC) for IR munitions at CAAA.  Will transition an IOC for 2.75? Rockets at CAAA.  Will initiate an Analysis of Alternative (AOA) for Insensitive Munitions (IM) Large Bombs.  Will conduct an AOA for IM Autoclave Upgrades."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from FY19 to FY20 for the AoAs of IM Large Bombs and IM Autoclave Upgrades."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Waste Stream Treatment"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on handling waste streams from munitions items."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.809"
                                            },
                                            "Text": {
                                                "val": "Assembled major components and conduct operational demonstration of the upgraded feed system on a rotary kiln incinerator at an organic location. Conducted testing on CS Gas munitions to verify analytical estimates to thermally treat CS gas and provide a final report."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.241"
                                            },
                                            "Text": {
                                                "val": "Initiating the building of the upgraded feed system on a rotary kiln incinerator at an organic location. Conducting an Analysis of Alternatives for a Bulk Energetics Confined Burn Capability located at Hawthorne Army Depot (HWAD).  Initiating Feed Recipe Efficiency Evaluation project.  Will initiate an evaluation of Recovered Energetic Materials for use as donor material."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.682"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.682"
                                            },
                                            "Text": {
                                                "val": "Will initiate installation of upgraded feed system at an organic installation.  Will initiate a project to upgrade a RKI for CS gas treatment.  Will initiate a design for a Bulk Energetic Confined Burn System at an organic location."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from FY19 to FY20 to support development of a new Bulk Energetic Confined Burn System Capability and Testing of Feed Recipe Efficiency Evaluation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Munitions Disassembly"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on developing innovative and efficient processes to disassemble munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.699"
                                            },
                                            "Text": {
                                                "val": "Completed the Design for a capability to Cryofracture Rockeye Munitions with thermal processing in the rotary kiln at CAAA. Initiated equipment installation for a Rockeye Demil Capability at CAAA. Planned transition of production demil process for Liquid Rocket-62 (LR-62) Bullpup motors at ANMC. Installed equipment to conduct Reactive Armor Tile Thermal Treatment and disposal. Conducted an Operational Demonstration of size reduction of reactive armor tiles to facilitate thermal treatment\/disposal. Transitioned an Initial Capability for Size Reduction of Reactive Armor Tiles. Developed a Design for D561\/D562 155mm ICM Project Demil. Fabricated and Installed equipment for D561\/D562 ICM Demil at a Depot location. Developed a design for disassembly of MK46 Torpedoes at HWAD."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.067"
                                            },
                                            "Text": {
                                                "val": "Initiating systemization of Family of Scatterable Mines (FASCAM) demil project to integrate the preprocessing Cryofracture capability of FASCAM mines with thermal processing in the rotary kiln at Crane Army Ammunition Activity (CAAA). Conducting operational demonstration of MK46 Torpedo Warhead segmenting capability at HWAD. Completing testing of capability developed to size reduce Reactive Armor Tiles. Completing testing on Thermal Treatment of Reactive Armor Tiles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.014"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.014"
                                            },
                                            "Text": {
                                                "val": "Will continue systemization of a Family of Scatterable Mines (FASCAM) demil project to integrate the preprocessing Cryofracture capability of FASCAM mines with thermal processing in the rotary kiln at Crane Army Ammunition Activity (CAAA).  Conduct an operational demonstration on 155mm APICM projectile download capability at HWAD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from FY19 to FY20 to conduct an operational demonstration on the 155mm APICM projectile download Capability."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY19 SBIR\/STTR adjustment"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.61"
                                            },
                                            "Text": {
                                                "val": "FY19 SBIR\/STTR adjustment"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 SBIR\/STTR adjustment"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}