{
    "id": "2020-Army-PB-2040-JBOOK-caa98a5fe7b001fc6e9636b55add742024da70b1a5204a85a180c10adbb25455-15",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602270A"
        },
        "ProgramElementTitle": {
            "val": "Electronic Warfare Technology"
        },
        "R1LineNumber": {
            "val": "21"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "33.683"
            },
            "CurrentYear": {
                "val": "25.558"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "59.241"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) is realigned with continuity of effort to the following PEs:\n* 0602146A Network C3I Technology\n* 0602148A Future Vertical Lift Technology\n* 0602150A Air and Missile Defense Technology\n* 0602213A C3I Applied Cyber"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE designs and validates electronic warfare (EW) components, both hardware and software, that deny, disrupt, or degrade the enemy's use of the electromagnetic spectrum for offensive or defensive operations. This is accomplished through the investigation of electronic support measures (ESM); countermeasures against communications systems and networks; the design and fabrication of sensors used to identify and locate threat forces in an asymmetric environment; and threat warning and electronic countermeasures (ECM) against munitions sensors, missile guidance systems, targeting systems, and explosive hazards. Project 906 supports protection of high-value ground platforms, aircraft and the Soldier from threat surveillance and tracking systems, imaging systems, and advanced radio frequency (RF)\/electro-optical (EO)\/infrared (IR) guided missiles, artillery, and smart munitions. Information fusion research addresses sensor correlation and fusion, relationship discovery, and management services through use of automated processing, as well as software that applies higher level reasoning techniques to support automated combat assessment. Project 906 also supports research and application of key EW sensors, direction finders and jammers to intercept, locate, and disrupt current and emerging communications and non-communications threat emitters to provide vital quality combat information directly to users in a timely and actionable manner. It focuses on detection of threat sensors and emitters associated with weapon systems, targeting systems and command, control, communications, computers, and intelligence systems and networks. Project CYB designs, creates, evaluates, and applies emerging cyber techniques and cyber situational awareness technologies to enhance Army capabilities and to mitigate risks and investigates cyber collection and mapping technologies to offer real time cyber situational awareness to enable interpretation of current threats and predict future enemy activities.\n\nWork in this PE complements PE 0602120A (Sensors and Electronic Survivability), PE 0602782A (Command, Control, Communications Technology), PE 0603270A (Electronic Warfare Technology), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology); and is coordinated with PE 0603710A (Night Vision Advanced Technology) and PE 0603794A (Command, Control and Communications Advanced Technology).\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "27.144"
                },
                "CurrentYear": {
                    "val": "25.571"
                },
                "BudgetYearOne": {
                    "val": "26.008"
                },
                "BudgetYearOneBase": {
                    "val": "26.008"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "33.683"
                },
                "CurrentYear": {
                    "val": "25.558"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "6.539"
                },
                "CurrentYear": {
                    "val": "-0.013"
                },
                "BudgetYearOne": {
                    "val": "-26.008"
                },
                "BudgetYearOneBase": {
                    "val": "-26.008"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.009"
                    },
                    "CurrentYear": {
                        "val": "-0.013"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "7"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.452"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-26.008"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-26.008"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY18 Congressional add of $7 Million. \nFY20 PE realigned due to Science and Technology financial restructuring."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "475"
                    },
                    "ProjectTitle": {
                        "val": "ELECTRONIC WARFARE COMPONENT TECHNOLOGIES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "7.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Fiscal Year (FY) 2018 Congressional Increase."
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Electronic Warfare technology applied research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Congressional Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "7"
                                        },
                                        "Text": {
                                            "val": "Congressional Program Increase"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "906"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Electronic Warfare Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "26.683"
                        },
                        "CurrentYear": {
                            "val": "20.197"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "46.880"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned to:\nProgram Element (PE) 0602146A Network C3I Technology\n* Project AN7 COE - Every Receiver is a Sensor Technology\n* Project AO2 Stand-In Advanced RF Effects (STARE)\n* Project AQ2 EW Techniques Technology\n* Project AQ3 Network Access and Effects \n* Project AV3 Foundational S&T for Network C3I Technology\nPE 0602148A Future Vertical Lift Technology\n* Project AK2 Aviation Survivability Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs, fabricates, evaluates, and applies key electronic warfare (EW)\/information operations technologies to enhance platform survivability (to include ground combat vehicles, aircraft, and the dismounted Soldier) and to intercept, track and locate current and emerging threat munitions, communications and non- communications threat emitters. This project applies recent advances in radio frequency (RF), infrared (IR), and electro-optical (EO) sensors and jamming sources to detect, locate, deceive, and jam threats (to include radar directed target acquisition systems, target-tracking sensors, surface-to-air missiles (SAMs), air-to-air missiles (AAMs), top attack weapons, and electronically fused munitions). This project also pursues the ability to neutralize improvised explosive devices. This project designs information systems to provide vital, quality combat information directly to users in a timely, actionable manner in accordance with concepts for future force intelligence operations. This Project investigates RF collection and mapping technologies to offer real time emitter detection, location, and identification. In addition, this project enables a remote capability to disrupt, deny, or destroy threat communication signals and enables fusion (automated assimilation and synthesis) of battlefield intelligence data to enable interpretation of current threats and future enemy activities. This allows commanders to develop operational courses of action in time to act decisively and in a pre-emptive manner.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multi-Intelligence Data Fusion and Targeting"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs and codes advanced automated exploitation and fusion analysis tools, applications, and software services for the creation of improved intelligence products, common information management and information dissemination systems to facilitate collaboration between intelligence and mission command functions. This will provide relevant and timely information in support of command decisions, such as high value identification and targeting in an asymmetric environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.319"
                                            },
                                            "Text": {
                                                "val": "Matured predictive analyst tools to determine patterns, anomalies and behavior to correlate and exploit big data sources; developed techniques and software tools to correlate dark web with clear web organizational personas; developed cyber threat indicators and ratios for identification of group patterns, tactics, techniques and procedures; and applied stylometry and authorship principles to cyber content to identify and group adversarial cyber themes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data Analytics for Situational Awareness"
                                    },
                                    "Description": {
                                        "val": "This effort researches and designs spectrum sensing, electronic sensing and intelligence collection technologies and analytics to enhance overall situational understanding within a contested battlespace. Efforts focus on developing the analytics necessary to taking advantage of the expanding number of data sources available by leveraging existing tactical receivers and other tactical data feeds."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.946"
                                            },
                                            "Text": {
                                                "val": "Identify relevant tactical receiver data and emerging Internet of Things (IoT) data sources, to include publicly available information, enriching the existing cyber terrain and electromagnetic operations environment; will investigate potential correlation points with non-traditional datasets to identify cyber events; and explore new data analytics, fusion algorithms and semi-automated analytical methods to process and exploit the extended datasets to support cyber situational understanding."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602146A (Network C3I Technology) \/  Project AN7 (COE - Every Receiver is a Sensor Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Offensive Information Operations Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort designs, codes and evaluates techniques for RF network mapping, surgical disruption and unobtrusive operations in the presence of host nation networks. Electronic warfare capabilities include detection, location, classification, mapping and disruption of RF networks and providing data to a user."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.984"
                                            },
                                            "Text": {
                                                "val": "Validated advanced, software techniques to perform various cyber\/EW functions against identified SOIs and devices of interest (DOIs); concluded requirements investigation and analysis of software architecture to allow the tactical commander to direct and control cyber functions from EW and SIGINT platforms across\/within security domains and battlespace domain resources; and incorporated the results of cyber laboratory experiments into the next generation architecture requirements and analyzed analytic tools that can inform the commander's situational understanding; and designed and coded the data models necessary for the delivery of CEMA data products to the intelligence enterprise."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.47"
                                            },
                                            "Text": {
                                                "val": "Investigate emerging networks to identify shortfalls in capability to detect, identify and map network nodes; identify future analytic, sensor, and data research needs; and investigate techniques for surgical disruption and unobtrusive operation within native network infrastructures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602146A (Network C3I Technology) \/ Project AO2 (Stand-In Advanced RF Effects (STARE)) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multispectral Threat Warning and Countermeasures, formerly Multispectral Threat Warning"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and evaluates software and warning sensor\/countermeasure components to increase probability to detect and defeat current and evolving small arms and man-portable air defense system (MANPADS) type threats for aviation platforms using modeling and simulation (M&S) and hardware in the loop (HWIL) simulations. Work being accomplished under PE 0603270A\/Project K16 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.605"
                                            },
                                            "Text": {
                                                "val": "Investigated threat agnostic warning algorithms to increase probability of detection of threats and provided identification and position information to the countermeasure system for an increased probability of defeat; based upon feasibility study results, investigated novel techniques using lasers of higher energy than currently used to increase the probability of defeat of threats not previously encountered; used M&S to develop new threat scenarios and mature HWIL simulations that sense the electro-magnetic environment to assess existing countermeasure capabilities against previously unknown threats; investigated higher fidelity countermeasures and incorporated them into the simulation environment; investigated threat agnostic countermeasure techniques against previously unknown threats and investigated the effects of combined EO\/IR\/RF technologies to defeat both multiple and multi-spectral threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.8"
                                            },
                                            "Text": {
                                                "val": "Investigate technologies to indiscriminately detect and defeat broad classes of threats; conduct analysis of next-generation detect technologies with focus on machine learning algorithms to enable detection of unrecognized threat features; conduct analysis of advanced defeat technologies focusing on new lasers and laser materials and build a breadboard laser to indiscriminately degrade EO threat sensor performance; investigate RF digital hardware and software techniques that are adaptive to agile RF threats; use modeling and simulation (M&S) to iteratively train machine learning algorithms to perform threat classification and optimize laser countermeasure and RF technique development; and assess performance of technologies (e.g., machine learning, lasers, etc.) and techniques independently and incorporate them into a digital M&S platform."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602148A (Future Vertical Lift Technology) \/ Project AK2 (Aviation Survivability Technology) in  FY20 realignments as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Function Intelligence, Surveillance and Reconnaissance Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and codes software algorithms and techniques to intelligently integrate tactical Intelligence, Surveillance, and Reconnaissance (ISR) sensors, improve their individual performance and increase the effectiveness of battlespace awareness\/intelligence data in an area of operations. Efforts focus on networking of sensors and open, scalable common RF architectures for terrestrial and aerial sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.771"
                                            },
                                            "Text": {
                                                "val": "Conducted experiments on reference design for multi-channel receiver architecture to assess baseline performance of commercial and Government off the shelf (COTS\/GOTS) receivers to determine optimal size, weight, and power and cost for a variety of electronic warfare (EW) and Signals Intelligence (SIGINT) missions, including direction finding and beamforming functions; continued to mature and validate Open RF Architecture interface specifications to support advanced interference mitigation between RF functionalities (e.g., communications, SIGINT and blue force jamming); matured interface specifications of intermediate processing functions to enable multi mission EW and SIGINT operations; standardized application interfaces across cyber, EW and SIGINT mission spaces to enable coordinated command and control (C2) of these capabilities to better address emerging threat signal classes; and began investigation of Next Generation Radar architecture for compatibility with EW and SIGINT missions and architectures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.246"
                                            },
                                            "Text": {
                                                "val": "Research enhanced next generation techniques for distributed sensing and single sensor geolocation to enable detection, and geolocation of advanced threats and inform requirements for future hardware designs; investigate state of the art electronic situational awareness technique susceptibility to adversarial use of next generation RF deception and jamming; investigate cyber hardening of sensor component technology for front-end sensors; investigate a best-of-breed low-cost HF software defined radio for use in an open multifunction ISR platform to be utilized in a hostile cyber environment; will explore trade space of shared multi-function next generation hardware for Radar, SIGINT and EW; perform tradeoff studies to understand the feasibility and impact of executing multi-function capabilities from a common RF array with consideration for advancing threat electronic protection capability; and perform laboratory sensing data collections and analysis to address the applicability of a multi-function sensor."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602146A (Network C3I Technology) \/  Project AN7 COE  (Every Receiver is a Sensor Technology) and Project AV3 (Foundational S&T for Network C3I Technology) in FY20 as a result of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi Function Electronic Warfare (MFEW) Technique Development"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops EW techniques critical to countering communications, such as networked command and control nodes or improvised explosive device threats, and radars, such as ground surveillance and counter-fire radars. The techniques developed are system agnostic and applicable to a wide variety of EW and electronic countermeasure applications, and they can be used to improve the performance and expand the functionality of both current and future EW system capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.004"
                                            },
                                            "Text": {
                                                "val": "Investigated and performed vulnerability analysis on emerging commercial communications capabilities and investigated\/developed EW techniques and methods (such as active, reactive, surgical and protocol based software) to defeat specific commercial communications systems while maximizing waveform jamming effectiveness, minimizing transmission time and reducing jamming power."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.5"
                                            },
                                            "Text": {
                                                "val": "Investigate and perform vulnerability analysis on emerging threats (including, but not limited to, tactical communications, ground surveillance radar, and counter-fire radar systems) and mature EW techniques and methods (such as active, reactive, surgical, and protocol based software) with the goals of maximizing EW waveform jamming effectiveness, minimizing transmission time, and reducing jamming power to defeat Army relevant threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602146A (Network C3I Technology) \/ Project AQ2 (EW Techniques Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.235"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CYB"
                    },
                    "ProjectTitle": {
                        "val": "Applied Offensive Cyber"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "5.361"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.361"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) FY 2020 this Project is realigned to:: \nProgram Element (PE) 0602146A Network C3I Technology\n* Project AQ3 Network Access and Effects\nPE 0602213A C3I Applied Cyber\n* Project 5CY Offensive Cyber Operations (OCO) Mirror Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs, creates, evaluates, and applies emerging cyber techniques and cyber situational awareness technologies to enhance Army capabilities. This Project leverages behavioral Modeling and Simulation to mitigate risks and investigates cyber collection and mapping technologies to offer real time cyber situational awareness to enable interpretation of current threats and predict future enemy activities. This allows commanders to develop operational courses of action in time to act decisively and in a pre-emptive manner.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Offensive Information Operations Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort designs, codes and evaluates cyber architectures, software, tools and techniques that identify and capture data traversing targeted networks for the purpose of Cyber Electro Magnetic Activity (CEMA) or otherwise countering adversary communications. Cyber capabilities include detection, identification, exploitation, direction finding (DF), geolocation, and denial of service."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.165"
                                            },
                                            "Text": {
                                                "val": "Investigate utilizing Machine Learning for threat assessment, decision aid, and mission choreography; determine algorithm design needs for recognition and Battle Damage Assessment for the purposes of survey, network topology understanding, and effect assessment; refine CEMA interface definitions to include a mechanism for service\/capability discovery to address solidifying mission management across Unified Land Operations platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned in FY20 to PE 0602146A (Network C3I Technology) \/ Project AQ3 (Network Access and Effects) and PE 0602213A (C3I Applied Cyber) \/ Project 5CY (Offensive Cyber Operations (OCO) Mirror Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.196"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}