{
    "id": "2020-Army-PB-2040-JBOOK-c3dfc4efbfac46da70170659364c6c2d720e705db77d6ab495afa846698c0b96-16",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA5C-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605042A"
        },
        "ProgramElementTitle": {
            "val": "Tactical Network Radio Systems (Low-Tier)"
        },
        "R1LineNumber": {
            "val": "156"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "8.845"
            },
            "CurrentYear": {
                "val": "3.825"
            },
            "BudgetYearOne": {
                "val": "35.654"
            },
            "BudgetYearOneBase": {
                "val": "35.654"
            },
            "BudgetYearTwo": {
                "val": "50.297"
            },
            "BudgetYearThree": {
                "val": "47.368"
            },
            "BudgetYearFour": {
                "val": "26.235"
            },
            "BudgetYearFive": {
                "val": "27.61"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "199.834"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Tactical Network Radio Systems (Low-Tier) supports the Army Network Modernization Strategy Line of Effort 1, Unified Network\n\nThe HMS radios are a key component of the Integrated Tactical Network which supports a converged Mission Command Network that operates seamlessly worldwide in any environment.  These radios will perform under a standards-based network architecture that unifies enterprise and deployed network capabilities.  The near-term goal of the HMS radios is to provide 'secure but unclassified' networking capabilities utilizing next generation tactical radios.  The cited work is consistent with Strategic Planning Guidance and the Mission Command Network Modernization Implementation Plan.\n\nThe Handheld, Manpack, and Small Form Fit (HMS) radio program is a materiel solution providing software-defined radio systems that are tailorable and scalable to support the Chief of Staff of the Army's \"fight tonight\" strategy. HMS is an Acquisition Category IC program that encompasses specific requirements to support the U.S. Army, Air Force, Navy, Marine Corps and Special Operations Command communications needs. \n\nHMS provides voice and data communications to the tactical edge\/most disadvantaged warfighter with an on-the-move, at-the-halt, and stationary Line of Sight \/ Beyond Line of Sight capability for both dismounted personnel and platforms. HMS radio systems are software reprogrammable, networkable, multi-mode systems capable of simultaneous voice and data communications. \n\nHMS encompasses the Handheld Radios (one-channel Rifleman Radio and two-channel Leader Radio), Manpack Radio (MP), and Small Form Fit radios. HMS radios will provide voice and support for data services such as text, control graphics, imagery, video, and telemetry to Warfighters and tactical end user devices including handheld, embedded, and larger computing devices, as well as unmanned systems. The program office will continue with the ongoing competition to procure the newest generation of software defined radios capable of running the threshold waveforms, to include MUOS for MP, and will pursue alternative waveforms to reduce the complexity of Mobile AdHoc Networking waveforms, improve spectral efficiency, and seek Electronic Counter-Countermeasures improvements for operations in a contested environment.\n\nThe Army intends to test and integrate 2-channel communications technologies, utilizing existing Army 2-channel radio variants (HMS Radios), in support of Air to Ground experimentation. Experimentation includes, but not limited to: concept refinement, characterization, data collection, demos, new kit prototyping, and operational assessments."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.076"
                },
                "CurrentYear": {
                    "val": "3.829"
                },
                "BudgetYearOne": {
                    "val": "10.062"
                },
                "BudgetYearOneBase": {
                    "val": "10.062"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.845"
                },
                "CurrentYear": {
                    "val": "3.825"
                },
                "BudgetYearOne": {
                    "val": "35.654"
                },
                "BudgetYearOneBase": {
                    "val": "35.654"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-11.231"
                },
                "CurrentYear": {
                    "val": "-0.004"
                },
                "BudgetYearOne": {
                    "val": "25.592"
                },
                "BudgetYearOneBase": {
                    "val": "25.592"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.009"
                    },
                    "CurrentYear": {
                        "val": "-0.004"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-8.739"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.04"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.443"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "25.592"
                                },
                                "BudgetYearOneBase": {
                                    "val": "25.592"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2020 was increased $25.592 million to support a network-wide evaluation. The test will assess the effectiveness of HMS systems within the Army network and support materiel release\/acquisition milestone decisions."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "FA1"
                    },
                    "ProjectTitle": {
                        "val": "Manpack Radio"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.248"
                        },
                        "CurrentYear": {
                            "val": "1.957"
                        },
                        "BudgetYearOne": {
                            "val": "30.622"
                        },
                        "BudgetYearOneBase": {
                            "val": "30.622"
                        },
                        "BudgetYearTwo": {
                            "val": "39.422"
                        },
                        "BudgetYearThree": {
                            "val": "36.335"
                        },
                        "BudgetYearFour": {
                            "val": "13.945"
                        },
                        "BudgetYearFive": {
                            "val": "15.3"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "138.829"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Tactical Network Radio Systems (Low-Tier) supports the Army Network Modernization Strategy Line of Effort 1, Unified Network\n\nThe HMS radios are a key component of the Integrated Tactical Network which supports a converged Mission Command Network that operates seamlessly worldwide in any environment.  These radios will perform under a standards-based network architecture that unifies enterprise and deployed network capabilities.  The near-term goal of the HMS radios is to provide 'secure but unclassified' networking capabilities utilizing next generation tactical radios.  The cited work is consistent with Strategic Planning Guidance and the Mission Command Network Modernization Implementation Plan.\n\nHMS is structured as a single program of record consisting of several products. The Manpack (MP) radio is a NSA certified Type 1 radio used for transmission of up to SECRET information. The MP is capable of providing two simultaneous channels of secure voice and data communications using SINCGARS, Demand Assigned Multiple Access Satellite Communication, Mobile User Objective System (MUOS), and other advanced networking waveforms. The MP provides range extension and connects soldiers in the lower tier network to the mid-tier network. It is interoperable with legacy waveforms and capable of route and retransmission and cross-banding. The MP provides networking waveforms connectivity, Networked Line of Sight (LOS) \/ Beyond Line of Sight (BLOS) voice and data communications. The MP will serve as the vehicular and man-packable tactical LOS \/ BLOS radio."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Management"
                                    },
                                    "Description": {
                                        "val": "PdM HMS Manpack's program management includes overall management of program execution, major events, reporting, funds execution, contract management, and logistical support. Includes participation in program planning and Integrated Product Team meetings."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.548"
                                            },
                                            "Text": {
                                                "val": "Maintained management and oversight on PdM HMS acquisition and testing strategies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.45"
                                            },
                                            "Text": {
                                                "val": "During this timeframe, will provide overall management and oversight to implement PdM HMS acquisition strategy. Includes Matrix and Contractor support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.55"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.55"
                                            },
                                            "Text": {
                                                "val": "During this timeframe, will provide overall management and oversight to implement PdM HMS acquisition strategy. Includes Matrix and Contractor support."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "An increase in funding is necessary to support a network-wide evaluation planned for FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HMS Engineering\/Technical Support"
                                    },
                                    "Description": {
                                        "val": "Overall technical analysis support to PdM HMS' Manpack products."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.7"
                                            },
                                            "Text": {
                                                "val": "PdM HMS successfully provided engineering and technical assistance in support of Manpack Radio testing events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.7"
                                            },
                                            "Text": {
                                                "val": "To provide technical support, including systems engineering to evaluate technical alternatives and test support. System Engineering efforts includes: communication architecture analysis, identifying alternatives to reduce costs, improving system performance, and achieve tactical radio objectives. Technical test support includes: planning and execution of laboratory and field test events, support for testing of prototypes, Engineering Design Models (EDMs), commercial radio solutions, Developmental and Operational Test events, and data collection\/reduction\/analysis of tactical radio performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "To provide technical support, including systems engineering to evaluate technical alternatives and test support. System Engineering efforts includes: communication architecture analysis, identifying alternatives to reduce costs, improving system performance, and achieving tactical radio objectives. Technical test support includes: planning and execution of laboratory and field test events, support for testing of prototypes, EDMs, commercial radio solutions, Developmental and Operational Test events, and data collection\/reduction\/analysis of tactical radio performance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "An increase in funding is necessary to support a network-wide evaluation planned for FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Manpack's Test and Evaluation focuses on the key technical and operational characteristics of the system: Radio Frequency performance, security, Reliability, Availability & Maintainability, suitability and survivability requirements, in addition to operational environmental performance requirements as per the Capability Production Document. All radios awarded a contract were required to go through the Qualification Test (QT) to qualify for a Customer Test (CT). Following CT there will be a Sandbox and Soldier Feedback Study and Field \/ Lab Based Risk Reduction Test (FBRR\/LBRR) that will serve as risk reduction events prior to Operational Test (OT) to ensure the radio is operational at full capability and ready to be used by soldiers. The QT and CT are complete and were executed by Electronic Proving Ground. \n\nThe QT validated the manufacturers' ability to meet the minimum functional requirements identified in the Performance Requirements Document. All vendors successfully demonstrated key capabilities during QT and proceeded to the CT. The Sandbox, Soldier Feedback Study and FBRR\/LBRR will serve as risk reduction events for delayed thresholds and OT. The OT will include support from Army and DoD operational testers and will use communication scenarios based on the Operational Mode Summary \/ Mission Profile of the system(s) under test. The OT will be designed to validate that HMS products meet warfighter needs in terms of effectiveness, suitability and survivability in an operationally realistic environment. Results from OT will facilitate the delivery orders for Full Rate Production."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.744"
                                            },
                                            "Text": {
                                                "val": "The FY 2019 funding is needed to conduct testing for the MP candidate products to demonstrate compliance with program requirements; assess effectiveness, suitability, and survivability; to obtain material release for FRP; engineering and technical support at test events; and to fully fund the testing requirements on the MP candidate radios as laid out in the HMS Acquisition Strategy approved May 2014."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "29.072"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "29.072"
                                            },
                                            "Text": {
                                                "val": "The FY 2020 funding is needed to conduct testing for the MP candidate products to demonstrate compliance with program requirements; assess effectiveness, suitability, and survivability; to obtain material release for FRP; engineering and technical support at test events; and to fully fund the testing requirements on the MP candidate radios as laid out in the HMS Acquisition Strategy approved May 2014. HMS is planning a network evaluation event in FY 2020 to assess required capabilities, operational efficacy, and interoperability across the communications network. In FY 2020 the Army intends to test and integrate 2-channel communications technologies in support of Air to Ground experimentation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "An increase in funding is necessary to support a network-wide evaluation planned for FY 2020. The test will assess the effectiveness of HMS systems within the Army network and support materiel release\/acquisition milestone decisions."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Accounting for FY 2019 SBIR\/ STTR Transfer."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.063"
                                            },
                                            "Text": {
                                                "val": "Accounting for FY 2019 SBIR\/ STTR Transfer."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 Decrease to account for SBIR\/ STTR transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "FA2"
                                    },
                                    "Title": {
                                        "val": "Rifleman Radio (RR)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.597"
                                        },
                                        "CurrentYear": {
                                            "val": "1.868"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.032"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.032"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.875"
                                        },
                                        "BudgetYearThree": {
                                            "val": "11.033"
                                        },
                                        "BudgetYearFour": {
                                            "val": "12.29"
                                        },
                                        "BudgetYearFive": {
                                            "val": "12.31"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "61.005"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "B95004"
                                    },
                                    "Title": {
                                        "val": "Handheld Manpack Small Form Fit (HMS)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "415.351"
                                        },
                                        "CurrentYear": {
                                            "val": "298.475"
                                        },
                                        "BudgetYearOne": {
                                            "val": "468.026"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "468.026"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "526.565"
                                        },
                                        "BudgetYearThree": {
                                            "val": "609.206"
                                        },
                                        "BudgetYearFour": {
                                            "val": "774.369"
                                        },
                                        "BudgetYearFive": {
                                            "val": "697.28"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "MP Radio is currently executing a May 2014 approved acquisition strategy to procure Non-Developmental Items (NDI). Utilizing a full and open competition strategy, the MP base contract was awarded to all potential industry partners. The MP contract was awarded on 26 February 2016, and procures NDI MP radios for use in a classified environment. The MP is currently capable of running the following waveforms: SRW, Single Channel Ground and Airborne Radio System (SINCGARS), Satellite Communications (SATCOM) - Army managed waveforms, Mobile User Objective System (MUOS) - Navy managed waveform, and other advanced networking waveforms. \n\nThe Army has awarded will procure radios through a multiple step selection process:\na. Awarded FFP Contracts to all qualified vendors based on technical acceptability and demonstrations (26 February 2016)\nb. Awarded initial delivery orders based on Qualification Test results (19 December 2016)\nc. Awarded second delivery orders based on Customer Test results (31 July 2017)\nd. Awarded LRIP delivery order (30 April 2018)\ne. Award LRIP delivery orders based on best value trade-off construct (3QFY19 & 3QFY20)\nf. Achieve Full Rate Production (2QFY21)"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management Office Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO C3T, CECOM, PM TR Alliant"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various; APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.312"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.548"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.45"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.55"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.55"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.860"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2019 SBIR \/ STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.063"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.063"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "HMS Engineering\/Technical Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO C3T, ARL, ESP, CECOM, CERDEC, LCMC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.142"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.7"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.7"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.542"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Follow on Delta Development & Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "EPG"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Huachuca"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.447"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.447"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Follow on Delta Development & Testing (2)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OTC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.446"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.744"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "29.072"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "29.072"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "36.262"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190306_0_444561_FA1.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Manpack (MP) Customer Test (CT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MP Sandbox and Soldier Feedback Study"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MP Field\/Lab Base Risk Reduction Test (FBRR\/LBRR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MP Log Demo"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MP FBRR 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Network Evaluation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MP Full Rate Production (FRP)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FA2"
                    },
                    "ProjectTitle": {
                        "val": "Rifleman Radio (RR)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.597"
                        },
                        "CurrentYear": {
                            "val": "1.868"
                        },
                        "BudgetYearOne": {
                            "val": "5.032"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.032"
                        },
                        "BudgetYearTwo": {
                            "val": "10.875"
                        },
                        "BudgetYearThree": {
                            "val": "11.033"
                        },
                        "BudgetYearFour": {
                            "val": "12.29"
                        },
                        "BudgetYearFive": {
                            "val": "12.31"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "61.005"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Tactical Network Radio Systems (Low-Tier) supports the Army Network Modernization Strategy Line of Effort 1, Unified Network\n\nThe HMS radios are a key component of the Integrated Tactical Network which supports a converged Mission Command Network that operates seamlessly worldwide in any environment.  These radios will perform under a standards-based network architecture that unifies enterprise and deployed network capabilities.  The near-term goal of the HMS radios is to provide 'secure but unclassified' networking capabilities utilizing next generation tactical radios.  The cited work is consistent with Strategic Planning Guidance and the Mission Command Network Modernization Implementation Plan.\n\nHMS is structured as a single program of record consisting of several products. The HMS Handheld products encompass the one-channel Rifleman Radio (RR) and two-channel Leader Radio (LR). The RR is a handheld radio that connects soldiers at the lowest echelon of the Army network. It is a National Security Agency certified Type 1 radio used for transmission of up to SECRET information. The RR provides one-channel secure voice and data communications. It is the primary squad level communication system. The LR is a Multiband two-channel handheld radio to be used at the Team, Squad, and Platoon level. The LR will simultaneously support Single Channel Ground and Airborne Radio System (SINCGARS) voice interoperability and other advanced networking waveform communications, in one radio with both handheld and mounted configurations, for fixed and mobile sites.\n\nOn 13 September 2016 the Army Acquisition Executive approved a decreased Basis of Issue (BOI) for the single channel RR, an increase to the BOI for the two channel LR and moving forward with acquisition activities for the two channel LR. Single channel RR procurement is being deferred."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Management"
                                    },
                                    "Description": {
                                        "val": "Handheld's program management includes overall management of program execution, major events, reporting, funds execution, contract management, and logistical support. Includes participation in program planning  and Integrated Product Team meetings."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.485"
                                            },
                                            "Text": {
                                                "val": "Maintained management and oversight on PdM HMS acquisition and testing strategies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.425"
                                            },
                                            "Text": {
                                                "val": "During this timeframe, will provide overall management and oversight to implement HMS acquisition strategy. Includes Matrix and Contractor support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.475"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.475"
                                            },
                                            "Text": {
                                                "val": "During this timeframe, will provide overall management and oversight to implement HMS acquisition strategy. Includes Matrix and Contractor support."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "An increase in funding is necessary to support a network-wide evaluation planned for FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HMS Engineering\/Technical Support"
                                    },
                                    "Description": {
                                        "val": "Overall technical analysis support to PdM HMS' Handheld products."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.3"
                                            },
                                            "Text": {
                                                "val": "PdM HMS successfully provided engineering and technical assistance in support of Handheld Radio testing events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.3"
                                            },
                                            "Text": {
                                                "val": "Provide technical systems engineering support to evaluate technical alternatives and perform communication architecture analysis to identify alternatives to reduce cost, improve performance, and achieve tactical radio objectives. Technical test support for the planning and execution of laboratory and field test events, including support for testing of prototypes, Engineering Design Models (EDMs), commercial radio solutions, Developmental and Operational Test events, and data collection\/reduction\/analysis of tactical radio performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.4"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.4"
                                            },
                                            "Text": {
                                                "val": "Provide technical systems engineering support to evaluate technical alternatives and perform communication architecture analysis to identify alternatives to reduce cost, improve performance, and achieving tactical radio objectives. Technical test support for the planning and execution of laboratory and field test events, including support for testing of prototypes, EDMs, commercial radio solutions, Developmental and Operational Test events, and data collection\/reduction\/analysis of tactical radio performance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "An increase in funding is necessary to support a network-wide evaluation planned for FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Handheld's Test and Evaluation focuses on the evaluation of key technical and operational characteristics of the system: Radio Frequency performance, security, Reliability, Availability & Maintainability, and survivability requirements, in addition to operational environmental performance requirements as per the Capability Production Document. All radios awarded a contract will be required to go through the Qualification Test (QT) to qualify for Field \/ Lab Based Risk Reduction (FBRR\/LBRR) that will serve as risk reduction events prior to Operational Test (OT) to ensure the radio is operational at full capability and ready to be used by soldiers.\n\nThe QT will validate the manufacturers' ability to meet the minimum functional requirements identified in the Performance Requirements Document. Radios that successfully demonstrate key capabilities during QT will proceed to FBRR\/LBRR. The OT will include support from Army and DoD operational testers and will use communication scenarios based on the Operational Mode Summary \/ Mission Profile of the system(s) under test. The OT will be designed to validate that the HMS products meet warfighter needs in terms of effectiveness, suitability and survivability in an operationally realistic environment. Results from the OT will facilitate the delivery orders for Full Rate Production."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.812"
                                            },
                                            "Text": {
                                                "val": "PdM HMS held a Customer Test for the Leader Radio (LR) in second quarter FY 2018; both vendors successfully passed. The PdM HMS team also attended SOCOM OUA, to collect data on Handheld radios being utilized at the event."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.083"
                                            },
                                            "Text": {
                                                "val": "The FY 2019 funding is needed to conduct testing for the LR candidate products to demonstrate compliance with program requirements; assess effectiveness, suitability, and survivability; to obtain material release for FRP; and to fund the testing requirements on the LR candidate radios as laid out in the HMS Acquisition Strategy addendum approved in March 2017."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.157"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.157"
                                            },
                                            "Text": {
                                                "val": "The FY 2020 funding is needed to conduct testing for the LR candidate products to demonstrate compliance with program requirements; assess effectiveness, suitability, and survivability; to obtain material release for FRP; and to fund the testing requirements on the LR candidate radios as laid out in the HMS Acquisition Strategy addendum approved in March 2017. In FY 2020 the Army intends to test and integrate 2-channel communications technologies in support of Air to Ground experimentation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "An increase in funding is necessary to support a network-wide evaluation planned for FY 2020. The test will assess the effectiveness of HMS systems within the Army network and support materiel release\/acquisition milestone decisions."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR\/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Accounting for FY 2019 SBIR\/ STTR Transfer."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.06"
                                            },
                                            "Text": {
                                                "val": "Accounting for FY 2019 SBIR\/ STTR Transfer."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 Decrease to account for SBIR\/ STTR transfer."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "FA1"
                                    },
                                    "Title": {
                                        "val": "Manpack Radio"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.248"
                                        },
                                        "CurrentYear": {
                                            "val": "1.957"
                                        },
                                        "BudgetYearOne": {
                                            "val": "30.622"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "30.622"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "39.422"
                                        },
                                        "BudgetYearThree": {
                                            "val": "36.335"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.945"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.3"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "138.829"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "B95004"
                                    },
                                    "Title": {
                                        "val": "Handheld Manpack Small Form Fit (HMS)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "415.351"
                                        },
                                        "CurrentYear": {
                                            "val": "298.475"
                                        },
                                        "BudgetYearOne": {
                                            "val": "468.026"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "468.026"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "526.565"
                                        },
                                        "BudgetYearThree": {
                                            "val": "609.206"
                                        },
                                        "BudgetYearFour": {
                                            "val": "774.369"
                                        },
                                        "BudgetYearFive": {
                                            "val": "697.28"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "On 13 September 2016 the Army Acquisition Executive determined to decrease the Basis of Issue (BOI) for the single channel RR, increase the BOI for the two channel LR and move forward with acquisition activities for the two channel LR. Single channel RR procurement is being deferred. An acquisition strategy addendum adding LR was approved in March 2017. The addendum continues the multi-vendor approach utilizing the existing Indefinite Delivery Indefinite Quantity (IDIQ) RR base contract (awarded 29 April 2015) to on-ramp LR capabilities (18 September 2018). The LR effort is a separate competition under the Handheld radio suite. \n\nThe LR will simultaneously run Single Channel Ground and Airborne Radio System (SINCGARS) and other advanced networking waveforms, in one radio with both handheld and mounted configurations, for fixed and mobile sites.\n\nThe Army will procure radios through a multiple step selection process:\na. Awarded FFP Contracts to all qualified vendors based on technical acceptability and demonstrations (18 September 2018)\nb. Awarded LRIP delivery orders to support SFAB and ITN fieldings\/evaluations (18 September 2018)\nc. Award LRIP delivery orders based on results the best value trade-off construct (3QFY19 & 3QFY20)"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management Office Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO C3T, CECOM, PM TR Alliant"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various; APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.373"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.485"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.425"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.475"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.475"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.758"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2019 SBIR\/ STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.060"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "HMS Engineering\/Technical Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO C3T, ARL, ESP, CECOM, CERDEC, LCMC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.154"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.3"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.3"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.4"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.4"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.154"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Follow on Delta Development & Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "EPG"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fort Huachuca"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.676"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.1"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.776"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Follow on Delta Development & Testing (2)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OTC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.648"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.712"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.083"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.157"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.157"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "10.600"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190306_0_444561_FA2.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "LR Qualification Test (QT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LR Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LR Lab Based Risk Reduction (LBRR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LR Field Based Risk Reduction (FBRR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LR Log Demo"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Network Evaluation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LR Full Rate Production (FRP)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}