{
    "id": "2020-Army-PB-2040-JBOOK-c3dfc4efbfac46da70170659364c6c2d720e705db77d6ab495afa846698c0b96-24",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA5C-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605380A"
        },
        "ProgramElementTitle": {
            "val": "AMF Joint Tactical Radio System (JTRS)"
        },
        "R1LineNumber": {
            "val": "164"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "18.639"
            },
            "CurrentYear": {
                "val": "15.964"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "34.603"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The AMF radios are software programmable, multi-band, multi-mode, mobile ad hoc networking radios, providing simultaneous voice and data communications for Army Aviation platforms.  The radios will operate in networks supporting the Common Operating Picture, Situational Awareness, and interoperability of Mission Command systems throughout the battlefield.  AMF radios will ensure the Soldier's ability to communicate both horizontally and vertically via voice and data within all mission areas and Common Operating Environment.  AMF radios will operate waveforms that are deployed by Joint Forces today, and will introduce networking waveforms to the Aviation community that will enable interoperability between air and ground forces and transport operational and Mission Command information through the tactical network.  AMF radios will help close capability gaps by extending data networking to company and below echelons, enabling network services to the platform and connecting Army Aviation platforms to Army ground and Joint air network domains. \n\nOn 17 July 18, the Army Acquisition Executive signed both the SANR Closeout Acquisition Decision Memorandum (ADM) and SANR Termination plan.  This ADM and plan initiates a program termination action and directs an orderly shutdown of the SANR program. \n\nThe SANR subprogram (Project EG6) has no approved requirement and all funding has been withdrawn in FY 2020 and beyond."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "8.965"
                },
                "CurrentYear": {
                    "val": "15.984"
                },
                "BudgetYearOne": {
                    "val": "43.457"
                },
                "BudgetYearOneBase": {
                    "val": "43.457"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.639"
                },
                "CurrentYear": {
                    "val": "15.964"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "9.674"
                },
                "CurrentYear": {
                    "val": "-0.02"
                },
                "BudgetYearOne": {
                    "val": "-43.457"
                },
                "BudgetYearOneBase": {
                    "val": "-43.457"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.007"
                    },
                    "CurrentYear": {
                        "val": "-0.02"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "10"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.319"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-43.457"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-43.457"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The SANR subprogram (Project EG6) has no approved requirement."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EG6"
                    },
                    "ProjectTitle": {
                        "val": "Small Airborne Networking Radio (SANR)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.639"
                        },
                        "CurrentYear": {
                            "val": "15.964"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "34.603"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Prior to FY 2014, the Airborne Maritime\/Fixed Station (AMF) Joint Tactical Radio System (JTRS) was funded under Navy PE 0604280N, aligned under the Navy JTRS Programs. In accordance with a July 11, 2012 Acquisition Decision Memorandum (ADM), the JTRS Program of Record transitioned to a Military Department-managed program. AMF is now managed by Program Executive Office Command, Control and Communications-Tactical, under Project Manager Tactical Radios, and funded by Army PE 0605380A. On May 2, 2014, the Milestone Decision Authority (MDA), Under Secretary of Defense for Acquisition, Technology, and Logistics, issued an ADM that designated Small Airborne Link 16 Terminal (SALT) and Small Airborne Networking Radio (SANR) as subprograms under the AMF Program. In FY 2015, Project EA9 represented the total Airborne Maritime Fixed Small Airborne (AMF-SA, or SALT) RDT&E budget. In FY 2016, funding was allocated between the SALT (Project EA9) and SANR (Project EG6) subprograms.  The SANR subprogram (Project EG6) has no approved requirement and funding has been withdrawn in FY 2020 and beyond."
                        },
                        "ProjectMissionDescription": {
                            "val": "Per MDA direction, AMF JTRS will procure SANR radios as Non-Developmental Items (NDI).  The SANR is a two-channel, software-defined, National Security Agency Type 1 certified networking radio providing seamless real-time information for operation in mobile and dynamic combat environments that will meet tactical communications requirements as validated by the Army Aviation community.  SANR will provide increased data throughput to Army Aviation platforms via advanced networking capabilities supporting Mid-Tier and Lower Tier tactical networks, and maintain Single Channel Ground and Airborne Radio System (SINCGARS) capability.  SANR will replace the current SINCGARS radios on Army Aviation platforms.  SANR is planned for implementation on the following platforms: Apache (AH-64E), Black Hawk (UH-60V, UH-60M, HH-60M, and MH-60M), Chinook (CH-47F and MH-47G), and Gray Eagle Unmanned Aircraft System (MQ-1C) aircraft.  SANR will enhance and further enable the ability of the maneuver commander to integrate and synchronize aviation forces with land based operational forces. SANR, employed on Army aviation platforms, will enable aviation combat elements (Combat Aviation Brigades, Theater Aviation Brigades, and Special Operations Aviation Regiment) to better utilize the inherent versatility of airborne communications as a complement to the unique capabilities of the other combat arms.  SANR will give commanders enhanced Situational Awareness and Mission Command in a package that provides a more responsive means of directing aircraft to match changing maneuver forces situations and missions.\n\nOn 17 July 18, the Army Acquisition Executive signed both the SANR Closeout Acquisition Decision Memorandum (ADM) and SANR Termination plan.  This ADM and plan initiates a program termination action and directs an orderly shutdown of the SANR program. \n\nThe SANR subprogram (Project EG6) has no approved requirement and funding has been withdrawn in FY 2020 and beyond."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Small Airborne Networking Radio (SANR)"
                                    },
                                    "Description": {
                                        "val": "Small Airborne Networking Radio (SANR)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.639"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.379"
                                            },
                                            "Text": {
                                                "val": "FY 2019 provides funding necessary to conduct source selection testing and acquisition activities in support of contract award.  SANR source selection efforts include evaluation of proposals (document review), test article integration and test execution for each offeror (source selection testing), and evaluation of all selection factors.  The program will also continue to develop documentation to support Milestone C.  These planned program activities may be influenced by the CSA Network Review and Network Cross Functional Team (CFT) review of the SANR program path forward."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The SANR subprogram (Project EG6) has no approved requirement and funding has been withdrawn in FY 2020 and beyond."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air-Ground Integration Experimentation"
                                    },
                                    "Description": {
                                        "val": "The Army is considering the expanded use of Link-16 to enable Army aviation to enter the joint\/coalition air picture; to create low-latency, fused, air-ground pictures in the command post environment; and to provide Joint fires observers the ability to conduct jam-resistant, digital, coalition, close air support coordination.  The Army will buy Link-16 handheld radios to conduct experimentation and develop concepts of operation in order to refine requirement for an objective capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10"
                                            },
                                            "Text": {
                                                "val": "With FY 2019 RDTE funds, the Army will procure 160 Link-16 handheld radios to equip four brigades, enabling them to conduct experimentation and develop concepts of operation in order to refine requirement for an objective capability."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The SANR subprogram (Project EG6) has no approved requirement and funding has been withdrawn in FY 2020 and beyond."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR\/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.585"
                                            },
                                            "Text": {
                                                "val": "Accounting for FY 2019 SBIR\/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 Decrease to account for SBIR\/ STTR transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "On 17 July 18, the Army Acquisition Executive signed both the SANR Closeout Acquisition Decision Memorandum (ADM) and SANR Termination plan.  This ADM and plan initiates a program termination action and directs an orderly shutdown of the SANR program."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "AMF-SA   Business Operations Management and Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.136"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.83"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.174"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.140"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "AMF-SA - System Engineering and Requirements Validation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.329"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.587"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.552"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.468"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "AMF-SA - Air-Ground Integration Experimentation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "20.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2019 SBIR\/ STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.585"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.585"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "AMF-SA - Logistics Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.967"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.634"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.344"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.945"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "AMF-SA - Test and Evaluation and Test Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.614"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.588"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.309"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.511"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "AMF-SA- WNW Demonstration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various\/AWA 17.1"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "EPG"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.072"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.072"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190306_0_444561_EG6.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Procurement of Link-16 Handheld Radios"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Experimentation and CONOPS Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}