{
    "id": "2020-DoDHumanResourcesActivity-PB-0400-JBOOK-e06237f61124fba0306c2bd0a6513969167e10d46331dec59bc891b3e2585fe4-1",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-DHRA-U_RDTE_JustificationBook_DoD_Human_Resources_Activity_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_DoD_Human_Resources_Activity_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "DoD Human Resources Activity",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605803SE"
        },
        "ProgramElementTitle": {
            "val": "R&D in Support of DOD Enlistment, Testing and Evaluation"
        },
        "R1LineNumber": {
            "val": "170"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "DoD Human Resources Activity"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "15.230"
            },
            "PriorYear": {
                "val": "22.856"
            },
            "CurrentYear": {
                "val": "24.914"
            },
            "BudgetYearOne": {
                "val": "34.448"
            },
            "BudgetYearOneBase": {
                "val": "34.448"
            },
            "BudgetYearTwo": {
                "val": "35.260"
            },
            "BudgetYearThree": {
                "val": "27.157"
            },
            "BudgetYearFour": {
                "val": "17.480"
            },
            "BudgetYearFive": {
                "val": "17.829"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "A. Mission Description and Budget Item Justification\nThe Department of Defense Human Resources Activity (DHRA) is a DoD-wide Field Activity chartered to support the Under Secretary of Defense for Personnel and Readiness (USD (P&R)). This PE includes application of R&D to expedite prototype development and mission support efforts to sustain and\/or modernize operations required for general RDT&E.\n\nFor FY 2017, as a result of a Business Process and Systems Review, DHRA implemented a major reorganization that impacted the DHRA RDT&E budget.  The most significant aspect of this reorganization, from a RDT&E perspective, was the integration of the Enterprise Human Resources Information System (EHRIS) into the Defense Manpower Data Center’s (DMDC) portfolio of information technology (IT) initiatives.  Additionally, DHRA has implemented a major reorganization of the DMDC programs to more accurately align budget program lines with the DHRA Information Technology (IT) data reported in the DHRA IT Budget.  The Defense Eligibility and Enrollment System (DEERS); Data Governance; Real Time Automated Personnel Identification System (RAPIDS); Common Access Card (CAC); the Cyber Security program has been integrated into the DEERS and RAPIDS programs, with CAC being retained as part of the RAPIDS program.  Synchronized Pre-deployment and Operational Tracker (SPOT) has been integrated into a Personnel Accountability (PA) program that also includes Joint Personnel Accountability Reconciliation and Reporting (JPARR), and the Noncombatant Evacuation Operations (NEO) Tracking System (NTS).\n\nProject 1: DCPDS - this project is described below in Project #10 EHRIS where it has been realigned.\n\nProject 5:  ESGR Awards & Activity Tracking (AATR) Tool. Employer Support of the Guard and Reserve (ESGR) requires a comprehensive web-based application (Awards and Activity Tracking and Reporting) to track ESGR Activities to include briefings and recognition of civilian employers and briefings of National Guard and Reserve that will track against organizational goals vs. costs and the hours donated by Volunteers.  The application will replace several manual processes that use Microsoft Excel spreadsheets across 54 State Committees and through contractor support.  This will also place all critical data in a DoD Data Center. Development of a web-based application would immensely improve data collection and analysis while allowing field staff and volunteers to better focus on operations and mission accomplishment.  The application would be an addition to ESGR’s current Portal that contains ESGR’s member management, inquiry and case management, and freedom award nomination systems. \n\nProject 6:  Enterprise Data Management (EDS) is addressing two critical projects in FY 2020: 1) JOM and 2) EDDIE.  1) The Joint Officer Management (JOM) modernization initiative will support improvements in the Joint Manpower Information System’s (JMIS) automation, reliability, accuracy, and system interoperability to enable the Department to more effectively comply with Title 10 management requirements of Joint Duty Officers in the Active and Reserve forces, and improve the sight picture of joint officer personnel capabilities and readiness for the SECDEF and the Chairman, Joint Chiefs of Staff (CJCS).  The JMIS is the DoD’s sole IT system to inform the SECDEF and CJCS on their operational joint personnel officer readiness capability.  The system is used to track joint duty billets, and the officers assigned to them. It also tracks joint duty experiences, education, training, and qualifications for facilitation of joint duty officer assignments and promotions.  The legacy system was built in the 1990’s and is no longer agile enough to support today’s mission.  This modernization project will bring JOM into the 21st century while addressing critical compliance issue around cyber security, and legislative and policy changes for which the legacy system has been unable to keep pace.  2) The Enterprise Data to Decisions Information Environment (EDDIE) introduces a streamlined way to provide person based “data as a service” and “analytics as a service” to all of DoD and other Federal Agencies. It enables and improves all types of analytics from standard reporting to more emergent and embedded predictive\/prescriptive analytics.  EDDIE will assist decision makers in forming relevant questions, retrieving pertinent information, and informing policy and program changes.  In FY 2020 development will begin based on the findings of the Analysis of Alternatives.\n\nProject 7:  Defense Sexual Assault Incident Database (DSAID). DSAID serves as the Department’s only centralized, case-level database for the collection and maintenance of information regarding sexual assaults involving Service members, via both Unrestricted and Restricted Reporting options. In addition, DSAID accommodates a variety of uses, including the tracking of sexual assault victim support services, support Sexual Assault Prevention and Response (SAPR) program administration, program reporting requirements, and data analysis. DSAID will also facilitate reports to Congress on claims of retaliation in connection with an Unrestricted Report of sexual assault made by or against a member of the Armed Force, and serve as a repository for documents necessary for victim future support. Service Sexual Assault Response Coordinators (SARCs) use the system to track support to victims of sexual assault throughout the lifecycle of support requirements that facilitate sexual assault case transfer between SARCs and Services.  \nThe DoD SAPR Office and Service headquarters-level users access the system as a management tool for statistical analysis, tracking, Congressional and ad-hoc reporting, evaluating program effectiveness, conducting research, and case and business management. In order to facilitate analysis at the OSD level, the System is able to easily export data for analysis in statistical applications, such as Statistical Package for the Social Sciences (SPSS). DSAID includes safeguards to shield personally identifiable information (PII) from unauthorized disclosure, and stringent user access control in place.\n\nCurrently CAP utilizes a Government-Off-The-Shelf (GOTS) product designed to support the program’s robust mission.  This product, CAP Portal, is used primarily to process DoD and other government agencies requests for hardware, software, training, and other miscellaneous accommodation services.  CAP Portal also processes information pertaining to developing and tracking requirements packages, market research, events and outreach to include proposals, presentations, materials, and assistive technology.  The CAP Portal allows staff and contract support personnel to utilize all aspects of its functionality to facilitate the provision of reasonable accommodations, and run various reports to make financial forecasts with the data that is contained within the system.\n\nProject 9:  OPA Testing and Assessment Division administers testing programs, which enable the Armed Services to select highly qualified military recruits.  The DoD uses a single test, the Armed Services Vocational Aptitude Battery (ASVAB), to determine eligibility of military applicants and to report recruit quality data to Congress.  High quality recruits are obtained from administering the ASVAB annually to approximately 600,000 applicants for Military Service as part of the DoD Enlistment Testing program, and to 1 million students in the DoD Student Testing program. Each Service also uses ASVAB test forms developed in this program as part of their in-service testing programs. New ASVAB test forms and related support materials are implemented approximately every four years.  This allows DoD to make measurement improvements as well as decrease the likelihood of test compromise.  Ongoing RDT&E efforts include development and evaluation of procedures which (1) reduce or eliminate threats to the validity of the ASVAB test scores generated; (2) improve the efficiency of the test development, calibration, and validation process; and (3) improve selection and classification decisions made by each Service through more effective use of test score information.  In addition, periodic assessments are required to provide DoD manpower planners and Congress with information on aptitude trends in the population from which recruits are drawn. \n\nProject 10:  The Enterprise Human Resource Information System (EHRIS) is comprised of the Defense Civilian Personnel Data System (DCPDS), Civilian HR IT Managed Services, Civilian HR IT Enterprise Services, and Civilian HR IT Program Planning and Management.  \n- DCPDS is the DoD enterprise civilian personnel HR system, servicing approximately 900,000 users worldwide.  The system holds all authoritative civilian employee “personal data” and personnel actions, and provides HR business capabilities to support the end-to-end HR line of business and employee self-service capabilities, such as benefits election.  The DCPDS program implements systems training, testing, and requirements management that provides user and administrator training for DCPDS and performs integrated testing for DCPDS and DoD HR IT systems to ensure proper operations throughout their life cycles.  \n-Civilian HR IT Managed Services is responsible to customers for deployment and management of civilian HR IT systems delivered to the DoD by external government service providers, such as the Office of Personnel Management (OPM).  Services currently managed include staff acquisition (USA Jobs and USA Staffing) and the electronic official personnel folders (eOPF).  DMDC’s role is to centrally manage the Department’s requirements for these services so that the service provider (in most cases OPM) is working with a single point of contact at DoD. \n-Civilian HR IT Enterprise Services is responsible to customers for the development, operations, and sustainment of all other enterprise civilian HR IT capabilities not provided by DCPDS or external government service providers.  These systems are typically unique to the DoD and allow the DoD to automate the remainder of the end-to-end HR line of business.  \n-Civilian HR IT Program Planning and Management centralizes civilian HR IT planning and strategy activities within DMDC in order to create an integrated plan for the future that both aligns with higher level guidance and takes into account requirements and priorities across the Department for automation of civilian HR IT processes.  This program works with functional sponsors and users to produce validated functional requirements, as well as technical requirements that apply to all DoD HR IT systems. \n\nProject 11:  Personnel Accountability program is comprised of several systems, including: Synchronized Pre-deployment Operational Tracker Enterprise Suite (SPOT-ES), Joint Personnel Accountability Reconciliation and Reporting (JPARR), Defense Travel System (DTS)\/Defense Travel System Modernization and Noncombatant Evacuation Operations (NEO) Tracking System (NTS).  This family of systems represents end-to-end tracking, reconciliation and reporting of DoD personnel location and movements, to include military, DoD affiliated civilian, contractor and U.S. citizens.  This includes DoD travel, contracts, and contractor personnel tracking in support of contingencies, military readiness, reporting of locations at the unit and person level, accountability of DoD personnel during (and after) natural or man-made disasters and accountability and visibility of noncombatant evacuees.  \n\nProject 12:  Personnel Security Assurance (PSA) provides comprehensive capabilities to perform processing and verification of security clearances for all DoD military personnel, civilians and contractors including the technology and processes that need to be addressed in order to implement Continuous Evaluation.  Funding in this program support the Defense Information System for Security (DISS) which transferred to DHRA\/DMDC from DLA in FY 2017.  The DISS mission is to consolidate the DoD personnel security mission into an enterprise adjudicative case management system that will automate the implementation of improved national investigative and adjudicative standards to eliminate costly and inefficient work processes and increase information collaboration across the community. \n\nProject 13:  The Federal Voting Assistance Program (FVAP) administers many of the federal responsibilities of the Uniformed and Overseas Citizens Absentee Voting Act (UOCAVA) of 1986 and other federal military voter registration and assistance laws.  FVAP works to ensure Service members, their eligible family members and overseas citizens are aware of their right to vote and have the tools and resources to successfully do so – from anywhere in the world.  FVAP works to Increase the likelihood of interested Active Duty Members to use available FVAP resources to increase their level of awareness of available DoD voting assistance resources, which will increase the likelihood of returning their absentee ballot.  FVAP conducts voting research projects with States, local election jurisdictions and private entities to assist UOCAVA voters to register to vote and submit their absentee ballot and improve federal, State and local election processes and procedures.\n\nProject 14:  Defense Travel System-Modernization (Pilot) - The DoD Travel System Pilot Program (DTSPP), is part of the DTS-M effort, to determine the viability of using commercial-off-the-shelf software as a service (CSaaS) to conduct DoD travel."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "30.356"
                },
                "CurrentYear": {
                    "val": "24.914"
                },
                "BudgetYearOne": {
                    "val": "34.448"
                },
                "BudgetYearOneBase": {
                    "val": "34.448"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "22.856"
                },
                "CurrentYear": {
                    "val": "24.914"
                },
                "BudgetYearOne": {
                    "val": "34.448"
                },
                "BudgetYearOneBase": {
                    "val": "34.448"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-7.500"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-7.500"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "Congress reduced DHRA by -$7.500 million in FY 2018 for prior year carryover."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "5"
                    },
                    "ProjectTitle": {
                        "val": "ESGR Awards and Activity Tracking & Reporting (AATR) Tool"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.595"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Redesign the ESGR Portal that contains the Inquiry and Case Management System, Member Management System, and Secretary of Defense Employer Support Freedom Award Nomination (FAN) system to account for technology changes and migrate to an approved DoD or Federal Cloud environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ESGR Redesign\/Technical Refresh"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.595"
                                            },
                                            "Text": {
                                                "val": "• ESGR Portal Redesign\/Technical Refresh"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "6"
                    },
                    "ProjectTitle": {
                        "val": "Enterprise Data Services"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.134"
                        },
                        "CurrentYear": {
                            "val": "4.856"
                        },
                        "BudgetYearOne": {
                            "val": "14.434"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.434"
                        },
                        "BudgetYearTwo": {
                            "val": "17.880"
                        },
                        "BudgetYearThree": {
                            "val": "10.637"
                        },
                        "BudgetYearFour": {
                            "val": "0.644"
                        },
                        "BudgetYearFive": {
                            "val": "0.658"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Supports research and development efforts on two critical projects, JOM and EDDIE.  The Joint Officer Management (JOM) modernization initiative will support improvements in the Joint Manpower Information System’s (JMIS) automation, reliability, accuracy, and system interoperability of the program that tracks and manages joint personnel officer readiness capability.  The Enterprise Data to Decisions Information Environment (EDDIE) introduces a streamlined way to provide person based “data as a service” and “analytics as a service” to all of DoD and other Federal Agencies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enterprise Data Services (EDS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.134"
                                            },
                                            "Text": {
                                                "val": "•  Procure the Automated Regression and Functional Testing (EoSL) Modernization\n•  Install Microsoft Forefront Identity Management (FIM)\n•  Implement Network (EoSL) Lifecycle Modernization\n•  Modernize the VTC\/AV Upgrades for DoDC (Seaside) and Mark Center (EoSL) Lifecycle Modernization\n•  Server End of Service Life (EoSL) Lifecycle Modernization\n•  Wireless Local Area Network (WLAN) (EoSL) Lifecycle Modernization\n•  Destruction Of Mainframe Tapes\n•  Implementation of Audit Log Management\n•  Continued development and implementation of the Intrusion Detection System \/ Intrusion Prevention System (IDS\/IPS)\n•  Continued installation of required Port Aggregators\n•  Implement Rogue System Detection (RSD)\n•  Implement Dynamic Code Scanning Solution (NTO Spider)\n•  Implement Static Code Scanning Solution (Fortify)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.856"
                                            },
                                            "Text": {
                                                "val": "•  Research JOM requirements and perform decomposition of the technical implementation requirements and specifications needed for the development efforts.\n•  Develop JOM proposed architecture for modernized system.\n•  Evaluate JOM interoperability requirements and system interfaces.\n•  Research existing alternatives and develop an Analysis of Alternatives for the EDDIE environment.\n•  Evaluate the DISA Data Lake, CIO Data Environment, and PDE Enhancement.\n•  Develop the architecture and design for EDDIE.\n•  Collaborate with the Federally Funded Research and Development Centers (FFRDC), Policy Offices, and other stakeholders on EDDIE.\n•  Perform business process reengineering in support of EDDIE to improve the approval processes in gaining access to the data, \n•  Define EDDIE workflow.\n•  Define the minimal and optimal data universe required for the EDDIE collaborative environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.434"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.434"
                                            },
                                            "Text": {
                                                "val": "•  JOM technical implement begins and continues through FY 2022.\n•  Provides JOM configuration management support. \n•  Deploys JOM to internal\/user testing and Production Environments.\n•  Install, configure, and integrate software and middleware to host EDDIE.\n•  Implement EDDIE architecture and migrate data assets for inclusion in the pilot implementation.\n•  Create the software workflows and data governance processes necessary to store candidate data assets in the EDDIE system.\n•  Extend EDDIE self-service capability to selected user communities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The EDS project increase from FY 2019 to FY 2020 supports increased funding for both the JOM modernization project and the EDDIE project. FY 2019 funding provided initial start-up funds, but the bulk of the development work for each program will begin in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "7"
                    },
                    "ProjectTitle": {
                        "val": "DSAID"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "1.932"
                        },
                        "PriorYear": {
                            "val": "3.570"
                        },
                        "CurrentYear": {
                            "val": "1.800"
                        },
                        "BudgetYearOne": {
                            "val": "2.984"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.984"
                        },
                        "BudgetYearTwo": {
                            "val": "0.669"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Defense Sexual Assault Incidents Database (DSAID) is the integrated DoD SAPR Data Collection and Reporting System that accommodates a variety of uses, including the tracking of sexual assault victim support services, support SAPR program administration, program reporting requirements, and data analysis."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Sexual Assault Incidents Database (DSAID)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.570"
                                            },
                                            "Text": {
                                                "val": "•\t6 Server Upgrade\n•\tDevelop Secure File Locker Mechanism\n•\tIncorporate DSAID Control Board (CCB) approved and pending Change Requests (CRs) (e.g. Sharing VAs across Services)\n•\t Add functionality to the Enhanced Reporting Capability\n•\tImplement or update interfaces with Service Legal Agency Systems, personnel systems, and external databases (DMDC\/DEERS)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.800"
                                            },
                                            "Text": {
                                                "val": "•\tAdd Business Intelligence tools to the Enhanced Reporting Capability Module\n•\tIncorporate DSAID Control Board (CCB) approved and pending Change Requests (CRs) (e.g. Create Retaliation and Document Management Modules)\n•\tImplement an interface with the DEERS."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.984"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.984"
                                            },
                                            "Text": {
                                                "val": "•\tThe Joint Services Provider (JSP) has required all systems moved out of the Pentagon enclave. This requirement necessitates SAPRO to move DSAID to new server environment with additional system requirements in FY 2020.  \n•\tFY 2019 requires the Department to expand Congressional reporting requirements to include data on collateral misconduct and expedited transfers for adult dependents.  SAPRO will add required data elements as a new module in DSAID."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease in funding $1.770M from FY 2018 to FY 2019 - realigning planned FY 2019 requirements to FY 2020 and FY 2021 and prioritizing those requirements and associated funding:\n•\tImplement or update interfaces with the Service Investigative Agencies, Family Advocacy and Sexual Harassment Programs.\n•\tAdd Service interface (e.g. Navy & USMC Resiliency Management system) to the Enhanced Reporting Capability Module.\n•\tCreate additional Legal Officer (LO) Modules for Regional Judge Advocates, Academies, the National Guard Bureau (NGB), and the Coast Guard."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "•\tIn accordance with contract Plan of Action & Milestones."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "8"
                    },
                    "ProjectTitle": {
                        "val": "CAP"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.290"
                        },
                        "CurrentYear": {
                            "val": "1.292"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Computer\/Electronic Accommodations Program (CAP) Portal has been certified as a Defense Business System (DBS). This project will help CAP obtain and maintain an optimized and certified DBS that executes data collection, records management, and reporting accountability for all stakeholders.  In order to enhance areas of program data-tracking capabilities and stabilize the environment for future operations, CAP requires modernization of CAP Portal.  The CAP Portal has pages\/controls that have accumulated up to 7,000 lines of code, making it difficult to ensure the reliability of any updates made to the system which has undergone over 500 change requests since its launch.\nThere are components and functionality that are no longer being utilized and others needed, but it is risky to remove or disable due to the interconnected nature of the codebase.  The current codebase utilizes an outdated framework that is difficult to maintain.  The CAP Modernization Project will implement a .NET Model View Controller (MVC) framework to separate the business, display and input layers of the code.  As CAP’s operating procedures evolve, CAP Portal’s current structure will not match the changing business needs of its users.  Towards that end, the issue of restructuring CAP Portal is necessary to ensure flexibility and reliability moving forward.  As a result of an outdated framework, the current CAP Portal is becoming increasingly challenging to maintain and less reliable when making updates.  The CAP Modernization Project will provide a restructured database for CAP Portal with an updated codebase to provide a solid foundation that supports CAP’s current structure and business processes while also increasing flexibility for future enhancements and efficiencies.  All aspects of CAP Portal will be enhanced by this project, which will provide a streamlined foundation on which to incorporate new internal processing workflow entitled ONE CAP.  It will provide the ability to implement new processes that reflect the current organization, roles, responsibilities, tasks and specific workflow and assignments.  The modernization of technology will ensure full integration of the new internal operating model."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "The Computer\/Electronic Accommodations Program (CAP)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.290"
                                            },
                                            "Text": {
                                                "val": "Enhancements in FY 2018 will include development efforts along several lines.  One such effort will be increasing the ability for CAP Staff to update content on the CAP website, CAP Mobile App, and communications template to reduce dependence on external resources to make these changes.  Also included are development efforts aimed at enhancing the ability of CAP Staff to document process actions within the system in support of procurement and acquisition records keeping requirements as well as to facilitate effective relationship management between CAP, the DoD, Federal partner agencies, and other stakeholders.  Another major effort will be increasing the self-service accessibility of information to CAP customers to reduce the level of effort required to pass on information regarding their requests for reasonable accommodation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.292"
                                            },
                                            "Text": {
                                                "val": "FY 2019 is a continuation of the efforts accomplished in FY 2018."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project complete in FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9"
                    },
                    "ProjectTitle": {
                        "val": "Office of People Analytics (OPA), Testing and Assessment"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "2.686"
                        },
                        "PriorYear": {
                            "val": "2.640"
                        },
                        "CurrentYear": {
                            "val": "2.419"
                        },
                        "BudgetYearOne": {
                            "val": "5.089"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.089"
                        },
                        "BudgetYearTwo": {
                            "val": "4.767"
                        },
                        "BudgetYearThree": {
                            "val": "4.244"
                        },
                        "BudgetYearFour": {
                            "val": "4.329"
                        },
                        "BudgetYearFive": {
                            "val": "4.416"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The primary mission of OPA Testing and Assessment is to test and implement more accurate methods of assessing aptitudes required for military enlistment, success in training, and performance on the job. Also, it includes implementing methods that are useful in the identification of persons with the high aptitudes required by today’s smaller and more technically demanding military."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Office of People Analytics (OPA), Testing and Assessment"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.640"
                                            },
                                            "Text": {
                                                "val": "• Develop automated item generation of General Science and Arithmetic Reasoning items\n• Research efforts on new measures\/new content that could potentially be added to the ASVAB"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.419"
                                            },
                                            "Text": {
                                                "val": "• Improve the efficiency of the test development, calibration, and validation process\n• Continue research efforts on new measures\/new content that could potentially be added to the Armed Services Vocational Aptitude Battery (ASVAB)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.089"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.089"
                                            },
                                            "Text": {
                                                "val": "• Improve the efficiency of the test development, calibration, and validation process\n• Continue research efforts on new measures\/new content that could potentially be added to the ASVAB\n• Build\/Improve methods to conducted automated test item generation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Full funding for FY 2020 will allow development and implementation of new tests with higher predictive validity for predicting success in training to proceed.  Reprioritized projects and realigned some planned FY 2019 requirements to FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "10"
                    },
                    "ProjectTitle": {
                        "val": "Enterprise Human Resource Infor System(EHRIS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "4.585"
                        },
                        "PriorYear": {
                            "val": "6.827"
                        },
                        "CurrentYear": {
                            "val": "3.127"
                        },
                        "BudgetYearOne": {
                            "val": "4.380"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.380"
                        },
                        "BudgetYearTwo": {
                            "val": "4.383"
                        },
                        "BudgetYearThree": {
                            "val": "4.511"
                        },
                        "BudgetYearFour": {
                            "val": "4.602"
                        },
                        "BudgetYearFive": {
                            "val": "4.692"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The planned Civilian HR automation enhancements are focused on software development to rationalize and modernize legacy systems and standalone systems to support the Department’s civilian workforce, including a DoD-Wide performance management system; enhancement of employee competency assessment capability and talent management; modernization of the Priority Placement Program and Reemployment Priority List; and integration of succession planning.  In addition, changes to the Defense Civilian Personnel Data System (DCPDS) are required for the Office of Personnel Management (OPM) mandates, HR Line of Business (LoB) directives, electronic Official Personnel Folder changes, and Retirement Systems Modernization implementation.  DoD is one of five designated Shared Service Centers in the federal government focused on providing standard services across agency lines, potentially gaining significant business and cost-saving benefits.  DoD is considered a leader in this initiative.\n\nDCPDS is the Department’s enterprise civilian HR system that has proven a recurring $200M annual cost-avoidance originally projected in the achievement of full operational capability in 2002 and which continues to operate as the DoD system serving over 900,000 employee records.  Additional initiatives to sustain the Department’s lead in automated systems include expansion the Oracle eBusiness Suite (EBS) capability to provide self-service functionality, centralized payroll support, and data warehouse improvements.  Compliance with a number of directives, such as Data Center Optimization Initiative (DCOI) and Financial Audit Readiness (FIAR), drive additional consolidation requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enterprise Human Resource Infor System (EHRIS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.827"
                                            },
                                            "Text": {
                                                "val": "• Continue to deliver improved Benefits processing and employee self service capabilities\n• Continue completion efforts on consolidation to single database\n• Continue work on integration of time and attendance and payroll processing"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.127"
                                            },
                                            "Text": {
                                                "val": "Deploy Modernized Priority Placement Program and Reemployment Priority List Solution\n• Pilot USA Performance for Executive Performance Management\n• Explore Succession Planning \n• Develop cloud based solution for the migration of Civilian HR tools from the current DCPDS. \n• Develop replacement solutions for required capability currently existing in DCPDS that have been determined to be out of scope for initial IT\n• Reform Initiative to move to Software as a Service (SaaS)\n• Complete HRIT enterprise system hosting transition to DISA\n• Begin strategy for integration of time and attendance & payroll processing"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.380"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.380"
                                            },
                                            "Text": {
                                                "val": "• Continue exploring ways of transforming portfolio from on premise IT support to SaaS\n• Configure SaaS to replace attendance support\n• Configure SaaS to replace\/enhance Competency Management and Talent Management\n• Explore Benefits Management capability in SaaS offering"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This increase supports the work required to re-develop and migrate the validated HR capability currently provided in DCPDS to a new solution."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "11"
                    },
                    "ProjectTitle": {
                        "val": "Personnel Accountability (PA)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "1.774"
                        },
                        "PriorYear": {
                            "val": "5.000"
                        },
                        "CurrentYear": {
                            "val": "3.330"
                        },
                        "BudgetYearOne": {
                            "val": "2.174"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.174"
                        },
                        "BudgetYearTwo": {
                            "val": "2.174"
                        },
                        "BudgetYearThree": {
                            "val": "2.237"
                        },
                        "BudgetYearFour": {
                            "val": "2.282"
                        },
                        "BudgetYearFive": {
                            "val": "2.327"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The PA program is comprised of three sub-programs: Synchronized Pre-deployment and Operational Tracker (SPOT), Joint Personnel Accountability Reconciliation and Reporting (JPARR), and the Noncombatant Evacuation Operations (NEO) Tracking System (NTS).   This family of systems represents end-to-end tracking, reconciliation and reporting of DoD personnel location and movements, to include military, DoD affiliated civilians, contractors, and U.S. citizens. This includes DoD contracts, and contractor personnel tracking in support of contingencies, military readiness, reporting of locations at the unit and person level, accountability of DoD personnel during (and after) natural or man-made disasters, and accountability and visibility of noncombatant evacuees.  SPOT is the DoD system of record for accountability and visibility of contracts and contractor personnel authorized to operate in a contingency operation.  JPARR is a \"public\" SIPR only application that provides daily person- level location reporting.  JPARR receives feeds for Service and Agency deployment systems, reconciles the data, and provides various reports at unit level detail.  NTS is a certified and accredited DoD automated system that accounts for, and sustains visibility of noncombatant evacuees during a NEO."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Personnel Accountability (PA)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "•  Modernize hardware and peripheral footprint\n•  Automate and reduce maintenance requirements for fielded systems \n•  Modernize data management and data processing\n•  Modernize application technologies and processes\n•  Develop application programing interfaces (API) and micro services \n•  Research and develop mobile technologies\n•  Identify, reduce and consolidate fragmented\/duplicated personnel accountability systems"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.330"
                                            },
                                            "Text": {
                                                "val": "Enhancements will reduce the physical footprint of systems such as NEO and SPOT-ES (Joint Asset Movement Management System).  In coordination with PACOM, DMDC will be creating the ability to pre-populate a NEO with the affected population to ensure faster more accurate accountability.   Personnel Accountability will be looking at an effort to analyze and develop a plan to migrate SPOT-ES from the .NET framework to the Java technology stack standard supported by DMDC which will allow development and operations to live on DMDC shared application infrastructure.   \n\nPersonnel Accountability will also work towards several new modernization efforts to include development and implementation of distributed processing, business intelligence and geographic information system (GIS) tools to support the Contingency Tracking System (CTS) and Joint Personnel Accountability Reconciliation and Reporting (JPARR) systems.  Additionally we will research and create an integration plan for the possible use of Blue Force Tracking data and Radio-frequency identification (RFID) scanning technologies for evacuation and personnel accounting operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.174"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.174"
                                            },
                                            "Text": {
                                                "val": "Enhancements will include modernization and integration of the products in the PA program. Enhancements will also allow for development of new features within the SPOT, JAMMS and NTS systems to include additional online capabilities. Funding will also be used for the transformation of travel capabilities using a commercial travel solution."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease is attributable to the completion of FY 2019 New Travel System and DTS Modernization Pilot funding."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "12"
                    },
                    "ProjectTitle": {
                        "val": "Personnel Security Assurance (PSA)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "4.253"
                        },
                        "PriorYear": {
                            "val": "3.000"
                        },
                        "CurrentYear": {
                            "val": "4.116"
                        },
                        "BudgetYearOne": {
                            "val": "4.594"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.594"
                        },
                        "BudgetYearTwo": {
                            "val": "4.594"
                        },
                        "BudgetYearThree": {
                            "val": "4.728"
                        },
                        "BudgetYearFour": {
                            "val": "4.823"
                        },
                        "BudgetYearFive": {
                            "val": "4.920"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Personnel Security Assurance (PSA) provides comprehensive capabilities to perform processing and verification of security clearances for all DoD military personnel, civilians and contractors including the technology and processes that need to be addressed in order to implement Continuous Evaluation.  Funds within this program will support the Defense Information System for Security (DISS).  The DISS mission is to consolidate the DoD personnel security mission into an enterprise adjudicative case management system that will automate the implementation of improved national investigative and adjudicative standards to eliminate costly and inefficient work processes and increase information collaboration across the community."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Personnel Security Assurance"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "•  FY 2018 RDT&E will be used for DISS development to meet emerging interface or architecture requirements as well as data quality initiatives."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.116"
                                            },
                                            "Text": {
                                                "val": "FY 2019 RDT&E will be used for DISS development to meet National Security, Suitability and Credentialing reform initiatives."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.594"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.594"
                                            },
                                            "Text": {
                                                "val": "FY 2020 funding will be used to complete development of the DISS solution and finalize integration with Joint Verification System and National Background Investigation System interfaces."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "DISS development continues in FY 2020.  Increase can be attributed to a combination of price growth and normal schedule fluctuations associated with modernization."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "13"
                    },
                    "ProjectTitle": {
                        "val": "Federal Voting Assistance Program"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.800"
                        },
                        "CurrentYear": {
                            "val": "0.793"
                        },
                        "BudgetYearOne": {
                            "val": "0.793"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.793"
                        },
                        "BudgetYearTwo": {
                            "val": "0.793"
                        },
                        "BudgetYearThree": {
                            "val": "0.800"
                        },
                        "BudgetYearFour": {
                            "val": "0.800"
                        },
                        "BudgetYearFive": {
                            "val": "0.816"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "FVAP administers many of the federal responsibilities of the Uniformed and Overseas Citizens Absentee Voting Act (UOCAVA) of 1986 and other federal military voter registration and assistance laws.  FVAP works to ensure Service members, their eligible family members and overseas citizens are aware of their right to vote and have the tools and resources to successfully do so – from anywhere in the world.  FVAP works to Increase the likelihood of interested Active Duty Members to use available FVAP resources to increase their level of awareness of available DoD voting assistance resources, which will increase the likelihood of returning their absentee ballot.  FVAP conducts voting research projects with States, local election jurisdictions and private entities to assist UOCAVA voters to register to vote and submit their absentee ballot and improve federal, State and local election processes and procedures."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Federal Voting Assistance Program"
                                    },
                                    "Description": {
                                        "val": ": The Federal Voting Assistance Program (FVAP) requires a research and analysis policy clearinghouse program that continues to research and present the value of key policy and technology topics that connects to the successful return of absentee balloting materials from military and overseas citizen voters pursuant to the Uniformed and Overseas Citizens Absentee Voting Act (UOCAVA)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "FVAP requires a clearinghouse through a cooperative agreement with a nonprofit organization to work with FVAP to develop innovative programs to support uniformed overseas and civilian overseas voters.  \n•  Assess the impact of previous efforts to enact structured data feeds from the States and localities with the most populous number of military and overseas voters. \n•  Identify and assess the process to assess voter residency and how it impacts overseas citizen voters attempting to vote in federal elections.  \n•  Study the extent to which States enact authorizations for the use and acceptance of electronic signatures derived from the Department of Defense Common Access Card (CAC), or its successor. \n•  Identify the feasibility and risks associated with a comprehensive approach for States to establish a single statewide office with the technology and software to process UOCAVA absentee balloting materials. \n•  Monitor the implementation, adoption and impact of clearinghouse recommendations and voting technology practices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.793"
                                            },
                                            "Text": {
                                                "val": "FVAP efforts in FY 2019 are a continuation of the cooperative agreement from FY 2018."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.793"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.793"
                                            },
                                            "Text": {
                                                "val": "The program mission efforts continue from FY 2019."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No program changes between FY 2019 and FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Each project contained within this program contains specific metrics to determine progress towards completion. Metrics for all include completed and documented analysis provided by the performer. The completion date for that analysis varies with each project. In addition, to that analysis, each effort contains a roadmap addressing the best use of the findings throughout the department. If the results of the analysis show benefit to the Department, those findings are included in policy, doctrine, tactics and procedures.  The project will yield actionable findings on how to best assist UOCAVA voters while reducing the overall reporting burden for these States to provide data on the number of absentee ballots transmitted to and received from military and overseas citizens after each federal election.  Process mappings about how the Federal Post Card Application and the Federal Write-in Absentee Ballot, are treated by States for uniformed overseas and civilian overseas citizens and the impact of their residency classifications will identify the extent of uniformed and civilian overseas citizens who vote.   The acceptance of electronic signatures derived from the Common Access Card within the Department provides significant potential for ensuring the absentee balloting process is seamless for active duty military members by permitting the use of an electronic signing and submission of an absentee ballot application in those States that permit an electronic submission.  This will measure the extent to which States have proceeded with the consideration and adoption of authorizing statutes or administrative rules to permit the use of electronic signatures in a limited fashion and for a limited population of uniformed overseas voters."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "14"
                    },
                    "ProjectTitle": {
                        "val": "Defense Travel System-Modernization (PILOT)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "3.181"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The DoD Travel System Pilot Program (DTSPP), is part of the DTS-M effort, to determine the viability of using commercial-off-the-shelf software as a service (CSaaS) to conduct DoD travel."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Travel System-Modernization"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Defense Travel System (DTS).  At the request of Acting Secretary of Defense, DHRA is conducting a DoD Travel System Pilot Program (DTSPP), as part of the DTS-M effort, to determine the viability of using commercial-off-the-shelf software as a service (CSaaS) to conduct DoD travel."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.181"
                                            },
                                            "Text": {
                                                "val": "DTS supports $3.0 Billion in annual travel across the DoD.  DTSPP will investigate the use of CSaaS to conduct DoD Travel under the Federal and Joint Travel Regulations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "The Defense Travel System-Modernization project will reside within the Personnel Accountability  (PA) program."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The Defense Travel System-Modernization project will reside within the Personnel Accountability  (PA) program."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}