{
    "id": "2020-Army-PB-2040-JBOOK-caa98a5fe7b001fc6e9636b55add742024da70b1a5204a85a180c10adbb25455-29",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602782A"
        },
        "ProgramElementTitle": {
            "val": "Command, Control, Communications Technology"
        },
        "R1LineNumber": {
            "val": "35"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "32.458"
            },
            "CurrentYear": {
                "val": "54.956"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "87.414"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) is being realigned, with continuity of effort realigned to the following PEs:\n* PE 0602146A Network C3I Technology\n* PE 0602213A C3I Applied Cyber"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE researches and investigates communications, mission command (MC), and electronics components, sub-components, software and protocols that provide the Army with enhanced capabilities for secure, mobile, networked communications, assured information delivery, and presentation of information that enables decision-making. Commercial technologies are continuously investigated and leveraged where possible. Project 779 researches and develops MC software, algorithms, protocols, architectures, and devices that enable management of information across the tactical and strategic battle space; provides automated cognitive reasoning and decision making aids; allows timely distribution, presentation\/display and use of MC data on Army platforms; and researches alternatives to Global Positioning System (GPS) for positioning, navigation and timing. Project CY2 investigates cyber electromagnetic activities (CEMA), cyber security devices, software and techniques to harden wireless communications networks against cyber-attacks and new mobile networking protocols that afford resilience within our networks to autonomically 'fight through' and\/or evade hostile cyber effects. Project H92 supports research in communications components, software, algorithms and protocols, which allow field commanders to communicate on-the-move to\/from virtually any location, through a seamless, secure, self-organizing, self-healing network.\n\nWork in this PE complements PE 0601104A (University and Industry Research Centers), PE 0602270A (Electronic Warfare Technology) , PE 0602705A (Electronics and Electronic Devices), PE 0603270A (EW Technology), PE 0603772A (Adv Tactical Computer Science & Sensor Technology), and PE 0603794A (C3 Advanced Technology).\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "33.123"
                },
                "CurrentYear": {
                    "val": "55.003"
                },
                "BudgetYearOne": {
                    "val": "49.895"
                },
                "BudgetYearOneBase": {
                    "val": "49.895"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "32.458"
                },
                "CurrentYear": {
                    "val": "54.956"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.665"
                },
                "CurrentYear": {
                    "val": "-0.047"
                },
                "BudgetYearOne": {
                    "val": "-49.895"
                },
                "BudgetYearOneBase": {
                    "val": "-49.895"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.013"
                    },
                    "CurrentYear": {
                        "val": "-0.047"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.652"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-49.895"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-49.895"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY20 decrease related to science and technology financial restructuring."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "779"
                    },
                    "ProjectTitle": {
                        "val": "Command, Control And Platform Electronics Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.638"
                        },
                        "CurrentYear": {
                            "val": "11.144"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "23.782"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0602146A Network C3I Technology\n* Project AQ6 Command Applications of Machine Learning Technolog\n* Project AQ7 High Tempo Data Driven Decision Tools Technology\n* Project AQ9 Expeditionary Data to Decisions Technology\n* Project AV6 Airborne Engineering Support Technology\n* Project AW1 Autonomous Navigation Technology\n* Project AW3 DoD PNT M&S Collaborative Initiative (CI) Technology\n* Project AW5 Modular GPS Independent Sensors Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project researches moveable and mobile command post hardware and other components, software and algorithms that enable commanders at all echelons to have more accurate, useful, and timely information and allows them to execute mission command (MC) from anywhere on the battlefield. Emphasis is on advancements to MC computing platforms, with a specific emphasis on positioning, navigation, and timing (PNT); user\/computing platform interaction and cognitive burden reduction; informed operations; and commander-centric capabilities, including using automation to augment or supply staff capabilities. This Project researches technologies that support multi-modal man-machine interaction, battle space visualization, positioning and navigation in degraded environments (poor Global Positioning System (GPS) performance), automated cognitive decision aids, real-time collaborative tactical planning tools, open system architectures, and integration concepts which contribute to more efficient expeditionary and uninterrupted operations.\n\nWork in this Project is related to, and fully coordinated with PE 0603772A (Adv Tactical Computer Science & Sensor Technology) \/ Project 101 (Tactical Command and Control). \n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Assured Positioning, Navigation, and Timing (A-PNT)"
                                    },
                                    "Description": {
                                        "val": "This effort investigates positioning, navigation and timing sensor and sensor integration technologies to provide position, velocity, and time information to support operational and training requirements, especially in GPS denied\/degraded environments. This effort also designs PNT modeling and simulation (M&S) architectures, frameworks and models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.114"
                                            },
                                            "Text": {
                                                "val": "Investigated new methods of time transfer and novel ways to reduce size, weight and power for micro autonomous pseudolites to create expendable pseudolites that minimized the risks resulting from compromised assets; conduct research on machine learning concepts applied to navigation of autonomous vehicles to improve an autonomous vehicle's localization and movement through a complex environment over time; continued investigation through an iterative process of design, fabrication, and test for size and performance improvements to miniature inertial sensors to augment PNT in GPS denied environments; completed validation of the use of Multi Global Navigation Satellite Systems signals (signals from foreign nation navigation satellite systems) in military applications; investigated new signals of opportunity for augmenting positioning and timing solutions on the battlefield; researched dismounted anti-jam (AJ) technologies, such as wearable fabric antenna systems; explored potential applications for leveraging the new M-Code GPS signal for offensive and defensive navigation warfare operations; and developed models of PNT sensors, systems, and platforms and conducted simulations of operational scenarios to support Department of Defense (DoD) analysis of the behaviors of PNT devices and the effects these sensors have on the capabilities of United States (U.S.) forces, especially under GPS challenged conditions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.356"
                                            },
                                            "Text": {
                                                "val": "Research and investigate new and novel GPS-independent sensors; investigate innovative ways to use exiting PNT sensors; design and develop sensor fusion algorithms; develop portable sensor fusion core, allowing for a platform-agnostic solution for navigation in GPS denied or degraded environments that can be tailored based on mission or size, weight and power (SWAP) requirements; develop interfaces for GPS independent sensors, allowing connectivity with the portable sensor fusion core; continue investigation of miniature inertial sensors to augment PNT in GPS denied environments; continue research involving LIDAR odometry, visual navigation, and map building as potential sensor packages for use with the sensor fusion core; investigate new signals of opportunity for augmenting positioning and timing solutions on the battlefield; continue to improve localization and movement of an autonomous vehicle using PNT sensors through a complex environment; and continue to develop models of PNT sensors and conduct simulations of operational scenarios, especially under GPS challenged conditions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602146A (Network C3I Technology) \/ Project AW1 (Autonomous Navigation Technology), Project AW3 (DoD PNT M&S Collaboration Initiative (CI) Technology), and Project AW5 (Modular GPS Independent Sensors Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Mission Command Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs and codes software to enable a uniform MC capability and experience for the commander in the command post, on the move in vehicles, or dismounted, increases the situational awareness through software data architectures and algorithms that intelligently share data across low bandwidth networks and across dismounted, mounted and command post platforms, and improves decision making capacity across the battlefield by using software knowledge representation to model mission, enabling artificial intelligence techniques to use the model to automate staff tasks, correlate and analyze information and provide recommendations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.524"
                                            },
                                            "Text": {
                                                "val": "Furthered research, in the second of a three year effort, to develop a software model that is a knowledge representation of a mission to enable automation of tasks such as developing course of action and staff assignment recommendations; researched and developed a framework with standard interfaces that allows externally developed software to communicate with the mission model and leveraged the data to perform real time analytics such as continuous power predictions for the mission; researched and refined business process modeling technologies to assist users with dynamic and reusable workflows that align with the military decision making process or a unit's standard operating procedures; and completed research and investigation of several artificial intelligence techniques including machine learning and intelligent agents that will be down selected and implemented in Fiscal Year (FY) 2019 and FY 2020 to assess the mission objectives and current situation to help with situational understanding by providing visualizations of how the situation is deviating from intent with continuous running estimates and an on-going analysis of risks and opportunities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.639"
                                            },
                                            "Text": {
                                                "val": "Investigate and leverage relevant research and technology in pattern matching and cognitive science; develop data-driven decision tools with pre-populated decision models, user directed machine learning, and machine directed human learning to enhance the speed of decision making in high operational tempo environments; design a software framework to allow the dynamic connection of information sources and sensors to decision tools; and develop and validate visualization techniques that supply increased situational awareness, understanding, and recommendations based on the primary, secondary, and third order effects of decisions through the identification of patterns detected in available battle-space data, resulting in improved decision cycles for commanders and staff."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602146A (Network C3I Technology) \/ Project AQ6 (Command Applications of Machine Learning Technolog), Project AQ7 (High Tempo Data Driven Decision Tools Technology), Project AQ9 (Expeditionary Data to Decisions), and Project AV6 (Airborne Engineering Support Technolog) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.149"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CY2"
                    },
                    "ProjectTitle": {
                        "val": "Applied Defensive Cyber"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "8.257"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "8.257"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0602213A Network C3I Technology\n* Project 2CY Information Trust Technology\n* Project CY6 Autonomous Cyber Technology\n* Project CY8 Cyber Sec Applied Research and Exper Partner Tech\n* Project CY9 Decoy and Deterrence Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates cyber electromagnetic activities (CEMA), cyber security devices, software and techniques to harden wireless communications networks against cyber-attacks and new mobile networking protocols that afford resilience within our networks to autonomically 'fight through' and\/or evade hostile cyber effects. This Project also investigates and applies robust cyber security techniques and applications to advanced communications and networking devices, software, algorithms and protocols utilized within wireless tactical networks to protect against nation state level cyber effects and maintain Warfighter confidence in network information, resources, identities and mission partners by hardening the blue force attack surface.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defensive Cyber Operations"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and applies robust cyber security techniques and applications to advanced communications and networking devices, software, algorithms and protocols utilized within wireless tactical networks to protect against nation state level cyber effects and maintain Warfighter confidence in network information, resources, identities and mission partners by hardening the blue force attack surface. These capabilities will harden the attack surface by ensuring trustworthy software (SW), hardware (HW), information systems, communications and networks. This effort affords resilience within our networks to autonomically 'fight through' and\/or evade hostile cyber effects and provide situational understanding (SU) to enable effective mission planning and execution."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.641"
                                            },
                                            "Text": {
                                                "val": "Research and validate cyber security technologies to improve the depiction, perception, and understanding of cyber space as it pertains to a commander?s operational environment to speed actionable decisions;  research cyber hardening methodologies for software, hardware, identities, and information to create trusted architectures and measures of provable identity, pedigree, and provenance; investigate robust built-in techniques that enable systems and networks to absorb, fight through, and adapt to adversary attacks; research and design autonomic techniques, models and algorithms to support convergence of defensive cyber, offensive cyber, Electronic Warfare (EW), and network\/spectrum management information to improve decision response; research and validate block-chaining methodologies to trace and validate pedigree of tactical information as it traverses the network; research and validate robust non-intrusive identity authentication techniques that supports tactical access control; and will research models and algorithms that can provably determine a confidence factor associated with software vulnerability prioritization."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602213A (Network C3I Technology) \/ Projects CY9 (Decoy and Deterrence Technology), Project CY6 (Autonomous Cyber Technology) and Project 2CY (Information Trust Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Security Applied Research & Experimentation Partner (AREP) Technology (formerly called the Cyber Collaborative Research Alliance (CRA))"
                                    },
                                    "Description": {
                                        "val": "This effort will take innovative basic research theories from the Cyber CRA and experimentally validate the hypothesis and create proof-of-concept defensive cyber software implementations."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.616"
                                            },
                                            "Text": {
                                                "val": "Investigate and validate artificial intelligence and machine learning models and methods for reasoning on real time vulnerability prediction\/analysis at a system-of-system perspective;  investigate use of modeling methodologies and techniques to capture and specify system properties (e.g., structural and behavioral), and characterize cybersecurity attributes (e.g., confidentiality, integrity and availability); investigate biological-inspired self-securing models and methods that can support capabilities to autonomously perform analytic monitoring, maintain dynamic representation, realign their resources as necessary, and be able to substantiate integrity; and will investigate models and methods that can estimate what likely impact a vulnerability will cause to a system or network based on incomplete and inaccurate data."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602213A (Network C3I Technology) \/ Project CY8 (Cyber Sec Applied Research and Exper Partner Tech) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H92"
                    },
                    "ProjectTitle": {
                        "val": "Communications Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.82"
                        },
                        "CurrentYear": {
                            "val": "35.555"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "55.375"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0602146A Network C3I Technology\n* Project AM6 Modular RF Communications Technology\n* Project AM8 Protected SATCOM Technology\n* Project AN3 Non Traditional Waveforms Technology\n* Project AN5 Protected SATCOM-WB Global SATCOM Inter Canc Tech\n* Project AN9 UNT - Every Receiver is a Sensor Technology\n* Project AO2 Stand-In Advanced RF Effects (STARE)\n* Project AP7 Comms\/Horiz Int for Army Mod Priorities Tech\nPE 0602143A Soldier Lethality Technology\n* Project AN1 Narrowband SATCOM Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and applies advanced communications and network devices, software, algorithms and services by leveraging and adapting commercial research and new communications and network sciences work by the Army Research Lab, Network Science Collaborative Technology Alliance or other Basic Research efforts. This Project leverages developments in wireless transport (e.g. mobile radio based communications systems) to design new techniques for improving communications in high radio frequency (RF) interference environments, such as in the presence of electronic warfare (EW), and to increase the communications capacity of terrestrial and satellite communications (SATCOM) systems. This Project also investigates antenna components, materials, designs and configurations to reduce the visual signature of antennas on Soldier, vehicular and airborne platforms and to reduce co-site interference on platforms with multiple transceivers, such as radios and jammers.  Additionally, this Project investigates defensive cyber, cyber security devices, software and techniques to harden wireless communications networks against cyber attacks and new mobile networking protocols to make wireless, on-the-move (OTM) communications networks more responsive to user needs. Beginning in FY19 cyber efforts are being reported in Project CY2. This Project also investigates software and techniques that improve the ability of the Soldier to manage and maintain complex, dynamic networks; and it designs spectrum management software tools to make more efficient use of the congested RF spectrum. This Project also designs new technology and techniques to lower the size, weight, power and cost of networking systems deployed on Army platforms.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Communications, Adaptive Networks to Improve Maneuver Operations, formerly Networking to Improve Maneuver and Expeditionary Operations"
                                    },
                                    "Description": {
                                        "val": "This effort investigates new capabilities to provide a range of robust, reliable, scalable, agile, interoperable and resource efficient communications capabilities to forces on the move. These capabilities allow forces to conduct maneuver operations, develop situational understanding, and sustain operations while maintaining freedom of movement."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.508"
                                            },
                                            "Text": {
                                                "val": "Researched, brassboarded, and conducted laboratory experiments on new short range wireless transmission technologies to improve performance and robustness of secure wireless personal area networks for on-Soldier sensors and ancillary devices; conducted studies, simulations, laboratory experiments and provided incremental enhancements to commercial wireless technologies, such as cellular Long Term Evolution (LTE), to adapt them for use in the tactical environment as a low cost and rapidly adaptive capability to the warfighter; conducted research, simulations and lab experiments for next generation terrestrial and SATCOM radios and code waveform protocols to conduct reliable communications in austere environments; conducted analysis, simulations and lab experiments to design and code networking protocols for network relays to be carried by autonomous systems and to optimize networking capabilities resulting from autonomous maneuvering of these relays on the battlefield; and conducted research, simulations and lab experiments to minimize the burden of network configurations and to visualize, gather information from and control all networked devices in the battlefield."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.705"
                                            },
                                            "Text": {
                                                "val": "Design and develop exquisite local communication techniques with inherent low probability of interception\/low probability of detection (LPI\/LPD) characteristics and high frequency reuse for spectrum supportability; investigate use of non-traditional networking methods for high bandwidth needs; design and develop techniques to extend the range of waveforms with propagation limitations and challenges operating through obstruction blockages (e.g. foliage, building, etc.) for line of sight networking; investigate technology with large channel bandwidths that support high data-rate transfer; design and develop mature non-traditional transceiver components for increased capacity, and reduced interference; conduct experiments for high bandwidth, resilient communications for high data rate applications, with improved communications protection between nearby vehicles with LPI\/LPD; investigate improved methods to adapt LPI\/LPD techniques to mesh networks to counter contested threats in the spectrum environment; mature distributed dismounted beam forming algorithms that enable two distributed beam forming nets to communicate;  design and develop an architecture, and related protocols, for secure connection onto existing or third party transport infrastructure; investigate methods to utilize existing networks  that will increase available network bandwidth and provide access to resources through a local network topology in which infrastructure nodes cooperatively connect directly, dynamically, and non-hierarchically; begin the design and development of a system that integrates sensor data which is harvested from existing fielded receivers, and  propagated across the network to enable improved situational understanding; design and develop components that will help incorporate  future radio systems into the sensing architecture; develop data analytics algorithms to identify, evaluate, and correlate specific events from available tactical and intelligence data, leveraging standard protocols and interfaces to current and future tactical receivers with associated visualization and data analytics tools; investigate components for low cost, unattended sensors that can be readily distributed ,then discarded, within an area of interest; develop interfaces and methods to use existing tactical radios and receivers; develop small, easily dispersible sensors to deliver large scale sensing over designated areas; develop data consolidation and sampling methods to minimize bandwidth use of large scale sensing devices available through tasking existing receivers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602146A (Network C3I Technology) \/ Project AM6 (Modular RF Communications Technology), Project AM8 (Protected SATCOM Technology), Project AN3 (Non Traditional Waveforms Technology), Project AN5 (Protected SATCOM-WB Global SATCOM Inter Canc Tech), Project AN9 (UNT - Every Receiver is a Sensor Technology), Project AO2 (Stand-In Advanced RF Effects (STARE)), Project AP7(Comms\/Horiz Int for Army Mod Priorities Tech), and PE 0602143A (Soldier Lethality Technology) \/ Project AN1 (Narrowband SATCOM Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defensive Cyber Operations, formerly Cyber\/CEMA Operations"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and applies robust cyber security techniques and applications to advanced communications and networking devices, software, algorithms and protocols utilized within wireless tactical networks to protect against nation state level cyber effects and maintain Warfighter confidence in network information, resources, identities and mission partners by hardening the blue force attack surface. These capabilities will harden the attack surface by ensuring trustworthy software (SW), hardware (HW), information systems, communications and networks. This effort affords resilience within our networks to autonomically 'fight through' and\/or evade hostile cyber effects and provide situational understanding (SU) to enable effective mission planning and execution."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.13"
                                            },
                                            "Text": {
                                                "val": "Researched and designed cyber security technologies to improve situational awareness (SA) and SU of cyber threat correlated to mission impact across Cyberspace Electromagnetic Activities (CEMA) elements to enable actionable decisions, and enable self- defending qualities within Army networks that can absorb, deflect, evade, and deceive adversarial cyber actions; research and conduct experiments on robust wearable 2 factor (i.e., token plus personal identification number) identity and network access capabilities to improve identity verification and authentication processes; researched and developed anomalous behavior and insider threat detection techniques to apply to tactical radio waveforms to improve communications security against cyber threats; researched and experimented with mechanisms to track data flows, monitor data modification, and ensure trusted pedigree of the information flowing across tactical networks; developed models and algorithms to reason on cyber adversary intent and predict next action; research and code intelligent algorithms to efficiently pin point potentially exploitable areas within software; designed and coded models and techniques utilizing a software defined networking architecture to improve tactical network resilience; designed and coded spectrum awareness models and algorithms to detect denied spectrum conditions from jamming or other interference; and designed a security architecture that supports convergence across the intelligence, network operations, cyber, EW, Fires, and information operations functions within a tactical Command Post."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Collaborative Research Alliance  (CRA)"
                                    },
                                    "Description": {
                                        "val": "This effort will take innovative basic research theories from the Cyber CRA and experimentally validate the hypothesis and create proof-of-concept defensive cyber software implementations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.916"
                                            },
                                            "Text": {
                                                "val": "Validated new defensive cyber theories in stealthy virtual machine migration, advanced persistent threat detection, malware communication detection, port scanning attack detection, and evidence collection for cyber-attacks; designed models and algorithms in support of computer network defense and counter attack technologies; developed software to address cyber risk, detection, agility, and human psychosocial elements as they relate to cyber defense; developed and validated new defensive cyber metrics; ran defensive cyber operation experiments to assess tactical applicability of new cyber theories\/models; made determinations on how new validated cyber theories impact other on-going cyber research and how those programs should shift their technical implementations; and matured cyber theories into software capabilities that can transition into ongoing and future Cyber\/CEMA Operations programs of record."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communications, Robust Tactical Systems, formerly Uninterrupted Communications"
                                    },
                                    "Description": {
                                        "val": "This effort designs and matures components, software and algorithms that enable Army tactical wireless networks to provide assured uninterrupted access to critical communications and information links so that they operate more robustly in congested, contested and competitive electromagnetic environments. These capabilities will result in robust, reliable and secure terrestrial and Satellite Communications (SATCOM) networks with greater survivability in austere, congested and hostile electromagnetic environments while ensuring that the capabilities are interoperable and resource efficient and will allow forces to develop SU and conduct operations to support mission command networks even under adverse operational conditions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.266"
                                            },
                                            "Text": {
                                                "val": "Conducted studies, simulations and laboratory experiments to mature low-cost integrated directional networking (DN) capability to enable operation in Global Positioning System (GPS)-denied environments; constructed DN algorithms to implement adaptive antenna nulling techniques to direct emissions only in the desired direction for robust and undetectable communications while maintaining a robust tactical networking capability; conducted studies, simulations and laboratory experiments to develop efficient techniques to maintain capacity across multiple networks while providing low probability of interception (LPI) and low probability of detection (LPD) capability for individual users; and leveraged techniques resulting from earlier efforts to make blue force electronic warfare (EW) and communications more interoperable and provide spectrum situational awareness (SA) in real time to develop techniques for improved LPI\/LPD while maintaining robust tactical communications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.03"
                                            },
                                            "Text": {
                                                "val": "Design and develop an agile network architecture that globally manages traffic from traditional and non-traditional networks; design and develop algorithms and software to enable resilient controls to support network traffic over Commercial and Government satellite communications (SATCOM) systems; conduct experiments to develop methods for robust narrowband SATCOM with resilience against adversary jamming; research to resilient Mission Command designs that are transport agnostic; investigate and design software-based algorithms for anti-jam, Low Probability of Interception and Deception (LPI\/LPD) high frequency communications that incorporate state of the art protection against threat systems and enable operation in a contested environment of High Frequency systems; design and develop a standard interface specification to enable tactical Army units to interoperate with Navy and Air Force components; investigate components for a reliable, long range, and low data rate communications link to provide uninterrupted communications in a contested environment for the Army Tactical network;  design a proof of concept adaptive system that supports multiple simultaneous radio frequency connections, multiple types of interference cancellation, incorporating diverse paths and waveforms, beam forming, and power control; design and develop a control modem supporting required connectivity, throughput, and protection to support resiliency functions in a contested environment; design and develop a software based adaptive system that supports multiple types of Wideband SATCOM interference mitigation techniques; validate applicability of cognitive reasoning software to recognize interference signals and select the appropriate mitigation techniques and, through machine-learning, grow in responsiveness;  conduct experiments to evaluate uninterrupted SATCOM configurations; conduct analysis to determine approach for developing and adding interference cancellation to the Army tactical modems; design and develop algorithms for improved interference rejection and improved jammer stand-off distance to address the tactical Army threats; investigate and design a decoy signal generator of multiple waveforms, capable of deceiving Intelligence, Surveillance, & Reconnaissance (ISR) systems; design and develop obfuscator hardware, supporting sensor and policy-based dynamic spectrum access (DSA) and transmitting obfuscation (flooding) waveforms, and frequency obfuscation to hide troop?s radio frequency signatures and spend enemy resources;  conduct research to enable extended reach back, data link, and localized communications for long range precision fires; design and develop a single, autonomous and intelligent network across the tactical Army, providing a common user interface and drawing on the available resilient links to maintain data flow; develop solutions to provide reliable voice\/data links for the next generation combat vehicles, and tele-operation and data links for Manned\/Unmanned-Teaming (MUM-T); develop components to improve resilience of Air-to-Air and Air-to-Ground links for future vertical lift and next generation unmanned aerial system; design algorithms for intelligent networks to enable resilient links and data flow capability for Fire control, sensor data flow, and proximity\/distance networking for air and missile defense; validate network-enabled mission command to the dismount soldier through intelligence and situational understanding-based routing of data over resilient communication links."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602146A (Network C3I Technology) \/ Project AM6 (Modular RF Communications Technology), Project AM8 (Protected SATCOM Technology), Project AN3 (Non Traditional Waveforms Technology), Project AN5 (Protected SATCOM-WB Global SATCOM Inter Canc Tech), Project AN9 (UNT - Every Receiver is a Sensor Technology), Project AO2 (Stand-In Advanced RF Effects (STARE)), Project AP7 (Comms\/Horiz Int for Army Mod Priorities Tech), and PE 0602143A (Soldier Lethality Technology) \/ Project AN1 (Narrowband SATCOM Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modular Radio Frequency (RF)"
                                    },
                                    "Description": {
                                        "val": "This effort enables connectivity in contested & congested environments by applying automated networking techniques to modular RF technology & networking techniques to adapt and continue operation under interference signals."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.8"
                                            },
                                            "Text": {
                                                "val": "Design and develop product architectures based on a Modular Open System Architecture (MOSA) approach that incorporates components of network technologies into a unified solution; identify, validate, and develop standards for major internal interfaces and all external interfaces to product components and network capabilities and services; identify, develop, and validate quality attribute requirements that reflect a focus on resilience for autonomous networking to addresses critical product qualities that span a design space of feasible solutions that will allow high value services to maintain persistent network connectivity in congested and contested environments; investigate alternative requirement allocations for different network technology components that will incorporate identified technologies currently in use, and new network technologies, within an agile and resilient autonomous network; develop alternative solutions and validate selection criteria for autonomous networking approaches that provide agile detection and switching among available network connections in order to sustain the network in dense and hostile spectrum environments; investigate situation-adaptive communications to inform networks of current spectrum environment changes (e.g. interference, congestion) for the tactical network links, in an effort to optimize their performance based on available resiliency features, to implement mitigation techniques to maintain operation and inform the automated network of their status and any degradations; investigate the methods for agile networking algorithms to detect network technologies available for inclusion in the automated network processing and determine techniques to minimize user input to establish the detections, authentications, and incorporation of the technologies into the automation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 062146A (Network C3I Technology) \/ Project AM6 (Modular RF Communications Technology) in FY20 as part of financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.02"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}