{
    "id": "2020-Navy-PB-1319-JBOOK-9da760a8280e5c477a40ce5d303141285b83ab4a577b7d5903632d5298d41e17-14",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602792N"
        },
        "ProgramElementTitle": {
            "val": "(U)Innovative Naval Prototypes(INP) Applied Res"
        },
        "R1LineNumber": {
            "val": "15"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "160.884"
            },
            "CurrentYear": {
                "val": "154.085"
            },
            "BudgetYearOne": {
                "val": "153.062"
            },
            "BudgetYearOneBase": {
                "val": "153.062"
            },
            "BudgetYearTwo": {
                "val": "160.537"
            },
            "BudgetYearThree": {
                "val": "163.711"
            },
            "BudgetYearFour": {
                "val": "166.933"
            },
            "BudgetYearFive": {
                "val": "170.290"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2020, the Applied Research Electro-Magnetic Railgun (EMRG) high-power, kinetic energy weapon prototype development effort was realigned from Project Unit 0000 to Project Unit 2481 within this PE.\n\nIn FY 2020 a stand alone Artificial Intelligence (AI) R-2 Activity was established in Project Unit 0000 to consolidate and coordinate the acceleration of AI investments.\n\nThe FY 2017 Appropriation Act encouraged the services to realign Cyberspace Activity (CA) resources into individual cost codes, projects or program elements (PEs) in order to provide additional clarity and enhanced oversight of cyberspace resources.  Within this PE, cyber funding was moved from Proj 0000 Innovative Naval Protoypes (INP) Applied Research to Proj 2958 Cyberspace Activities beginning in FY20, which was established to isolate and identify cyberspace activities."
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) address the Applied Research associated with the Innovative Naval Prototypes (INP) Program.  These investments represent game-changing technologies with the potential to revolutionize operational concepts.  They are disruptive in nature as they would dramatically change the way naval forces fight.  INPs push the imagination of our nation's technical talent to deliver transformational warfighting capabilities.  The projects in this portfolio are high risk, technically challenging development efforts that offer the potential of high warfighting payoff in the future.  The goal of these investments is to develop and demonstrate the viability of new technological capabilities via experimental prototypes that prove the new capability could be implemented if an acquisition program were to be established to support further development.  These investments are selected by a process that involves senior leadership in the Department of the Navy.\n\nDeveloping INPs requires a systematic expansion and application of knowledge to develop useful materials, devices, and systems oriented toward the design and development of prototypes applicable to specific mission area requirements.  The efforts funded within this PE translate promising basic research into solutions for broadly defined military needs.  These efforts include developing breadboard hardware and algorithms that establish the initial feasibility and practicality of proposed solutions to technological challenges, such as concept exploration efforts, studies, investigations, and non-system specific technology efforts.\n\nDue to the nature of these projects, technology development plans have been written with limited details due to information security concerns.  Specific information on each project will be provided separately to the Congressional oversight committees.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "171.146"
                },
                "CurrentYear": {
                    "val": "159.697"
                },
                "BudgetYearOne": {
                    "val": "161.381"
                },
                "BudgetYearOneBase": {
                    "val": "161.381"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "160.884"
                },
                "CurrentYear": {
                    "val": "154.085"
                },
                "BudgetYearOne": {
                    "val": "153.062"
                },
                "BudgetYearOneBase": {
                    "val": "153.062"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-10.262"
                },
                "CurrentYear": {
                    "val": "-5.612"
                },
                "BudgetYearOne": {
                    "val": "-8.319"
                },
                "BudgetYearOneBase": {
                    "val": "-8.319"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-5.612"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.262"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.776"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.776"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-7.543"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-7.543"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Directed Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-7.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "(U)Innovative Naval Prototypes(INP) Applied Res"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "160.884"
                        },
                        "CurrentYear": {
                            "val": "154.085"
                        },
                        "BudgetYearOne": {
                            "val": "114.427"
                        },
                        "BudgetYearOneBase": {
                            "val": "114.427"
                        },
                        "BudgetYearTwo": {
                            "val": "132.026"
                        },
                        "BudgetYearThree": {
                            "val": "137.650"
                        },
                        "BudgetYearFour": {
                            "val": "166.933"
                        },
                        "BudgetYearFive": {
                            "val": "170.290"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Beginning in FY 2020, the Applied Research Electro-Magnetic Railgun (EMRG) high-power, kinetic energy weapon prototype development effort was realigned from Project Unit 0000 to Project Unit 2481 within PE 0602792N."
                        },
                        "ProjectMissionDescription": {
                            "val": "Innovative Naval Prototypes (INP) investments are typically 4-8 years in duration.  They provide a continuance of basic research by maturing technologies from a Technology Readiness Level (TRL) of 2 or 3 to a TRL of 6.  It is intended that prototypes developed within this program, requiring both Budget Activity 2 (BA2) and Budget Activity 3 (BA3) funding, are demonstrated in a relevant environment to prove the feasibility of the new technological capability.  The portfolio is periodically refreshed through the selection of new INPs as existing ones are completed.  Successful experiments and demonstrations are intended to present the Department of the Navy with a programmatic challenge as these new capabilities can lead to the obsolescence of existing capabilities, requiring significant decisions as to the path forward for integrating the new technological capabilities into the warfighting systems of the future.  INPs have been collectively grouped into R-2 Activities that include Unmanned and Autonomous Systems, Directed Energy\/Electric Weapons, Electromagnetic Maneuver Warfare, Cyber, Undersea Warfare and Artificial Intelligence.\n\nDue to the nature of these projects, technology development plans have been written with limited details due to information security concerns.  Specific information on each project will be provided separately to the Congressional oversight committees."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.567"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Total Platform Cyber Protection (TPCP):\nContinue the TPCP project, previously funded predominantly in Program Element (PE) 0602123N Force Protection Applied Research.  Develop leap-ahead resilient cybersecurity tools that will enable our warfighting platforms to fight through current and future unauthorized cyber intrusions and assure command and control of any naval platform (submarine, surface, and air platforms) providing an adaptive cyber toolkit and real time cyber sensors.  This project develops cyber sensors and automated vulnerability assessment cyber tools that deliver comprehensive defense-in-depth cyber capabilities to monitor, detect, mitigate, and recover from cyber threats in near real-time.  This project will develop software based capabilities and a compact and affordable computing appliance applicable to any aircraft, surface vessel, submarine or ground vehicle.  The technical development will leverage dynamic and active sensing and cyber vulnerability prevention science and technology approaches, including formal methods, model checking, and static\/dynamic analyses which reduce cyber platform attack surfaces, prevent the exploitation of system vulnerabilities, shorten detection timelines, and perform other mitigation functions.  Commercial off-the-shelf software components will be leveraged to develop technology for de-bloating and delayering so as to reduce the attack surface and ensure platform resiliency against unauthorized cyber intrusions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.535"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Applied Research effort to develop leap-ahead resilient cybersecurity tools that will enable our warfighting platforms to fight through current and future cyber intrusions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 to FY 2020 decrease reflects the realignment of funding within this PE from Proj 0000 Innovative Naval Protoypes (INP) Applied Res to Proj 2958 Cyberspace Activities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Directed Energy \/ Electric Weapons"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Applied Research Innovative Naval Prototype (INP) investments that are developing new technologies for directed energy, electric weapons, and hypersonic cruise and air launch booster technology.  Future adversaries will seek to neutralize U.S. conventional advantages by capitalizing on asymmetric capabilities that incorporate mobility, range, speed and deception.  Naval platforms will be on the front line of our national integrated defensive capabilities to defeat these emerging threats that are proliferating.  At the same time, the fleet\/force must be able to effectively strike targets with survivable, scalable and cost-effective weapons that have sufficient range, speed and accuracy to complete a variety of missions while reducing risk to our warfighters and without creating unnecessary collateral damage or loss of life.  Technologies within this activity will provide scalable lethality through enabling multi-domain, integrated, scalable kinetic and non-kinetic systems for offensive of defensive purposes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "56.333"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electro-Magnetic Railgun (EMRG):\nContinue EMRG, previously funded in Program Element (PE) 0602114N Power Projection Applied Research and PE 0602123N Force Protection Applied Research. The EMRG capability will support Naval Surface Fires, Integrated Air and Missile Defense (IAMD), Fast Attack Craft and Fast Inshore Attack Craft (FAC\/FIAC) defense and Anti-Surface Warfare (ASuW) missions.  Conduct applied research addressing the unique technical challenges inherent in the construction, assembly and operation of an Electro Magnetic (EM) railgun prototype capable of launching long range projectiles repeatedly, many times per minute.  Special materials and compact sub-system components will be developed that are capable of operating in harsh thermal and electromagnetic environments.  Advanced modeling tools will be developed to assess design options, analyze system concepts and inform experimental hardware design and testing.  Develop and test next generation battery energy storage and pulsed power components to assess performance and applicability towards future designs.  Develop and refine algorithms for controlling the precision timed electromagnetic pulse used to fire the railgun in the rep-rate mode.  Conduct material, physics and thermal property research for long life, rep-rate electromagnetic launch systems and actively monitor performance to understand the high currents, elevated operating temperatures, and cooling of components, so as to improve designs and increase their reliability.  Develop modeling and simulation tools that support electromagnetic launch, multi-shot life development, testing, and assessments, and ASuW missions.  The capability will electromagnetically launch a projectile with sufficient kinetic energy to travel significantly farther than traditional Naval gunfire.   \n\nHigh-power Joint Electromagnetic Non-Kinetic Strike (HIJENKS):\nContinue HIJENKS, a joint USAF\/USN project previously funded as a FY17 jump-start effort in PE 0602114N Power Projection Applied Research.  Develop a High Power Radio Frequency (HPRF) technology payload integrated on an air platform capable of engaging multiple electronic targets with a single, scalable effects weapon across a variety of warfighting missions. This effort will culminate in a live-fire demonstration of a multi-mission\/multi-target HPRF payload integrated into a demonstration platform.  The operational impacts include decreased cost exchange ratios, non-kinetic counter electronic effects, reduced collateral damage, and the ability to engage multiple targets with a single weapon.  This effort aligns Naval Science and Technology (S&T) with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.  During FY18, the following applied research development efforts are planned:  investigate Radio Frequency (RF) effects on complex electronic systems with the goal being to finalize an RF waveform specification; investigate High-Power Radio Frequency (HPRF) weapons effects for non-kinetic counter electronics to include the prediction model improvements required for mission planning of Directed Energy Weapons (DEW); perform Modeling and Simulation (M&S) to capture Radio Frequency (RF) antenna output, RF propagation, RF interaction with complex enclosures, and RF interaction with electronic circuits to characterize Directed Energy Weapons (DEW) performance to the maximum extent possible; conduct research into the time-out of action or recuperation time for complex electronics, exploring Battle Damage Indicators (BDI) for electronic disruption; determine the critical pulsed power and RF components required to reduce the High Power Radio Frequency (HPRF) payload's Size, Weight, and Power (SWaP); perform a trade-off analysis of the technology alternatives, their maturity, and their suitability for this application; develop the most promising component technologies, such as conformal antenna designs for high power, advanced high power RF source technologies, pulsed power components with higher energy densities, and advanced architectures and magnetic materials for high voltage power electronics systems; conduct risk reduction research for the RF source and antenna subsystems by examining high risk, high payoff technology alternatives to improve output power while simultaneously reducing system size and weight, and examine the efficiency of each subsystem and the impact of overall payload prime power requirements.\n\nSolid State Laser Technology Maturation (SSL TM):\nComplete the Applied Research portion of SSL TM, which was previously funded in Program Element (PE) 0602114N Power Projection Applied Research.  Complete development of the maritime laser weapons system prototype components and test them in the prototype system on a representative test platform for a naval surface combatant.  Complete the required laser weapon system component engineering, design, integration and testing necessary to have a testable, experimental prototype."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "45.788"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Applied Research development addressing the unique technical challenges inherent in the construction, assembly and operation of a high-power, kinetic energy weapon prototype capable of repeatedly launching long range, precision guided projectiles using electricity instead of chemical propellants.  Conduct a full-scale, rep-rate composite barrel structural demonstration for this project.\n\nContinue Applied Research efforts to develop a radio frequency effects payload (a joint USAF\/USN project) with scalable electromagnetic effects.  Conduct payload shock\/vibration testing at the subsystem level.\n\nInitiate development of a government laboratory laser testing environment that is representative of a shipboard environment.  Conduct the applied research associated with a land-based test at White Sands Missile Range that will involve ship integration and sea testing on an LPD ship."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "29.531"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "29.531"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct development efforts for a radio frequency effects payload (a joint USAF\/USN project) with scalable electromagnetic effects.  Conduct the Applied Research supporting initial lab and integration testing.\n\nConduct research to develop a hypersonic cruise missile that is affordable and effective to mature critical technologies."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 is due to a planned ramp down in Directed Energy\/Electric Weapons Applied Research as some of the difficult technology challenges are being achieved, and the realignment of Applied Research Electro-Magnetic Railgun (EMRG) high-power, kinetic energy weapon prototype development effort to a newly created Project Unit 2481 in PE 0602792N.  Specific information on each project will be provided separately to the Congressional oversight committees."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electromagnetic Maneuver Warfare"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Applied Research Innovative Naval Prototype (INP) investments that are developing new technologies for Electromagnetic Maneuver Warfare (EMW).  The electromagnetic spectrum is a key operational maneuver space enabled by continuous, real-time awareness of all spectrum activity.  This R-2 Activity supports spectrum dominance, which included efforts that focus on communications, surveillance, EMW and electronics to understand and shape the battle space.  The ability to assure access to the full spectrum is essential for battle space awareness and threat surveillance\/weapon sensor engagement.  Technologies within this activity will provide for integrated and distributed forces capable of dynamic synchronized actions through interoperable forces by incorporation of autonomous\/ disaggregated systems to increase flexibility and reach within the electromagnetic spectrum."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.607"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic Maneuver & Control Capability (EMC2):\nContinue the EMC2 project, previously funded in Program Element (PE) 0602271N Electromagnetic Systems Applied Research,  by conducting applied research efforts that will enable a battle group to work cooperatively in the Electromagnetic Spectrum (EMS) to optimize Electronic Warfare (EW), Information Operations (IO), Communications and Radar performance.  EMC2 will develop technology that optimizes Radio Frequency (RF) resources in order to meet the commander's intent across multiple warfare areas simultaneously within a single platform and across a strike group.  It will complete technology development and design that will be used for a Low-band RF Intelligent Distribution Resource (LowRIDR) prototype.  In addition, EMC2 will conduct studies and continue the technology development and design for a wideband, multifunction airborne system that will be integrated with ship-based, wideband multifunction systems.\n\nNemesis:\nComplete the Nemesis project, previously funded in PE 0602271N Electromagnetic Systems Applied Research, by finishing research efforts to develop and mature technologies in multiple areas that will be used to assess the feasibility of Nemesis to coordinate Electronic Warfare (EW) operations across distributed EW systems.  Technologies being matured include swarming vehicle operations, distributed resource mission control, multi-domain coordinated operations and advanced RF component and subsystems technologies.  These emerging technologies are being designed and developed for prototype Nemesis systems which will be capable of performing coordinated EW operations across distributed EW systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.072"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Applied Research efforts to develop technology which will enable a strike group to work cooperatively in the Electromagnetic Spectrum (EMS) to optimize EW, Information Operations (IO), communications, and radar performance.  Conduct the Applied Research supporting an at-sea Flexible Distributed Array Radar demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.056"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.056"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop efforts to enable a strike group to work cooperatively in the electromagnetic spectrum by optimizing electronic warfare, information operations, communications and radar performance.  Conduct the Applied Research associated with the final design for a Low-band Radio Frequency Intelligent Distribution Resource (LowRIDR) for the EMC2 prototype."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 is due to a planned ramp down in applied research as work in this technology area is approaching completion.  Specific information on each project will be provided separately to the Congressional oversight committees."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INP Management"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity was discontinued in FY 2019."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.470"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Innovative Naval Prototypes (INP) Management:\nContinue INP Management Support\/OPS Analysis, previously funded in Program Element (PE) 0602747N Undersea Warfare Applied Research.  Conduct applied research and analysis, including technology management of INP investments supporting Department of the Navy priorities for emerging technologies of a disruptive and game changing nature."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Undersea Warfare"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Applied Research Innovative Naval Prototype (INP) investments that are developing new technologies for Undersea Warfare.  This R-2 Activity explores development of technologies to achieve and maintain undersea dominance in the areas of Anti-Submarine Warfare (ASW) and mine warfare, and to improve environmental sensing capabilities which support the Undersea Warfare domain.  Technologies within this activity will dramatically improve sensing and sense-making, provide integrated and distributed autonomy to forces, and provide scalable lethality through development of kinetic and non-kinetic effects payloads."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.439"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Forward Deployed Energy & Communications Outpost (FDECO):\nComplete the FDECO project, previously funded in Program Element (PE) 0602747N Undersea Warfare Applied Research. Complete the FDECO architecture planning study to analyze distributed, open, adaptable, and scalable architectures suitable to future naval demands.  Conduct limited objective experiments of component technologies for docking, energy transfer, communications and control.  The docking task will focus on developing and testing technologies and approaches that are vehicle agnostic (type & size), reliable and repeatable.  The energy task will focus on developing and testing technologies and approaches that maximize the availability and efficiency to transfer electrical energy to\/from various networked energy sources and sinks (FDECO batteries, vehicle batteries, communication systems and sensors).  The communications task will focus on developing interface control definitions that support plug-and-play operation, federated network protocols, multiple communication modalities, dynamic latencies, various bandwidths, and adaptive command & control structures.\n \nAnti-Submarine Warfare Mission Packages (ASW MP):\nComplete ASW MP, previously funded in PE 0602747N Undersea Warfare Applied Research.  The ASW MP is developing a set of ASW sensors and autonomy algorithms.\n\nAffordable Mobile ASW Surveillance System (AMASS):\nInitiate AMASS, a two-year project that will verify our understanding of the physical phenomenon postulated to give superior performance.  Design source and receiver configurations suitable for future spiral development as an autonomous deployable system.  The first of three units will be fabricated and assembled, and fabrication and assembly of the second and third unit will begin.  Develop software for real time control of the source and post-test control of the receiver.  Develop software to analyze data that will be collected."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.602"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Affordable Mobile ASW Surveillance System (AMASS)\nContinue AMASS, a three year project that will verify our understanding of the physical phenomenon postulated to give superior performance. Complete Design source and receiver configurations suitable for future spiral development as\nan autonomous deployable system. The first of three units will be fabricated and assembled, and fabrication and assembly of the second and third unit will begin. Develop software for real time control of the source and post-test\ncontrol of the receiver. Develop software to analyze data that will be collected.\n\n\nInitiate Applied Research efforts to develop the technology required to operate an unmanned environmental observing system in strategically important locations in support of persistent monitoring of environmental conditions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.046"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.046"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct applied research associated with the development of an Arctic Mobile Observing System (AMOS), a prototype mobile sensing system incorporating Arctic-capable unmanned underwater vehicles that can be deployed anywhere in the Arctic using a central, ice-based buoy node to provide the critical infrastructure (power, communication, navigation, and environmental intelligence).  AMOS will provide the Navy with a persistent Arctic presence and environmental Arctic domain awareness at a lower cost and less risk than manned platforms.  The combination of Unmanned Underwater Vehicle (UUV) assets included in an AMOS node will determine the range, sensing capability and persistence of each node, and can be chosen based on need and Arctic location.  Work under this effort will involve understanding the trade-offs and capabilities for the prototype system.\n\nAffordable Mobile ASW Surveillance System (AMASS)\nComplete Applied Research efforts to verify performance of components to enable next generation Anti-Submarine Warfare (ASW) capability."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No significant change from FY 2019 to FY 2020"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unmanned and Autonomous Systems"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Applied Research Innovative Naval Prototype (INP) investments that are developing new technologies for Unmanned and Autonomous Systems.  Increased proliferation of inexpensive lethal threats targeting individual warfighters and high-value assets, combined with continued rapid advances in computing, power and energy, robotics, sensors and position guidance technologies, drives the requirement to augment expensive manned systems with less expensive, unmanned, fully autonomous systems that can operate in all domains.  Technologies within this activity will provide integrated and distributed, autonomous and disaggregated systems to increase flexibility and reach."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "47.468"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Autonomous Aerial Cargo\/Utility System (AACUS):\nComplete the AACUS project, which was previously funded in Program Element (PE) 0602123N Force Protection Applied Research.  The AACUS project will complete research efforts to develop and mature technologies that perform autonomous take-off, conduct en-route navigation, classify the terrain of landing zones, detect and avoid ground-based obstacles, and safely operate in degraded visual environments.  In addition to maturing these individual technologies, specific attention will be directed toward the task of integrating them into a full scale autonomous platform to increase their technology readiness level.\n\nClaws:\nClaws, which was previously funded in Program Element (PE) 0602747N Undersea Warfare applied Research will develop the autonomy required to operate large and extra-large Unmanned Undersea Vehicles (UUVs) in an anti-access, area-denial environment.  To support large and extra-large UUV operations further forward and farther from the battle group, the technology will be evolved to allow operations with limited navigational fixes and limited communication opportunities.  During FY18, research will be conducted and technology will be matured in the areas of precision navigation, obstacle avoidance, robust communications, on-board vulnerability assessment, and payload autonomy.  Applied research efforts in advanced undersea autonomy will also be initiated.\n\nLarge Displacement Unmanned Undersea Vehicle (LDUUV):\nComplete the LDUUV project, which was previously funded in PE 0602747N Undersea Warfare Applied Research.  The LDUUV Innovative Naval Prototype (INP) is developing the critical technologies of energy, autonomy, endurance, and submarine launch and recovery.  These critical technologies are needed to enable Large UUVs to be pier and ship launched, and recovered.  The technologies will enable the completion of missions with long ranges, as well as those requiring over 60 days of endurance for Intelligence, Surveillance, and Reconnaissance (ISR) tasks.  Continue development of the long endurance, air-independent energy source technology for large UUVs.  Continue development of the autonomy technology that will support operation of the UUV in the littorals.  Continue development of core UUV technologies that will extend the reliability and endurance of the UUV operating in the littorals.  Conduct a UUV fuel cell systems technology analysis, which will be used to support a land-based demonstration.\n\nLow-Cost UAV Swarming Technology (LOCUST):\nContinue the LOCUST project, previously funded in PE 0602114N Power Projection Applied Research and PE 0602123N\nForce Protection Applied Research. Low-Cost UAV Swarming Technology (LOCUST) will ultimately deliver a scalable system of inexpensive Unmanned Aerial Vehicles (UAVs) and payloads that will provide game-changing disruptive capabilities over a wide range of military operations and areas of operations.  LOCUST will make advances in unmanned system collective autonomous behaviors, robust low probability of interception or detection ad hoc networks, and payload miniaturization and modularity breakthroughs to counter threats in constrained urban environments, as well as large-scale anti-access area denial defenses.  This will be accomplished at greatly reduced cost and risk when compared to traditional manned platform target prosecution. The applied research effort in 2018 specifically will conduct preliminary system design and technology developments within the three major Low-Cost UAV Swarming Technology (LOCUST) sub-systems: (1) the Distributed, Collaborative, Coordinated, & Cognitive autonomy system architecture; (2) the distributed Command & Control system architecture; and (3) a series of modular Unmanned Aerial Vehicle (UAV) payloads.\n\nLarge Displacement Unmanned Undersea Vehicles (LDUUV) - Advanced Power and Energy Demonstration (LDUUV-APED):\nContinue LDUUV-APED, which was previously funded in Program Element (PE) 0602747N Undersea Warfare Applied Research. The\nLDUUV-APED Program is integrating the Aluminum Power System (ALPS) air-independent fuel cell system into an existing LDUUV vehicle and conducting at-sea testing to demonstrate a mission endurance capability that meets the Navy's UUV far-term objectives (up to 70 days) for a persistent forward presence.  During FY18, the hull structural design and analysis will be completed and the energy section hull will be fabricated. Integration of ALPS into the energy section hull will begin.  Modifications to the vehicle to accept the ALPS energy section will begin.  The notional mission profiles will be finalized and development of the test plan will begin.  The vehicle-level hazards analysis will be completed and the range approval process will continue to be supported.\n\nMedium Displacement Unmanned Surface Vehicle (MDUSV):\nContinue MDUSV, which was previously funded in PE 0602123N Force Protection Applied Research and PE 0602747N Undersea Warfare Applied Research.  The MDUSV project will continue research efforts to develop and mature technologies in multiple areas that will be used to assess the feasibility of an MDUSV to perform Mine Countermeasures (MCM), Anti-Submarine Warfare (ASW) and Electronic Warfare (EW) mission area requirements.  Autonomy technologies being matured include a robust perception approach using Electro-Optic\/Infrared (EO\/IR) sensors and technologies that enable autonomous all-weather operations, detection of low radar cross section craft, reduced vulnerability to jamming, and operations with reduced Radio Frequency (RF) emissions.  MCM technologies being developed include mine sweeping capabilities using High Temperature Superconductor (HTS) magnets in combination with acoustic sweep technologies.  ASW technologies being developed include an advanced version of the Non-Traditional Sensor System (NTSS) to be assessed for its autonomous ASW track and trail capability.  The project also includes development of an NTSS EW payload integrated with an MS3 Sonar. These emerging technologies are being designed and developed for an MDUSV prototype that will be capable of performing multiple autonomous missions over extended periods of time.\n\nTern Complete Tern, a joint Office of Naval Research (ONR) and Defense Advanced Research Projects Agency (DARPA) project, previously funded in PE 0602123N Force Protection Applied Research.  Continue airplane launch and recovery component and subsystem technology developments to enable medium size, long endurance, long-range Unmanned Aerial Vehicles (UAVs) to be launched and recovered on short deck ships.  Complete the maturation of technology addressing integration challenges associated with developing a Vertical Take-Off and Landing (VTOL) UAV capability.\n\nUnmanned Surface Vehicle (USV) Swarm:\nContinue USV Swarm, which was previously funded in Program Element (PE) 0602271N Electromagnetic Systems Applied Research and PE 0602747N Undersea Warfare Applied Research.  Conduct applied research into cooperative autonomy for unmanned surface vehicle swarms including task allocation, route planning and perception."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "60.088"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue applied research of autonomous payloads for large and extra-large unmanned undersea vehicles.\n\nContinue applied research of autonomy algorithms, the command and control architecture needed for swarm control (a flying ad-hoc network), effects payloads and sensing modalities.  \n\nContinue applied research of autonomous control for medium displacement unmanned surface systems, focusing on research into common behaviors across multiple missions, advancements in route planning, and additional perception modalities.\n\nComplete applied research to include an at-sea demonstration of a fuel cell system on an available Unmanned Undersea Vehicle (UUV) of suitable size.\n\nConduct applied research into small multi-Unmanned Surface Vehicle (USV) autonomous control, including research into common multi-USV behaviors across multiple missions, multi-USV task recognition\/allocation\/execution and advanced perception."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "48.925"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "48.925"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct development of autonomous payloads for extra-large unmanned undersea vehicles. \n\nConduct development of technologies that continue to support development of a scalable system of inexpensive Unmanned Aerial Vehicles (UAVs) in order to provide a disruptive capability in contested urban environments against anti-access area denial defenses.\n\nConduct development of technologies that will enable a self-deploying, highly autonomous, multi-mission\/multi-payload Unmanned Surface Vehicle (USV) capable of operating with carrier strike groups and surface action groups at a very low operating cost.\n\nConduct development of an autonomous control system for multiple Unmanned Surface Vehicle (USVs) consisting of cooperative task allocation, cooperative route planning\/behaviors, and shared situational awareness."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 to FY 2020 decrease is due to the completion of applied research associated with a fuel cell system for unmanned undersea vehicles.  Funding realigned specific information on each project will be provided separately to the Congressional oversight committees."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Artificial Intelligence"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains coordinated AI investments for Applied Research Innovative Naval Prototype (INP) efforts that develop new technologies applying Artificial Intelligence.  This Applied Research, being conducted in coordination with complimentary Advanced Technology Development investment in Program Element (PE) 0603801N INP, will create Artificial Intelligence applications for predictive mission-focused analytics that autonomously gather, analyze, compile, interpret, and visualize a fused tactical & national all source data picture to improve decision making speeds and enable a distributed Artificial Intelligence capability that can function in a harsh and adversarial environment and is able to determine an optimal response and accelerate reactions to real time."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.869"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.869"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Align Applied Research associated with the development of a prototype multi-domain integrated fires control capability enabled by Artificial Intelligence (AI) allowing for real-time, force-wide electromagnetic maneuver and soft-kill and hard-kill battle management. Thrust areas being explored include distributed combat data systems, AI battle management tools, and embedded machine learning.\n\nAlign Applied Research supporting the goal of demonstrating machine speed battle management tools to support continuous analysis and planning at the operational and tactical levels and dynamically synchronizing forces across intelligence, surveillance and reconnaissance, Command and Control and combat systems.  Thrust areas being explored include distributed combat data systems, adaptive data analytics and a course of action and intentions assessment AI application."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2019 to FY 2020 is due to the acceleration of aligned Artificial Intelligence R-2 Activity being initiated. This project is being initiated in response to the National Defense Strategy guidance for modernization of advanced autonomous systems. It will enable a broad array of autonomous functions, such as machine-speed decision making in Electromagnetic Warfare (EW) and Spectrum Management operations, through improvements in artificial intelligence.  Specific information on each project will be provided separately to the Congressional oversight committees."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "In all cases, the technologies being developed within this Program Element (Applied Research associated with the Innovative Naval Prototypes (INP) Program) support the Department of the Navy INP Program and are managed at the Office of Naval Research.  The primary technological metrics used in this PE involve experiments and tests that demonstrate proof of concept for the technological capability being developed.  Technology development is informed by periodic interaction with Naval warfighters, resource sponsors and the acquisition community.  At the lowest level, each project is evaluated against technical and financial milestones on a frequent basis.  Annually, each project is reviewed in depth for technical performance and development status by the Chief of Naval Research.  Department of the Navy leadership is briefed on the portfolio's status by the Chief of Naval Research."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2481"
                    },
                    "ProjectTitle": {
                        "val": "EMRG"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "7.632"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.632"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "7.632"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Beginning in FY 2020, the Applied Research Electro-Magnetic Railgun (EMRG) high-power, kinetic energy weapon prototype development effort was realigned from Project Unit 0000 to Project Unit 2481 within PE 0602792N."
                        },
                        "ProjectMissionDescription": {
                            "val": "Electro-Magnetic Railgun (EMRG) is a high-power, kinetic energy weapon capable of launching precision guided projectiles using electricity instead of chemical propellants. When released into the railgun, an electric pulse launches the projectile at speeds up to Mach 6. EMRG will bring new capabilities, increased capacity and improved operational economy to fleet operations at sea. With its increased velocity and extended range, the EM Railgun provides multi-mission potential for hypersonic missile defense, anti-air & surface warfare, and naval surface fire support.\n\nEMRG is a multi-year effort in various stages of research and development within with the Navy's Innovative Naval Prototypes (INP) family of RDT&E programs. INP investments are typically 4-8 years in duration.  They provide a continuance of basic research by maturing technologies from a Technology Readiness Level (TRL) of 2 or 3 to a TRL of 6.  It is intended that prototypes developed within this program, requiring both Budget Activity 2 (BA2) and Budget Activity 3 (BA3) funding, are demonstrated in a relevant environment to prove the feasibility of the new technological capability.  Successful experiments and demonstrations are intended to present the Department of the Navy with a programmatic challenge as these new capabilities can lead to the obsolescence of existing capabilities, requiring significant decisions as to the path forward for integrating the new technological capabilities into the warfighting systems of the future.  The Activity identified in Project Unit 2481 specifically addresses Applied Research in support of the Electro-Magnetic Railgun (EMRG) high-power, kinetic energy weapon prototype development INP effort. \n\nDue to the nature of these projects, technology development plans have been written with limited details due to information security concerns.  Specific information on each project will be provided separately to the Congressional oversight committees."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NewElectro-Magnetic Railgun (EMRG)"
                                    },
                                    "Description": {
                                        "val": "EMRG is a high-power, kinetic energy weapon capable of launching precision guided projectiles using electricity instead of chemical propellants. When released into the railgun, an electric pulse launches the projectile at speeds up to Mach 6. EMRG will bring new capabilities, increased capacity and improved operational economy to fleet operations at sea. With its increased velocity and extended range, the EM Railgun provides multi-mission potential for hypersonic missile defense, anti-air & surface warfare, and naval surface fire support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.632"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.632"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct applied research addressing the unique technical challenges inherent in the construction, assembly and operation of an Electro-Magnetic (EM) Railgun prototype capable of launching long range projectiles at a tactically relevant muzzle energy and repetition rate.  Special materials and compact sub-system components will be developed that are capable of operating in harsh thermal and electromagnetic environments.  Advanced modeling tools will be utilized to assess design options, analyze system concepts, and inform experimental hardware design and testing.  Develop and test next generation pulsed power components to assess performance and applicability towards future shipboard designs. Develop and refine algorithms for controlling the precision timed electromagnetic pulse used to fire the railgun in the rep-rate mode. Conduct material, physics and thermal property research for long life, rep-rate electromagnetic launch systems and actively monitor performance to understand the high currents, elevated operating temperatures, and cooling of components, so as to improve designs and increase their reliability. Utilize modeling and simulation tools that support simulated operational scenarios to quantify the value of HVP fired from a Railgun."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in FY 2020 is due to the realignment of the Applied Research Electro-Magnetic Railgun (EMRG) high-power, kinetic energy weapon prototype development effort from Project Unit 0000 to Project Unit 2481 within PE 0602792N."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "In all cases, the technologies being developed within this Program Element (Applied Research associated with the Innovative Naval Prototypes (INP) Program) support the Department of the Navy INP Program and are managed at the Office of Naval Research.  The primary technological metrics used in this PE involve experiments and tests that demonstrate proof of concept for the technological capability being developed.  Technology development is informed by periodic interaction with Naval warfighters, resource sponsors and the acquisition community.  At the lowest level, each project is evaluated against technical and financial milestones on a frequent basis.  Annually, each project is reviewed in depth for technical performance and development status by the Chief of Naval Research.  Department of the Navy leadership is briefed on the portfolio's status by the Chief of Naval Research."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2958"
                    },
                    "ProjectTitle": {
                        "val": "Cyberspace Activities"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "31.003"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.003"
                        },
                        "BudgetYearTwo": {
                            "val": "28.511"
                        },
                        "BudgetYearThree": {
                            "val": "26.061"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "85.575"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "The FY 2017 Appropriation Act encouraged the services to realign Cyberspace Activity (CA) resources into individual cost codes, projects or program elements (PEs) in order to provide additional clarity and enhanced oversight of cyberspace resources.  Within this PE, cyber funding was moved from Proj 0000 Innovative Naval Protoypes (INP) Applied Research to Proj 2958 Cyberspace Activities, which was established to isolate and identify cyberspace activities."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project contains all Applied Research Innovative Naval Prototype (INP) investments that are developing new technologies for cyber warfare.  Potential adversaries are investing in advanced technologies that will challenge our advantages in the critical information domain.  Nation states and non-state actors seek to degrade our command and control capabilities, networks and computer systems.  Cyber threats continue to grow and rapidly proliferate.  Technologies developed in this R-2 Activity will enable the warfighter to take immediate, appropriate action at any time, against any desired adversary, target or network by assuring that autonomous, continuous analyses of intelligence, persistent surveillance and open information sources have, at all times, optimized the possible courses of action based on commander's guidance.  Technologies within this activity will foster operational endurance and enable sustained operations and resiliency for warfighters and platforms through enhanced cyber security\/protection.\n\nThis Project was formerly the Cyber R-2 Activity under Project 0000 (U)Innovative Naval Prototypes(INP) Applied Research."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "31.003"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "31.003"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct Applied Research addressing the unique technical challenges required to achieve a systematic reduction of any computing system's attack surface across all its layers of computing.  Continue development of tools and techniques enabling powerful tailoring of an end-system computing environment to match the needs of deployed applications and users, removing software bloat and unused features, resulting in significantly reduced attack surface for both known and unknown vulnerabilities. Specific information on each project will be provided separately to the Congressional oversight committees."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 to FY 2020 increase reflects the realignment of funding within this PE from Project 0000 Innovative Naval Prototypes (INP) Applied Research to Project 2958 Cyberspace Activities. The 6% increase from the FY 2019 Cyber R-2 Activity ($23.535M) in Project 0000 to $31.003M here in FY 2020 is due to Applied Research associated with the planned third phase of the TPCP project, which covers efforts to develop tools and techniques for automatically customizing a range of standard communications protocols used in closed shipboard environments, tailoring end-system network stacks to\nmatch the needs of deployed applications.  Addressing this computing layer is essential for achieving total protection of Navy cyber infrastructure and drastically reducing attack surface."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "In all cases, the technologies being developed within this Program Element (Applied Research associated with the Innovative Naval Prototypes (INP) Program) support the Department of the Navy INP Program and are managed at the Office of Naval Research.  The primary technological metrics used in this PE involve experiments and tests that demonstrate proof of concept for the technological capability being developed.  Technology development is informed by periodic interaction with Naval warfighters, resource sponsors and the acquisition community.  At the lowest level, each project is evaluated against technical and financial milestones on a frequent basis.  Annually, each project is reviewed in depth for technical performance and development status by the Chief of Naval Research.  Department of the Navy leadership is briefed on the portfolio's status by the Chief of Naval Research."
                        }
                    }
                }
            ]
        }
    }
}