{
    "id": "2020-Army-PB-2040-JBOOK-bbfb861aa2459c788128b03572c321536da98358a56d59849bf889b375dfd80d-2",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603003A"
        },
        "ProgramElementTitle": {
            "val": "Aviation Advanced Technology"
        },
        "R1LineNumber": {
            "val": "43"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "172.545"
            },
            "CurrentYear": {
                "val": "169.411"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "341.956"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2020 this Program Element (PE) is being realigned, with continuity of effort realigned to PE 0603465A Future Vertical Lift Advanced Technology."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures and demonstrates manned and unmanned air vehicle technologies to enable Army aviation modernization.  Within this PE, aviation technologies are advanced and integrated into realistic and robust demonstrations.  Project 313 matures, demonstrates and integrates enabling component, subsystems and systems in the following areas: rotors and, structures.  Project 436 matures, integrates and demonstrates air launched weapons systems, mission equipment packages to enable control of unmanned systems and advanced teaming capabilities.  Project 447 matures and demonstrates affordable and efficient engines and drive trains.  \n\nWork in this PE contributes to the Army Science and Technology (S&T) Air Systems portfolio and is related to and fully coordinated with PE 0602211A (Aviation Technology), PE 0603313A (Missile and Rocket Advanced Technology), PE 0603710A (Night Vision Advanced technology), and PE 0603270A (Electronic Warfare Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering S&T focus areas and the Army Modernization Strategy. Work in this PE is performed by the  U.S. Army Futures Command (AFC).\n\nFY 2020 realignments are due to financial restructuring in support of the Army Modernization Priorities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "160.746"
                },
                "CurrentYear": {
                    "val": "124.958"
                },
                "BudgetYearOne": {
                    "val": "111.607"
                },
                "BudgetYearOneBase": {
                    "val": "111.607"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "172.545"
                },
                "CurrentYear": {
                    "val": "169.411"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "11.799"
                },
                "CurrentYear": {
                    "val": "44.453"
                },
                "BudgetYearOne": {
                    "val": "-111.607"
                },
                "BudgetYearOneBase": {
                    "val": "-111.607"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.127"
                    },
                    "CurrentYear": {
                        "val": "-0.147"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "18"
                    },
                    "CurrentYear": {
                        "val": "44.6"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-6.074"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-111.607"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-111.607"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019, $44.6 million in congressional adds were applied to Project BA7 (AVIATION ADVANCED TECHNOLOGY INITIATIVES (CA)) for rotorcraft automated component tracking, future vertical lift capability set 3, advanced helicopter seating system, surface tolerant adhesive for bonded airframe structure, joint tactical aerial resupply vehicle, data refinement and optimization for aviation sustainment, and stretch broken composite material forms.\nFY 2020, PE eliminated due to Science and Technology financial restructuring."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "313"
                    },
                    "ProjectTitle": {
                        "val": "Adv Rotarywing Veh Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "142.093"
                        },
                        "CurrentYear": {
                            "val": "113.678"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "255.771"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned to Program Element (PE) 0603003A Future Vertical Lift Advanced Technology, Projects: \n* AI4 Joint Multi-Role (JMR) Demonstration\n* AI6 Next Gen Tactical UAS TD\n* AJ3 Next Gen Rotorcraft Transmission\n* AJ5 Digital Vehicle Management and Control\n* AJ7 Advanced Rotors Advanced Technology\n* AJ9 Integ Mission Equipment for Vertical Lift Systems\n* AK3 Aviation Survivability Advanced Technology\n* AK8 Air Launched Effects Advanced Technology\n* AL6 Degraded Visual Environment Mitigation (DVE-M)\n* AM3 Aircraft and Aircrew Protection"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures, demonstrates and integrates components, subsystems and systems for vertical lift and unmanned air systems that provide improved aircraft and occupant survivability, reduced maintenance and sustainment costs, and greater performance through improved rotors, drives, vehicle management systems and platform design and structures. Systems demonstrated include rotors and robust airframe structures. A major effort in this Project is the Joint Multi-Role (JMR) Technology Demonstrator (TD) in support of the Future Vertical Lift (FVL) family of aircraft.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering S&T focus areas and the Army Modernization Strategy. \n\nWork in this project is coordinated with Program Executive Office Aviation (PEO Aviation) and PEO Intelligence, Electronic Warfare, and Sensors (PEO IEW&S).\n\nFY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Platform Design & Structures Systems"
                                    },
                                    "Description": {
                                        "val": "Provide demonstration of Future Vertical Lift (FVL) platform configurations that address multi domain battle capability needs.  Determine optimum vehicle attributes that meet future force capability needs for increased system speed, range, payload, and reduced operating costs, to inform and reduce future aviation materiel acquisitions.  Flight demonstrate operational capabilities of technology demonstrators."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "115.866"
                                            },
                                            "Text": {
                                                "val": "Continued flight and ground demonstrations of two technology demonstrator aircraft to collect data and assess the capabilities of advanced rotary-wing configurations (an advanced tilt rotor and lift-offset, co-axial helicopter with a pusher prop) and enabling component technologies. Began design and build of a test stand and test articles (hardware and software) for a Single Rotor Tiedown (SRT) test of the two-speed gearbox, Independent Blade Control (IBC) and rotors critical to realizing the performance capabilities of an Optimum Speed Tilt Rotor (OSTR). Completed analysis and modeling of interactional aerodynamics and piloted simulations of a Compound Co-Axial Helicopter (CCH) configuration. Mission Systems Architecture Demonstration: Continued development and release of JCA v2.0, including a functional model, data model, supporting documentation and tools. Continued development of model-based engineering processes and tools for the development and analysis of mission systems architectures as part of Development, Architecture Centric Virtual Integration Process (ACVIP).  Released a Broad Area Announcement (BAA) for the Mission System Architecture Capstone Demonstration, seeking the development of a mission systems architecture from a representative architecture specification using JCA, model-based engineering tools, virtual integration methods and open systems architecture. Completed source selection activities for the Capstone Demonstration and agreement awards to multiple vendors. Began Mission System Architecture Capstone Demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "80.484"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate integrated, fastenerless advanced structural assemblies that enable future vertical lift platforms with crashworthy, damage tolerant, lightweight and sustainable solutions. Continue flight demonstrations of two Joint Multi-Role (JMR) Technology Demonstrator (TD) aircraft to collect data and assess the capabilities of advanced rotary-wing configurations (an advanced tilt rotor and lift-offset, co-axial helicopter with a pusher prop) and enabling component technologies.  Demonstrate advanced flight control technologies. Demonstrate on a ground test stand a Single Rotor Tiedown (SRT) test of the two-speed gearbox, Independent Blade Control (IBC) and rotors critical to realizing the performance capabilities of an Optimum Speed Tilt Rotor (OSTR). Finalize development a mission systems architecture from a representative architecture specification using JCA, model-based engineering tools, virtual integration methods and open systems architecture in a Mission Systems Architecture Capstone Demonstration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned to PE 0603465A\/ Projects AI4 and AJ9."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rotors & Vehicle Management Systems"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the performance benefits of advanced rotors through the assessment of alternative designs aimed to satisfy future force capability needs for increased system durability, speed, range and payload.  This effort also integrates advanced flight controls with real-time aircraft state information into vehicle management systems to enable safe, low-effort maneuvering and real-time adaptation to aircraft state changes (degradation, damage, mission, etc.)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.072"
                                            },
                                            "Text": {
                                                "val": "Completed detailed design of a new Research Flight Control Computer Assembly for the modernized RASCAL and conducted a thorough government evaluation through a comprehensive technical review."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.292"
                                            },
                                            "Text": {
                                                "val": "Conduct trade studies to identify reliable technologies that enable highly efficient aircraft performance throughout the flight envelope."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned to PE 0603465A\/ Projects AJ5 and AJ7."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rotorcraft Drive Systems"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates advanced rotorcraft drive technologies with the potential to: increase the horsepower-to-weight ratio; reduce drive system noise; reduce production, operating and support costs; and provide automatic component impending failure detection. The drive system demonstrators for this effort will be applicable to Future Vertical Lift (FVL) platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.062"
                                            },
                                            "Text": {
                                                "val": "Completed design of advanced multi-speed drive train for advanced aircraft configurations under the Next Generation Rotorcraft Transmission program and initiated fabrication of demonstrator hardware."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.037"
                                            },
                                            "Text": {
                                                "val": "Continue fabrication of advanced multi-speed drive train hardware and initiate development testing of demonstrator hardware under the Next Generation Rotorcraft Transmission program to enable greater aircraft speed\/range in support of Future Vertical Lift."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned to PE 0603465A\/ Project AJ3."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability for Degraded Visual Environment (DVE) Operations"
                                    },
                                    "Description": {
                                        "val": "Develop and mature advanced sensor cueing and flight controls to provide ability to maintain terrain and obstacle situational awareness during all DVEs both aircraft induced (brown-out & white-out) and environmentally induced (fog, rain, snow etc.)   Flight testing on fleet aircraft is an integral component of the demonstration. Work in this area is being done in coordination with efforts at United States (U.S.) Army Communications-Electronics Research, Development, and Engineering Center (CERDEC), Program Element (PE) 0603710A, Night Vision Advanced Technology. The program presents an opportunity to North Atlantic Treaty Organization (NATO) nations, global industry, and academia to participate with their own assets in order to foster information exchange and collaboration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.5"
                                            },
                                            "Text": {
                                                "val": "Continued to refine Integrated Cueing Environment (ICE) design and to integrate new technology, including spatial aural cues and experiment in the flight environment. Conducted limited flight test of real time enroute path guidance from sensor data using Obstacle Field Navigation (OFN) algorithms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.377"
                                            },
                                            "Text": {
                                                "val": "Conduct multiple research focused trials and demonstrations while seeking opportunities to spin off and transition research to programs that will provide capability to the warfighter.  Physically integrate sensor fusion engine onto test aircraft and conduct engineering flight test of integrated system.  Implement approaches for multi ship networking and operations in DVE.  Conduct capstone demonstration in government SIL that validates optimal cueing symbology, sensor driven guidance, flight control configuration, and optimum presentation of sensor data through augmented and virtual reality."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned to PE 0603465A\/ Project AL6."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft & Occupant Survivability Systems"
                                    },
                                    "Description": {
                                        "val": "This effort increases rotorcraft survivability by reducing platform signatures, providing the means to more efficiently counter enemy detection and tracking systems, and also increases protection to the aircraft and aircrew against ballistic munitions, crash landings, and post-crash fire events. This effort enhances air crew situational awareness, allowing manned\/unmanned aircraft to avoid enemy air threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.196"
                                            },
                                            "Text": {
                                                "val": "Continued maturation of individual technologies that comprise the Aircraft and Aircrew Protection solution. Established a virtual prototype of the integrated Aircraft and Aircrew Protection solution and initiated incremental verification testing. Refined aircraft integration and system level demonstration strategies. Continued the demonstration of efficient, low drag rotor and hub designs and technologies to allow for high speed flight. Matured rotorcraft threat protection capabilities including self-protection and engagement technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.532"
                                            },
                                            "Text": {
                                                "val": "Develop aircraft survivability correlator algorithms that take into account aircraft signatures, vulnerable areas, maneuverability, terrain, threat understanding, and available countermeasures to provide an appropriate response for an increased level of threat aircraft protection.  Develop ownship and team based survivability behaviors and continue integration of rotorcraft threat protection technologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned to PE 0603465A\/ Project AM3."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Tactical UAS Technology Demonstration (NGTUAS)"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate transformational air vehicle technologies that overcome key barriers to meet the Army?s future Unmanned Aircraft System (UAS)  performance, survivability, and reliability requirements and operational capabilities. Work in this area is being done in coordination with efforts at AMRDEC  Program Element (PE) 0602211A, Platform Design & Structures Technologies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.888"
                                            },
                                            "Text": {
                                                "val": "Refine air vehicle technologies maturation, integration and system level test and demonstration strategies.  Validate new design and assessment methodologies relevant to UAS-scaled platforms through demonstration.  Develop an informed Model Performance Specifications (MPS) and provide quantifiable metrics and key attributes for the NGTUAS."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned to PE 0603465A\/ Project AI6."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maintainability & Sustainability Systems"
                                    },
                                    "Description": {
                                        "val": "Enables highly reliable, low maintenance platforms that can survive un-sustained in the multi-domain battle space for extended periods.  Integrates and demonstrates technology solutions comprising aircraft health state awareness, data driven sustainment approaches, and operationally durable designs with minimal operating and sustainment costs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.397"
                                            },
                                            "Text": {
                                                "val": "Initiated effort to develop an embedded and networked rotorcraft sustainment capability. Matured integrated health management technologies in a SIL environment to demonstrate: an aircraft level sustainment network; embedded health assessment, adaptive aircraft control inputs, and component self-assessment; usage tracking; and embedded history data interfaces with mission planning and enterprise logistics systems. Identified and selected hardware and software for integration into a sustainment rig and\/or SIL test."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.068"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "436"
                    },
                    "ProjectTitle": {
                        "val": "Rotarywing MEP Integ"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.554"
                        },
                        "CurrentYear": {
                            "val": "7.417"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "13.971"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to Program Element (PE) 0603465 Future Vertical Lift Advanced Technology, Projects: \n* AL1 Advanced Teaming for Tactical Aviation Oper"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and validates man-machine integration and mission equipment software and hardware technologies for unmanned and optionally manned aircraft systems and integrated threat protection systems. Efforts focus on artificial intelligence, intelligent agents, cognitive decision aiding, sensors, avionics, communications, and pilot vehicle interfaces. This Project improves the overall mission execution by demonstrating manned and unmanned system teaming, enhanced aircraft pilotage capability, improved crew workload distribution, and new capabilities for both manned and unmanned aircraft. This Project supports Army transformation by providing mature technology to greatly expand the capabilities of unmanned aircraft, in current operating roles and future unmanned wingman roles. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.\n\nFY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unmanned and Optionally Manned Systems"
                                    },
                                    "Description": {
                                        "val": "Mature and apply tactical behavior algorithms and safe-flight technologies to enable unmanned and optionally manned aircraft to maintain safe, responsive, flexible, and tactical formation flight with manned helicopters for unmanned wingman applications in re-supply, reconnaissance, surveillance and attack missions.  Develop, mature, apply, and integrate advanced decision aiding, autonomy, and human-machine interface technologies to enable the helicopter flight crew to make full use of the capabilities of an unmanned aircraft system (UAS) without requiring continuous attention. Efforts include development of intelligent algorithms that aid decisions and actions in order to increase situation awareness, maximize use of on-board and off-board sensors, efficiently manage a team of manned and unmanned vehicles and their mission systems, and develop and execute effective and appropriate offensive and defensive responses."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.554"
                                            },
                                            "Text": {
                                                "val": "Integrated and demonstrated third party vendor pilot aiding software and advanced human machine interface technologies in simulations to inform cockpit development programs for both legacy fleet aircraft upgrades and future aircraft procurements. Demonstrated software integration within an open systems, modular architecture based system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.674"
                                            },
                                            "Text": {
                                                "val": "Continue the development, integration and demonstration of third party vendor software and advanced human machine interface technologies in simulations to enable increased manned and unmanned teaming capabilities and to inform crew station development programs for both legacy fleet aircraft upgrades and future aircraft procurements. Continue to demonstrate software and hardware integration within an open systems, modular architecture based system."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Work transferred to PE 0603465 due to S&T Financial Restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Teaming"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate teaming behaviors and autonomous decision making for mixed platform formations in combined arms operations.  Focus areas include:  resilient autonomous algorithms; self-organizing unmanned formations; distributed command and control; and navigation."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.518"
                                            },
                                            "Text": {
                                                "val": "Develop and mature teaming algorithms focused on resupply, reconnaissance and surveillance mission areas. Integrate and demonstrate sensor and processing technology to support teaming behavior for heterogeneous platform formations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned to PE 0603465\/ Project AL1"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.225"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "447"
                    },
                    "ProjectTitle": {
                        "val": "ACFT Demo Engines"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.898"
                        },
                        "CurrentYear": {
                            "val": "3.716"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "9.614"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned to Program Element (PE) 06033465 Future Vertical Lift Advanced Technology, Projects:\n* AI8 Alternative Concept Engine\n* AJ1 Future UAS Engine"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates power system technologies through design, fabrication, and evaluation of advanced engine components in order to improve the performance of turbine engines and drive systems for vertical lift aircraft and Unmanned Aerial Systems (UAS) vehicles  This Project supports Army modernization by demonstrating mature technologies for lighter turbine engines and drives that provide increased power, increased fuel efficiency, improved sustainability and reduced maintenance. These advanced engine designs and drives will significantly improve the overall aircraft performance characteristics and reduce the logistical footprint of Army Aircraft.    \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Alternative Concept Engine (ACE)"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates alternative, adaptive, and intelligent engine technologies to provide improved \/ mission-optimized performance, readiness, and affordability across an expanding engine envelope for increased operational capability for Army Aviation manned and unmanned platforms.  The alternative concept engine technology demonstrations planned for this effort are applicable to current and future platforms. Work in this project is coordinated with efforts in PE 0602211A, Project 47A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.898"
                                            },
                                            "Text": {
                                                "val": "Completed detailed design and initiate fabrication of innovative\/adaptive engine component technologies such as variable speed power turbine.  Performed component design integration efforts in preparation for full system demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.633"
                                            },
                                            "Text": {
                                                "val": "Continue fabrication and initiate component test of innovative\/adaptive engine component technologies such as variable speed power turbine. Continue component design integration efforts and perform fabrication of hardware for full system demonstration to enable greater aircraft performance and engine durability in support of Future Vertical Lift."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned to PE 06033465\/ projects AI8 and AJ1."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.083"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BA7"
                    },
                    "ProjectTitle": {
                        "val": "AVIATION ADVANCED TECHNOLOGY INITIATIVES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18"
                        },
                        "CurrentYear": {
                            "val": "44.6"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "62.600"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Aviation advanced technology development."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "JTARV"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "3"
                                        },
                                        "Text": {
                                            "val": "JTARV"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FVL Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "FVL Research"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rotary Wing Development"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Rotary Wing Development"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Stretch Broken Composite Material Forms"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4"
                                        },
                                        "Text": {
                                            "val": "Stretch Broken Composite Material Forms"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Helicopter Seating System"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Advanced Helicopter Seating System"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data Refinement and Optimization for Aviation Sustainment"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "1.6"
                                        },
                                        "Text": {
                                            "val": "Data Refinement and Optimization for Aviation Sustainment"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Surface Tolerant Adhesive for Bonded Airframe Structure"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Surface Tolerant Adhesive for Bonded Airframe Structure"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Tactical Aerial Supply Vehicle"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "3"
                                        },
                                        "Text": {
                                            "val": "Joint Tactical Aerial Supply Vehicle"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rotorcraft Automated Compenent Tracking"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "6"
                                        },
                                        "Text": {
                                            "val": "Rotorcraft Automated Compenent Tracking"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Future Vertical Lift (FVL) Research"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "20"
                                        },
                                        "Text": {
                                            "val": "Future Vertical Lift (FVL) Research"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}