{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-5a07dc0699c01ee0aa0e25e1d703a9926ea45842c064a371eb5a85ab7f6935f0-19",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603618D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Electronic Advanced Technology"
        },
        "R1LineNumber": {
            "val": "44"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "14.020"
            },
            "CurrentYear": {
                "val": "12.889"
            },
            "BudgetYearOne": {
                "val": "12.063"
            },
            "BudgetYearOneBase": {
                "val": "12.063"
            },
            "BudgetYearTwo": {
                "val": "12.280"
            },
            "BudgetYearThree": {
                "val": "12.489"
            },
            "BudgetYearFour": {
                "val": "12.723"
            },
            "BudgetYearFive": {
                "val": "12.992"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2020, Project 619, Electronic Warfare and Non-Kinetic Effects Experimentation and Oversight, is realigned to Project 245, Electronic Warfare Enterprise Exploration and Innovation."
        },
        "ProgramElementMissionDescription": {
            "val": "The United States has enjoyed a historical technological advantage in sensors, weapons, and countermeasures.  To offset this advantage, adversaries are developing competing and asymmetric capabilities that are enabled by advanced commercial electronic components and devices.  These threats range from terrorist-employed improvised devices, small unmanned air systems, and easily transportable Man-Portable Air Defense Systems (MANPADS) to dedicated military systems such as advanced sensors and communications systems, advanced Electronic Warfare (EW) components and systems, integrated air defense systems (IADS), and increasingly capable cruise and ballistic missiles. \n\nThe rate at which new threats are appearing continues to accelerate and demands a faster response than traditional Department of Defense (DoD) research, development, and acquisition processes can provide.  The myriad of new advanced electromagnetic spectrum (EMS) threats have made operations in the EMS significantly more difficult and complex.  The challenges posed by new kinetic and nonkinetic EMS threats and the dire consequences of technology surprise highlight the need to rapidly develop and field innovative EW and EW-Cyber capabilities that can address new threats far more quickly and in more cost-effective ways.\n\nThe Joint Electronic Advanced Technology (JEAT) program is specifically designed to address these challenges through efforts designed to substantially accelerate new nonkinetic solutions for the EMS battlespace.  To do this, the JEAT program explores technologies and approaches that either fall outside the Services’ research and development (R&D) programs of record or are being developed at rates that cannot deliver needed capabilities in the required timeframes. \n\nTo identify nearer-term and lower-cost solutions, JEAT specifically explores and assesses approaches that use off-the-shelf military and commercial technologies in innovative ways.  This approach has resulted in substantial savings for the Services and the Department in both R&D and in Programs of Record.  It has also enabled needed military capabilities to be delivered to the warfighter much sooner than possible by traditional DoD approaches. \n\nJEAT program efforts are focused in four areas in two project codes, Project 619 and Project 245.\n\nThere currently are three classes of efforts within Project 619, EW and Non-Kinetic Effects Experimentation and Oversight:\n\n(1) Experimentation\/Demonstration efforts utilize innovative field and laboratory experimentation venues to fully understand current and future threats and more rapidly and thoroughly explore, mature, and demonstrate potential countermeasures and overmatch opportunities. This effort will be realigned and funded out of the 0603699D8Z Emerging Capabilities Technology Development (ECTD) Program Element beginning in FY 2020. \n\n(2) Advanced Technology Development\/Verification efforts investigate mature technologies and approaches to counter advanced threats in innovative ways and provide powerful new warfighting capabilities.  These efforts include advanced technology development of new sensors and countermeasures in laboratory environments and the development and demonstration of new warfighting capabilities such as computer-augmented data dominance and machine learning technologies and approaches to enhance EMS situational awareness and accelerate nonkinetic operations planning and decision-making. This effort will be realigned to Project 245 beginning in FY 2020.\n\n(3) EW Collaboration and Planning ensures appropriate coordination and technological oversight of Department and Service EW and EW-Cyber R&D programs and processes and provides governance insights for senior decision-makers. This effort will be realigned to Project 245 beginning in FY 2020.\n\nCurrently the sole effort in Project 245, EW Enterprise Exploration and Innovation explores computer-augmented data dominance and machine learning technologies, tools, and approaches to enhance EMS situational awareness and accelerate nonkinetic operations planning and decision-making."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "14.389"
                },
                "CurrentYear": {
                    "val": "12.918"
                },
                "BudgetYearOne": {
                    "val": "12.098"
                },
                "BudgetYearOneBase": {
                    "val": "12.098"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "14.020"
                },
                "CurrentYear": {
                    "val": "12.889"
                },
                "BudgetYearOne": {
                    "val": "12.063"
                },
                "BudgetYearOneBase": {
                    "val": "12.063"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.369"
                },
                "CurrentYear": {
                    "val": "-0.029"
                },
                "BudgetYearOne": {
                    "val": "-0.035"
                },
                "BudgetYearOneBase": {
                    "val": "-0.035"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.341"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.028"
                                },
                                "CurrentYear": {
                                    "val": "-0.029"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.035"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.035"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "619"
                    },
                    "ProjectTitle": {
                        "val": "EW and Non-Kinetic Effects Experimentation and Oversight"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.770"
                        },
                        "CurrentYear": {
                            "val": "12.114"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project 619, EW and Non-Kinetic Effects Experimentation and Oversight explores and assesses innovative technologies and approaches to rapidly mitigate advanced threats and demonstrate new overmatch technologies in ways not being explored by the Services.  Three efforts, Experimentation\/Demonstration (Expt\/Demo), Advanced Technology Development\/Verification (ATD\/V), and Electronic Warfare Enterprise Collaboration and Planning (EW C&P), focus on enabling nearer-term lower-cost technology transitions to the warfighter with reduced risk. \n\nExpt\/Demo efforts use innovative large-scale field experimentation venues to explore, demonstrate, mature, and assess innovative technologies and approaches to counter advanced electromagnetic spectrum (EMS) threats and provide new overmatch capabilities for U.S. forces.  ATD\/V efforts mature, integrate, and demonstrate technologies and approaches not being explored by the Services, including the use of off-the-shelf commercial and military technologies.  They include laboratory efforts to demonstrate nearer-term, lower cost technological solutions to emergent threats.  EW C&P efforts are conducted within the Office of the Under Secretary of Defense for Research and Engineering (OUSD(R&E)).  These efforts assess, ensure coordination, and provide insights to senior leadership on all Departmental EW and EW-Cyber research and development (R&D). \n\nExpt\/Demo venues simultaneously explore myriads of technologies and approaches side-by-side with warfighter participation to more rapidly identify and mature promising technological solutions.  They employ very complex and dense EMS environments, fielded and in-development threats, and emerging technologies and capabilities in combinations and ways not otherwise achievable due to cost and other limitations.  These venues thus provide greater realism and far more information than any other developmental approach. \n\nThe next Expt\/Demo venue, Silent Hammer (SH), is a multi-year, multi-agency, live, virtual, and constructive series of events to explore, assess, mature, and accelerate technologies and approaches for multi-platform, multi-aperture, multi-domain (M3) passive\/active sensing and targeting in complex and congested EMS environments.  Modeled after JEAT’s highly successful BLACK DART, TRIDENT SPECTRE, Rotorcraft Aircraft Survivability Equipment Experiment (RASE), and VIGILANT HAMMER venues, SH will use both scripted and dynamic scenarios to give participants opportunities to explore new M3 capabilities and approaches to engage emerging EMS threats.  Follow-on venues will address similar compelling capabilities, approaches, and threats. This effort will be realigned and funded out of the 0603699D8Z Emerging Capabilities Technology Development (ECTD) Program Element beginning in FY 2020.\n\nATD\/V explores, matures, integrates, and demonstrates emerging technologies and approaches to address compelling EW and EW-Cyber warfighting needs.  Many of these efforts are conducted in JEAT’s state-of-the-art Distributed Electronic Effects Development (DEED) Laboratory to enable exploration of exceptionally complex approaches and interactions including, for example, multi-aperture collaborative-coherent EW and EW-Cyber employment using exquisitely coordinated electronic sensing and attack capabilities. \n\nEW C&P supports activities related to selecting, organizing, overseeing, and coordinating all EW and EW-Cyber-related R&D efforts across DoD.  EW C&P oversees and ensures coordination and collaboration between OSD and the Joint Staff, the Combatant Commands, the Services, and the Intelligence Community (IC) on all EW and EW-Cyber activities within DoD.  To accomplish this, EW C&P identifies, assesses, and develops recommendations to address EW- and EW-Cyber-related threats impacting sensors, seekers, communications, platform survivability, countermeasures, and EMS battle management.  EW C&P also provides programmatic recommendations and decision support to the Office of the Under Secretary of Defense for Acquisition and Sustainment (OUSD(A&S)) on Programs of Record, Joint Urgent Operational Need responses, and similar efforts, including technology maturity and availability, critical program information standards, foreign disclosure, and technical signals requirements.  EW C&P also conducts and leads deep dives and analyses of technological opportunities and advanced threats to support Departmental EW and EW-Cyber R&D research, development and acquisition efforts."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Experimentation\/Demonstration (Expt\/Demo)"
                                    },
                                    "Description": {
                                        "val": "Leveraging JEAT’s history of conducting highly successful experimentation venues, Silent Hammer (SH), our new multi-year, multi-agency, series of field experimentation venues, will explore, assess, mature, and accelerate technologies and approaches for multi-platform, multi-aperture, multi-domain (M3) passive\/active sensing in complex and congested EMS environments.  As with earlier Project 619 experimentation venues, Silent Hammer (SH) and subsequent venues are scoped to address the most pressing EMS threats and issues.  The EW and Cyber Communities of Interest and Executive Committees and warfighters are involved in the selection of follow-on venue topics and scoping of these efforts to ensure their maximum relevance and value."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.223"
                                            },
                                            "Text": {
                                                "val": "VH 3 is planned for early third quarter of FY 2018.  A report and briefing will be provided approximately two months following execution in the fourth quarter of FY 2018.  Assessment of earlier VH events, compelling threats, and technological maturity is also guiding initial planning efforts of our next Expt\/Demo venue which will focus on Multi-platform, Multi-aperture, Multi-domain (M3) opportunities to more effectively sense, target, and attack threats of multi-static passive\/active sensing architectures in a complex and congested environment.  This venue will be planned during FY 2018, and is tentatively scheduled to be held in late FY 2019."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.172"
                                            },
                                            "Text": {
                                                "val": "This venue will begin exploring, assessing, and maturing technologies and approaches to engage M3 passive\/active threat architectures. It will provide understanding of the effectiveness of current and new technologies in this role and any unintended consequences of simultaneous passive\/active engagement."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Silent Hammer is realigned to PE 0603699D8Z, Emerging Capabilities Technology Development (ECTD), beginning in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Technology Development\/Verification (ATD\/V)"
                                    },
                                    "Description": {
                                        "val": "ATD\/V research efforts mature and assess emerging technologies to address compelling EW and converged EW-Cyber warfighting needs.  They focus on identifying and integrating advanced technologies to synergistically create effects that are far greater than the sum of the constituent systems and identifying nearer term, lower cost, and more effective solutions.  Many of these efforts utilize JEAT’s DEED Laboratory, which integrates promising technologies into unmanned aerial vehicles for further exploration and assessment in venues like Silent Hammer."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.535"
                                            },
                                            "Text": {
                                                "val": "Complete the integration and enable full-operational capability of the Integrated Air Defense Systems (IADS) threat simulator in the DEED Laboratory.  Develop and validate multi-platform\/multi-aperture EW and Integrated Cyber Electronic Warfare (ICEW) techniques and approaches employed from distributed platforms.  Continue support of advanced technique development and demonstration by multiple organizations across the DoD, including OSD and other agency-sponsored R&D efforts (Joint Capability Technology Demonstrations, Future Naval Capabilities, etc.)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.714"
                                            },
                                            "Text": {
                                                "val": "Demonstrate and assess multi-platform\/multi-aperture EW and integrated Cyber\/Electronic Warfare (ICEW) techniques in the laboratory.  Integrate matured technologies\/approaches into unmanned air systems to be flown in Silent Hammer and other experimentation venues."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned to Project 245, EW Enterprise Exploration and Innovation, within PE 0603618D8Z, Joint Electronic Advanced Technology, beginning in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EW Enterprise Collaboration and Planning (EW C&P)"
                                    },
                                    "Description": {
                                        "val": "Coordinates, oversees, and manages the plethora of EMS warfare-related R&D activities in the OUSD(R&E).  Maintains cognizance of all EW capabilities and capability development efforts worldwide; oversees all EW-related R&D activities across DoD; explores new and innovative EMS technologies and approaches; coordinates Departmental EW-related R&D, protocols, and policy; analyzes requisite development and operational interfaces across DoD and with international partners; and reports relevant information to senior leaders and across the Department, as well as to Congress and other external groups."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.012"
                                            },
                                            "Text": {
                                                "val": "In FY 2018, EW C&P effort will include participating in the EW EXCOM; providing guidance to and direction and management of JEAT Expt\/Demo and ATD\/V efforts; advancing initiatives for the establishment of EW vulnerability portfolios; and tracking the progress of Joint Urgent Operational Need SO-0010, for which Project 619 helped identify technology solutions.  Project 619 continues interfacing with the Intelligence Community (IC) at senior levels to address critical intelligence gaps related to foreign EMS capabilities and advanced technology development efforts.  Project 619 also assessed alternative courses of action for employing advanced, adaptive, and cognitive EW technologies that are being developed and marketed commercially for data communications, radar, and other advanced spectrum domains previously dominated by DoD.  Emerging concepts and technologies from the R&E Reliance Process and the EW Science and Technology Community of Interest road maps were assessed for their potential impact and value.  Analysis and coordination of national and international efforts addressing emerging Information Operations and EW-Cyber Convergence topics were addressed as well as efforts to advance technologies that provide countermeasures to imaging infrared seekers and expand U.S.-Australia collaboration in EW-Cyber.  These efforts guided planning of Non-Kinetic Battle Management and Visualization Technology research efforts in Project 245 of this Program Element.\n\nIn addition to continued participation in ongoing efforts mentioned above, FY 2018 efforts include the development of a variety of new EW capabilities including distributed cooperative or coherent aperture techniques; battle management and visualization technologies for optimization of non-kinetic fires; asymmetric targeting technologies; passive system countermeasure techniques; and national technical means applications to EW.  Efforts will also guide planning of future EW Enterprise Exploration and Innovation (Project 245) research efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.228"
                                            },
                                            "Text": {
                                                "val": "Participate in joint, collaborative EW guidance and oversight activities, including the EW EXCOM.  Guide, direct, and oversee the JEAT Advance initiatives to establish EW vulnerability portfolios.  Track the progress of Joint Urgent Operational Need SO-0010 (Project 619-led identification of technology solutions).  Interface with the Intelligence Community (IC) to address critical intelligence gaps related to foreign EMS capabilities and advanced technology development efforts.  Additional efforts include exploring a variety of new EW capabilities including battle management and visualization technologies; asymmetric targeting technologies; countermeasures to passive sensor threats; and greater leveraging of national technical means to support the development of EW and EW-Cyber capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned to Project 245, EW Enterprise Exploration and Innovation, within PE 0603618D8Z, Joint Electronic Advanced Technology, beginning in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "245"
                    },
                    "ProjectTitle": {
                        "val": "EW Enterprise Exploration and Innovation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.250"
                        },
                        "CurrentYear": {
                            "val": "0.775"
                        },
                        "BudgetYearOne": {
                            "val": "12.063"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.063"
                        },
                        "BudgetYearTwo": {
                            "val": "12.280"
                        },
                        "BudgetYearThree": {
                            "val": "12.489"
                        },
                        "BudgetYearFour": {
                            "val": "12.723"
                        },
                        "BudgetYearFive": {
                            "val": "12.992"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project 245 was established to address compelling threats identified by the Electronic Warfare (EW) Defense Science Board in FY 2016.  It originally included four efforts focused on maturing and demonstrating innovative countermeasures to new classes of advanced EW threats, demonstrating new EW-Cyber capabilities, and enabling extremely high fidelity, real-time comprehension and management control of the EMS battlespace and non-kinetic effects within it."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Non-Kinetic Battle Management and Visualization Technology Development"
                                    },
                                    "Description": {
                                        "val": "The Digital Attack Surface Execution Environment (DASEE) effort explores a variety of advanced technologies to significantly enhance the fidelity, timeliness, and comprehension of information provided to warfighters and IC analysts responsible for understanding and exercising control of the EMS and cyberspace warfighting domains.  DASEE, is a joint, collaborative effort with the Services, Combatant Commands, and the Intelligence Community (IC) to integrate and demonstrate vastly enhanced real-time electromagnetic spectrum (EMS)\/Cyberspace situational awareness and battle management technologies.  State-of-the-art artificial intelligence, machine learning, big data analytics, and advanced heuristics will be leveraged to enable predictive analytics and course of action development and for highly accurate real-time battle management of non-kinetic capabilities within the EMS and cyberspace domains."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.250"
                                            },
                                            "Text": {
                                                "val": "Building on FY 2017 efforts, the initial demonstration of Digital Attack Surface Execution Environment (DASEE) capabilities is scheduled for December 2017 and the final demonstration for Phase One activities is scheduled in February 2018.  FY 2018 efforts will significantly expand and refine approaches to increase the representational fidelity and comprehensibility of non-kinetic battlespaces and advance course-of-action development capabilities.  Operational and IC users will be highly leveraged in this work to refine initial products and streamline the transitioning of newly developed capabilities to users for field experimentation and assessment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.775"
                                            },
                                            "Text": {
                                                "val": "The DASEE research effort will continue with two additional demonstrations involving progressively challenging objectives culminating with field demonstrations with operational and IC users to enable the transition of capabilities to these communities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort continues under Advanced Technology Development\/Verification (ATD\/V) as described below in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Technology Development\/Verification (ATD\/V)"
                                    },
                                    "Description": {
                                        "val": "ATD\/V research efforts mature and assess emerging technologies to address compelling EW and converged EW-Cyber warfighting needs.  They focus on identifying and integrating advanced technologies to synergistically create effects that are far greater than the sum of the constituent systems and identifying nearer term, lower cost, and more effective solutions.  Many of these efforts utilize JEAT’s DEED Laboratory, which integrates promising technologies into unmanned aerial vehicles for further exploration and assessment in venues like Silent Hammer."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Continue demonstrating and assessing multi-platform\/multi-aperture EW and integrated Cyber\/Electronic Warfare (ICEW) techniques in the laboratory.  Matured technology products will be integrated and flown by unmanned air systems in Silent Hammer 2 and other experimentation venues.  Digital Attack Surface Execution Environment (DASEE) development efforts will also continue."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.906"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.906"
                                            },
                                            "Text": {
                                                "val": "Continue ongoing activities from FY 2019.  Additional DASEE demonstrations involving progressively challenging objectives will culminate in field demonstrations with operational and IC users to enable the transition of capabilities to warfighting and IC users in FY 2020 and FY 2021."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned from Project 619 beginning in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EW Enterprise Collaboration and Planning (EW C&P)"
                                    },
                                    "Description": {
                                        "val": "Coordinates, oversees, and manages the plethora of EMS warfare-related R&D activities in the OUSD(R&E).  Maintains cognizance of all EW capabilities and capability development efforts worldwide; oversees all EW-related R&D activities across DoD; explores new and innovative EMS technologies and approaches; coordinates Departmental EW-related R&D, protocols, and policy; analyzes requisite development and operational interfaces across DoD and with international partners; and reports relevant information to senior leaders and across the Department, as well as to Congress and other external groups."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Participate in joint, collaborative EW guidance and oversight activities, including the EW EXCOM.  Guide, direct, and oversee the JEAT Expt\/Demo, ATD\/V, and Project 245 Non-Kinetic Battle Management Technology Development efforts.  Advance initiatives to establish EW vulnerability portfolios.  Track the progress of Joint Urgent Operational Need SO-0010 (Project 619-led identification of technology solutions).  Interface with the Intelligence Community (IC) to address critical intelligence gaps related to foreign EMS capabilities and advanced technology development efforts.  Additional efforts include exploring a variety of new EW capabilities including battle management and visualization technologies; asymmetric targeting technologies; countermeasures to passive sensor threats; and greater leveraging of national technical means to support the development of EW and EW-Cyber capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.157"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.157"
                                            },
                                            "Text": {
                                                "val": "Continue ongoing activities from FY 2019."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned from Project 619 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}