{
    "id": "2020-DefenseAdvancedResearchProjectsAgency-PB-0400-JBOOK-a68dd9fef367b9c12cbc9abe43de0f366f7fa17ff175266a426863ca981e6b3b-0",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-DARPA-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601101E"
        },
        "ProgramElementTitle": {
            "val": "DEFENSE RESEARCH SCIENCES"
        },
        "R1LineNumber": {
            "val": "2"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "403.448"
            },
            "CurrentYear": {
                "val": "422.680"
            },
            "BudgetYearOne": {
                "val": "432.284"
            },
            "BudgetYearOneBase": {
                "val": "432.284"
            },
            "BudgetYearTwo": {
                "val": "431.356"
            },
            "BudgetYearThree": {
                "val": "414.402"
            },
            "BudgetYearFour": {
                "val": "392.564"
            },
            "BudgetYearFive": {
                "val": "382.423"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Research Sciences Program Element is budgeted in the Basic Research Budget Activity because it provides the technical foundation for long-term National Security enhancement through the discovery of new phenomena and the exploration of the potential of such phenomena for Defense applications.  It supports the scientific study and experimentation that is the basis for more advanced knowledge and understanding in information, electronic, mathematical, computer, and materials sciences.\n\nThe Math and Computer Sciences project supports scientific study and experimentation on new mathematical and computational algorithms, models, and mechanisms in support of long-term national security requirements.  Modern analytic and information technologies enable important new military capabilities and drive the productivity gains essential to U.S. economic competitiveness.  Conversely, new classes of threats, in particular threats that operate in or through the cyber domain, put military systems, critical infrastructure, and the civilian economy at risk.  This project aims to magnify these opportunities and mitigate these threats by leveraging emerging mathematical and computational capabilities including computational social science, artificial intelligence, machine learning and reasoning, data science, complex systems modeling and simulation, and theory of computation.  The basic research conducted under the Math and Computer Sciences project will produce breakthroughs that enable new capabilities for national security and homeland defense.\n\nThe Cyber Sciences project supports long-term national security requirements through scientific research and experimentation in cyber security.  Information technologies enable important new military capabilities and drive the productivity gains essential to U.S. economic competitiveness.  Meanwhile, cyber threats grow in sophistication and number, and put sensitive data, classified computer programs, mission-critical information systems, and future economic gains at risk.  The basic research conducted under the Cyber Sciences project will produce breakthroughs necessary to enhance the resilience of DoD information systems to current and emerging cyber threats.\n\nThe Electronic Sciences project is for basic exploration of electronic and optoelectronic devices, circuits, and processing concepts to meet the military's need for near real-time information gathering, transmission, and processing.  In seeking to continue the phenomenal progress in microelectronics innovation that has characterized the last few decades, the project should provide DoD with new, improved, or potentially revolutionary device options for accomplishing these critical functions.  The resulting technologies should help maintain knowledge of the enemy, communicate decisions based on that knowledge, and substantially improve the cost and performance of military systems.  Research areas include analog, mixed signal, and photonic circuitry for communications and other applications; alternative computer architectures; and magnetic components to reduce the size of Electromagnetic (EM) and sensing systems.  Other research could support field-portable electronics with reduced power requirements, ultra-high density information storage \"on-a-chip\", and new approaches to nanometer-scale structures, molecules, and devices.\n\nThe Beyond Scaling Sciences project will support investigations into materials, devices, and architectures to provide continued improvements in electronics performance with or without the benefit of Moore's Law (silicon scaling). Within the next ten years, traditional scaling will start to encounter the fundamental physical limits of silicon, requiring fresh approaches to new electronic systems. Over the short term, DoD will therefore need to unleash circuit specialization in order to maximize the benefit of traditional silicon. Over the longer term, DoD and the nation will need to engage the computer, material, and mechanical sciences to explore electronics improvements through new non-volatile memory devices that combine computation, memory, and new automated design tools using machine learning. Other memory devices could also leverage an emerging understanding of the physics of magnetic states, electron spin properties, topological insulators, or phase-changing materials. Beyond Scaling programs will address fundamental exploration into each of these areas.\n\nThe Materials Sciences project provides the fundamental research that underpins the design, development, assembly, and optimization of advanced materials, devices, and systems for DoD applications in areas such as robust diagnostics and therapeutics, novel energetic materials, and complex hybrid systems.\n\nThe Transformative Sciences project supports research and analysis that leverages converging technological forces and transformational trends in information-intensive subareas of the social sciences, life sciences, manufacturing, and commerce.  The project integrates these diverse disciplines to improve military adaptation to sudden changes in requirements, threats, and emerging\/converging trends, especially trends that have the potential to disrupt military operations or threaten National Security.  Specific research in this project will investigate technologies to enable detection of novel threat agents (e.g., bacterial pathogens) and maintain warfighter health, as well as create innovative materials of interest to the military (e.g., self-healing materials)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "432.347"
                },
                "CurrentYear": {
                    "val": "422.130"
                },
                "BudgetYearOne": {
                    "val": "413.970"
                },
                "BudgetYearOneBase": {
                    "val": "413.970"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "403.448"
                },
                "CurrentYear": {
                    "val": "422.680"
                },
                "BudgetYearOne": {
                    "val": "432.284"
                },
                "BudgetYearOneBase": {
                    "val": "432.284"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-28.899"
                },
                "CurrentYear": {
                    "val": "0.550"
                },
                "BudgetYearOne": {
                    "val": "18.314"
                },
                "BudgetYearOneBase": {
                    "val": "18.314"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-14.510"
                    },
                    "CurrentYear": {
                        "val": "-14.450"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "15.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.638"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-11.751"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "18.314"
                                },
                                "BudgetYearOneBase": {
                                    "val": "18.314"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018:  Decrease reflects Congressional reduction, SBIR\/STTR transfer and reprogrammings.\nFY 2019:  Increase reflects Congressional adjustments.\nFY 2020:  Increase reflects expansion of Artificial Intelligence initiatives, offset by smaller program decreases."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CCS-02"
                    },
                    "ProjectTitle": {
                        "val": "MATH AND COMPUTER SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "174.658"
                        },
                        "CurrentYear": {
                            "val": "188.629"
                        },
                        "BudgetYearOne": {
                            "val": "220.824"
                        },
                        "BudgetYearOneBase": {
                            "val": "220.824"
                        },
                        "BudgetYearTwo": {
                            "val": "236.716"
                        },
                        "BudgetYearThree": {
                            "val": "226.076"
                        },
                        "BudgetYearFour": {
                            "val": "213.572"
                        },
                        "BudgetYearFive": {
                            "val": "219.536"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Math and Computer Sciences project supports scientific study and experimentation on new mathematical and computational algorithms, models, and mechanisms in support of long-term national security requirements.  Modern analytic and information technologies enable important new military capabilities and drive the productivity gains essential to U.S. economic competitiveness.  Conversely, new classes of threats, in particular threats that operate in or through the cyber domain, put military systems, critical infrastructure, and the civilian economy at risk.  This project aims to magnify these opportunities and mitigate these threats by leveraging emerging mathematical and computational capabilities including computational social science, artificial intelligence, machine learning and reasoning, data science, complex systems modeling and simulation, and theory of computation.  The basic research conducted under the Math and Computer Sciences project will produce breakthroughs that enable new capabilities for national and homeland security."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "DARPA Foundational and Applied Artificial Intelligence"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "15.000"
                                        },
                                        "Text": {
                                            "val": "-  Develop approaches to build, maintain, and reason over rich models of complex systems by interpreting and exposing scientific knowledge and assumptions in existing code and documentation.  \n-  Create systems to extract scientific laws and governing equations from data and assess the adequacy of the supplied data, identifying regions where additional data would be most beneficial.\n- Research the computational principles and architecture of reduced-scale systems in miniaturized insect species operating with low energy that could identify new computing paradigms for improved AI with considerably reduced training times and power consumption."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Social Systems"
                                    },
                                    "Description": {
                                        "val": "The social sciences provide essential theories and models that can enable deeper understanding of human social systems and behaviors relevant to national security such as humanitarian aid, disaster relief, and stability support missions, as well as tactical, operational, strategic, and policy-level decision-making across the DoD.  However, current limitations to the speed, scalability and reproducibility of empirical social science research continue to hamper its practical use by the DoD.  Additionally, current social behavioral models often fail to accurately interpret social behaviors because they do not sufficiently capture diversity of context.  The Human Social Systems thrust will address these limitations by focusing on the following technical challenges:  (1) developing and validating new methods, models and tools to perform rigorous, reproducible experimental research at scales necessary to understand emergent properties of human social systems; (2) identifying methods to better characterize and quantify properties, dynamics, and behaviors of different social systems to enable better and more confident forecasting of changes in social systems, particularly when under stress; and (3) developing an understanding of the complex effect of context and incorporating these effects into social science models.  This research thrust will provide DoD with new, reliable strategies to better understand and respond to social system issues at city scale and will significantly improve DoD ability to assess intent, deception, and other social behaviors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.767"
                                            },
                                            "Text": {
                                                "val": "-  Tested newly developed representation and modeling tools to determine applicability for understanding social behavioral outcomes.  \n-  Developed new capabilities for experimentally testing and validating multiple models of human social systems and behaviors.  \n-  Demonstrated the applicability of newly developed representation and modeling tools for understanding potential social behavioral outcomes.  \n-  Began to leverage inherent bias in artificial intelligence (AI) systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.608"
                                            },
                                            "Text": {
                                                "val": "-  Integrate new capabilities for experimentally testing and validating multiple models of human social systems and behavior.  \n-  Develop scoring methods to quantify the predictive accuracy of different models across different social experimental designs.  \n-  Test the efficiency and value of enhanced reproducibility for accelerating rigorous understanding of human social systems and behaviors.  \n-  Develop and deploy increasingly complex social simulations with known causal ground truth as test bed challenges for social science research communities.  \n-  Quantify the diagnostic and predictive accuracy, robustness, and efficiency of social science representation and modeling tools by testing them against simulations.  \n-  Determine the capabilities and limitations of representation and modeling tools for understanding and predicting cause and effect in complex social systems.  \n-  Measure bias in systems trained on distinct training sets and apply understanding of group biases to specific use cases. \n-  Formalize definitions of reproducibility and replicability for social and behavioral science research.  \n-  Develop new capabilities for rapidly assigning quantitative confidence scores to social and behavioral science research.  \n-  Explore analogous systems to improve societal systems models used by military decision-makers engaged in conflict resolution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop and deploy highly complex social simulations with known causal ground truth as test bed challenges for social science research communities.  \n-  Quantify the diagnostic and predictive accuracy, robustness, and efficiency of social science representation and modeling tools by testing them against simulations.  \n-  Determine the capabilities and limitations of representation and modeling tools for understanding and predicting cause and effect in highly complex social systems.  \n-  Demonstrate efficiency and value of rapid, scalable replication capabilities for accelerating rigorous understanding of human social systems and behaviors.  \n-  Implement and test algorithms for automatically assigning quantitative confidence scores to social and behavioral science research.\n-  Develop capabilities for adjusting algorithms based on user-specific needs and interests.  \n-  Initiate development of a taxonomy of social contexts and human-centric context-aware models that accounts for the specifics of a given situation, including cultural differences.  \n-  Demonstrate feasibility for expanding consideration of context in social science models to enhance interpretation of social behavior including intent and deception."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Synergistic Discovery and Design (SD2)"
                                    },
                                    "Description": {
                                        "val": "The Synergistic Discovery and Design (SD2) program is developing data-driven methods to accelerate scientific discovery and robust design in domains that lack complete models.  Engineers regularly use high-fidelity simulations to create robust designs in complex domains such as aeronautics and integrated circuits.  In contrast, robust design remains elusive in domains such as synthetic biology, neuro-computation, and synthetic chemistry due to the lack of high-fidelity models.  The SD2 program will collect raw experimental data into a data and analysis hub, develop computational techniques that extract scientific knowledge directly from experimental data, and create data sharing tools and metrics that facilitate collaborative design.  SD2 application domains include synthetic biology, solar cell chemistry, and protein design, which will impact future DoD capabilities in areas such as chemical and biological defense, and warfighter readiness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed baseline scientific discovery algorithms to detect why experiments fail and enhance reproducibility of sensor and circuit design experiments.\n-  Established initial automated design tools for biological circuit, riboswitch, and protein design to accelerate design of molecular sensors.     \n-  Developed experimental planning tools that optimized cost trade-offs for biological circuit, riboswitch, and protein design experiments. \n-  Generated cross laboratory datasets and evaluate the extent to which scientific discovery and design tools accelerated the design of biological circuits, riboswitches, and proteins."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Extend scientific discovery algorithms to understand why experiments fail, and to enhance reproducibility of experiments.\n-  Establish tools for automated design of novel solar materials, improve accuracy of protein and riboswitch design tools, and extend design tool capabilities to enable biological circuit design.\n-  Enhance experimental planning tools to facilitate design of experiments that maximize information gained on a per-experiment basis.\n-  Extend baseline protocol capture software to enable assembly of high-quality, integrated, experimental data, and evaluate generalizability of approach."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.000"
                                            },
                                            "Text": {
                                                "val": "-  Apply discovery algorithms to novel systems that have not been characterized by human experts.\n-  Integrate discovery algorithms with design protocols to automate the experimental process.\n-  Improve experimental planning tools to reduce the experimental costs required to obtain a functional design.\n-  Scale software and infrastructure to process petabytes of experimental data, and evaluate tools by testing their ability to adapt protein, riboswitch, and cellular circuit designs into biosensors."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "World Modelers"
                                    },
                                    "Description": {
                                        "val": "The World Modelers program is creating explanatory models for natural and human-mediated systems at regional and global scales.  The world is highly interdependent, and disruption of natural resources, supply chains, and production systems can have severe consequences.  The World Modelers capability is focused on regional and global systems with the goal of generating timely indications and warnings of impending catastrophe.  Water and food security are application domains of particular interest, as persistent drought may cause crops to fail, leading to migration and regional conflicts.  The World Modelers program is developing techniques for automating the creation, maintenance, and validation of large-scale integrated models using publicly available news and analyst reports as a structuring mechanism, and government and commercial data as quantitative inputs.  Advances in machine reading and learning, semantic technologies, big data analysis, geo-spatial and economic modeling, and environmental simulation bring this strategic capability within reach."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.633"
                                            },
                                            "Text": {
                                                "val": "-  Implemented basic semi-automated machine reading and learning techniques for creating and iterating upon large-scale models using public literature and government data.\n-  Developed an initial capability to model perturbations having the potential to impact regional security.\n-  Expanded large-scale data sets, and initiated evaluations of integrated models of issues related to food security.\n-  Analyzed initial models of regional and global phenomena, and formulated theory to understand the limits of model accuracy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop advanced capabilities for perturbation modeling and apply technology to additional use cases, in particular, migration and other factors that can provoke conflict among local populations.\n-  Integrate technologies into an initial end-to-end workflow: build qualitative models, parameterize quantitative models, automate machine processing from scenarios to actions, and generate uncertainty reporting.\n-  Evaluate integrated workflow on use cases, such as food security and migration.\n-  Work with DoD and Intelligence Community (IC) stakeholders to demonstrate and test the technologies on high-priority use cases, and coordinate with Department of Homeland Security (DHS) to consider the potential for applying the technology to domestic use cases such as disaster relief."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.500"
                                            },
                                            "Text": {
                                                "val": "-  Develop models for acute, high-impact phenomena such as natural disasters and disruption of civilian infrastructure on regional scales.\n-  Extend the integrated workflow to operate on compressed temporal scales and apply to use cases involving acute, high-impact phenomena.\n-  Evaluate and optimize the extended workflow on food security, migration, and acute, high-impact use cases.\n-  Perform demonstrations on realistic scenarios in collaboration with DoD, IC, DHS, and other stakeholders and potential transition sponsors."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Young Faculty Award (YFA)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Young Faculty Award (YFA) program is to encourage junior faculty at universities and their equivalent at non-profit science and technology research institutions to participate in sponsored research programs that will augment capabilities for future defense systems.  This program focuses on cutting-edge technologies for greatly enhancing microsystems technologies, biological technologies and defense sciences.  The long-term goal for this program is to develop the next generation of scientists, engineers and mathematicians in key disciplines who will focus a significant portion of their careers on DoD and national security issues.  The aim is for YFA recipients to receive deep interactions with DARPA program managers, programs, performers and the user community.  Current activities include research in fifteen topic areas spanning from Machine Learning and Many Body Physics, to Wideband Transmitter-Antenna Interfaces and Multi-Scale Models of Infectious Disease Dynamics.  A key aspect of the YFA program is DARPA-sponsored military visits; all YFA Principal Investigators are expected to participate in one or more military site visits to help them better understand DoD needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.000"
                                            },
                                            "Text": {
                                                "val": "-  Awarded new FY 2018 grants for new two-year research efforts across the topic areas which established a new set of appropriate technologies to solve current DoD problems.\n-  Continued FY 2017 research on new concepts for microsystem technologies, biological technologies and defense sciences by exercising second year funding and by providing continued mentorship by program managers.\n-  Awarded Director's Fellowships for top FY 2016 participants to refine technology further and align to DoD needs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.000"
                                            },
                                            "Text": {
                                                "val": "-  Award new FY 2019 grants for new two-year research efforts across the topic areas, establishing a new set of appropriate technologies to solve current DoD problems.\n-  Continue FY 2018 research on new concepts for microsystem, biological, strategic, and tactical technologies; information innovation; and defense sciences by exercising second year funding and by providing continued mentorship by program managers.\n-  Award Director's Fellowships for top FY 2017 participants to refine technology further and align to DoD needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.000"
                                            },
                                            "Text": {
                                                "val": "-  Award new FY 2020 grants for new two-year research efforts across the topic areas, establishing a new set of appropriate technologies to solve current DoD problems.\n-  Continue FY 2019 research on new concepts for microsystem, biological, strategic, and tactical technologies; information innovation; and defense sciences by exercising second year funding and by providing continued mentorship by program managers.\n-  Award Director's Fellowships for top FY 2018 participants to refine technology further and align to DoD needs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Tools for Modeling and Simulation"
                                    },
                                    "Description": {
                                        "val": "The Advanced Tools for Modeling and Simulation thrust will develop foundational mathematical, computational, and multi-physics theories, approaches and tools to better represent, quantify and model complex DoD systems from multimodal data analysis through part\/system design and fabrication.  One focus area of this thrust is developing a unified mathematical framework to enable better visualization and analysis of massive, complex data sets.  Rigorous mathematical theories are also being developed to address uncertainty in the modeling and design of complex multi-scale physical and engineering systems, incorporating capabilities to handle noisy data and model uncertainty that are well beyond the scope of current capabilities.  Other work in this thrust focuses on developing the mathematical and computational tools required to generate and better manage the enormous complexity of design, ultimately allowing designers to more easily discover non-intuitive (yet realizable) designs that fully leverage new materials and advanced manufacturing approaches now available.  Outcomes from this thrust will improve the speed and accuracy of modeling and simulation, as well as enable management of complexity across DoD devices, parts and systems. Another focus area of this thrust is multi-physics models for predicting behavior and non-intuitive failure pathways for complex, dynamic physical systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.466"
                                            },
                                            "Text": {
                                                "val": "-  Explored techniques to extract promising designs from a vast multi-dimensional design space.  \n-  Demonstrated novel mathematical and computation tools that integrate geometry with materials, including micro-structure architectures, to accelerate design exploration and optimization subject to a single physics.  \n-  Explored alternative representations to describe design problem formulation.  \n-  Established new fundamental mathematics and computer science building blocks for conceptual design."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.200"
                                            },
                                            "Text": {
                                                "val": "-  Incorporate variability in shaping and material properties under multiple types of physics in analysis and synthesis of real world designs.  \n-  Investigate multi-physics analysis and synthesis capabilities for multiple different design representations.  \n-  Demonstrate efficacy of alternative design approaches on DoD relevant design challenge problems.  \n-  Demonstrate rapidly adaptable conceptual design on a DoD relevant problem.  \n-  Explore use of novel conceptual design mathematics and computer science building blocks for evolutionary design. \n-  Transition novel conceptual design software prototypes to government partners for exploration.  \n-  Develop general approach to automate creation of adaptable virtual models from heterogeneous data.\n-  Initiate development of approaches that can identify and track the evolution of patterns within a dynamical system in order to simplify solutions by dimensional reduction.\n-  Quantify performance of physics-based architectures, algorithms, and approaches in comparison to alternative state-of-the art approaches."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.400"
                                            },
                                            "Text": {
                                                "val": "-  Transition developed technologies and software prototypes to government partners for further exploration. \n-  Incorporate uncertainty into multi-physics analysis and synthesis capabilities. \n-  Develop techniques based on data analysis and machine learning tools to guide design exploration and find promising designs.\n-  Develop multi-physics solvers to cross-compile between different physics (chemical, fluid dynamics, etc.). \n- Demonstrate the potential for exploiting advances in stochastic methods to quantify risk, including the identification of rare events and non-intuitive behaviors and failure pathways."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects expanded research in the development of multi-physics models to predict behavior and non-intuitive failure pathways for complex, dynamic physical systems."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communicating With Computers (CWC)"
                                    },
                                    "Description": {
                                        "val": "The Communicating With Computers (CWC) program is advancing human-computer interaction by enabling computers to comprehend language, gesture, facial expression and other communicative modalities in context.  Since the very beginning of the field, artificial intelligence has sought to create machines that can use language, interact naturally with humans, and form abstractions and concepts.  Human language is inherently ambiguous, so humans depend strongly on perception of the physical world and shared context to communicate efficiently.  CWC will provide computers with analogous capabilities to sense the physical world, encode the physical world in a perceptual structure, and link language to this perceptual encoding.  To accomplish this, CWC will apply and extend research in language, vision, gesture recognition and interpretation, dialog management, cognitive linguistics, and the psychology of visual encoding, which are essential for human communication.  CWC will also extend the communication techniques developed for physical contexts to nonphysical contexts and virtual constructs.  These CWC advances in foundational areas of artificial intelligence will contribute to future military capabilities in robotics and command and control."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed human-machine communication techniques that integrate communicative modalities (gesture and speech) for a problem-solving task in which humans and machines collaborate to explain physical effects such as moving and stacking.\n-  Developed elementary composable information principles such as pointing and locating.\n-  Demonstrated that increased cognitive bandwidth of communication such as integrated gesture and speech enables machines and humans to collaborate more effectively and solve problems more rapidly."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "-  Enhance multi-modal communication techniques to increase robustness and minimize breakdowns in context-aware communication.\n-  Develop capability for communication that produces content that is interesting and engaging.\n-  Integrate performer teams across multiple use cases and demonstrate the capability for one machine or system to seamlessly address multiple use cases."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.565"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.565"
                                            },
                                            "Text": {
                                                "val": "-  Evaluate final technologies against hallmarks of communication that are applicable across multiple program use cases.\n-  Demonstrate a collaborative agent for human-machine communication, extending and leveraging human capacity to plan and execute diverse tasks across multiple domains.\n-  Evaluate technologies across multiple task domains (robotics, knowledge management, content creation) and use cases (blocks, biocuration, and collaborative composition), and transition successful techniques to military and industrial applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects ramping down of development of human-computer interaction technologies and a shift in focus to demonstrations and evaluation of human-machine communication capabilities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Complex Hybrid Systems"
                                    },
                                    "Description": {
                                        "val": "The Complex Hybrid Systems program thrust is focused on exploring fundamental science, mathematics, and computational approaches to collectives, complex hybrid (e.g., human-machine) systems and systems-of-systems across a variety of DoD-relevant domains.  Efforts include development of foundational, quantitative theories and algorithms for the analysis and design of complex systems, as well as novel testing capabilities for assessing the value of these theories using experimental verification across multiple problem domains.  Results from this thrust will better enable the systematic design of complex hybrid systems that can achieve unprecedented resilience and adaptability in unexpected environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated impact of team composition parameters on a specific human-machine application in small unit infantry operations. \n-  Demonstrated use of multi-level grammar knowledge representation to model and optimize collaborative problem solving performance. \n-  Began demonstration of a small infantry unit experimental environment to explore human-machine team configuration and problem solving."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.500"
                                            },
                                            "Text": {
                                                "val": "-  Advance development of design tools for the optimization of collaborative problem solving performance in human-machine systems and systems-of-systems. \n-  Advance development of a small infantry unit experimental environment that can test the impact of variation of human-machine system configuration. \n-  Demonstrate the use of knowledge representation, including a multi-level grammar approach, and design tools to produce quantitative explanations of the structure and problem solving strategy of high performing teams with machine elements.\n-  Identify massive simulation capabilities with potential to enable new modeling of local\/global contexts including retrospectives. \n-  Initiate efforts to enable Artificial Intelligence (AI) systems that handle unknown unknowns gracefully without having to solve the AI Complete problem."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate simultaneous design and integrated exploration of team structure, capabilities, and problem solving strategies in a dynamic experimental environment. \n-  Conduct multiple demonstrations of the use of knowledge representation and design tools to predict team structure and problem solving strategy of high performing teams with machine elements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects consolidated research efforts focused on the development of multi-physics models to predict behavior and non-intuitive failure pathways for complex, dynamic physical systems."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Building Resource Adaptive Software from Specifications (BRASS)"
                                    },
                                    "Description": {
                                        "val": "The Building Resource Adaptive Software from Specifications (BRASS) program is developing an automated framework that permits software systems to seamlessly adapt to changing resource conditions in an evolving operational environment.  Effective adaptation is realized through rigorously defined specifications that capture application resource assumptions and resource guarantees made by the environment.  The current manual adaptation paradigm is based on corrective patching, which is time-consuming, error-prone, and expensive.  Predicting the myriad of possible environment changes that an application may encounter in its lifetime is problematic, and existing reactive approaches are brittle and often incorrect.  The use of specification-based adaptation will allow BRASS applications to be correctly restructured in real time whenever stated assumptions or guarantees are broken.  This restructuring is optimized to trade off execution fidelity and functionality for continued operation.  BRASS will create tools to automatically discover and monitor resource changes, build new analyses to infer deep resource-based specifications, and implement compiler and runtime transformations that can efficiently adapt to resource changes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.450"
                                            },
                                            "Text": {
                                                "val": "-  Investigated applicability of formal methods techniques for verifying correctness of adaptive transformations of extended code bases.\n-  Prototyped initial capabilities for dynamically updating software systems in response to resource changes such as degraded sensors and partial loss of electrical power.\n-  Implemented program synthesis tools that automatically generate new programs in response to underlying resource changes such as method renaming, parameter addition, and change of units).\n-  Designed continuous testing frameworks capable of identifying resource changes and assessing the correctness of generated adaptations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.170"
                                            },
                                            "Text": {
                                                "val": "-  Develop scalable whole-system, resource-aware analysis tools to infer deep resource-based specifications.\n-  Develop optimizing and embeddable compilers to synthesize resource-efficient program variants.\n-  Extend synthesis tools to automatically discover and monitor resource changes for large-scale software systems such as robotics operating systems.\n-  Construct integrated toolchains that automatically adapt software to changing resource conditions, and demonstrate and evaluate the effectiveness of the integrated adaptation technologies on laboratory systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Based on the effectiveness of the adaptation technologies on laboratory and operational use cases, perform final improvements to adaptation modules and systems and transition technologies to open source repositories, industry, and DoD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease is the result of development work concluding, and the focus shifting to finalizing and transitioning the runtime verification and adaptive program transformation techniques."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Guaranteeing AI Robustness against Deception (GARD)"
                                    },
                                    "Description": {
                                        "val": "The Guaranteeing AI Robustness against Deception (GARD) program, expanding on technical challenges encountered in the Lifelong Learning Machines program, will develop techniques to make artificial intelligence (AI) and machine learning (ML) algorithms and systems more robust in the presence of deceptive data and adversarial attack.  Concurrent with the recent explosion of interest in ML, deception attacks that manipulate a ML system into an erroneous response have also emerged.  While such deception attacks against ML have become sophisticated and varied, the development of defensive capabilities for ML systems has not been maintained.  The GARD program will address the growing need for defensive ML capabilities by developing techniques to establish robustness properties of ML systems, and to defend against possible attacks.  The techniques developed under RAIAD will be essential if the DoD is to rely on ML systems in contested environments."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.100"
                                            },
                                            "Text": {
                                                "val": "-  Identify causes of vulnerability and develop metrics for the robustness of ML algorithms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.244"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.244"
                                            },
                                            "Text": {
                                                "val": "-  Develop methodologies to increase the robustness of ML systems to deceptive data and adversarial attacks.\n-  Develop and implement defensive techniques for ML systems.\n-  Implement a testbed for ML risk evaluation through challenge problems, attack simulation, and open competitions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects ramping up of development of robust ML techniques and initial implementation of an ML risk evaluation testbed."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Machine Common Sense (MCS)"
                                    },
                                    "Description": {
                                        "val": "The Machine Common Sense (MCS) program will explore approaches to enable commonsense reasoning by machines.  Recent advances in machine learning have resulted in exciting new artificial intelligence (AI) capabilities in areas such as image recognition, natural language processing, and two-person strategy games such as Chess and Go.  In all of these application domains, the machine reasoning is narrow and highly specialized, and the machine must be carefully trained or programmed for every situation.  General machine commonsense reasoning, on par with human cognition, remains elusive.  MCS will develop computational models that mimic core systems of human cognitive development that are grounded in perceptual, motor, and memory modalities; develop simulated interaction and learning environments to support machine manipulation of grounded concept models; and develop a commonsense knowledge repository to support AI system development.  AI systems that are capable of more human-like reasoning will be able to behave reasonably in unforeseen situations."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.525"
                                            },
                                            "Text": {
                                                "val": "-  Develop initial approaches for modeling the core systems of human cognition for intuitive physics, spatial locations, and intentional agents.\n-  Develop machine learning methods and techniques to extract commonsense knowledge from the web."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.815"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.815"
                                            },
                                            "Text": {
                                                "val": "-  Develop a suite of models of core cognition using a variety of AI approaches, to include deep learning, probabilistic simulation, and symbolic reasoning.\n-  Develop techniques for evaluating AI models of core cognition against known human cognitive development milestones, using the simulation environments to assess the realism of core models.\n-  Initiate development of simulation environments for AI systems to interact, learn, and test their models of core cognition.\n-  Begin testing the extracted common knowledge repositories against a suite of commonsense challenge problems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects ramping up of research and development and initial testing of machine common sense technologies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Learning with Less Labels (LwLL)"
                                    },
                                    "Description": {
                                        "val": "The Learning with Less Labels (LwLL) program, addressing a key issue encountered by the Data-Driven Discovery of Models program (budgeted in PE 0602702E, Project TT-13), will develop technology to greatly reduce the amount of labeled data required to train machine learning (ML) systems.  In supervised ML, the system learns by example to recognize things, such as objects in images or speech.  Humans provide these examples to ML systems during their training in the form of labeled data.  With enough labeled data on which to train ML systems, it is generally possible to build useful models, but training accurate models currently requires large amounts of labeled data that can be costly to obtain.  LwLL will address this problem by creating ML algorithms that learn and adapt more efficiently than current ML approaches, and by formally deriving the limits of machine learning and adaptation.  LwLL-based ML systems will be easier to train and use in variable, unpredictable, real-world environments."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.250"
                                            },
                                            "Text": {
                                                "val": "-  Introduce ML algorithms that require less labeled data to achieve a specified performance level including hybrid supervised-unsupervised ML approaches that can be trained using both labeled and unlabeled data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.500"
                                            },
                                            "Text": {
                                                "val": "-  Formulate ML algorithms that are robust to distributional mismatch between the data on which the system is trained and the data on which the system operates post training.\n-  Develop estimates for the rate at which an ML system will converge with increased training in terms of the hyperparameters of the system.\n-  Construct challenge problems and associated labeled and unlabeled data sets, and demonstrate increased learning rates and distributional robustness of the new ML algorithms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects ramping up of research and development of ML techniques that require less labeled data for effective training."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Safe Documents (SafeDocs)"
                                    },
                                    "Description": {
                                        "val": "The Safe Documents (SafeDocs) program, expanding on foundational issues encountered by the Building Resource Adaptive Software from Specifications program, will develop software technologies that reduce syntactic complexity of data formats and improve the capability to reject invalid and maliciously crafted data in electronic documents and streaming data.  The high complexity of electronic documents and streaming data greatly increases the computational attack surface.  The SafeDocs program will focus on simplifying existing data formats and advancing the state of the art in the security of document and data format parsers.  Simplification is essential to enabling automated code verification and assuring that the conditions of data validity are enforced.  SafeDocs technology will enable secure documents and streaming data."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop techniques to identify, extract, and prioritize the critical elements of existing electronic documents and streaming data formats that are essential for reduced-complexity format variants."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "-  Explore formal development approaches for reduced-complexity format variants for electronic documents\/data and the associated processing software.\n-  Design reduced-complexity format variants and parsers for electronic documents and streaming data.\n-  Initiate construction of verified functionally correct, efficient parsers for syntactically complex formats currently in use."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects expanded efforts to develop reduced-complexity formats for electronic documents and streaming data and verified functionally correct, efficient parsers."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Foundational Artificial Intelligence (AI) Science"
                                    },
                                    "Description": {
                                        "val": "The Foundational Artificial Intelligence (AI) Science thrust will develop a fundamental scientific basis for understanding and quantifying performance expectations and limits of AI technologies.  Current AI technologies are challenged in handling uncertainty and incompleteness of training protocols and data.  This has prevented the successful integration of AI technology into many transformative DoD applications.  To address these limitations the Foundational AI science thrust will focus on the development of new learning architectures that enhance AI systems' ability to handle uncertainty, reduce vulnerabilities, and improve robustness for DoD AI systems.  One focus area of this thrust is the ability to embed known physics, mathematics, and other prior knowledge to improve performance of AI systems, particularly for problem sets involving incomplete, sparse and noisy data.  Another focus area is the development of a model framework for quantifying performance expectations and limits of AI systems.  A third focus area is the development of new tools and methodologies that enable AI approaches for accelerated molecular discovery.  The technology advances achieved under the Foundational AI Science thrust will ultimately remove technical barriers to exploiting AI technologies for scientific discovery, human-AI collaboration, and other DoD relevant applications."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.500"
                                            },
                                            "Text": {
                                                "val": "-  Initiate efforts to identify and develop AI architectures that make optimal use of both observational and experimental data, simulated data, and prior knowledge.   \n-  Design initial physics-based machine learning architectures, algorithms, and approaches.  \n-  Test and evaluate initial physics-based machine learning architectures, algorithms, and approaches.\n-  Demonstrate novel AI architectures that exploit advances in Transfer Learning, One-shot Learning and Human-Aware AI.   \n-  Demonstrate the ability to quantify AI performance\/robustness tradeoffs in DoD-relevant application domains.   \n-  Begin development of hardware and control software for autonomous experimental chemistry systems.   \n-  Explore automated approaches for extracting data from lab notebooks and instrumentation, refining representations, and demonstrating semi-autonomous experimentation informed by models.\n-  Test systems on real-world problems in one or more relevant DoD domains where the behaviors are not known in advance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human-Machine Symbiosis (HMS)"
                                    },
                                    "Description": {
                                        "val": "The Human-Machine Symbiosis (HMS) program will conduct basic research to enable machines to collaborate with humans as colleagues, partners, and teammates.  The world is moving faster than humans can assimilate, understand, and act.  At present, we design machines to handle well-defined, high-volume or high-speed tasks, freeing humans to focus on complexity.  If successful, HMS will bring forth technologies that enable machines to do more than execute pre-programmed instructions.  Rather, HMS-enabled machines will: 1) understand speech; 2) extract information contained in diverse media; 3) learn, reason and apply knowledge gained through experience; 4) identify and work to fill knowledge gaps; 5) extrapolate causal phenomena to anticipate predictable outcomes; and 6) respond intelligently to new and unforeseen events.  A companion Applied Research effort is funded in PE 0602303E, Project IT-04."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Investigate and derive performance predictions for computational agents capable of advising and guiding humans in the performance of physical tasks.  \n-  Develop computational simulations of knowledge-seeking behavior and combine these with human-machine dialog techniques that can automatically generate efficacious questions for human experts. \n-  Evaluate alternative goal reasoning techniques to serve as the basis for curious machines that identify and fill knowledge gaps."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Alternative Computing"
                                    },
                                    "Description": {
                                        "val": "The Alternative Computing thrust will explore and develop new computational primitives for modeling and simulating complex systems.  Despite decades of rapid advancement in electronic computing, there remain important national security relevant challenge problems that do not lend themselves to achieving tractable solutions under size, weight, and power (SWaP) constrained conditions.  For example, simulation of complex nonlinear phenomena such as turbulence, fluid flow and plasma dynamics can be challenging even using currently available high power computing resources.  Building on technologies developed under the Advanced Tools for Modeling and Simulation thrust, also in this PE\/Project, the goal of the Alternative Computing thrust is to develop novel architectural and algorithmic approaches to enable fast and accurate simulations for problems that are practically intractable using electronic computers.  Approaches considered under this thrust include the following: (1) analog computing substrates for efficiently simulating systems governed by complex non-linear phenomena; (2) multi-functional spin-based devices for scalable, efficient neuromorphic computing; (3) computing approaches that exploit the capacity of nonlinear systems to simulate nonlinear dynamical systems; and (4) quantum enabled simulations of complex phenomena in physics, chemistry and materials."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.800"
                                            },
                                            "Text": {
                                                "val": "-  Initiate efforts to determine near term applications for quantum computing in simulating complex phenomena in physics, chemistry and materials.  \n-  Investigate potential for spin-based devices to enable scalable, efficient implementation of neuromorphic computing.\n-  Demonstrate the ability to quantify fundamental limitations of performance and scalability of quantum simulation due to factors such as decoherence, degeneracy, environmental interactions, and others.   \n-  Demonstrate proof of concept for novel analog computing substrates that outperform electronic computing in the simulation of complex non-linear phenomena.  \n-  Identify national security relevant challenge problems for quantifying speed and power efficiency advantages of analog computing substrates over electronic computing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Applied Mathematics"
                                    },
                                    "Description": {
                                        "val": "The Applied Mathematics thrust will create the basic mathematics needed to support complex, multi-physics analysis ranging from uncertainty quantification to integrated, multi-system design.  Focus areas of this thrust include application of geometry to challenge problems in optimization science and frameworks and advanced tools for propagating and managing uncertainty in the modeling and design of complex physical and engineering systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.489"
                                            },
                                            "Text": {
                                                "val": "-  Developed risk-averse stochastic optimization methods to address a complex multi-physics challenge problem. \n-  Implemented the scalable uncertainty quantification (UQ) methods as well as the model error estimates in the optimization framework. \n-  Demonstrated the efficacy of UQ methodologies in a final stochastic design problem.  \n-  Identified complex, high dimensional, nonlinear, hybrid, stochastic application areas to solve the related optimization problems.  \n-  Developed novel tools and algorithms to solve high dimensional non-linear complex optimization problems that cannot be optimized with current methods due to intractability or lack of scalability.  \n-  Demonstrated the applicability of novel optimization approaches beyond domain-specific application areas."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.276"
                                            },
                                            "Text": {
                                                "val": "-  Advance the developed optimization tools to handle substantial complexity and make working progress towards a fully nonlinear, non-convex problem.  \n-  Demonstrate full theoretical and computational development of optimization methodologies with implementation on the real scope\/scale application problem.  \n-  Initiate work on development of codes and software for the tested optimization algorithms.\n-  Identify promising analog computing substrates for efficient simulation of complex non-linear phenomena."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lifelong Learning Machines (L2M)"
                                    },
                                    "Description": {
                                        "val": "The Lifelong Learning Machines (L2M) program will research and develop fundamentally new machine learning mechanisms, enabling machines that learn continuously as they operate.  Current learning machines are fully configured in advance of deployment, meaning that they have difficulty accounting for in-the-field mission changes or for unexpected deviations in the data being processed.  To overcome this limitation, L2M will pursue learning approaches inspired by biological systems, which continuously learn and improve their skills without losing previous knowledge.  Areas of research will include network structures that improve performance by processing new data seen in the field, learn new tasks without forgetting previous tasks, and incorporate context into their understanding of the environment.  These capabilities would impact a broad array of military applications that require processing and understanding data in real-time, often have limited data sets for training, and must be deployed in environments where unpredictable events may occur.  The L2M program moves to Project ES-02, Beyond Scaling Sciences, in FY 2019."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.000"
                                            },
                                            "Text": {
                                                "val": "-  Identified and defined lifelong learning component approaches.\n-  Developed preliminary description of applications integrating L2M software components.\n-  Performed first evaluation of lifelong learning software components showing capability to retain previous learning while learning new tasks."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mining and Understanding Software Enclaves (MUSE)"
                                    },
                                    "Description": {
                                        "val": "The Mining and Understanding Software Enclaves (MUSE) program developed program analyses and frameworks for improving the resilience and reliability of complex software applications at scale.  MUSE applied machine learning algorithms to large software corpora to repair defects and vulnerabilities in existing software, and to create new software programs that conform to desired behaviors and specifications.  Specific technical challenges included generation and analysis of persistent semantic artifacts, identification and repair of defects, and inference and synthesis of specifications.  MUSE research improves the security of intelligence-related applications and enhances computational capabilities in areas such as automated code maintenance and revision management, low-level systems implementation, graph processing, entity extraction, link analysis, high-dimensional data analysis, data\/event correlation, and visualization."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed statistical database technologies for scalable feature exploration and mining of the software corpus.\n-  Applied machine learning concepts to predict, repair, and synthesize program properties and structures from purely empirical observations.\n-  Explored and integrated static and dynamic program analyses to discover software anomalies and automatically synthesize program repairs.\n-  Applied natural language processing techniques to discover semantic properties of code from multiple information sources.\n-  Deployed an open-source public portal that provides access to MUSE tools and artifacts for the wider software development community."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Big Mechanism"
                                    },
                                    "Description": {
                                        "val": "The Big Mechanism program created new approaches to automate computational intelligence applicable to diverse domains such as biology, cyber, economics, social science, and intelligence.  Mastering these domains requires the capability to create abstract, causal models from massive volumes of diverse data.  Current modeling approaches are heavily reliant on human insight and expertise, but the complexity of these models will soon exceed the capacity for human comprehension.  Big Mechanism created technologies to: extract and normalize information for incorporation in flexible knowledge bases; build reasoning engines that can infer general rules from a collection of observations; and develop knowledge synthesis techniques to create models of extreme complexity consistent with huge volumes of data.  Big Mechanism applications accommodate an operator-in-the-loop to clarify ambiguities and reconcile detected inconsistencies.  The program focused on cancer modeling due to the availability of experimental data.  The complexity of this problem is representative of challenges facing the DoD in areas such as cyber attribution and open-source intelligence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.353"
                                            },
                                            "Text": {
                                                "val": "-  Extended information extraction techniques to additional problem domains."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Knowledge Representation"
                                    },
                                    "Description": {
                                        "val": "The Knowledge Representation thrust developed much-needed tools to contextualize and analyze heterogeneous scientific data, facilitating field-wide hypothesis generation and testing.  This was accomplished by focusing on two key efforts: (1) the development of domain-agnostic mathematical tools for representing heterogeneous data and (2) the development of domain knowledge in a unified knowledge framework and domain-specific computational tools to embed observable data within the framework and enable tangible discoveries through computational analysis.  To demonstrate the applicability of Knowledge Representation technology to multiple complex systems, the thrust included validation across multiple disparate scientific and engineering fields.  The technology developed under this thrust will revolutionize the process of scientific discovery by efficiently maximizing the potential of large, heterogeneous, multi-scale datasets across numerous complex scientific fields."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated knowledge representation and extraction frameworks on multiple DoD relevant data sets."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CYS-01"
                    },
                    "ProjectTitle": {
                        "val": "CYBER SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "44.094"
                        },
                        "CurrentYear": {
                            "val": "12.801"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Cyber Sciences project supports long-term national security requirements through scientific research and experimentation in cyber security.  Information technologies enable important new military capabilities and drive the productivity gains essential to U.S. economic competitiveness.  Meanwhile, cyber threats grow in sophistication and number, and put sensitive data, classified computer programs, mission-critical information systems, and future economic gains at risk.  The basic research conducted under the Cyber Sciences project will produce breakthroughs necessary to enhance the resilience of DoD information systems to current and emerging cyber threats."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Transparent Computing"
                                    },
                                    "Description": {
                                        "val": "The Transparent Computing program is developing technologies to enable the implementation of more effective security policies across distributed systems.  The scale and complexity of modern information systems obscure linkages between security-related events, making it hard to discover attacks such as advanced persistent threats (APTs).  The Transparent Computing program will create the capability to propagate security-relevant information, track complete knowledge of event provenance, and ensure component interactions are consistent with established behavior profiles and policies.  Transparent Computing technologies are particularly important for large integrated systems with diverse components such as distributed surveillance systems, autonomous systems, and enterprise information systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.630"
                                            },
                                            "Text": {
                                                "val": "-  Incorporated technologies in a comprehensive architectural framework to extend new capabilities across various software layers and systems, with coordination among the different tag-and-track mechanisms.\n-  Implemented detection and enforcement at a network element and demonstrated the collection and analysis of causally linked events\/activities in near real-time to infer the nature of an attack using realistic APT behavior.\n-  Conducted an evaluation against a sophisticated, multi-platform APT that uses different lateral movement techniques."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.201"
                                            },
                                            "Text": {
                                                "val": "-  Provide a user interface with tracking and visualization of tagged traffic on the network.\n-  Implement policy enforcement and enterprise architecture protection capabilities.\n-  Demonstrate techniques to filter tag streams and information for relevance without sacrificing precision and accuracy.\n-  Improve scalability of provenance graph construction, and test and evaluate performance and effectiveness."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space\/Time Analysis for Cybersecurity (STAC)"
                                    },
                                    "Description": {
                                        "val": "The Space\/Time Analysis for Cybersecurity (STAC) program is developing techniques to detect algorithmic complexity vulnerabilities and side channel attacks in software.  Historically, adversaries have exploited software implementation flaws through buffer and heap overflow attacks.  Advances in operating systems have largely mitigated such attacks, so cyber adversaries are now finding new ways of compromising software.  Algorithmic complexity and side channel attacks are emerging as a new generation of attacks since they depend on intrinsic properties of software algorithms rather than implementation flaws.  The STAC program seeks to develop analysis tools and techniques to detect vulnerabilities to these new attacks in the software on which the U.S. government, military, and economy depend."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.504"
                                            },
                                            "Text": {
                                                "val": "-  Identified the most promising analysis tools for finding vulnerabilities to algorithmic complexity and side channel attacks in a corpus of test programs, and integrated them into a best-of-breed prototype.\n-  Engaged in experiments of prototype tools with transition partners and, based on user feedback, improve prototypes to enhance usability in the context of DoD operational needs.\n-  Implemented a unified toolset with latest versions of tools from engagements to allow analysis of complete program modules."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.600"
                                            },
                                            "Text": {
                                                "val": "-  Update analysis toolset with latest versions of tools from engagements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SafeWare"
                                    },
                                    "Description": {
                                        "val": "The SafeWare program developed new code obfuscation techniques for protecting software from reverse engineering.  At present, adversaries can extract sensitive information from stolen software, which could include cryptographic private keys, special inputs\/failsafe modes, and proprietary algorithms.  Today's state-of-the-art in software obfuscation adds junk code (loops that do nothing, renaming of variables, redundant conditions, etc.) that is not resilient against automated tools.  Recent breakthroughs in theoretical cryptography have the potential to make software obfuscation into a mathematically rigorous science, very much like what the Rivest-Shamir-Adleman (RSA) algorithm did for the encryption of messages in the 1970s.  In its present form, cryptographic obfuscation incurs too much runtime overhead to be practical.  The SafeWare program took this very early-stage obfuscation theory and increased its practicality and efficiency."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.960"
                                            },
                                            "Text": {
                                                "val": ".- Developed demonstrations of obfuscation protocols with provable security properties and quantifiable security levels for complex processes supporting pattern recognition in text and images for virus scanning and target classification.\n-  Created modular approaches that restrict obfuscation to the most sensitive parts of computational or algorithmic processes based on human analysis.\n-  Reformulated classic cryptographic protocols using obfuscation as a basic resource for computational security and created proofs guaranteeing computational security."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ES-01"
                    },
                    "ProjectTitle": {
                        "val": "ELECTRONIC SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "69.001"
                        },
                        "CurrentYear": {
                            "val": "41.032"
                        },
                        "BudgetYearOne": {
                            "val": "43.333"
                        },
                        "BudgetYearOneBase": {
                            "val": "43.333"
                        },
                        "BudgetYearTwo": {
                            "val": "35.083"
                        },
                        "BudgetYearThree": {
                            "val": "36.883"
                        },
                        "BudgetYearFour": {
                            "val": "34.883"
                        },
                        "BudgetYearFive": {
                            "val": "34.883"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Electronic Sciences project is for basic exploration of electronic and optoelectronic devices, circuits, and processing concepts to meet the military's need for near real-time information gathering, transmission, and processing.  In seeking to continue the phenomenal progress in microelectronics innovation that has characterized the last few decades, the project should provide DoD with new, improved, or potentially revolutionary device options for accomplishing these critical functions.  The resulting technologies should help maintain knowledge of the enemy, communicate decisions based on that knowledge, and substantially improve the cost and performance of military systems.  Research areas include analog, mixed signal, and photonic circuitry for communications and other applications; alternative computer architectures; and magnetic components to reduce the size of Electromagnetic (EM) and sensing systems.  Other research could support field-portable electronics with reduced power requirements, ultra-high density information storage \"on-a-chip\", and new approaches to nanometer-scale structures, molecules, and devices.\n\nWithin this project, Beyond Scaling programs will support investigations into materials, devices, and architectures to provide continued improvements in electronics performance with or without the benefit of Moore's Law (silicon scaling).  Within the next ten years, traditional scaling will start to encounter the fundamental physical limits of silicon, requiring fresh approaches to new electronic systems.  Over the short term, DoD will therefore need to unleash circuit specialization in order to maximize the benefit of traditional silicon.  Over the longer term, DoD and the nation will need to engage the computer, material, and mechanical sciences to explore electronics improvements through vertical circuit integration for improved computation or non-volatile memory devices that combine computation and memory.  Other memory devices could also leverage an emerging understanding of the physics of magnetic states, electron spin properties, topological insulators, or phase-changing materials. Beyond Scaling programs will address fundamental exploration into each of these areas. The Beyond Scaling programs move to Project ES-02, Beyond Scaling Sciences, in FY 2019."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Magnetic Miniaturized and Monolithically Integrated Components (M3IC)"
                                    },
                                    "Description": {
                                        "val": "The Magnetic Miniaturized and Monolithically Integrated Components (M3IC) program aims to integrate magnetic components onto semiconductor materials, improving the size and functionality of electromagnetic (EM) systems for communications, radar, and electronic warfare (EW).  Current EM systems use magnetic components such as circulators, inductors, and isolators that are bulky and cannot be integrated with electronic circuitry.  This limits the utility of the magnetic components as well as their ability to impact overall system performance and function.  Reducing the Size, Weight, And Power (SWaP) of magnetic components and integrating them onto semiconductor chips, however, could enable broader exploitation of magnetic materials and provide new mechanisms for the control and manipulation of EM signals.  For instance, tighter integration could yield smaller radar systems, higher bandwidth communication over longer ranges, improved jam resistance, and more resilient EW systems.  The M3IC program is divided into three technical areas: integration of magnetic materials and systems with semiconductor technology; accurate and efficient modeling of magnetic phenomena from the molecular to the component system level; and exploitation of magnetic phenomena in innovative component designs relevant to DoD EM systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.500"
                                            },
                                            "Text": {
                                                "val": "-  Characterized properties of magnetic films deposited on semiconductor substrates using novel deposition approaches and with new magnetic material systems.\n-  Designed and fabricated prototype integrated magnetic components of circulators and isolators.\n-  Demonstrated prototype modeling codes with improved accuracy and efficiency.\n-  Demonstrated preliminary non-linear magnetic components (circulators and frequency selective limiters) through design, simulation, and initial fabrication."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.800"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate deposition of high-quality thick magnetic films on semiconductor-compatible patterning process.\n-  Demonstrate prototype codes with improved accuracy and efficiency and integration pathway to industry standard radio frequency (RF) circuit design tools.\n-  Demonstrate integrated or miniaturized non-linear magnetic components leveraging the developed high quality films and novel integration approaches."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.083"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.083"
                                            },
                                            "Text": {
                                                "val": "-  Deliver optimized micro-magnetic codes coupled with industry-standard RF circuit design tools.\n-  Demonstrate integrated or miniaturized components such as circulators and frequency selective limiters incorporating new materials or integration methods, and optimized with design tools developed under the program."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects conclusion of the development effort and a shift in focus on final demonstrations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "A MEchanically Based Antenna (AMEBA)"
                                    },
                                    "Description": {
                                        "val": "The A MEchanically Based Antenna (AMEBA) program seeks to develop efficient radio frequency (RF) transmitters operating in the Ultra-Low Frequency (ULF) and Very Low Frequency (VLF) ranges, for portable applications in underground and underwater communications.  For classical antennas, the minimum antenna size for efficient transmission is related to the wavelength of the RF signal.  This fundamental property prevents reducing the size of today's ULF and VLF transmitting antennas, which are up to a mile wide.  Whereas traditional antennas generate electromagnetic waves by driving current through a conductive material, AMEBA takes a novel approach, mechanically moving an electrical charge or magnet to generate electromagnetic waves at ULF and VLF.  This mechanical coupling provides unique advantages over traditional approaches at these frequencies, most notably greater than 1,000x reduction in antenna size.  AMEBA will focus on developing both the materials and precision-controlled electromechanical systems required for an efficient transmitter system.  This new capability would enable a range of applications including hard-to-jam wireless communications for use over very long distances and short-range underground and underwater RF links.  Other potential applications include terrestrial navigation systems for GPS-denied environments and ground-penetrating radar for detecting unexploded ordnance, underground facilities, and tunnels."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed physics-based models of the electromagnetic field generation and propagation at targeted distances.\n-  Developed ferrofluids with improved magnetization and particle conglomeration properties.\n-  Designed and developed electromechanical systems and architectures to realize large scale, high-precision mechanical actuation of magnets and electrically polarized materials.\n-  Demonstrated data transmission via a mechanically driven antenna."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Continue to improve the performance of electric and magnetic materials employed in the program.\n-  Progressively scale mechanical systems to a larger number of elements, synchronously actuated and modulated at RF frequencies.\n-  Demonstrate small, low frequency transmitters capable of text messaging from 10 m underwater or 30 m underground."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.900"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.900"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate and deliver scaled ULF transmitters capable of text messaging from 100 m underwater and 600 m underground.\n-  Demonstrate and deliver scaled VLF transmitters capable of communicating voice at 100 km terrestrial distances."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SHort Range Independent Microrobotics Program (SHRIMP)"
                                    },
                                    "Description": {
                                        "val": "The SHort Range Independent Microrobotics Program (SHRIMP) will develop microrobots with the ability to enter constrained disaster areas such as collapsed buildings for search and rescue operations.  These sugar cubed-sized microrobots could obtain local sensing data to assist with location of injured persons or critical infrastructure failures.  The capabilities of the developed microrobots will be tested through a series of Olympic-themed events at the end of the program.  The primary technical developments needed are in the efficiency, robustness, and control of millimeter-scale actuators, which allow the robots to move using new materials, processing, and sensor integration techniques, and in the power and energy capacity of batteries, which provide the power required for the microrobot to move and sense stimuli.  Complete platforms will require access controls for Controlled Unclassified Information (CUI).  Successful execution of the SHRIMP program will advance the micro-robotics field, allowing for practical robots to assist in disaster relief efforts in environments for which traditional robotics cannot efficiently operate due to their larger size.  A companion applied research effort is funded in PE 0602716E, Project ELT-01."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.132"
                                            },
                                            "Text": {
                                                "val": "-  Initiate development of high force, high efficiency actuator materials for microrobotic platforms.\n-  Initiate development of integrated multi-mode power solutions for microrobotic platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.350"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.350"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate actuator materials meeting program defined metrics for size, weight, and actuation force.\n-  Demonstrate integrated power systems and batteries meeting program defined metrics for size, weight, volume, and power related performance.\n-  Initiate development of high work density, actuator mechanisms for microrobotic platforms.\n-  Initiate development of improved integrated multi-mode power solutions with emphasis on smaller size and performance across varied temperatures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects the program shifting from initial development to demonstration of actuator materials, integrated power systems, and batteries."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Atomic-Photonic Integration (A-PhI)"
                                    },
                                    "Description": {
                                        "val": "The Atomic-Photonic Integration (A-PhI) program, building on technology developed in the Direct On-Chip Digital Optical Synthesis (DODOS) program, aims to reduce the complexity of atomic clocks and gyroscopes by using integrated photonics for Position, Navigation, and Timing (PNT) applications.  A-PhI will demonstrate that a compact photonic integrated chip can replace the optical assembly for trapped atomic gyroscopes and clocks without degrading the performance of the device.  PNT is a critical resource for all DoD missions such as communications, navigation, reconnaissance, and electronic warfare.  While PNT needs are usually met by using the Global Positioning System, GPS signals are vulnerable to a variety of disruption modalities and a fallback from GPS is essential.  Currently, in the absence of GPS, tactical grade clocks and tactical\/navigation grade Inertial Measurement Units can provide GPS-like accuracy for the short term.  However, longer-term GPS independent strategies are still desirable. A-PhI will enable long-term GPS independence and enable PNT accuracy better than GPS for short durations."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop preliminary architectures for trapped atom gyroscopes.\n-  Design low phase noise oscillators compatible with the A-PhI performance metrics.\n-  Design, fabricate and characterize preliminary components of a photonic integrated chip for the trapped atom clock."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform a laboratory demonstration of a trapped atom gyroscope.  \n-  Demonstrate and characterize performance of a low phase noise oscillator.\n-  Demonstrate a photonic integrated chip capable of atom trapping and cooling compatible with proposed clock architecture."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects a shift from preliminary design to fabrication and technology demonstration."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High power Amplifier using Vacuum electronics for Overmatch Capability (HAVOC)"
                                    },
                                    "Description": {
                                        "val": "The High power Amplifier using Vacuum electronics for Overmatch Capability (HAVOC) program seeks to develop compact Radio Frequency (RF) signal amplifiers for air, ground, and ship-based communications, sensing, and radar systems.  HAVOC amplifiers would enable these systems to access the high-frequency millimeter-wave portion of the Electromagnetic (EM) spectrum, facilitating increased range and other performance improvements.  Today, the effectiveness of combat operations across all domains increasingly depends on DoD's ability to control and exploit the EM spectrum and to deny its use to adversaries.  However, the proliferation of inexpensive commercial RF sources has made the EM spectrum crowded and contested, challenging our spectrum dominance.  Operating at higher frequencies, such as the millimeter-wave, helps DoD to overcome these issues and offers numerous tactical advantages such as high data-rate communications and high resolution and sensitivity for radar and sensors.  HAVOC will fund basic research in vacuum electronics to improve understanding of the various phenomena governing vacuum electronic amplifiers operating at mm-wave frequencies above 75 GHz.  Focus areas will include modeling and simulation techniques, advanced manufacturing methods, novel beam-wave interaction structures, high current density and long-life cathodes, and other relevant topics.  Applied research efforts are funded in PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Verified and validated the performance of high-fidelity, three-dimensional, multi-physics, numerically efficient modeling and simulation techniques on structures representative of advanced vacuum electronic amplifiers.\n-  Fabricated and tested wideband and high-power beam-wave interaction structures, and high current-density cathodes meeting Phase 2 metrics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate high-current-density and long life cathodes based on understanding gained from processing and material structure investigations.\n-  Demonstrate wideband and high power beam-wave interaction structures meeting Phase 3 metrics.\n-  Demonstrate high current-density cathodes meeting Phase 3 metrics."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects completion of the basic research effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precise Robust Inertial Guidance for Munitions (PRIGM)"
                                    },
                                    "Description": {
                                        "val": "The Precise Robust Inertial Guidance for Munitions (PRIGM) program aims to identify, investigate, and demonstrate inertial sensor technologies for Positioning, Navigation, and Timing (PNT) in GPS-denied environments.  When GPS is not available, these inertial sensors can provide autonomous PNT information.  The program will exploit recent advances in integrating photonic (light-manipulating) components into electronics and in employing Microelectromechanical Systems (MEMS) as high-performance inertial sensors for use in extreme environments.  Whereas conventional MEMS inertial sensors can suffer from inaccuracies due to factors such as temperature sensitivity, new photonics-based PNT techniques have demonstrated the ability to mitigate these inaccuracies.  PRIGM will focus on two areas.  By 2020, it aims to develop and transition a Navigation-Grade Inertial Measurement Unit (NGIMU), a state-of-the-art MEMS device, to DoD platforms.  By 2030, it aims to develop Advanced Inertial MEMS Sensors (AIMS) that can provide gun-hard, high-bandwidth, high dynamic range navigation for GPS-free munitions.  These advances should enable navigation applications, such as smart munitions, that require low-cost, size, weight, and power inertial sensors with high bandwidth, precision, and shock tolerance.  PRIGM will advance state-of-the-art MEMS gyros from TRL-3 devices to a TRL-6 transition platform, eventually enabling the Service Labs to perform TRL-7 field demonstrations.  Applied research efforts are funded in PE 0602716E, Project ELT-01, and advanced technology development for the program is budgeted in PE 0603739E, Project MT-15."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "-  Integrated component technology and evaluated photonic-MEMS inertial sensors for beyond-navigation-grade stability and precision.\n-  Tested navigation-grade inertial sensor performance robustness to external perturbations such as vibration and shock."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.400"
                                            },
                                            "Text": {
                                                "val": "-  Package all component technology, evaluate the performance of new materials and integration techniques across ultra-high shock loads, and measure long-term inertial sensor bias stability.\n-  Demonstrate inertial sensor survival and operation through laboratory-representative launch events."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects completion of the basic research effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Signal Processing at RF (SPAR)"
                                    },
                                    "Description": {
                                        "val": "The Signal Processing at RF (SPAR) program will investigate advanced analog components to process radio frequency (RF) signals for communications, radar, and electronic warfare applications.  Today, electronic components are limited in their ability to distinguish between two or more signals operating at the same frequency when one signal is strong enough to jam the others.  The jamming signal, in this case, saturates the receiver electronics much like loud music drowns out a quiet conversation.  By using advancements in new semiconductor materials, processing, and novel signal interaction mechanisms, SPAR components will be able to pick out friendly RF signals from both intentional and unintentional jamming signals, even when those signals sit on top of one another in frequency.  This capability would enable a range of new applications including communications in contested battlefield RF environments, jamming the RF spectrum while maintaining communication, and full-duplex radio communication.  Other potential applications include equipping mobile radios with SPAR-enabled front ends for simultaneous jam-resistant two-way communication and electronic warfare."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.001"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated SPAR RF signal processing components meeting Phase 1 performance.\n-  Designed Phase 2 RF signal processing components with commercial communications grade performance capable of rejecting uncooperative in-band jamming by 30x and cooperative self-interference by 100,000x."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.700"
                                            },
                                            "Text": {
                                                "val": "-  Design Phase 3 RF signal processing components with DoD communications grade performance capable of rejecting uncooperative in-band jamming by 100x and cooperative self-interference by 1,000,000x.\n-  Fabricate and integrate the components developed during Phase 2 into a system-level design that extends Simultaneous Transmit and Receive (STAR) capability to Commercial, Off The Shelf (COTS) transceiver technology.\n-  Perform field measurements on developed STAR system to demonstrate simultaneous bidirectional voice communications over 1 km capable of rejecting uncooperative in-band jamming by 30x and cooperative self-interference by 10,000x while maintaining communications integrity."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Direct On-Chip Digital Optical Synthesis (DODOS)"
                                    },
                                    "Description": {
                                        "val": "The Direct On-chip Digital Optical Synthesis (DODOS) program investigated high-performance photonic components for a compact, robust, and highly-accurate optical frequency synthesizer suited to various mission-critical DoD applications.  Frequency synthesis and accurate control of radiofrequency and microwave radiation is the enabling technology for radar, satellite and terrestrial communications, positioning and navigation technology, and many other core DoD capabilities.  Frequency synthesis and control of light or optical waves, however, has been constrained to laboratory experiments due to the size, fragility, and cost of optical frequency synthesizers.  DODOS leveraged recent developments in the field of integrated photonics to enable the development of ubiquitous, low-cost optical frequency synthesizers.  The program led to disruptive DoD capabilities, including high-bandwidth optical communications, higher performance Light Detection And Ranging (LiDAR), portable high-accuracy atomic clocks, and high-resolution detection of chemical\/biological threats at a distance.  Applied research for this program is funded within PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed and implemented techniques to improve the laser frequency tuning speed and tuning accuracy using co-integrated electronic and photonic components.\n-  Designed components and developed processes for fabrication of high efficiency integrated frequency doublers to reduce the power consumption of the DODOS frequency synthesizer."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint University Microelectronics Program (JUMP)"
                                    },
                                    "Description": {
                                        "val": "The Joint University Microelectronics Program (JUMP) is a government-industry joint research program to explore computing, sensing, communication, and data storage innovations for applications beyond the 2030 horizon.  The program recognizes that the densely interconnected microsystems of the future will be built through the use of groundbreaking materials, revolutionary devices, advanced architectures, and unconventional computing.  JUMP will therefore sponsor academic research teams focused on related key technology areas that will impact future DoD capabilities and national security.  The JUMP program will not only push fundamental technology research but also establish long-range microelectronic research themes with greater emphasis on end-application and systems-level computation.  By discovering the science underlying new technologies and overcoming engineering challenges, JUMP will enable DoD applications to exploit the entire electromagnetic spectrum from radio frequency (RF) to terahertz (THz) and to employ both distributed and centralized computing with embedded intelligence and memory.  The JUMP program moves to Project ES-02, Beyond Scaling Sciences, in FY 2019."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Launched six university research teams to study technical areas with long-term impacts to government and industry.\n-  Identified emerging materials, power efficient RF, THz, digital, and storage devices as well as circuits for future microsystems.\n-  Investigated distributed and centralized computing architectures and subsystems for efficient information extraction, processing, and autonomous control applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Beyond Scaling - Materials"
                                    },
                                    "Description": {
                                        "val": "The Beyond Scaling - Materials program will investigate new materials to support next-generation logic and memory components.  Historically, the DoD provided leadership in shaping the electronics field through research in semiconductor materials, circuits, and processors.  However, as DoD focuses on military-specific components and commercial investments eschew the semiconductor space, U.S. fundamental electronics research is stagnant just as an inflection point in Moore's Law (silicon scaling) is about to occur.  The Beyond Scaling - Materials program will pursue potential enhancements in electronics that do not rely on Moore's Law, including research not only into new materials but also into the implications of those materials at the device, algorithm, and packaging levels.  These basic explorations include: novel mechanisms for computation based on inherent material properties, unique architectures leveraging new components, and new methods to accelerate the identification and utilization of emerging materials.  The Beyond Scaling - Materials program moves to ES-02, Beyond Scaling Sciences, in FY 2019.  Applied research for this program is funded within PE 0602716E, Project ELT-02."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "-  Performed material combination depositions and tests to determine the optimal configuration for a unique multi-state non-volatile memory. \n-  Designed and simulated a novel memristor-based neural network and demonstrated higher energy efficiency and throughput against a state of the art image classification algorithm. \n-  Validated a model of voltage-controlled magnetic tunnel junction memory compatible with commercial design tools and demonstrated lower write energy than state of the art devices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Beyond Scaling - Architectures and Designs"
                                    },
                                    "Description": {
                                        "val": "The Beyond Scaling - Architectures and Design program will investigate the design of application-specific circuit architectures that ensure continued improvements in electronics performance with or without the benefit of continued scaling in silicon transistors (Moore's Law).  Currently, improvements in electronics largely depend on a regular reduction in the size of silicon components.  As Moore's Law slows and the nation loses the benefit of free, exponential improvements in electronics performance, DoD will need to maximize the benefits of available silicon technologies through circuit specialization.  This program will investigate the potential for lowering the barriers to designing specialized circuits.  Approaches include the use of machine learning and automated design tools to program specialized hardware blocks, integrate them into existing designs, and deploy them in complex systems.  Further research would also develop tools to create exact representations of physical hardware.  Advances under this program will support a new DoD capability to create specialized hardware and provide benefits by improving electronics systems that do not depend on continued rapid improvements in silicon transistors.  The Beyond Scaling - Architectures and Design program moves to ES-02, Beyond Scaling Sciences, in FY 2019.  Applied research for this program is funded within PE 0602716E, Project ELT-02."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed an initial reconfigurable design approach and supporting architectural elements to address classes of big data problems.\n-  Explored application of predictive models and extreme partitioning to circuit design tools.\n-  Determined an architecture for use in a design flow for the layout of digital chips."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ES-02"
                    },
                    "ProjectTitle": {
                        "val": "BEYOND SCALING SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "51.100"
                        },
                        "BudgetYearOne": {
                            "val": "47.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "47.000"
                        },
                        "BudgetYearTwo": {
                            "val": "43.800"
                        },
                        "BudgetYearThree": {
                            "val": "38.700"
                        },
                        "BudgetYearFour": {
                            "val": "53.290"
                        },
                        "BudgetYearFive": {
                            "val": "53.290"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Beyond Scaling Sciences project will support investigations into materials, devices, and architectures to provide continued improvements in electronics performance with or without the benefit of Moore's Law (silicon scaling). Within the next ten years, traditional scaling will start to encounter the fundamental physical limits of silicon, requiring fresh approaches to new electronic systems. Over the short term, DoD will therefore need to unleash circuit specialization in order to maximize the benefit of traditional silicon. Over the longer term, DoD and the nation will need to engage the computer, material, and mechanical sciences to explore electronics improvements through new non-volatile memory devices that combine computation, memory, and new automated design tools using machine learning. Other memory devices could also leverage an emerging understanding of the physics of magnetic states, electron spin properties, topological insulators, or phase-changing materials. Beyond Scaling programs will address fundamental exploration into each of these areas."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Beyond Scaling - Materials"
                                    },
                                    "Description": {
                                        "val": "The Beyond Scaling - Materials program will investigate new materials to support next-generation logic and memory components.  Historically, the DoD provided leadership in shaping the electronics field through research in semiconductor materials, circuits, and processors.  However, as DoD focuses on military-specific components and commercial investments eschew the semiconductor space, U.S. fundamental electronics research is stagnant just as an inflection point in Moore's Law (silicon scaling) is about to occur.  The Beyond Scaling - Materials program will pursue potential enhancements in electronics that do not rely on Moore's Law, including research not only into new materials but also into the implications of those materials at the device, algorithm, and packaging levels.  These basic explorations include, novel mechanisms for computation based on inherent material properties, new methods to accelerate the identification and utilization of emerging materials, and innovative processes to vertically integrate these materials with others to realize superior computational mechanisms.  The Beyond Scaling - Materials program moved from Project ES-01, Electronic Sciences, in FY 2019.  Applied research for this program is funded within PE 0602716E, Project ELT-02."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the basic material properties which would allow for greatly increasing the amount of computational throughput.\n-  Demonstrate the performance and physics of unconventional components that enable new circuit topologies and architectures.\n-  Complete analysis and preliminary architectural design that integrates compute elements with high-performance memory components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Identify preliminary DoD-relevant benchmark algorithms. \n-  Complete detailed analysis using hardware emulation\/simulation in process showing performance benefits of technology approach."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects a shift in focus on analysis and benchmarking of components developed in FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Beyond Scaling - Architectures and Designs"
                                    },
                                    "Description": {
                                        "val": "The Beyond Scaling - Architectures and Design program will investigate application-specific circuit architectures that ensure continued improvements in electronics performance with or without the benefit of continued scaling in silicon transistors (Moore's Law).  Currently, improvements in electronics largely depend on a regular reduction in the size of silicon components.  As Moore's Law slows and the nation loses the benefit of free, exponential improvements in electronics performance, DoD will need to maximize the benefits of available silicon technologies through circuit specialization.  This program will investigate the potential for lowering the barriers to designing specialized circuits.  Approaches include the use of machine learning and automated design tools to program specialized hardware blocks, integrate them into existing designs, and deploy them in complex systems.  Further research would also develop tools to create exact representations of physical hardware.  Advances under this program will support a new DoD capability to create specialized hardware and provide benefits by improving electronics systems that do not depend on continued rapid improvements in silicon transistors.  The Beyond Scaling - Architectures and Designs program moved from Project ES-01, Electronic Sciences, in FY 2019.  Applied research for this program is funded within PE 0602716E, Project ELT-02."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop a cloud-based computer infrastructure and implement open source algorithms that will increase the quality of individual components and decrease design time.\n-  Demonstrate the application of machine learning to a chip layout process flow to determine the tradeoffs between accuracy, automation and turn-around time."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.800"
                                            },
                                            "Text": {
                                                "val": "-  Deliver open source software for physical layout of digital circuits verified against a set of open source benchmark circuits that will fully automate mixed signal System-On-Chip, package, and printed circuit board layout.\n-  Demonstrate rapid, automated generation of digital circuits at multiple technology nodes using an open source software platform."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lifelong Learning Machines (L2M)"
                                    },
                                    "Description": {
                                        "val": "The Lifelong Learning Machines (L2M) program will research and develop fundamentally new machine learning mechanisms, enabling machines that learn continuously as they operate.  Current learning machines are fully configured in advance of deployment, meaning that they have difficulty accounting for in-the-field mission changes or for unexpected deviations in the data being processed.  To overcome this limitation, L2M will pursue learning approaches inspired by biological systems, which continuously learn and improve their skills without losing previous knowledge.  Areas of research will include network structures that improve performance by processing new data seen in the field, learn new tasks without forgetting previous tasks, and incorporate context into their understanding of the environment.  These capabilities would impact a broad array of military applications that require processing and understanding data in real-time, often have limited data sets for training, and must be deployed in environments where unpredictable events may occur.  The L2M program moved from Project CCS-02, Math and Computer Sciences, in FY 2019."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.100"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate continual learning by determining the ability of artificial intelligence (AI) systems to improve performance while the systems operate, using their current experience as training data.\n-  Design algorithms that can use previous information and generalize it to never before seen situations.\n-  Invent a method that allows a machine learning system to balance adaptability to handling new environments while keeping some previous knowledge that may be important in later stages.\n-  Develop plans for how new biological mechanisms will be proven and measured in software, including preliminary specifications of test data.\n-  Generate common test data of interest to the government and distribute to performers for validating lifelong learning core capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.200"
                                            },
                                            "Text": {
                                                "val": "-  Translate first sets of insights from biological experiments into machine learning algorithms, and show that developed algorithms improve lifelong learning capabilities.\n-  Begin porting and testing of the first set of algorithms on the L2M specified test cases.\n-  Demonstrate first lifelong learning system with all five L2M core capabilities using test cases, and show that combining multiple L2M capabilities into a single system provides significant improvement over single focus systems.\n-  Complete demonstrations of working systems by each use case."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint University Microelectronics Program (JUMP)"
                                    },
                                    "Description": {
                                        "val": "The Joint University Microelectronics Program (JUMP) is a government-industry joint research program to explore computing, sensing, communication, and data storage innovations for applications beyond the 2030 horizon.  The program recognizes that the densely interconnected microsystems of the future will be built through the use of groundbreaking materials, revolutionary devices, advanced architectures, and unconventional computing.  JUMP will therefore sponsor academic research teams focused on related key technology areas that will impact future DoD capabilities and national security.  The JUMP program will not only push fundamental technology research but also establish long-range microelectronic research themes with greater emphasis on end-application and systems-level computation.  By discovering the science underlying new technologies and overcoming engineering challenges, JUMP will enable DoD applications to exploit the entire electromagnetic spectrum from radio frequency (RF) to terahertz (THz) and to employ both distributed and centralized computing with embedded intelligence and memory.  The JUMP program moved from Project ES-01, Electronic Sciences, in FY 2019."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Expand university research teams to add newly identified technical projects.\n-  Develop emerging materials, power efficient radio frequency (RF), terahertz (THz), digital, and storage devices prototype.\n-  Establish novel distributed and centralized computing architectures and subsystems for efficient information extraction, processing, and autonomous control applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Benchmark emerging materials, power efficient RF, THz, digital, and storage devices prototype.\n-  Demonstrate prototypes of novel distributed and centralized computing architectures and subsystems for efficient information extraction, processing, and autonomous control applications.\n-  Identify new research directions and amend new projects to the JUMP university research portfolio."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MS-01"
                    },
                    "ProjectTitle": {
                        "val": "MATERIALS SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "65.675"
                        },
                        "CurrentYear": {
                            "val": "77.919"
                        },
                        "BudgetYearOne": {
                            "val": "63.412"
                        },
                        "BudgetYearOneBase": {
                            "val": "63.412"
                        },
                        "BudgetYearTwo": {
                            "val": "65.436"
                        },
                        "BudgetYearThree": {
                            "val": "62.255"
                        },
                        "BudgetYearFour": {
                            "val": "60.138"
                        },
                        "BudgetYearFive": {
                            "val": "50.138"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Materials Sciences project provides the fundamental research that underpins the design, development, assembly, and optimization of advanced materials, devices, and systems for DoD applications in areas such as robust diagnostics and therapeutics, novel energetic materials, and complex hybrid systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Molecular Systems and Materials Assembly"
                                    },
                                    "Description": {
                                        "val": "The Molecular Systems and Materials Assembly thrust is exploring new approaches for the synthesis, assembly, and characterization of molecules and materials from the atomic to the product scale.  Ultimately, materials and methods developed in this thrust will support a wide range of DoD applications that span therapeutics, energetics, computation and next generation optical materials.  Specific approaches include non-traditional synthetic approaches such as the use of extreme pressure and\/or temperature conditions, engineering and controlling atomic-scale processing routes for designer microstructures, and the synthesis and rapid screening of many molecules to more quickly identify those with desired functions and\/or properties.  Efforts in this thrust also include assembly of these and other materials, such as subwavelength engineered shapes, into micro-to-macro-scale objects and devices, exploration of molecules for information storage and processing, and fundamental studies of the properties and function of these molecular ensembles and systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.290"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated the production of 10 micron and larger multilayer spherical assemblies from nanoparticles.  The new assemblies exhibited unique light modulation characteristics.\n-  Demonstrated the ability to assemble one-micron diameter wires into hierarchal 25-wire structured bundles more than one-centimeter in length.\n-  Demonstrated rapid discovery of affinity reagents to a series of DARPA-defined challenges, including optimization of binding in a target active site. \n-  Designed, synthesized and transitioned affinity reagents for current DoD therapeutic or diagnostic challenges to the U.S. Army Medical Research Institute for Infectious Diseases.\n-  Validated approaches to represent data in molecular form.\n-  Developed strategies to enable direct-access molecular informatics to include integrating elements to directly process molecular data.\n-  Demonstrated visual similarity search on images encoded in DNA. \n-  Initiated teaming of four academic\/industry groups with unique synthetic expertise and little or no prior energetic experience with government energetics laboratories to design new explosive and propellant ingredients.\n-  Developed initial set of target molecules for synthesis and further activation\/testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.700"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate creation of complex hierarchical structures with nanoscale features and properties. \n-  Develop methods for the scale-up of nano- and micro-assembly techniques.\n-  Demonstrate approaches for reading molecular data, including random access.\n-  Validate molecular processing approaches against relevant computational problems. \n-  Initiate integration of storage and processing approaches to develop a molecular computing concept. \n-  Activate, formulate, and test the performance of six new candidate energetic molecules that were synthetically inaccessible to the DoD energetics community in prior years. \n-  Demonstrate feasibility of synthesis, activation, testing, and redesign cycle in which government labs provide design recommendations without sharing sensitive information."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.000"
                                            },
                                            "Text": {
                                                "val": "-  Define limitations associated with scale-up of nano- and micro-assembly processes.\n-  Demonstrate operational molecular computing system by linking storage and processing components and execute processing approaches directly on molecular data. \n-  Identify and quantify advantages of molecular computing over conventional computing and storage methods.\n-  Characterize and mitigate error sources in storage and processing approaches and demonstrate repeatability of storage and processing approaches."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects completion of the thrusts to develop non-traditional synthesis and rapid screening of many molecules to more quickly identify those with desired functions and\/or properties and assembly of these and other materials, such as subwavelength engineered shapes, into micro-to-macro-scale objects and devices."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fundamental Limits"
                                    },
                                    "Description": {
                                        "val": "Understanding the fundamental limits (i.e., achievable boundaries) of scientific principles, processes and technologies is critical to better anticipate technological surprise for our adversaries and ourselves.  This thrust explores boundaries across fields such as physics, chemistry, mathematics, biology, and engineering to address critical questions for national security.  This thrust is addressing foundational theory and approaches that include, for example, the fundamental limitations of optical technologies, potential implications for basic biology on national security, and the ability for modeling and simulation to provide a better understanding of complex systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated new design architectures and engineered optical materials on the sub-millimeter (sub-mm) scale.\n-  Developed plans to extend optical device design and fabrication from sub-mm scale to centimeter (cm) scale.\n-  Demonstrated the technical capabilities, both theoretical and experimental, required to investigate if electromagnetic signaling is occurring in select biological systems.\n-  Determined humans can subconsciously detect some changes in earth-like static magnetic fields.\n-  Began developing software to simulate bio-generated weak electromagnetic fields facilitating cellular processes including protein building.\n-  Began investigating new building blocks to form structured materials that have previously unachieved electromagnetic properties.\n-  Investigated very low frequency (VLF) electromagnetic waves for imaging near field disturbances."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.219"
                                            },
                                            "Text": {
                                                "val": "-  Design and optimize centimeter (cm) scale optical systems based on engineered materials.\n-  Fabricate and test cm scale engineered material optical components.\n-  Determine if selected biological systems use electromagnetic signaling to purposefully communicate.\n-  Compare the accuracy and precision of theoretical signaling predictions with experimental measurements within and among biological systems.\n-  Quantify information channel capacity and characteristics pending any newly discovered communications pathways in selected biological systems.\n-  Develop design tools for \"meta-atom or meta-molecule\" building blocks and structures that can be used to create new material responses to electromagnetic radiation.\n-  Investigate breaking metamolecule symmetry and Lorentz reciprocity to create new material designs.\n-  Develop predictive, parametric models for materials for frequency mixing.\n-  Establish penetration\/range\/resolution trade space using low frequency electromagnetic waves for imaging.\n-  Demonstrate the possibility of high-resolution imaging in the near field using very low frequency (VLF) detector arrays."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "31.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "31.400"
                                            },
                                            "Text": {
                                                "val": "-  Integrate and demonstrate optical systems and architectures based on engineered materials.\n-  Extend capability of modeling tools to simulate cm-scale devices and confirm performance with characterization of cm-scale engineered materials.\n-  Investigate the possibility of influencing electromagnetic biological sensing or regulation as a result of any newly discovered biological communications channels.\n-  Demonstrate basic technical capabilities needed to examine electromagnetic, or electromagnetically facilitated, biological signaling channels.\n-  Develop experimental methods and setups to test predictive, parametric models of nascent light-matter interactions under investigation.\n-  Analyze experimental results of nascent light-matter interactions and provide input back to parametric models to further optimize and refine the modeling framework."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects a shift from design to development and demonstration."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Non-Equilibrium Materials"
                                    },
                                    "Description": {
                                        "val": "The Non-Equilibrium Materials thrust will explore materials and materials structures that acquire novel properties when driven far from equilibrium.  Work in this thrust will examine the physical underpinnings and applications of these systems in areas of interest to the DoD, including next generation electronics, high-performance computing, and sensing.  Efforts will include the development of topologically protected excitations in electronic materials and fundamental studies of exotic quantum states of matter in periodically driven solid-state systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.935"
                                            },
                                            "Text": {
                                                "val": "-  Identified materials that can host nanoscale classical topological excitations for memory, logic, or other applications.\n-  Validated materials that can host quantum topological excitations for topological quantum computing.\n-  Developed techniques for unambiguously measuring and detecting nanoscale topological excitations in electronic systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Establish the presence of topological excitations with size <10 nanometer (nm) at room temperature in a material system.\n-  Demonstrate long-term preservation of coherence in a topologically protected qubit.\n-  Design protocols for enhancing the lifetime of quantum coherence in a large quantum system. \n-  Develop techniques to probe the properties of material systems driven far from equilibrium.\n-  Design system for the demonstration of enhanced lifetime of a periodically driven correlated electron material. \n-  Validate the existence of novel phases of matter in systems driven out of equilibrium."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.012"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.012"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate fast current-induced motion of topological excitations.\n-  Develop prototype devices for topologically protected memory.\n-  Implement gate operations in topologically protected qubits.\n-  Experimentally demonstrate the enhancement of coherence time in a large quantum system.\n-  Demonstrate extended lifetime for a correlated electron phase."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects additional demonstrations of the applications of non-equilibrium materials."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Basic Photon Science"
                                    },
                                    "Description": {
                                        "val": "The Basic Photon Science thrust is examining the fundamental science of photons and their interactions in integrated devices for potential DoD-applications such as communications, signal processing, spectroscopic sensing and imaging.  One focus area is development of novel, chip-scale optical frequency comb sources and associated technologies for spectroscopic sensing, identification, and quantification of multiple trace materials in spectrally cluttered backgrounds.  Additional research will explore development of a complex theoretical framework for maximum information extraction from complex scenes to guide development of new imaging technologies.  Work in this thrust will establish the first-principles limits of photon detector performance in a variety of detector technologies to enable better, more sensitive detectors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.450"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated operation of rack-mounted package for mode-locked laser-based optical frequency division microwave source in relevant operational environments.\n-  Demonstrated three dimensional (3D) tabletop sub-wavelength and four-dimensional (4D) imaging of nanostructured technology with nanometer spatial resolution (using tabletop high harmonic x-ray source).\n-  Demonstrated end-user operation of tabletop attosecond source to study electronic and structural dynamics in molecular and semiconductor systems.\n-  Pushed two-way time and frequency transfer to free-space distances that could advance DoD capabilities.\n-  Developed simulated field test environments for the detection of multiple trace species in a cluttered environment using chip-scale frequency combs in multiple spectral regions.\n-  Demonstrated cavity-enhanced comb-spectroscopy methods for spectroscopy of multiple trace species in a cluttered environment.\n-  Established and experimentally verified fundamental trade-offs for photon detection and created new designs for photon detectors with significant performance metric improvements.\n-  Demonstrated world record performance in multiple detector metrics, including jitter, dark counts, and single photon detection.\n-  Developed a detector-agnostic and fully general quantum model of ideal detector performance.\n-  Developed detector test system with functionalized photon-sensitive molecules mounted on carbon nanotubes to mimic photon detection efficiencies found in nature.\n-  Evaluated the reconstruction of individual components of simple 3D scenes based on factors such as fidelity of reconstruction, size of scene, illumination conditions, reconstruction time and projected size, weight and power requirements.\n-  Experimentally demonstrated and evaluated system components for full complex 3D scene reconstruction from a single viewpoint.\n-  Developed components of a generalized theory for maximum information extraction from all photon pathways."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Compare the fundamental properties of new proof-of-concept detector designs with device performance.\n-  Determine which individual state of the art metrics (efficiency, jitter, bandwidth, and photon number count) are improved by an order of magnitude.\n-  Determine which detector designs result in several state of the art metrics (efficiency, jitter, bandwidth, photon number count) being improved simultaneously by an order of magnitude.\n-  Finalize prototype detector designs that are optimized for specified DoD needs.\n-  Refine viable components and algorithms for reconstructing individual aspects of a 3D scene from a single viewpoint.\n-  Combine non-line of sight approaches capable of creating an image of individual visible and hidden aspects of a scene from a single viewpoint into an integrated system."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects program completion."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TRS-01"
                    },
                    "ProjectTitle": {
                        "val": "TRANSFORMATIVE SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "50.020"
                        },
                        "CurrentYear": {
                            "val": "51.199"
                        },
                        "BudgetYearOne": {
                            "val": "57.715"
                        },
                        "BudgetYearOneBase": {
                            "val": "57.715"
                        },
                        "BudgetYearTwo": {
                            "val": "50.321"
                        },
                        "BudgetYearThree": {
                            "val": "50.488"
                        },
                        "BudgetYearFour": {
                            "val": "30.681"
                        },
                        "BudgetYearFive": {
                            "val": "24.576"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Transformative Sciences project supports research and analysis that leverages converging technological forces and transformational trends in information-intensive subareas of the social sciences, life sciences, and manufacturing.  The project integrates these diverse disciplines to improve military adaptation to sudden changes in requirements, threats, and emerging\/converging trends, especially trends that have the potential to disrupt military operations or threaten National Security.  Specific research in this project will investigate technologies to enable detection of novel threat agents (e.g., bacterial pathogens) and maintain warfighter health, as well as create innovative materials of interest to the military (e.g., self-healing materials)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Biological Complexity (BioCom)"
                                    },
                                    "Description": {
                                        "val": "The Biological Complexity (BioCom) program seeks to enhance the understanding of the basic processes associated with biological network interactions, communication, and control to enable novel approaches and technology development to improve warfighter readiness and resilience.  Key advances expected from this research will include the identification of approaches to create stable, predictable, and dynamic control mechanisms of biological networks.  Such information will allow the determination of a biosystem's state and enable the prediction of state.  Applications range from infectious disease mitigation or prevention, maintaining warfighter health, to leveraging biological systems for optimal production of therapeutics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.632"
                                            },
                                            "Text": {
                                                "val": "-  Investigated engineering approaches for influencing the controllability of complex biological systems.\n-  Investigated the utility of predictive design rules for engineering complex biological systems.\n-  Assessed the feasibility of building engineered controls into biological systems.\n-  Tested candidate engineering approaches relevant to control complex biological systems.\n-  Established effective frameworks for independent verification and validation in engineered biological systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.940"
                                            },
                                            "Text": {
                                                "val": "-  Develop theoretical and computational approaches to improve design of biological control systems in complex settings.\n-  Characterize performance and verify specifications of measurement technologies for assessing biological control.\n-  Build multiple, integrated system-level controllers within complex biological systems.\n-  Expand the library of well-characterized biological parts relevant to controlling complex biological systems.\n-  Establish processes for feedback control of mammalian cellular behaviors to enable robust responses to stimuli in the form of growth and\/or differentiation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.950"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.950"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate solutions that counter pathogens and antibiotic resistance, regulate inflammation from Traumatic Brain Injury (TBI), and maintain a healthy gut.\n-  Deliver new experimental tools and algorithms to engineer control of biological system behavior that is robust to perturbation.   \n-  Demonstrate real time characterization of cell and molecular responses to control algorithms.\n-  Establish the limits on reproducibility of performance of biological control systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects an assessment to focus on demonstrations related to warfighter health."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Social Simulation (SocialSim)"
                                    },
                                    "Description": {
                                        "val": "The Social Simulation (SocialSim) program is developing a computational capability to simulate the spread and evolution of information in the online environment.  The global information environment is radically changing how and at what rate information spreads and evolves, and both nation-state and sub-state actors are incorporating messaging into their operations to great advantage.  Existing approaches for understanding online information spread and evolution are largely based on specialized exercises that take considerable time to orchestrate and execute, and have limited accuracy.  SocialSim aims to enable a deeper and more quantitative understanding of adversaries' messaging campaigns and their likely outcomes, as well as exploration of potential responses."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.451"
                                            },
                                            "Text": {
                                                "val": "-  Developed initial modeling and simulation capabilities for the spread and evolution of information in a single online environment.\n-  Implemented privacy techniques for the data used in testing simulations.\n-  Tested simulations of online information dynamics using real-world data from a single online environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.014"
                                            },
                                            "Text": {
                                                "val": "-  Test the capability to simulate online information evolution.\n-  Evaluate the performance of social simulations of diverse scenarios in a single online environment.\n-  Extend the underlying models and mechanisms to simulate the spread and evolution of information in multiple interconnected online environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.952"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.952"
                                            },
                                            "Text": {
                                                "val": "-  Evaluate the performance of the extended models and mechanisms across multiple interconnected online environments.\n-  Integrate the multiple models and mechanisms into a prototype and leverage ensemble modeling and meta-modeling techniques to support performance-based application of models.\n-  Demonstrate the capability to accurately represent online social phenomena, such as recurrent cascades of information, and to quantify the effects of small, persistent groups of information disseminators."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineered Living Materials (ELM)"
                                    },
                                    "Description": {
                                        "val": "The Engineered Living Materials (ELM) program will pursue new approaches to engineer complex, multi-cellular systems for enhanced capabilities and functional materials to improve military infrastructure design and logistics.  Complex biological materials and systems have unique properties (e.g., controlled porosity and high strength-to-weight ratios) not only because of the inherent components but also because of how those components are assembled together across length scales.  Engineering biology tools and techniques are now at a stage to pursue the organization and function of multi-cellular systems for a new class of improved capabilities.  This program will develop underlying technological platforms to enable information-driven assembly of hierarchical multi-cellular systems for the development of advanced materials.  Advances in this program will impact military approaches to infrastructure design in austere environments as well as established methods for manufacture and maintenance of military platforms (e.g., tanks, planes, ships)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.584"
                                            },
                                            "Text": {
                                                "val": "-  Investigated methods for programming cellular behavior in response to external cues.\n-  Developed and tested biological systems that have genetically encoded three-dimensional forms of specified dimensions.\n-  Initiated testing of gene expression circuits that confer desirable surface properties and autonomous pattern formation to a multi-cellular community.\n-  Demonstrated methods to join living cells to non-living structural materials for the purpose of creating living building materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.955"
                                            },
                                            "Text": {
                                                "val": "-  Assess the potential for engineered living materials to respond to damage.\n-  Develop methods to control growth in engineered living materials.\n-  Investigate approaches to propagate external signals over long distances in engineered living materials.\n-  Demonstrate stability over relevant time periods in programmed multi-dimensional shapes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.350"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.350"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate at least two-fold improvements in rate of growth and maintenance of size.  \n-  Demonstrate engineered cell-cell interactions to organize and maintain the density\/spacing of patterns.\n-  Demonstrate increased strength, scaling, and robustness of materials in a built environment.\n-  Demonstrate controlled healing in response to damage of advanced materials."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects a reduction of development efforts and a focus on final demonstration."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biology for Security (BIOSEC)"
                                    },
                                    "Description": {
                                        "val": "Based on initial research conducted under the Biological Robustness in Complex Settings (BRICS) program, the Biology for Security (BIOSEC) program seeks to investigate novel approaches to address the DoD need for rapid detection of unknown and\/or emerging biological threats from state actors or violent extremist organizations (VEOs).  This program will investigate approaches for identifying pathogens based on specific behaviors, or phenotypes, such as niche finding or cell toxicity.  Unlike current methods, which rely on a priori knowledge of the pathogen and cannot detect or otherwise analyze unknown threats, this approach will handle scenarios involving engineered or undiscovered bacterial pathogens that do not have known hallmarks.  Advances in this area will produce a completely new capability to assess the emergence of pathogens and to detect pathogens that have been specifically engineered to evade detection by traditional methods.  Resulting systems may be used to alert deployed military personnel operating around the world to new biothreats, or in response to a U.S.-based discovery, outbreak, or pandemic."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.653"
                                            },
                                            "Text": {
                                                "val": "-  Investigated new assays for rapid phenotype and pathogenic characterization of organisms or biological systems.\n-  Initiated research to better connect genetic code with biological functions of interest.\n-  Identified new tools that isolate and manipulate small numbers of microbes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.290"
                                            },
                                            "Text": {
                                                "val": "-  Develop assays to rapidly screen organisms or biological systems for traits and mechanisms of interest.\n-  Identify genes and pathways associated with complex biological traits.\n-  Establish the potential for natural or synthetic biological systems as biological threat detectors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.847"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.847"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate unbiased high-throughput isolation of microbes from complex samples.\n-  Develop strategies for the maintenance and growth of all bacterial types from complex environmental samples.\n-  Demonstrate effective processes for phenotyping small numbers of bacteria for the three principal classes of pathogenic traits: niche finding, attacking a membrane, and self-defense. \n-  Implement data fusion and remedial algorithms for machine learning and modeling of pathogenicity. \n-  Demonstrate isolation and bioinformatics protocols on complex samples that show the potential for integration into a unified platform."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects increased system complexity and integration of demonstrated sampling and interrogation efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Native Bioelectronic Interfaces"
                                    },
                                    "Description": {
                                        "val": "The Native Bioelectronic Interfaces effort will address the DoD need for improving warfighter recovery from injury by developing technologies that can accelerate the restoration and repair of complex tissues.  This program will develop approaches that combine high-resolution biosensors to track the healing process in real-time with bioactuators to stimulate restoration where and when needed.  The primary challenge to achieving this is the lack of a closed-loop interface that can manipulate highly complex signaling pathways in wounds and the developmental interdependencies that scale from cell to tissue.  The program will develop new methods to convert dense multi-modal information into the body's native repair processes, and will leverage artificial intelligence to guide the delivery of the signals necessary for healing.  Advances from this program will produce bioactuators that can release diverse stimuli with high spatial and temporal resolution, and biosensors that provide the requisite in situ measurement to guide the healing process."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.616"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.616"
                                            },
                                            "Text": {
                                                "val": "-  Identify effective stimuli for directing growth, development, and repair.\n-  Identify critical physiological changes and biomarkers that can report on cell growth and differentiation.  \n-  Develop first set of algorithms that can deliver preliminary intervention strategies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Living Foundries"
                                    },
                                    "Description": {
                                        "val": "The goal of the Living Foundries program was to create a revolutionary, biologically-based manufacturing platform for the DoD and the Nation.  With its ability to perform complex chemistries, be flexibly programmed through DNA code, scale and adapt to changing environments and self-repair, biology represents one of the most powerful manufacturing platforms known.  Living Foundries developed the foundational technological infrastructure to transform biology into an engineering practice, speeding the biological design-build-test-learn cycle and expanding the complexity of systems that can be engineered.  Ultimately, Living Foundries provided game-changing manufacturing paradigms for the DoD, enabling adaptable, on-demand production of critical and high-value molecules.\n\nLiving Foundries developed tools to simplify, abstract, and standardize the biological production pathway optimization process.  Additionally, Living Foundries identified the fundamental design rules that govern the construction and organization of underlying genetic elements in the production pathways.  Research thrusts included development of the fundamental tools, capabilities, and methodologies to accelerate the biological design-build-test cycle, thereby reducing the extensive cost and time it takes to engineer new systems and expanding the complexity and accuracy of designs that can be built.  This resulted in rapid design, construction, implementation, and testing of complex, higher-order genetic networks with programmable functionality.  Applied research for this program was budgeted in PE 0602715E, Project MBT-02."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated novel learning systems of microbial systems using integrated feedback of results to inform subsequent designs.\n-  Utilized improved design and evaluation tools to decrease the cost and increase the speed of biological prototyping.\n-  Demonstrated the capability of new biological chassis for improved yield and production of biochemicals.\n-  Improved the predictability of scaling biological reactions from the lab-scale to the bench-scale."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biological Robustness in Complex Settings (BRICS)"
                                    },
                                    "Description": {
                                        "val": "The Biological Robustness in Complex Settings (BRICS) program leveraged newly developed technologies to enable radical new approaches for engineering biology.  An emerging field, engineering biology is focused on developing the tools to harness the powerful synthetic and functional capabilities of biology.  These tools facilitated design and biological production of new chemicals and materials, sensing capabilities, therapeutics, and numerous other applications.  This rapidly developing technological capability opened the door to new applications that have previously been out of reach, and offers substantial potential advantages in terms of cost and novel functionality.\n\nFundamental work in this area focused on understanding the underlying principles for engineering robust and safe microbes and microbial communities that perform as designed over the long-term.  This program also had applied research efforts funded in PE 0602715E, Project MBT-02."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.700"
                                            },
                                            "Text": {
                                                "val": "-  Continued development of design rules for functional engineered microbial communities.\n-  Refined parameters that contribute to the functional stability of engineered communities over relevant time scales in complex environments.\n-  Developed new metrics that are relevant to the stability and safe use of engineered consortia outside of a controlled environment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}