{
    "id": "2020-Army-PB-2040-JBOOK-caa98a5fe7b001fc6e9636b55add742024da70b1a5204a85a180c10adbb25455-16",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602303A"
        },
        "ProgramElementTitle": {
            "val": "Missile Technology"
        },
        "R1LineNumber": {
            "val": "22"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "52.858"
            },
            "CurrentYear": {
                "val": "91.647"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "144.505"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020, this Program Element (PE) is realigned with continuity of effort to the following PEs:\nPE 0602147A Long Range Precision Fires Technology\nPE 0602148A Future Vertical Lift Technology\nPE 0602150A Air and Missile Defense Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE designs, fabricates and evaluates advanced component technologies for tactical missiles, rockets, guided munitions, and their launch systems in order to increase lethality, precision, and effectiveness under adverse battlefield conditions while reducing system cost, size and weight. Major goals in Project 214 include enhancing the survivability of the munition, launch and fire control systems and increasing kill probabilities against diverse targets.\n\nIn FY18\/FY19 ,work in this PE is complimentary to PE 0603313A (Missile and Rocket Advanced Technology) and fully coordinated with PE 0602307A (Advanced Weapons Technology), PE 0602618A (Ballistics Technology), PE 0602624A (Weapons and Munitions Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0602782A (Command, Control, Communications Technology), and PE 0708045A (End Item Industrial Preparedness Activities). \n\nBeginning in FY20, work in this PE is complimentary to PE 0603464A (Long Range Precision Fires Advanced Technology), PE 0603465A (Future Vertical Lift Advanced Technology), PE 0603463A (Network\/C3I Advanced Technology), and PE 0603466A (Air and Missile Defense Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "43.742"
                },
                "CurrentYear": {
                    "val": "50.183"
                },
                "BudgetYearOne": {
                    "val": "50.468"
                },
                "BudgetYearOneBase": {
                    "val": "50.468"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "52.858"
                },
                "CurrentYear": {
                    "val": "91.647"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "9.116"
                },
                "CurrentYear": {
                    "val": "41.464"
                },
                "BudgetYearOne": {
                    "val": "-50.468"
                },
                "BudgetYearOneBase": {
                    "val": "-50.468"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.018"
                    },
                    "CurrentYear": {
                        "val": "-0.036"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "10"
                    },
                    "CurrentYear": {
                        "val": "41.5"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.866"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-50.468"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-50.468"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY18 Congressional add of $10 Million\nFY19 Congressional add of $41.5 Million\nFY20 PE eliminated due to Science and Technology Financial Restructuring."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "214"
                    },
                    "ProjectTitle": {
                        "val": "Missile Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "42.858"
                        },
                        "CurrentYear": {
                            "val": "50.147"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "93.005"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned to:\nProgram Element (PE) 0602147A Long Range Precision Fires Technology:\n* Project AE7 Land-Based Anti-Ship Missile (LBASM) Technology\n* Project AF3 Extended Range Propulsion Technology\n* Project AF5 Simulation and Aerostructures Technology\n* Project AF6 Structures Technology\n* Project AF7 Warhead Integration Technology\n* Project AF8 Affordable Extended Range Precision Technology\n* Project AF9 Precision and Accuracy Technology\n* Project AG1 Missile Electronics Technology\n* Project AG2 Information and Signal Processing Technology\n* Project AG9 Multiple Simul Engagement Technologies (MSET) Tech\n* Project AH2 Single Multi-mission Attack Missile (SMAM) Technol\nPE 06020148A  Future Vertical Lift Technology:\n* Project AK4 Multi-Role Small Guided Missile Technology\nPE 0602150A Air and Missile Defense Technology:\n* Project AD3 Maneuver Air Defense Technology\n* Project AD5 Next Generation Fires Radar Technology \n* Project AD7 Missile Fire Control Sensors Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs, fabricates, and evaluates missile and rocket component technologies that support demonstration of affordable, lightweight, highly lethal missiles and rockets. Major areas of research include: guidance, navigation, and controls; target acquisition systems; multi-spectral seekers; high-fidelity simulations; sustainment; aerodynamics and structures; launch systems, fire control technologies; payloads; and propulsion including research to help solve the insensitive munitions requirements. A theme embedded throughout the efforts in this project is smaller, lighter, and cheaper (SLC) missile technology to reduce the cost and logistical burden of precision munitions. \n\nThis Project supports the Army Science and Technology Lethality and Command, Control, Communications and Intelligence (C3I) portfolios.\n\nFY18\/19, major products of this Project transition to PE 0603313A (Missile and Rocket Advanced Technology).\n \nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Missile Seeker Technology"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the design, fabrication and evaluation of missile seekers, sensors, and software.  The goal is to increase affordability and performance of missile seekers through improvement of algorithms, imaging, and thermal management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.74"
                                            },
                                            "Text": {
                                                "val": "Developed feature extraction\/classification and tracker algorithms for resolved and unresolved unmanned aerial system to supplement existing surveillance assets; continued to develop infrared passive precision acquisition and tracking algorithms for true fire-and-forget engagements in GPS-denied environments with seeker hardware and interface formed for use on small guided munitions with modular open systems architectures; investigated technologies that support a low cost, strap down seeker system for counter unmanned aerial systems and will evaluate potential missile guidance errors; conducted design analysis for field of view, stabilization, resolution for a man-portable, Air Defense missile and investigate the performance of tactical optics over temperature with the use of additive manufacturing; developed a compact, low cost laser ranging sensor for range finding and target detection of personnel in defilade and develop a height of burst sensor for lethality against personnel."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.648"
                                            },
                                            "Text": {
                                                "val": "Will enhance infrared passive precision acquisition and tracking algorithms for true fire-and-forget engagements in global positioning system (GPS)-denied environments; will design, fabricate and evaluate novel mechanical designs utilizing additive manufacturing and new materials for optical sensor applications to enable lower cost infrared seeker optics; perform design analysis to determine man-portable, Air Defense missile seeker requirements and will develop robust seeker modeling and simulation tools to verify design parameter; will design, fabricate and evaluate technologies that support a low cost, strap down, active, electro-optic seeker system for counter unmanned aerial systems (UAS) and counter ground target missiles; design concepts for a multi-band active optical tracker that laser-designates small UAS to increase probability of defeat for seeker based kinetic weapons."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602147A (Long Range Precision Fires Technology) \/ Project AF9 (Precision and Accuracy Technology) in FY20  as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Missile Guidance, Navigation and Controls Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort designs, fabricates and evaluates guidance, navigation, and control systems and software, as well as information and signal processing systems for rocket and missile applications. Goals of this effort include more affordable missile guidance; miniaturization of guidance electronics; maintaining performance in GPS denied environments; improved image processing; improved missile power systems; improved communication with ground and other systems; technologies to track and respond to threat and offensive munition swarms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.773"
                                            },
                                            "Text": {
                                                "val": "Refined and developed a multi-sensor survey system by integrating inertial navigation sensors, chip-scale atomic clock (CSAC), optics and Global Positioning System (GPS) to provide highly accurate Position, Navigation and Timing (PNT) data in GPS degraded or denied environments; refined the design of small, precision inertial sensors\/accelerometers for fast, accurate north-finding required to support target location systems\/missile initialization; continue design and fabrication of test articles for increased current capacity batteries for long range, small guided missiles; combine Radio Frequency (RF) and electronics in 3-dimensional (3D) printed objects, generate  models and databases, and assess applications to reduce size, weight, and cost of missile systems; designed microelectromechanical systems (MEMS) gyroscope and optical frequency shifting device for next generation inertial sensors; developed laser source filters for semi-active Laser seeker optics and develop advanced machine intelligence and image processing techniques for enhanced target acquisition and engagement; investigated magneto-electric composites, advanced system-on-a-chip (SoC) integrated circuit electronics parts, and design processes that reduce the amount of thermal buildup."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.225"
                                            },
                                            "Text": {
                                                "val": "Will perform investigation and performance analysis of a multi-sensor survey emplacement system for GPS degraded or denied environments; will fabricate and develop microelectromechanical systems (MEMS) concentric proof mass gyroscope for next generation inertial sensor; will investigate radio frequency (RF) ? based navigation via RF range-finding datalinks as a GPS-independent position aid; will investigate a non-line-of-sight datalink for airborne loitering missiles with air\/ground launch capability; will complete evaluation of experimental articles for increased current capacity batteries for long range, small guided missiles; develop magnetoelectric composites, advanced system-on-chip (SoC) integrated circuit electronics parts, and will design processes that reduce the amount of thermal buildup enabling significant improvements in overall material performance and size\/weight reduction; will develop a four dimensional (4-D) printing technology where the printed device properties vary continuously throughout the structure creating a material with varied resistive, graded dielectric, electrical, and thermal management to support RF components; will further develop and evaluate laser source filters for semi-active Laser seeker optics, advanced machine intelligence, and image processing techniques for enhanced target acquisition and engagement."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602147A (Long Range Precision Fires Technology) \/ Project AF9 (Precision and Accuracy Technology), Project AG1 (Missile Electronics Technology), and Project AG2 Information and Signal Processing Technology in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Missile Fire Control Systems, Sustainment, Simulations, and Launchers"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates fire control and tracking sensor technologies for area protection and air defense, technologies to increase the longevity of developed missiles and reliability, advanced simulations to increase performance and reduce size, weight, and cost of missile systems, and launcher technology to deliver effects from air and ground platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.409"
                                            },
                                            "Text": {
                                                "val": "Furthered development of the Digital Array Radar Testbed (DART) to be used in the development of methods to counter evolving threats and maintain overmatch capability; furthered fabrication and evaluation of transmit\/receive element array for increased firm track ranges and higher update rates; refined the Interface Control Document (ICD) between the digital radar testbed antenna array front-end and the Future Fires Radar open systems architecture back-end processing software to ensure compatibility and utilization for air defense capabilities; investigated a radar employing a Low Probability of Intercept chaotic waveform to detect and track small Unmanned Aircraft System (UAS) systems and document results to quantify system performance and investigate the transition of the technology to other Army Air Defense radars; refined target identification algorithms for targets of interest with multiple sensor; further developed the design of modeling and simulation tools to enable increased weather fidelity with simultaneous results across all United States (US) and world climates; further developed UAS modeling validation processes with establishment of radio frequency (RF) predictive methodologies; investigated designs for missile airframe stability and control that includes advanced materials and miniature actuator technology; established behind armor debris prediction capabilities for multiple shaped charge materials and designs; investigated missile battery aging behavior and mechanisms responsible for degraded reliability; investigated the viability of an affordable common, man-portable fire control system to launch both ground and Air Defense missile."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.851"
                                            },
                                            "Text": {
                                                "val": "Will further develop DART technologies; will design and develop the full array beginning with RF characterization, digital beam forming evaluations, and algorithm and scenario development; maintain compatibility with Future Fires Radar open systems architecture back-end processing; will refine and increase capabilities for target identification and discrimination algorithms utilizing threat flight dynamics and multiple sensors; will develop amplitude modulated pulse waveforms for next generation radars and seekers in order to improve target resolution and discrimination for challenging air defense scenarios; will develop a generic algorithm and design antennas that allow the use of non-linear conformal antenna structures across any arbitrary array and operating frequency to reduce effective sensor size, weight, and power (SWAP); will investigate and design an open\/modular architecture for future missile health monitoring units (HMUs) that address shortfalls\/limitations in existing fielded capability and accommodate lower cost\/quicker expansion of missile HMU capability; will develop and demonstrate subscale novel conductive materials capable of supplementing battery life, and also have the ability to be electrically ignited to increase lethality; will develop modeling & simulation capabilities of hypersonic vehicles in low density flows at high altitude and develop a supersonic inlet code tailor made for air breathing missile propulsion enabling rapid design decisions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort  was realigned to PE 0602150A (Air and Missile Defense Technology) \/ Project AD5 (Next Generation Fires Radar Technology) and AD7 (Missile Fire Control Sensors Technology) in FY20  as part of the financial restructing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Missile Propulsion, Structures, Lethality, and Aerodynamic Technology"
                                    },
                                    "Description": {
                                        "val": "This effort designs, fabricates, evaluates and tests missile enabling technologies including: advanced missile propulsion with reduced launch signatures; increased lethality and reduced weight and size using advanced materials and additive manufacturing. Missile Propulsion, Structures and Lethality efforts are in coordination with PE 0602618A (Ballistics Technology) \/ Project H80 (Survivability and Lethality Technology) and PE 0602624A (Weapon and Munition Technology) \/ Project H28 (Warheads\/Energetics Technologies).."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.749"
                                            },
                                            "Text": {
                                                "val": "Conducted static test firings in representative propellant grain geometries for both minimum smoke and high performance propellants; investigated attributes of technology to mitigate temperature sensitivity of reduced shock-sensitivity minimum smoke propellants; investigated low-cost integral rocket ramjet solutions, including combustion testing of advanced fuels, for Army missions to allow extended range within a smaller size than achievable using all-solid propulsion approaches; validated laser welding process and electrically conductive coating technology to reduce weight and cost of composite structures; designed and tested novel warhead technologies for providing overwhelming catastrophic effects against current and emerging threat vehicles to include Main Battle Tanks (MBT); refined concept characterization and integration experiments of brassboard designs of advanced shaped charge, explosively formed penetrators, and fragmentation technologies to enhance warfighter lethality and provide overmatch; investigated approaches to reduce multi-spectral launch signature for minimum smoke propulsion systems; investigated the utility of a low-cost pulsed solid rocket motor approach to provide enhanced mission flexibility for aviation-launched small guided missiles; investigated modeling tools, additive manufacturing processes, and materials to optimize performance and reducing weight and cost of missile structures; investigated lethality performance low-cost reactive penetrators against dispersed targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.142"
                                            },
                                            "Text": {
                                                "val": "Will investigate and characterize enabling energetic technologies for applications to missile propellants; will perform final characterization and evaluation of next generation minimum smoke propellants that improve missile performance via reduced burning rate sensitivity; will further develop low-cost integral rocket ramjet technology for extended range deep strike capability; will demonstrate techniques for reducing rocket motor light emissions sufficient to defeat adversary?s launch detection methods for increased survivability; will develop advanced hardware and subsystem technology to enable mission flexibility via dual pulse motor for future small guided missiles from rotary wing and UAS platforms; will design and develop high performance variable thrust and impulse technologies that can efficiently operate over extended duty cycles, altitudes, and tactical temperatures providing enhanced capabilities against highly maneuverable targets; will design and analyze of high temperature materials supporting high flight speed missiles and dynamic end game scenarios; will further develop modeling tools, additive manufacturing processes, and materials to optimize performance and reducing weight and cost of missile structures; will develop and perform proof of principle testing of novel warhead technologies for providing overwhelming catastrophic effects against current and emerging threat vehicles to include Main Battle Tanks (MBT); will design and develop warhead subsystem analysis of advanced shaped charge, explosively formed penetrators, and fragmentation technologies to enhance warfighter lethality and provide overmatch; will develop lethality simulations utilized for trade space and predicting the probability of kill for multiple-purpose warhead configurations against multiple target classes."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 06020147A ( Long Range Precision Fires Technology) \/ Project AF3 (Extended Range Propulsion Technology) , Project AF5 (Simulation and Aerostructures Technology), Project AF6 (Structures Technology), and Project AF7 (Warhead Integration Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Role Missile Technology"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates critical technology and designs component for future affordable rockets and missiles to provide overwhelming defeat of conventional and asymmetrical threats in all environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.186"
                                            },
                                            "Text": {
                                                "val": "Continued detailed designs and component development of low-cost guidance, navigation and control systems, multi-purpose warhead\/fuzing technologies, and low-cost range finding and sighting systems for small unit precision lethality against multiple targets at extended ranges; designed and evaluated subsystems for expanding the applicability of the modular open systems architecture to the drop\/glide variant missile."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.728"
                                            },
                                            "Text": {
                                                "val": "Will mature modular missile technology components and open system architecture into subsystems and verify subsystem performance for the drop\/glide variant in bench-level and laboratory environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 06020148A (Future Vertical Lift Technology) \/ Project AK4 (Multi-Role Small Guided Missile Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air Defense Missile Technologies (formerly Counter Unmanned Aerial Systems and Counter Cruise Missile)"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates and provides technologies and performs necessary trade studies to provide the key components for maturation and demonstration of air defense missiles to counter threats such as UAS and cruise missile systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.368"
                                            },
                                            "Text": {
                                                "val": "Furthered the design of critical air defense interceptor technologies and components; performed the mission computer, and power system laboratory bench testing and demonstration in preparation for integration into guidance electronics units for the Ballistic and Control Test Vehicle evaluations; continued design of the control actuation system and demonstrate it in laboratory dynamic flight test simulation apparatus; designed and developed software algorithms to provide common targeting data across multiple tactical echelons, enabling a common operating picture for maneuver and fire support weapon targeting."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.3"
                                            },
                                            "Text": {
                                                "val": "Will further the design of critical air defense interceptor technologies and components; will mature guidance electronics units for the Ballistic and Control Test Vehicle evaluations and will conduct Ballistic Test Vehicle Flight Testing; mature the control actuation system and demonstrate it in laboratory dynamic flight test simulation apparatus; will continue to develop software algorithms to fuse data from radar, electro-optical\/Infrared, and acoustic sensors enabling a common operating picture of threat unmanned aerial systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort will realign to PE 06020150A (Air and Missile Defense Technology) \/ Project AD3 (Maneuver Air Defense Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Affordable Precision Missile Enabling Technology"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the studies, design, establishment, fabrication, and evaluation of components and subsystems critical to produce affordable discriminate extended range precision missiles. Critical component technologies include: advanced propulsion, seekers\/sensors, fire control, datalink, guidance, navigation and controls, and airframes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.787"
                                            },
                                            "Text": {
                                                "val": "Refined component\/subsystem trade studies and began to design, fabricate and test component technologies to provide the capability to engage maritime targets with lethal effects. Critical component technologies include: sensors, data-links, guidance, navigation, controls, aerodynamics, thermal protection systems and fuze integrated payloads."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.223"
                                            },
                                            "Text": {
                                                "val": "Will perform trade studies, develop concepts, generate designs, and explore technologies for affordable discrimination of extended range precision missiles for indirect fires capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort realigns to PE 06020147A (Long Range Precision Fires Technology) \/ Project AF8 (Affordable Extended Range Precision Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Range Fires Enabling Technology"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on performing the necessary trade studies, and designing, establishing, fabricating and evaluating critical component technologies needed to support a long range fires capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.846"
                                            },
                                            "Text": {
                                                "val": "Investigated emerging navigation technologies and techniques; designed navigation system integration architectures and algorithms capable of combining emerging navigation technologies into an alternate precision navigation solution; designed propulsion systems to increase the range of the system; designed light weight airframe structures to increase range of the system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.552"
                                            },
                                            "Text": {
                                                "val": "Will continue to develop and evaluate emerging navigation technologies and techniques; will design navigation system integration architectures and algorithms capable of integration emerging navigation technologies into an enhanced precision navigation solution; will design propulsion systems, including alternate propulsion cycles, to increase the range of the system; will design lightweight airframe structures to increase range of the system; will develop technologies that contribute to missile survivability in a contested environment.  Will develop and evaluate a multi-mode seeker to enable precision guidance in GPS denied or degraded environments; radio frequency sensor to guide to radiating targets, infrared sensor with advanced image processing to enable target classification and aim point selection for both land and maritime targets; miniaturization of sensor and guidance components; investigate data link technologies to provide in-flight target updates."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort realigns to PE 06020147A (Long Range Precision Fires Technology) \/ Project AE7 (Land-Based Anti-Ship Missile (LBASM) Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cooperative Engagement Lethality Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates critical component technology and designs for future missiles that provide expeditionary, scalable, precision strike and loiter capability to rapidly defeat hard targets and swarming or disbursed threats at the Tactical Edge.  Provides the missile technology path to supervised autonomous target detection and cooperative engagement\/manned-unmanned teaming for offensive, multiple simultaneous engagement capabilities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.327"
                                            },
                                            "Text": {
                                                "val": "Will develop optimized missile design with multi-effects lethal mechanism, man-in-the-loop and loiter capability for situational awareness, targeting, and lethal effects against hard and soft targets. WIll develop application-based fire control unit software hosted on a commercial end user device, extended range datalink enablers, and GPS\/comms denied navigation\/targeting technologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort realigns to PE 06020147A (Long Range Precision Fires Technology) \/ Project AH2 (Single Multi-mission Attack Missile (SMAM) Technol), and Project AG9 (Multiple Simul Engagement Technologies (MSET) Tech) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.151"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "G05"
                    },
                    "ProjectTitle": {
                        "val": "MISSILE TECHNOLOGY INITIATIVES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10"
                        },
                        "CurrentYear": {
                            "val": "41.5"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "51.500"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional Program increase for Fiscal Year (FY) 2018 and FY19."
                        },
                        "ProjectMissionDescription": {
                            "val": "This is a Congressional Interest Item."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Composites Research Air Veh Dev & Sust"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Composites Research Air Veh Dev & Sust"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "carbon composite warhead research"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "6.5"
                                        },
                                        "Text": {
                                            "val": "carbon composite warhead research"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "additive manufacturing to support optimized long range precision fires"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "additive manufacturing to support optimized long range precision fires"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "air vehicle development and sustainment"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "15"
                                        },
                                        "Text": {
                                            "val": "air vehicle development and sustainment"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "enterprise science and technology prototyping"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "enterprise science and technology prototyping"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}