{
    "id": "2020-Army-PB-2040-JBOOK-caa98a5fe7b001fc6e9636b55add742024da70b1a5204a85a180c10adbb25455-9",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602146A"
        },
        "ProgramElementTitle": {
            "val": "Network C3I Technology"
        },
        "R1LineNumber": {
            "val": "15"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "114.516"
            },
            "BudgetYearOneBase": {
                "val": "114.516"
            },
            "BudgetYearTwo": {
                "val": "133.431"
            },
            "BudgetYearThree": {
                "val": "117.508"
            },
            "BudgetYearFour": {
                "val": "111.923"
            },
            "BudgetYearFive": {
                "val": "114.124"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "591.502"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) was previously funded, with continuity of effort realigned from the following PEs: \n* PE 0602120A Sensors and Electronic Survivability\n* PE 0602270A Electronic Warfare Technology\n* PE 0602705A Electronics and Electronic Devices\n* PE 0602720A Environmental Quality Technology\n* PE 0602782A Command, Control, Communications Technology\n* PE 0602783A Computer and Software Technology\n* PE 0602784A Military Engineering Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) investigates technologies, techniques, components and tools to provide an Army tactical network and enabling infrastructure that support operations in any environment, to include where the electromagnetic spectrum is denied or degraded. This is accomplished through the design, and development of technologies and components (e.g., electronic components, software and protocols) that provide unified transport and are supportable, mobile and survivable; assured and secure positioning, navigation, and timing in all environments; converged and coordinated cyber and electronic warfare activities; resilient mission command on the move at; and the collection, processing, and dissemination of information for intelligence, surveillance, and reconnaissance.\n\nCommercial technologies are continuously investigated and leveraged where possible. \n\nProject AM6 develops techniques, methods, and standards for automation and intelligence to optimally route data among available radio frequency and networking technologies. Project AM8 investigates resiliency of Wideband Satellite Communications (SATCOM) in contested and congested electromagnetic environments. Project AN1 designs and develops technologies to enable gateway communications across disparate Narrowband SATCOM networks. Project AN3 develops non-traditional protocols and technologies to provide spectrum efficiency, high bandwidth, lower spectrum footprint, or anti-jam capabilities to tactical networks. Project AN5 develops interference cancellation technologies to allow uninterrupted and resilient communications over the Wideband Global Satellite constellation. Project AN7 and AN9 develop the algorithms to enable every communication receiver in the tactical environment to operate as a sensor while maintaining the systems' original networking capability. Project AO2 investigates distributed Electronic Warfare (EW) techniques for grey-zone operations and designs algorithms for sparse detection and EW, and investigates techniques for secure transmission across network transport links and designs networking communications with low probability of detection and intercept technologies. Project AO4 investigates energy efficiency improvements in support of four key areas: Radio Frequency (RF) component devices, optoelectronic devices for alternative communications modes, long-lived and high efficiency power sources, and efficient wireless power and data transfer technologies. Project AO5 researches and develops space-based remote sensing, signal, and information processing software in collaboration with other Department of Defense (DoD) and other government agencies to support space force enhancement and space superiority advanced technology integration into Army battlefield operating systems. Project AO8 develops defensive cyber technology to ensure that data traversing the network remains verified and has not been modified through unauthorized means. Project AP1 designs technologies to counter enemy cyber threats by delaying, disrupting, and deterring their ability to successfully attack tactical systems, applications, and critical data. Project AP3 develops and characterizes techniques for detecting, disrupting, understanding and predicting complex adversarial activities and their impacts for developing agile, adaptive maneuvers in defense of information and networks and hardware, algorithms, and methods that jointly adapt to support uninterrupted communications. Project AP4 designs cyber architectures, software, tools, and techniques to enable Cyber Electromagnetic Activities (CEMA) to counter adversary communications and harden the Army's tactical communications networks against cyber attacks. Project AP5 investigates emerging technologies related to EW applications, non-kinetic survivability\/lethality, and emerging concepts of operation in the increasingly contested and congested electromagnetic environment, with the goal of enhancing the survivability\/lethality of Army platforms through electronic attack (EA), EW support (ES), and electronic protection (EP). Project AP7 investigates the communication architectures of each of the Army's modernization priorities and determines technologies and components to enable assured and resilient communications and horizontal integration. Project AQ3 investigates the application of machine learning technologies to assist in capability development and mission execution processes with respect to Offensive Cyber Operations (OCO)\/RF Enabled capabilities. Project AQ9 investigates, codes and designs software, and algorithms that improve Mission Command by increasing situational understanding, via the intelligent sharing of data (application of artificial intelligence) in degraded networks during high op-tempo missions or while under cyber-attack. Project AR1 develops and characterizes machine learning and artificial intelligence methods for processing, analysis and provisioning control of smart, distributed, networked sensors and devices. Project AR5 designs and advances mission planning software enabling the Solider to identify, track, and plan for industrial or commercial chemical\/environmental threats. Project AR9 develops algorithms, software, and kitted hardware solutions to enable near-real-time battlespace awareness to persistently monitor and update courses of action regarding critical infrastructure conditions. Project AT2 develops an integrated suite of subterranean threat detection and vulnerability assessment\/decision technologies that enhance survivability and threat awareness for the soldier operating in environments with subterranean domains. Project AT7 investigates and develops a revolutionary, integrated capability to rapidly share mission critical 3-dimensional (3D) information that supports planning and execution at the Soldier level. Project AT9 investigates and develops next generation geospatial analytical tools for 3D complex environments for low echelon and tactical edge exploitation. Project AU3 investigates, advances and develops a geospatially enabled collaborative planning environment, accessible across echelons, by providing the ability to perform conceptual planning and problem framing. Project AU5 investigates and develops technologies that capture hidden threat patterns and operational environment changes from textual reporting. \n\nWork in this PE complements PE 0602782A (Command, Control, Communications Technology), PE 0602143A (Soldier Lethality Technology), PE 0602145A (Next Generation Combat Vehicle Technology), PE 0602146A (Network C3I Technology), PE 0602147A (Long Range Precision Fires Technology), PE 0602148A (Future Vertical Lift Technology), PE 0602150A (Air and Missile Defense Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602709A (Night Vision Technology), PE 0602782A (Command, Control, Communications Technology), PE 0603008A (Command Electronic Warfare Advanced Technology), PE 0603710A (Night Vision Advanced Technologies), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology), PE 0603001A (Warfighter Advanced Technology), PE 0603118A (Soldier Lethality Advanced Technology), PE 0603462A (Next Generation Combat Vehicle Advanced Technology), PE 0603464A (Long Range Precision Fires Advanced Technology), PE 0603465A (Future Vertical Lift Advanced Technology),  PE 0603466A (Air and Missile Defense Advanced Technology), PE 0603463A Network C3I Advanced Technology.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the United States Army Futures Command, the United States Army Space and Missile Defense Command and the Army Engineer Research and Development Center.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "114.516"
                },
                "BudgetYearOneBase": {
                    "val": "114.516"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "114.516"
                },
                "BudgetYearOneBase": {
                    "val": "114.516"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "114.516"
                                },
                                "BudgetYearOneBase": {
                                    "val": "114.516"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY20 increase related to Science and Technology financial restructuring."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "AM6"
                    },
                    "ProjectTitle": {
                        "val": "Modular RF Communications Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "3.909"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.909"
                        },
                        "BudgetYearTwo": {
                            "val": "8.313"
                        },
                        "BudgetYearThree": {
                            "val": "6.091"
                        },
                        "BudgetYearFour": {
                            "val": "5.193"
                        },
                        "BudgetYearFive": {
                            "val": "8.321"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "31.827"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nPE 0602782A Command, Control, Communications Technology Project:\n* H92 Communications Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and develops techniques, methods, and standards for automation and intelligence to optimally route data among available radio frequency (RF) and networking technologies. This project adds resiliency to the network through diversity and automation techniques to make automated network decisions, (e.g., automated Primary, Alternate, Contingency, and Emergency (PACE)) for the tactical Army to maintain operation in continually changing environments. \n\nWork in this Project complements PE 0603463A 9Network C3I Advanced Technology \/ Project AM7 (Modular RF Communications Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Modular Radio Frequency Communications Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops techniques, methods, and standards for automation and intelligence to optimally route data among available radio frequency and networking technologies. This effort adds resiliency to the network through diversity and automation techniques to make automated network decisions, (e.g., automated PACE) for the tactical Army to maintain operation in continually changing environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.909"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.909"
                                            },
                                            "Text": {
                                                "val": "Will investigate techniques and algorithms for autonomous network initialization, detection, and adaption; design and develop the architecture to enable validation of algorithms for network initialization from start-up condition; research multiple approaches to autonomous networking by providing algorithms to detect available networks and networking technologies; and develop specifications for shared interfaces between network technologies and autonomous networking algorithms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602782A (Command, Control, Communications Technology) \/ Project H92 (Communications Technology ) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AM8"
                    },
                    "ProjectTitle": {
                        "val": "Protected SATCOM Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "9.6"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.6"
                        },
                        "BudgetYearTwo": {
                            "val": "5"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "14.600"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602782A Command, Control, Communications Technology:\n* Project H92 Communications Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates resiliency of Wideband Satellite Communications (SATCOM) in contested and congested electromagnetic environments. Wideband SATCOM is the primary high-bandwidth Beyond Line of Sight (BLOS) Communications used by the tactical Army. This project designs and develops technologies and components, such as interference cancellation, to increase availability and reliability of Wideband SATCOM in spectrum-challenged environments. \n\nWork in this Project complements PE 0603463A (Network C3I Advanced Technology) \/ AM9 (Protected SATCOM Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Protected Satellite Communication Technology"
                                    },
                                    "Description": {
                                        "val": "This effort designs and develops technologies and components to increase resiliency of Wideband SATCOM in contested and congested electromagnetic environments. This effort develops resiliency through science & technology investigation."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.6"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.6"
                                            },
                                            "Text": {
                                                "val": "Will fund research to advance satellite communications technology in order to automatically adapt to constantly changing, congested, and contested environments; investigate emerging commercial aerial and overhead capabilities and products, to select those that may be leveraged for tactical Army use; conduct experiments to establish a baseline for future research of intelligent satellite communications (i.e., systems that automatically adapt and mitigate network problems); investigate technology to mature components that support the control of the Army satellite network in a contested environment; and research emerging commercial Low Earth Orbit (LEO) satellite mega-constellations to select applicable technologies to utilize and build upon for use in a mounted\/dismounted environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602782A (Command, Control, Communications Technology) \/ Project H92 9Communications Technology) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AN3"
                    },
                    "ProjectTitle": {
                        "val": "Non Traditional Waveforms Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "3.291"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.291"
                        },
                        "BudgetYearTwo": {
                            "val": "2.269"
                        },
                        "BudgetYearThree": {
                            "val": "7.11"
                        },
                        "BudgetYearFour": {
                            "val": "7.252"
                        },
                        "BudgetYearFive": {
                            "val": "4.263"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "24.185"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\n Program Element (PE) 0602782A Command, Control, Communications Technology:\n* Project H92 Communications Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates non-traditional protocols and technologies to provide spectrum efficiency, high bandwidth, lower spectrum footprint, or anti-jam capabilities to tactical networks.  This Project develops network resiliency for the dismounted and vehicular units through science & technology investigation. \n\nWork in this Project complements PE 0603463A (Network C3I Advanced Technology) \/ Project AN4 (Non Traditional Waveforms Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Non Traditional Waveforms Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates non-traditional protocols and technologies to provide spectrum efficiency, high bandwidth, lower spectrum footprint, or anti-jam capabilities to tactical networks. This effort develops network resiliency for the dismounted and vehicular units through science & technology investigation."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.291"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.291"
                                            },
                                            "Text": {
                                                "val": "Will develop novel beam-tracking techniques and advanced directional mobile ad-hoc networking (MANET) technology to support on-the-move (OTM) millimeter wave communications; conduct study of dynamic effects of vehicle and vehicle systems on communication systems, such as the impacts to highly directive systems and\/or cooperative beamforming techniques; and design adaptive power control techniques and dismounted networking for improved low probability of intercept \/ low probability of detection (LPI\/LPD) characteristics."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602782A (0602782A Command, Control, Communications Technology) \/ Project H92 (Communications Technology) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AN5"
                    },
                    "ProjectTitle": {
                        "val": "Protected SATCOM-WB Global SATCOM Inter Canc Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0.4"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.4"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "0.400"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602782A Command, Control, Communications Technology:\n* Project H92 Communications Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project develops interference cancellation technologies to allow uninterrupted and resilient communications over the Wideband Global Satellite constellation when operating in proximity to enemy threats. \n\nWork in this Project complements PE 0603463A (Network C3I Advanced Technology) \/ Project AN6 (Prot SATCOM-WB Global SATCOM Interference Canc Adv Tech.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Protected Satellite Communication ? Wide Band Global Satellite Communication Interference Cancellation Technology"
                                    },
                                    "Description": {
                                        "val": "This effort develops interference cancellation technologies to allow uninterrupted and resilient communications over the Wideband Global Satellite constellation when operating in proximity to enemy threats."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.4"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.4"
                                            },
                                            "Text": {
                                                "val": "Will validate the performance of interference cancelling technology to protect satellite communications; will mature predictive algorithms for satellite-based interference cancelling technology to establish expected improvement of tactical terminal operation in the presence of Electronic Warfare (EW) threats or jammers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602782A (Command, Control, Communications Technology \/ Project H92 (Communications Technology) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AN7"
                    },
                    "ProjectTitle": {
                        "val": "COE - Every Receiver is a Sensor Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "3.005"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.005"
                        },
                        "BudgetYearTwo": {
                            "val": "3.065"
                        },
                        "BudgetYearThree": {
                            "val": "3.126"
                        },
                        "BudgetYearFour": {
                            "val": "3.189"
                        },
                        "BudgetYearFive": {
                            "val": "3.225"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "15.610"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602270A Electronic Warfare Technology:\n* Project 906 Tactical Electronic Warfare Applied Research"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates, designs, and codes advanced automated exploitation and fusion analysis tools, applications, and software services that harvest, correlate and fuse tactical receiver sources with new and emerging data sources to improve understanding of the threat picture and more efficiently support near-real time Situational Understanding of the battlefield. \n\nWork in this Project complements PE 06022146A Network C3I Advanced Technology \\ Project AN9 UNT - Every Receiver is a Sensor Technology.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the U.S. Army Futures Command.\n\nFiscal Year (FY) 2020 realignments are due to financial restructuring in support of Army Modernization Priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Data Analytics for Situational Awareness"
                                    },
                                    "Description": {
                                        "val": "This effort researches and designs spectrum sensing, electronic sensing and intelligence collection technologies and analytics to enhance overall situational understanding within a contested battlespace. Efforts focus on developing the analytics necessary to taking advantage of the expanding number of data sources available by leveraging existing tactical receivers and other tactical data feeds. Work being accomplished under PE 06033463\/Project AO1 complements this effort."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.005"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.005"
                                            },
                                            "Text": {
                                                "val": "Will investigate deep learning techniques to leverage tactical and national data sources identified in FY 2019 to improve the threat picture while reducing the analysts? burden in understanding of the Electromagnetic Operating Environment (EMOE). Perform initial demonstrations with selected deep learning techniques and analytics to automatically generate an enemy Electronic Order of Battle (EEOB). Demonstrate the capability to provide automated alerting and a fused picture of red cyber events to enhance the near-time Cyber Situational Understanding (SU) to support decision making."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602270A (Electronic Warfare Technology) \/ Project 906 (Tactical Electronic Warfare Applied Research) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AN9"
                    },
                    "ProjectTitle": {
                        "val": "UNT - Every Receiver is a Sensor Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "3.85"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.85"
                        },
                        "BudgetYearTwo": {
                            "val": "4"
                        },
                        "BudgetYearThree": {
                            "val": "3.04"
                        },
                        "BudgetYearFour": {
                            "val": "2.081"
                        },
                        "BudgetYearFive": {
                            "val": "2.105"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "15.076"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0602782A Command, Control, Communications Technology:\n* Project H92 Communications Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project develops the algorithms to enable every communication receiver in the tactical environment to operate as a sensor while maintaining the systems' original networking capability.  This Project matures standards and protocols to expand the Cyber-Electromagnetic Activity (CEMA) situational understanding. Work in this Project complements PE 06033463A (Network C3I Advanced Technology) \\ Project AO1 (UNT - Every Receiver is a Sensor Advanced Tech) . \n\nWork in this Project complements PE 06022146A Network C3I Advanced Technology \\ Project AN7 COE - Every Receiver is a Sensor Technology.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unified Network Technology (UNT) - Every Receiver is a Sensor Technology"
                                    },
                                    "Description": {
                                        "val": "This effort develops the algorithms to enable every communication receiver in the tactical environment to operate as a sensor while maintaining the systems' original networking capability.  This effort matures standards and protocols to expand the CEMA situational understanding."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.85"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.85"
                                            },
                                            "Text": {
                                                "val": "Will investigate multiple artificial intelligence\/machine learning (AI\/ML) techniques that are applicable to radio frequency (RF) domain; develop and test software algorithms for dynamic spectrum sensing that incorporate identified AI\/ML techniques; design and implement method and\/or interface to transmit RF sensed metadata for use in  intelligence."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602782A (Command, Control, Communications Technology) \/ Project H92 (Communications Technology) in FY20 as part of the financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi Intelligence Modernization Components and Architecture"
                                    },
                                    "Description": {
                                        "val": "This effort will investigate underlying architectures for dynamic resource management and technology underpinnings for advanced signal processing, exploitation, and novel sensor hardening to better understand our ability to detect, intercept, identify, and geo-locate radiated RF energy to command our use of the electromagnetic spectrum while denying its use to our adversaries."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Will investigate and develop novel Electronic Warfare (EW) hardware technologies and techniques against adversarial Communication and Intelligence Surveillance and Reconnaissance (ISR) capabilities in the Electromagnetic Spectrum while in contested operational areas. Perform research to determine the feasibility of localized, distributed, and intermittent Electronic Warfare effects to support the Commander?s intent and conduct laboratory experiments utilizing developed EW techniques against high value threats to validate concepts. Work being accomplished under PE 06033463 Network C3I Advanced Technology\/Project AN8 COE - Every Receiver is a Sensor Advanced Tech complements this effort."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602782A (Command, Control, Communications Technology) \/ Project H92 (Communications Technology) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AO2"
                    },
                    "ProjectTitle": {
                        "val": "Stand-In Advanced RF Effects (STARE)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "7.504"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.504"
                        },
                        "BudgetYearTwo": {
                            "val": "6.387"
                        },
                        "BudgetYearThree": {
                            "val": "2.053"
                        },
                        "BudgetYearFour": {
                            "val": "2.113"
                        },
                        "BudgetYearFive": {
                            "val": "2.136"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "20.193"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0602705A Electronics and Electronic Devices:\n* Project EM8 High Power and Energy Component Technology\nPE 0602782A Command, Control, Communications Technology:\n* Project H92 Communications Technology\nPE 0602270A Electronic Warfare Technology:\n* Project 906 Tactical Electronic Warfare Applied Research"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates distributed Electronic Warfare (EW) techniques for grey-zone operations and designs algorithms for sparse detection and EW, and investigates techniques for secure transmission across network transport links and designs networking communications with low probability of detection and intercept technologies. \n\nWork in this Project complements PE 0603463A (Network C3I Advanced Technology) \/ Project AO3 (Robust Grey C3I Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RF Electronic Attack\/Surveillance"
                                    },
                                    "Description": {
                                        "val": "This effort investigates emerging technologies to enable EW applications in a grey environment. The goal is to develop software and reconfigurable radio frequency (RF) hardware in a low size, weight, and power form factor for distributed EW and communications."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Will investigate wideband reconfigurable transceivers, RF frontend hardware, reconfigurable filters, antenna tuners, and antennas for handheld and leave-behind EW applications; investigate techniques to counter adversarial surveillance and communications and conduct laboratory experiments to determine effectiveness; and investigate techniques for identification and geolocation of advanced communications transceivers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602705A (Electronics and Electronic Devices) \/ Project EM8 (High Power And Energy Component Technology),  PE 0602782A (Command, Control, Communications technology) \/ Project H92  (Communications Technology) and PE 0602270A (Electronic Warfare Technology) \/ Project 906 (Tactical Electronic Warfare Applied Research) in FY20 as part of the financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Grey C3I Communications Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates techniques for secure transmission across network transport links and designs networking communications with low probability of detection and intercept technologies."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.996"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.996"
                                            },
                                            "Text": {
                                                "val": "Will investigate enhancements to commercial off-the-shelf technologies; mature components that contribute such as cellular and\/or narrowband communications, to provide dismount and mounted operators with long-range connectivity in a hostile electromagnetic spectrum environment; and design and develop enhancements to improve network resiliency and robustness, such as low probability of detection, low probability of intercept, and\/or anti-jam features."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602705A (Electronics and Electronic Devices) \/ Project EM8 (High Power And Energy Component Technology),  PE 0602782A (Command, Control, Communications technology) \/ Project H92  (Communications Technology) and PE 0602270A (Electronic Warfare Technology) \/ Project 906 (Tactical Electronic Warfare Applied Research) in FY20 as part of the financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Grey C3 Exploitation Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates distributed EW techniques for grey-zone operations and designs algorithms for sparse detection and EW."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.508"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.508"
                                            },
                                            "Text": {
                                                "val": "Will investigate and develop novel EW hardware technologies and techniques against adversarial Communication and Intelligence Surveillance and Reconnaissance (ISR) capabilities in the electromagnetic spectrum while in contested operational areas. Perform research to determine the feasibility of localized, distributed, and intermittent EW effects to support the Commander?s intent and conduct laboratory experiments utilizing developed EW techniques against signals of interest to validate concepts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602705A (Electronics and Electronic Devices) \/ Project EM8 (High Power And Energy Component Technology),  PE 0602782A (Command, Control, Communications technology) \/ Project H92  (Communications Technology) and PE 0602270A (Electronic Warfare Technology) \/ Project 906 (Tactical Electronic Warfare Applied Research) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AO4"
                    },
                    "ProjectTitle": {
                        "val": "Energy Efficient Devices Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "5.412"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.412"
                        },
                        "BudgetYearTwo": {
                            "val": "5.478"
                        },
                        "BudgetYearThree": {
                            "val": "5.843"
                        },
                        "BudgetYearFour": {
                            "val": "5.415"
                        },
                        "BudgetYearFive": {
                            "val": "5.475"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "27.623"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0602705 Electronics and Electronic Devices:\n* Project H94 Elect & Electronic Dev"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project addresses sustainment operations by unburdening the Soldier and reducing logistics requirements (e.g., fewer batteries) for communications, computing, and sensing. The objective is to improve the underlying energy efficiency of supply and demand for Soldier-portable and distributed sensor electronics to enable the dismounted Soldier to maintain communications, freedom of movement, and increase mission duration. The majority of the electronics power used by the dismounted Soldier and by distributed electronics is attributable to radio frequency (RF) communications. In addition, freedom of movement and action during sustained and high tempo operations requires seamless battery recharging. To address these challenges, energy efficient electronics research includes RF and optoelectronic circuits, devices, materials and wireless power (and data) transfer. \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Energy Efficient Electronic and Photonic Components"
                                    },
                                    "Description": {
                                        "val": "This effort investigates energy efficiency improvements in support of four key areas: RF component devices, optoelectronic devices for alternative communications modes, long-lived and high efficiency power sources, and efficient wireless power and data transfer technologies. These components enable energy-efficient communications and networked energy, specifically leading to increased soldier mission duration and long-lived networked electronics."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.412"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.412"
                                            },
                                            "Text": {
                                                "val": "Will research and develop RF component technologies such as advanced silicon accelerators to improve squad level communication efficiency; develop zero-power sensors for wake-up radio applications; explore the development of optoelectronic devices for alternative communications; develop technologies for long-lived efficient power sources; develop efficient wireless power and data technologies with >10% efficiency enabling squad-level power and data transfer; and explore methods to support higher rate and energy density wireless battery recharging."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602705A (Electronics and Electronic Devices) \/ Project H94 (Elect & Electronic Dev) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AO5"
                    },
                    "ProjectTitle": {
                        "val": "Tag Track and Locate Small Satellites Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "4.406"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.406"
                        },
                        "BudgetYearTwo": {
                            "val": "3.837"
                        },
                        "BudgetYearThree": {
                            "val": "3.767"
                        },
                        "BudgetYearFour": {
                            "val": "3.888"
                        },
                        "BudgetYearFive": {
                            "val": "3.93"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "19.828"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0602120A Sensors and Electronic Survivability:\n* Project TS1 Tactical Space Research"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project researches, develops, and adapts technologies for space-based and high altitude applications for Army tactical ground forces. Applied research efforts include the design and development of sensors and electronic components for communications, signal and information processing, target acquisition, position\/navigation, and threat warning within space and high altitude environments. The applied research and technology evaluations conducted under this Project leverage other Department of Defense (DoD) space science and technology applications to support Army space force enhancement and cooperative satellite payload development. \n\nWork in this Project complements PE 0603463A (Network C3I Advanced Technology) \/ AO6 (Tag Track and Locate Small Satellites Adv Tech).\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n \nWork in this Project is performed by the United States Army Space and Missile Defense Command\/Army Forces Strategic Command in Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tag Track and Locate Small Satellites"
                                    },
                                    "Description": {
                                        "val": "This effort will design, develop, and adapt space-based technologies, components, and tools that lead to smaller, lighter, more responsive payloads and applications. These technologies allow for the rapid integration and development of tactical payloads in support of responsive space environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.256"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.256"
                                            },
                                            "Text": {
                                                "val": "Will fund research and validate software, hardware, and algorithms used to enable space-based capabilities in support of the Army?s Modernization Priorities. Will also investigate the maturity and feasibility of commercial advances and opportunities in small satellite constellation and payload management for apply to future Army concepts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602120A (Sensors and Electronic Survivability) \/ Project TS1 (Tactical Space Research) in FY20 as part of the financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Components and Systems Assessment Technology"
                                    },
                                    "Description": {
                                        "val": "This effort will fund research to conduct experiments and validate hardware and software components and models to further anchor laboratory capabilities enabling small spacecraft and payload design and development."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.15"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.15"
                                            },
                                            "Text": {
                                                "val": "Will fund research and validate software, hardware, and algorithms used to enable space-based capabilities in support of the Army?s Modernization Priorities. Will also investigate the maturity and feasibility of commercial advances and opportunities in small satellite constellation and payload management for application to future Army concepts. Will conduct experiments and validate hardware and software components and models to further anchor laboratory capabilities enabling small spacecraft and payload design and development."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602120A (Sensors and Electronic Survivability) \/ Project TS1 (Tactical Space Research) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AP4"
                    },
                    "ProjectTitle": {
                        "val": "CEMA Camouflage Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "9.716"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.716"
                        },
                        "BudgetYearTwo": {
                            "val": "9.851"
                        },
                        "BudgetYearThree": {
                            "val": "10.125"
                        },
                        "BudgetYearFour": {
                            "val": "9.976"
                        },
                        "BudgetYearFive": {
                            "val": "9.818"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "49.486"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0602705A Electronics and Electronic Devices Project:\n* Project EM8 High Power and Energy Component Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project develops and characterizes hardware and software to enable electronic spoofing and cyber deception along with inconspicuous Cyber Electromagnetic Activity (CEMA) and network operations of Army platforms and dismounts, while maintaining freedom to maneuver, communicate, and sense. This research is critical to counter near-peer ability to geo-locate our troops and put indirect fires onto our positions. \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RF\/Cyber Sensing and Deception"
                                    },
                                    "Description": {
                                        "val": "This effort develops technologies to avoid geolocation of blue force Radio Frequency (RF) emissions by peer\/near-peer adversaries. Research will focus on developing low probability of detection (LPD) communications and decoys to increase freedom of maneuver while maintaining effective communications."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.492"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.492"
                                            },
                                            "Text": {
                                                "val": "Will investigate compact antennas utilizing novel additive manufactured techniques to demonstrate wide bandwidth spectrum tuning for enabling low probability of detection communications in non-military bands; conduct experiments on passive optical-phased array (OPA) communication link based on chip-level, photonic integrated circuits; mature components for development of an active OPA for communication link studies; and investigate wideband reconfigurable transceivers, radio frequency frontend hardware, and antennas for decoy development."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602705A (Electronics and Electronic Devices) \/ Project EM8 (High Power and Energy Component Technology) in FY20 as part of the financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dynamic Intelligent Networks and Cyber Camouflage and Decoy for CEMA"
                                    },
                                    "Description": {
                                        "val": "This effort investigates techniques and develops methods for combining the physical (RF) and network (cyber) layers for enhanced effects when coupled with electromagnetic camouflage and decoy methods."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.419"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.419"
                                            },
                                            "Text": {
                                                "val": "Will design and develop flexible and adaptive methods for automated\/semi-automated active tactical cyber defense that use machine learning techniques to anticipate future activities and select the most effective response; design adaptive networking methods that leverage unconventional communication channels (e.g., lower-radio-frequencies and ultraviolet frequencies) and dynamic spectrum sensing to provide for enhancement, adaptation, and\/or balancing of energy usage, probability of detection, jamming resistance, and security; implement networking protocols in simulation and\/or hardware; and conduct experiments to develop and characterize the performance of such active cyber defense methods."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602705A (Electronics and Electronic Devices) \/ Project EM8 (High Power and Energy Component Technology) in FY20 as part of the financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Understanding, Protecting, and Enabling CEMA Effects"
                                    },
                                    "Description": {
                                        "val": "This research develops methodology and approaches to estimate and predict CEMA effects utilizing studies of the interaction of cyber and electromagnetic threats on future networks, and network-enabled systems, in a complex multi-domain operations. Abstracting, generalizing, and automating multi-domain CEMA operations including development of analysis and assessment capabilities to anticipate future threat. Live, virtual, and simulated environments will be developed to assess future networks, and network-enabled systems, to estimate the effect of CEMA technologies and discover critical vulnerabilities."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.19"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.19"
                                            },
                                            "Text": {
                                                "val": "Will develop techniques to estimate the effect of cyber and electromagnetic activities across functional layers (i.e., physical, electromagnetic, cyber, human, and operational); and study intelligent protocol learning and adaptation, automated vulnerability assessment techniques, physical-layer cyber assessment methodologies, and modeling and simulation representation of CEMA-enabled tactical scenarios."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602705A (Electronics and Electronic Devices) \/ Project EM8 (High Power and Energy Component Technology) in FY20 as part of the financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vulnerability Analysis Methodology for CEMA Threats"
                                    },
                                    "Description": {
                                        "val": "This research includes studies on threat\/target interactions to develop experimental and analytical methodology for separate and combined cyber and electromagnetic threat attack to assess vulnerabilities in a multi-domain complex environment. This research will help better support and inform Army technology and system designers, analysts, evaluators, and decision makers. Experimental and analysis methodology will be developed to investigate vulnerabilities of complex future networks with multiple communications modalities, advanced camouflage and decoy techniques in the cyber and electromagnetic areas, and advance Positioning, Navigation, and Timing (PNT) systems."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.615"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.615"
                                            },
                                            "Text": {
                                                "val": "Will study multi-domain impact analysis and experimental techniques that encompass cyber, electronic warfare, and other electromagnetic activities; investigate novel communications modalities and techniques (e.g., ultraviolet, millimeter wave, situational adaptive controllers) to develop experimental and analytical methodologies to assess and discover vulnerabilities; and research  new vulnerability assessment methodology and techniques for new, non-Global Positioning System (GPS) PNT technologies (e.g., inertial navigation technology, chip-scale atomic clocks, optical time transfer, and video-based technologies)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602705A (Electronics and Electronic Devices) \/ Project EM8 (High Power and Energy Component Technology) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AP5"
                    },
                    "ProjectTitle": {
                        "val": "Electronic Warfare Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "2.823"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.823"
                        },
                        "BudgetYearTwo": {
                            "val": "2.918"
                        },
                        "BudgetYearThree": {
                            "val": "3.015"
                        },
                        "BudgetYearFour": {
                            "val": "3.087"
                        },
                        "BudgetYearFive": {
                            "val": "3.128"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "14.971"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0602120A Sensors and Electronic Survivability:\n* Project H16 S3I Technology\nPE 0602705A Electronics and Electronic Devices\n* Project EM8 High Power and Energy Component Technology:"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates emerging technologies related to electronic warfare (EW) applications, non-kinetic survivability\/lethality, and emerging concepts of operation in the increasingly contested and congested electromagnetic environment, with the goal of enhancing the survivability\/lethality of Army platforms through electronic attack (EA), electronic warfare support (ES), and electronic protection (EP). \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Electronic Warfare Technology Research"
                                    },
                                    "Description": {
                                        "val": "This effort investigates emerging technologies related to electronic warfare (EW) applications, non-kinetic survivability\/lethality, and emerging concepts of operation in the increasingly contested and congested electromagnetic environment, with the goal of enhancing the survivability\/lethality of Army platforms through electronic attack (EA), electronic warfare support (ES), and electronic protection (EP)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.18"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.18"
                                            },
                                            "Text": {
                                                "val": "Will investigate algorithms for emitter geolocation and classification from distributed radio frequency (RF) receivers; research, design and develop spectrum sensing and channel prediction signal processing techniques to anticipate adversarial operations in congested and contested electromagnetic environments; will develop EA and EP techniques in an advanced hardware-in-the-loop complex electromagnetic environment to investigate deception and degradation of realistic threat capabilities; investigate methods to detect and identify threat emitters without a priori characterizations; and investigate techniques to determine target susceptibility to EA using feedback from ES sensors."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602120A (Sensors and Electronic Survivability) \/ Project H16 (S3I Technology) and PE 0602705A (Electronics and Electronic Devices) \/ Project EM8 (High Power and Energy Component Technology) in FY20 as part of the financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electronic Warfare Assessment Technologies"
                                    },
                                    "Description": {
                                        "val": "This research investigates emerging technologies related to EW applications (e.g., digital RF memory, software defined radios, cognitive radars) and electromagnetic-enabled cyberspace operations in the increasingly contested and congested environment. Research is focused on near-peer and future threats to enhance survivability\/lethality, and discover critical vulnerabilities, of Army technologies and systems through cyber and electromagnetic activities (CEMA)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.643"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.643"
                                            },
                                            "Text": {
                                                "val": "Will study novel electronic warfare approaches using unmanned aerial systems, software defined radios, and digital RF memory, and cyber techniques. These multi-domain technologies will be studied in advanced CEMA laboratories and anechoic chambers to develop approaches and methodology to assess technologies and systems. RF to digital signal conversion methodologies will be studied along with traffic-based modeling to reverse engineer protocols and automated digital vulnerability techniques."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602120A (Sensors and Electronic Survivability) \/ Project H16 (S3I Technology) and PE 0602705A (Electronics and Electronic Devices) \/ Project EM8 (High Power and Energy Component Technology) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AP7"
                    },
                    "ProjectTitle": {
                        "val": "Comms\/Horiz Int for Army Mod Priorities Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0.5"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.5"
                        },
                        "BudgetYearTwo": {
                            "val": "3.035"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "3.535"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0602782A Command, Control, Communications Technology:\n* Project H92 Communications Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates the communication architectures of each of the Army's modernization priorities and determines technologies and components to enable assured and resilient communications and horizontal integration. \n\nWork in this Project complements PE 0603463A (Network C3I Advanced Technology) \/ Project AP8 (Comms Supp to CSA\/Horizontal Int Fields Adv Tech)\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Communications Support to Army Modernization Priorities \/ Horizontal Integration Fields Technology"
                                    },
                                    "Description": {
                                        "val": "This project investigates the communication architectures of each of the Army?s modernization priorities and determines technologies and components to enable assured and resilient  communications."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.5"
                                            },
                                            "Text": {
                                                "val": "Will design and develop network requirements for Long Range Precision Fires (LRPF), Next Generation Combat Vehicle (NGCV), Future Vertical Lift (FVL), Air & Missile Defense (AMD), and Soldier Lethality (SL) Cross-Functional Teams (CFTs) based upon extended or new operational capabilities, and future science & technology insertions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602782A (Command, Control, Communications Technology) \/ Project H92 (Communications Technology) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "AQ2"
                    },
                    "ProjectTitle": {
                        "val": "EW Techniques Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0.5"
                        },
                        "BudgetYearThree": {
                            "val": "0.5"
                        },
                        "BudgetYearFour": {
                            "val": "0.52"
                        },
                        "BudgetYearFive": {
                            "val": "0.525"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.045"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "AQ6"
                    },
                    "ProjectTitle": {
                        "val": "Command Applications of Machine Learning Technolog"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "1.642"
                        },
                        "BudgetYearThree": {
                            "val": "3.682"
                        },
                        "BudgetYearFour": {
                            "val": "3.854"
                        },
                        "BudgetYearFive": {
                            "val": "3.897"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "13.075"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "AQ7"
                    },
                    "ProjectTitle": {
                        "val": "High Tempo Data Driven Decision Tools Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "1.407"
                        },
                        "BudgetYearThree": {
                            "val": "1.979"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "3.386"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "ProjectNumber": {
                        "val": "AQ9"
                    },
                    "ProjectTitle": {
                        "val": "Expeditionary Data to Decisions Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "2"
                        },
                        "BudgetYearOneBase": {
                            "val": "2"
                        },
                        "BudgetYearTwo": {
                            "val": "2.783"
                        },
                        "BudgetYearThree": {
                            "val": "2.896"
                        },
                        "BudgetYearFour": {
                            "val": "2.856"
                        },
                        "BudgetYearFive": {
                            "val": "2.888"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "13.423"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0602782A Command, Control and Communications Technology:\n* Project 779 Command, Control and Platform Electronics Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates, codes and designs software, and algorithms that improve Mission Command by increasing situational understanding, via the intelligent sharing of data in degraded networks during high op-tempo missions or while under cyber-attack. This Project includes researching artificial intelligence techniques to improve decision making capacity across the battlefield by using software knowledge representation to model the mission, automate staff tasks, correlate and analyze information, and provide recommendations. These capabilities allow forces to maximize op-tempo and maintain strategic advantage. \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Expeditionary Data to Decisions Technology"
                                    },
                                    "Description": {
                                        "val": "This effort researches algorithms and software that dynamically identify and arrange the most accurate, useful, and timely information from across the warfighting network to optimize commander and staff decision cycles and enable Mission Command from anywhere on the battlefield. It researches artificial intelligence techniques that provide the most relevant and available data to support time-sensitive and critical decisions, and present information in context and in alignment with complex cognitive needs."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Will identify a set of critical, time-constrained decisions that require data and information collection and analysis, map battlespace data and information to a set of important tactical decisions and identify the appropriate models for those decisions; and develop a set of initial requirements to enable the development a concept demonstrator upon effort completion."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602782A Command, Control and Communications Technology) \/ Project 779 (Command, Control and Platform Electronics Tech) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AR1"
                    },
                    "ProjectTitle": {
                        "val": "Robust, Resilient and Intelligent C3I Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "8.7"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.7"
                        },
                        "BudgetYearTwo": {
                            "val": "13.788"
                        },
                        "BudgetYearThree": {
                            "val": "14.048"
                        },
                        "BudgetYearFour": {
                            "val": "14.329"
                        },
                        "BudgetYearFive": {
                            "val": "14.489"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "65.354"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0602120A Sensors and Electronic Survivability:\n* Project H16 S3I Technology\nPE 0602783A Computer and Software Technology:\n* Project Y10 Computer\/Info Sci Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project develops and characterizes machine learning and artificial intelligence methods for processing, analysis and provisioning control of smart, distributed, networked sensors and devices. It provides situational understanding and decision support to enable fast, adaptive and interoperable C3I network-integrated applications, resilient to adversarial activity in contested and complex environments. Effective use of distributed networked sensors, autonomous agents and automated decision support tools is critical to address threats posed by peer competitors and more capable asymmetric forces, particularly in complex environments where traditional sensors provide an incomplete understanding of the tactical situation due to adversarial activity, occluded sightlines and small fields of regard. \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Intelligent Signal and Image Analytics for C3I"
                                    },
                                    "Description": {
                                        "val": "This effort designs and characterizes technologies for multi-modal (acoustic, seismic, infrasound, electric and magnetic (E\/H) field, and passive radio frequency (RF)), low-cost networked sensors to enhance persistent sensing capabilities for increased probability of target detection and reduced false alarms. These combined sensors have unique capabilities that enable detection of electrical equipment operation, underground facilities, vehicles, weapons launch, gunfire, and explosions. The work includes development of artificial intelligence (AI) and machine learning (ML) for analytics to improve situational understanding."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.344"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.344"
                                            },
                                            "Text": {
                                                "val": "Will develop very low-frequency electric- and magnetic-field sensors and arrays for electromagnetic imaging, and for power anomalies; improve hardware and software reliability for novel low-size, weight, power and cost (SWAP-C) unattended sensor applications; develop multi-functional algorithms with acoustic and seismic fusion and robust noise mitigation to detect and track diverse targets in complex environments; enhance elevation localization accuracy for Counter-Unmanned Aerial Vehicle (C-UAV) and counter-sniper applications; develop AI-enabled analytics for situational understanding, improved performance characterization, data enrichment, and domain adaptation; create synthetic data for training and algorithm development purposes; evaluate deep learning algorithms against adversarial attacks; assess and compare performance and confidence using curated multi-modal data and tools; and compare domain adaptation methods using automatically curated re-training data with off-ramp to fielded capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602120A (Sensors and Electronic Survivability) \/ Project H16 (S3I Technology) and PE 0602783A (Computer and Software Technology) \/  Project Y10 (Computer\/Info Sci Tech) in FY20 as part of the financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Smart Networks and Distributed Sensing for C3I"
                                    },
                                    "Description": {
                                        "val": "This effort will develop and assess a concept to link physical sensors and information sources to Soldiers and small units. Specifically, the research focuses on (1) multi-modal sensor fusion for detection and classification of human activities and infrastructures such as personnel, vehicles, machinery, radio frequency (RF) emissions, chemicals, and computers in hidden and confined spaces, (2) interoperability and networking of disparate sensors and information sources, (3) distributed information for decision-making, and (4) approaches for fusing results of processed outputs of multi-modal sensors, such as visible, infrared (IR), and hyperspectral imagers, and acoustic, magnetic, and electric field sensors."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.412"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.412"
                                            },
                                            "Text": {
                                                "val": "Will develop the framework for a reconfigurable network of fixed and relocatable sensors for accurate detection and tracking of hostile forces and in support of reconnaissance activities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602120A (Sensors and Electronic Survivability) \/ Project H16 (S3I Technology) and PE 0602783A (Computer and Software Technology) \/  Project Y10 (Computer\/Info Sci Tech) in FY20 as part of the financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Information Processing and Analysis"
                                    },
                                    "Description": {
                                        "val": "This effort investigates techniques that integrate local and external information sources and applies machine learning and artificial reasoning approaches to support automated intelligence analysis, command\/control, and decision making. The goal is to enable tactical users to cooperatively interact with relevant and timely tactical information supported by methods that are network-aware\/adaptive and deliver transparent and uniform transport."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.944"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.944"
                                            },
                                            "Text": {
                                                "val": "Will develop and evaluate methods for multi-modal, network-aware, ensemble machine learning and computational reasoning that enable tactical human and autonomous decision-making where there may be few or no guarantees of convergence and are amenable to adaptive learning and optimization; develop algorithms and approaches for self (e.g., self-organizing, self-managing, self-adapting, self-maintaining\/self-protecting, etc.) behaviors in heterogeneous, command and control complex-systems that facilitate interoperability, just-in-time human interactions, and that implement resilient mission command network and decision making functionality."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602120A (Sensors and Electronic Survivability) \/ Project H16 (S3I Technology) and PE 0602783A (Computer and Software Technology) \/  Project Y10 (Computer\/Info Sci Tech) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "AR3"
                    },
                    "ProjectTitle": {
                        "val": "Intelligent Environmental Battlefield Awareness"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "3.89"
                        },
                        "BudgetYearThree": {
                            "val": "3.622"
                        },
                        "BudgetYearFour": {
                            "val": "3.073"
                        },
                        "BudgetYearFive": {
                            "val": "2.135"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "12.720"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "ProjectNumber": {
                        "val": "AR5"
                    },
                    "ProjectTitle": {
                        "val": "Understanding the Environment as a Threat Technolo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "3.943"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.943"
                        },
                        "BudgetYearTwo": {
                            "val": "2.333"
                        },
                        "BudgetYearThree": {
                            "val": "1.982"
                        },
                        "BudgetYearFour": {
                            "val": "1.285"
                        },
                        "BudgetYearFive": {
                            "val": "0.981"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.524"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0602720A Environmental Quality Technology\n* Project 835 Mil Med Environ Crit\n* Project 896 Base Fac Environ Qual"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs and advances mission planning software enabling the Solider to identify, track, and plan for industrial or commercial chemical\/environmental threats. Software modules will increase capability of mission based planning technologies providing new operational routing options for mission execution with environmental threat overlays. Work supports the Common Operating Environment research effort. Research is transitioned to PE 0603463A (Network C3I Advanced Technology) \/ Project AR6 Understanding the Environment as a Threat Adv Tech. \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Engineer Research and Development Center."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Predictions of Lethal Environments\/ Computational Prediction of Threats in the Operational Environment"
                                    },
                                    "Description": {
                                        "val": "This effort delivers tools and models to the Soldier providing critical information of the operational environment allowing the Soldier to operate in, avoid, or prepare for contaminated battlefields."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.577"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.577"
                                            },
                                            "Text": {
                                                "val": "Will conduct research to provide new computational predictions that inform the Soldier on how materials interact with, move, and change in the operational environment and how to respond to contaminated battlefields."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602720A (Environmental Quality Technology) \/ Project 835 (Mil Med Environ Crit), and Project 896 (Base Fac Environ Qual) in FY20 as part of the financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Threat Overlays for Operational Routing\/Predictions of Lethal Environments"
                                    },
                                    "Description": {
                                        "val": "This effort develops tools enhancing operational route planning technologies. It will deliver a new capability informing the Solider of the risks associated with physical landscape, chemical exposure, and biological threats lethal to personnel and disruptive to equipment. Tools will support route planning and soldier mobility within a complex urban environment."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.366"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.366"
                                            },
                                            "Text": {
                                                "val": "Will develop models and algorithms needed for software to define potential hazards and the affects to Solider mobility. Software will model chemical and biological threats associated with Outside Continental United States (OCONUS) soil and landscape behavior within an urbanized operational environment. Relevant urban chemical and biological risk information will inform models."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602720A (Environmental Quality Technology) \/ Project 835 (Mil Med Environ Crit), and Project 896 (Base Fac Environ Qual) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "AR7"
                    },
                    "ProjectTitle": {
                        "val": "Sensing in Contested Environments Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "1.202"
                        },
                        "BudgetYearThree": {
                            "val": "1.208"
                        },
                        "BudgetYearFour": {
                            "val": "0.986"
                        },
                        "BudgetYearFive": {
                            "val": "0.997"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.393"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "ProjectNumber": {
                        "val": "AR9"
                    },
                    "ProjectTitle": {
                        "val": "Persistent Geophysical Sensing-Infrasound Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "3.963"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.963"
                        },
                        "BudgetYearTwo": {
                            "val": "4.343"
                        },
                        "BudgetYearThree": {
                            "val": "3.459"
                        },
                        "BudgetYearFour": {
                            "val": "2.5"
                        },
                        "BudgetYearFive": {
                            "val": "2.279"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "16.544"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0602784A Military Engineering Technology:\n* Project T40 Mob\/Wpns Eff Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs and develops algorithms, software, and hardware components to enable near-real-time battlespace awareness to persistently monitor (through non-line-of-sight sensing including infrasound) critical infrastructure conditions and threat activities in dynamic battlefields. These technologies provide near real time data collection, processing, and alerts of infrastructure go\/no-go condition required for maneuver planning. This project also designs and develops methodologies to assign maneuver relevant engineering attributes to geospatial feature data such as bridge load classification, road condition, and bathymetry. \n\nWork in this Project complements PE 0603463A (Network C3I Advanced Technology) \/Project AS9 (Persistent Geophysical Sensing-Infrasound Tech Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project is performed by the United States Army Engineer Research and Development Center."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Remote Assessment of Infrastructure for Ensured Maneuver (RAFTER)"
                                    },
                                    "Description": {
                                        "val": "This effort develops parameters for a suite of geophysical and geosensing technologies to persistently assess infrastructure capability and condition for large areas including urban terrain; develops complex terrain, topography, and meteorological models related to acoustic propagation detected by the sensor suite, as well as signal processing algorithms for detection and classification of transportation infrastructure."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.963"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.963"
                                            },
                                            "Text": {
                                                "val": "Will develop and refine algorithms associated with infrasound data processing for infrastructure monitoring as well as the urban, terrain, topographical, and meteorological models that feed into the analysis."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from 0602784A (Military Engineering Technology) \/ Project T40 (Mob\/Wpns Eff Tech) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AT2"
                    },
                    "ProjectTitle": {
                        "val": "Subterranean Detection and Monitoring Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "1.6"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.6"
                        },
                        "BudgetYearTwo": {
                            "val": "3.65"
                        },
                        "BudgetYearThree": {
                            "val": "1.278"
                        },
                        "BudgetYearFour": {
                            "val": "1.05"
                        },
                        "BudgetYearFive": {
                            "val": "1.437"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "9.015"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0602784A Military Engineering Technology:\n* Project T40 Mob\/Wpns Eff Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs and develops an integrated suite of tunnel detection, subterranean monitoring solutions, and vulnerability assessment technologies to detect, identify, and monitor subterranean threat activities in urban environments through advanced sensing and rapid analysis capabilities. This Project also develops and investigates enhanced technologies to detect tunnels and tunneling activity in complex and varied environments. \n\nWork in this Project complements PE 0603463A (Network C3I Advanced Technology \/ Project AT3 (Subterranean Detection and Monitoring Adv Tech).\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus area and the Army Modernization Strategy.\n\nWork in this Project is conducted at the United States Army Engineer Research and Development Center."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Subterranean Threat Assessment by Real-time Sensing"
                                    },
                                    "Description": {
                                        "val": "This effort designs and develops an integrated suite of tunnel detection and persistent surveillance technologies to detect, track, and identify subsurface activities; expedient underground municipal infrastructure detection system; urban source characterization and modeling algorithms; expedient void detection systems in urban areas, and vulnerability assessment tools for the urban subterranean domain. This effort is coordinated with PE 0603463A."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.6"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.6"
                                            },
                                            "Text": {
                                                "val": "Will design and develop a rapidly deployable passive seismic sensor system to detect subterranean activities of interest; mature electromagnetic induction transmitter component designs; and continue to investigate and conduct experiments on sensor coupling."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602784 (Military Engineering Technology) \/ Project T40 (Mob\/Wpns Eff Tech) FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "AT4"
                    },
                    "ProjectTitle": {
                        "val": "GeoINT - OPS Merge Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "6.096"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "6.096"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "ProjectNumber": {
                        "val": "AT7"
                    },
                    "ProjectTitle": {
                        "val": "Network-Enabled GeoSpatial-GEOINT Services Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "2.992"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.992"
                        },
                        "BudgetYearTwo": {
                            "val": "3.011"
                        },
                        "BudgetYearThree": {
                            "val": "2.446"
                        },
                        "BudgetYearFour": {
                            "val": "2"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.449"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0602784A Military Engineering Technology:\n* Project 855 Topographical, Image Intel & Space\n* Project T42 Terrestrial Science Applied Research"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and develops a revolutionary, integrated capability to rapidly share mission critical 3-dimensional (3D) information that supports planning and execution at the Soldier level. This will be achieved through the maturation of next-generation geospatial analytical models for 3D complex urban environment data, delivering enriched understanding of dynamic Operational Environments and distributed to a tactical Common Operating Environment. This effort will result in improved situational awareness and autonomy at low echelons, contributing to increased maneuver and mobility during manned and unmanned teaming operations. \n\nWork in this Project complements PE 0603463A (Network C3I Advanced Technology) \/ Project AT8 (Network-Enabled GeoSpatial and GEOINT Services AdvTech).\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Engineer Research and Development Center (ERDC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Geo-registration, Analytical Tool Development and Visualization"
                                    },
                                    "Description": {
                                        "val": "This research investigates the design and formulation of new urban terrain data models, frameworks and processes to automate the geo-registration of 3D and 2D source data (e.g. LiDAR, imagery, Open Street Maps, and full motion video derived data) to new model constructs for rapid alerting to changes in the Operational Environment of interest."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.992"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.992"
                                            },
                                            "Text": {
                                                "val": "Will investigate and compare software for accurately aligning 3D and 2D sources together, then adapt and\/or develop new software to fully automate the alignment of these geospatial sources to maximize their utility for automated extractions and change detection alerting within the Operational Environment.  Will initiate the design of an advanced 3D data processing framework meeting criteria for transformation of point cloud data to compact feature data models, 3D-data indexing and transmission algorithms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort is realigned from PE 0602784A (0602784A Military Engineering Technology) \/ Project 855 (Topographical, Image Intel & Space) and Project T42 (Terrestrial Science Applied Research) FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AT9"
                    },
                    "ProjectTitle": {
                        "val": "Tactical GeoSpatial Information Capabilities Techn"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "2.771"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.771"
                        },
                        "BudgetYearTwo": {
                            "val": "4.244"
                        },
                        "BudgetYearThree": {
                            "val": "1.8"
                        },
                        "BudgetYearFour": {
                            "val": "1.78"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.595"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\n* PE0602784A\/Project 855"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and develops next generation geospatial analytical tools for 3D complex environments for low echelon and tactical edge exploitation. Research focuses on improving geospatial and Geospatial Intelligence (GEOINT) aspects of situational awareness at the tactical edge in the complex environment by exploiting new data sources, automating analytical tasks, and testing new collection technologies, including interiors of infrastructure. Research develops capabilities to enhance\/update provisioned (baseline) standard, sharable, geospatial foundation (SSGF) data through automated analytics on multi-sourced spatial data resulting in streamlined, enhanced high fidelity terrain analysis products. Reducing data gaps and processing timelines will greatly increase Soldier situational awareness and support faster decision making in complex terrain. \n\nWork in this Project complements PE 0603463A 9Network C3I Advanced Technology) \/ Project AU1 (Tactical GeoSpatial Information Capabilities ATech).\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Engineer Research and Development Center (ERDC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "3D Terrain Analysis"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops software models and workflows provisioned on the geospatial and GEOINT workstations for improved capabilities to generate, process and exploit terrain products enabling situational awareness and rapid decision making at the tactical edge."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.33"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.33"
                                            },
                                            "Text": {
                                                "val": "Will investigate and build DCGS-A compatible workflows that provision remotely sensed tactical data exploitation and conflation for geospatial and GEOINT workstations, enabling enhanced situational awareness and rapid decision making."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort is realigned from PE 0602784A (0602784A Military Engineering Technology) \/ Project 855 Topographical, Image Intel & Space as part of the financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Airborne LiDAR"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops enhanced Geiger-mode LiDAR hardware\/software, for advanced testing of protocols, equipment, and products for improved high-altitude\/wide area terrain data collection, to support tactical operations."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.441"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.441"
                                            },
                                            "Text": {
                                                "val": "Will investigate new Geiger-mode LiDAR sensor payload components, for increasing performance and speed of collection and processing, for more realistic portrayal of multi-domain environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort is realigned from PE 0602784A (0602784A Military Engineering Technology) \/ Project 855 Topographical, Image Intel & Space as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AU3"
                    },
                    "ProjectTitle": {
                        "val": "Geospatially Enabled Operational Design Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "3.173"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.173"
                        },
                        "BudgetYearTwo": {
                            "val": "3.468"
                        },
                        "BudgetYearThree": {
                            "val": "2.803"
                        },
                        "BudgetYearFour": {
                            "val": "1.2"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.644"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0602784A Military Engineering Technology:\n* Project 855 Topographical, Image Intel & Space"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates, advances and develops a geospatially enabled collaborative planning environment, accessible across echelons, with capabilities that support Army Design Methodology (ADM) by providing the ability to perform conceptual planning and problem framing, supporting a greater understanding and visualization of the dynamic operational environment, a shared understanding of the operations purpose across echelons, and enhanced products to drive detailed planning (Military Decision Making Process - MDMP) and the operational assessment process, enhancing the collaborative interaction between commanders, staffs, and unified action partners. \n\nWork in this Project complements PE 0603463A (Network C3I Advanced Technology) \/Project AU4 (Geospatially Enabled Operational Design Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Engineer Research and Development Center (ERDC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Virtual Collaborative Operational Design"
                                    },
                                    "Description": {
                                        "val": "This effort investigates automation technologies to digitally visualize, create and assess critical elements of the Operational Environment required to inform the Operational Design functions, including collaborative conceptual framing of the problem by examining the differences between the current state of an operational environment and the desired end state."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.773"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.773"
                                            },
                                            "Text": {
                                                "val": "Will research methodologies and tools to support Army Design Methodology (ADM) using digital collaboration tools to frame the problem and visualize the desired end state in a geospatial context."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort is realigned from PE0602784A (Military Engineering Technology) \/ Project 855 (Topographical, Image Intel & Space) in FY20 as part of the financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Data Analysis and Visualization"
                                    },
                                    "Description": {
                                        "val": "This effort develops a suite of data aggregation analysis and visualization capabilities allowing commanders and staffs the capability to bridge conceptual planning (ADM) to deliberate planning Military Decision Making Process (MDMP) at echelons down to battalion."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.4"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.4"
                                            },
                                            "Text": {
                                                "val": "Will develop capabilities to geospatially enable strategic guidance inputs to operational design, in a digital, integrated, collaborative planning environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort is realigned from PE0602784A (Military Engineering Technology) \/ Project 855 (Topographical, Image Intel & Space) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AU5"
                    },
                    "ProjectTitle": {
                        "val": "Automated Analytics for Operational Environment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "3.95"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.95"
                        },
                        "BudgetYearTwo": {
                            "val": "3.242"
                        },
                        "BudgetYearThree": {
                            "val": "3.261"
                        },
                        "BudgetYearFour": {
                            "val": "1.034"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "11.487"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0602784A Military Engineering Technology:\n* Project 855 Topographical, Image Intel & Space"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates, advances and develops algorithms for automated extraction of relationships between the population and the operational environment. Linking the data points across multiple domains to include patterns of life will result a greater understanding of the operational environment enabling the Mission Analysis phase of detailed planning (Military Decision Making Process) Work supports the Common Operating Environment research effort.  Research is transitioned to PE 0603463A (Network C3I Advanced Technology) Project AU6 (Automated Analytics for Operational Environment) Advanced Technology.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Army Engineer Research and Development Center."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Simultaneous Multi-Domain Data Representation"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops advanced capabilities to provide commanders and staffs with the ability to understand and operate in multiple domains simultaneously, by proposing and validating new data models and encoding for threat actors and actions, and operational environment characterization optimized across multiple domains in the battlespace, and represented geospatially."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.844"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.844"
                                            },
                                            "Text": {
                                                "val": "Will investigate spatio-temporally coherent multi-domain data representations that capture explicit and implicit relationships between threat actors distilled from raw text content data; and develop a flexible suite of geospatial methods and algorithms for processing and correlating heterogeneous data streams generated from multiple domains using feature signatures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort is realigned from PE 0602784A (Military Engineering Technology) \/ Project 855 (Topographical, Image Intel & Space) in FY20 as part of the financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Automated Analysis of Multi-Domain Data"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops data models to support automated understanding and analysis and advanced relevancy ranking approaches to identify and prioritize knowledge gaps and contextualized results."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.106"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.106"
                                            },
                                            "Text": {
                                                "val": "Will investigate algorithms for automated threat pattern and non-threat categorization, and changes to the operational environment that may be revealed across multiple diverse data sources."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort is realigned from PE 0602784A (Military Engineering Technology) \/ Project 855 (Topographical, Image Intel & Space) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "AU7"
                    },
                    "ProjectTitle": {
                        "val": "GEOInt\/Ops Integration for Multi-echelon Orders"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "4.012"
                        },
                        "BudgetYearFive": {
                            "val": "4.058"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "8.070"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "AU9"
                    },
                    "ProjectTitle": {
                        "val": "GEOInt\/Ops Logistics Integration-Planning Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "2.28"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.280"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "AV3"
                    },
                    "ProjectTitle": {
                        "val": "Foundational S&T for Network C3I Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "1.929"
                        },
                        "BudgetYearThree": {
                            "val": "1.97"
                        },
                        "BudgetYearFour": {
                            "val": "2.103"
                        },
                        "BudgetYearFive": {
                            "val": "2.21"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "8.212"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "ProjectNumber": {
                        "val": "AV5"
                    },
                    "ProjectTitle": {
                        "val": "Protective Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "6.8"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.8"
                        },
                        "BudgetYearTwo": {
                            "val": "7.7"
                        },
                        "BudgetYearThree": {
                            "val": "7.846"
                        },
                        "BudgetYearFour": {
                            "val": "6.449"
                        },
                        "BudgetYearFive": {
                            "val": "6.521"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "35.316"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0602705A Electronics and Electronic Devices:\n* Project H94 Elect & Electronic Devices"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project develops tools, devices, and techniques to protect acquisition program systems and Critical Program Information (CPI) from adversarial threats. \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Protective Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort develops tools, devices, and techniques to protect acquisition program systems and Critical Program Information (CPI) from adversarial threats."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.8"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.8"
                                            },
                                            "Text": {
                                                "val": "Will integrate threat-based sensors and enhance secure processor intellectual property (IP) for enhanced Rigor 1b second engineering model; manufacture full Rigor 1a engineering models; complete laboratory characterization of Rigor 1a module; and will develop the designs for Rigor 1c and Rigor 1d modules."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602705A (0602705A Electronics and Electronic Devices) \/ Project H94 (Elect & Electronic Devices) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AV6"
                    },
                    "ProjectTitle": {
                        "val": "Airborne Engineering Support Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0.882"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.882"
                        },
                        "BudgetYearTwo": {
                            "val": "0.9"
                        },
                        "BudgetYearThree": {
                            "val": "0.918"
                        },
                        "BudgetYearFour": {
                            "val": "0.936"
                        },
                        "BudgetYearFive": {
                            "val": "0.947"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.583"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0602782A Command, Control, Communications Technology:\n* Project 779 Command, Control and Platform Electronics Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project supports advanced Command, Control, Communications, Intelligence, Surveillance and Reconnaissance (C3ISR) research and development technologies for airborne, and air-to-ground based testing of emerging Radio Frequency (RF) technologies.   \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Airborne Engineering Support Technology"
                                    },
                                    "Description": {
                                        "val": "This effort supports the demonstration of new and emerging C3ISR technologies. This venue performs technology assessments by evaluating candidate technologies in support of the Army Modernization Priorities.  Demonstration events are determined by the maturity of the tech base programs across the Army?s S&T command, control, communications, intelligence, surveillance and reconnaissance (C3ISR) portfolio."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.882"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.882"
                                            },
                                            "Text": {
                                                "val": "Will investigate and provide early performance feedback to S&T efforts that are developing technologies to provide robust and adaptive intelligence, electronic support, and electronic warfare capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort is realigned from PE 0602782A (Command, Control, Communications Technology \/ Project 779 (Command, Control and Platform Electronics Tech) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AV7"
                    },
                    "ProjectTitle": {
                        "val": "Atmospheric Modeling and Meterological Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "5.812"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.812"
                        },
                        "BudgetYearTwo": {
                            "val": "5.95"
                        },
                        "BudgetYearThree": {
                            "val": "6.07"
                        },
                        "BudgetYearFour": {
                            "val": "6.192"
                        },
                        "BudgetYearFive": {
                            "val": "6.261"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "30.285"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0602784 Military Engineering Technology:\n* Project H71 Meteorological Research for Battle Command"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project develops tactical atmospheric sensing, modeling, and decision support technologies. New atmospheric sensing technologies are developed that enable near-real-time, high-resolution measurements of atmospheric parameters via light-weight systems that can be employed in tactical domains. Efforts include high-resolution local assessments and forecasts of meteorological conditions that can accommodate the effects of dense urban and complex, mountainous terrain. Both physics-based and rule-based decision support systems are developed for assessing the impacts of weather\/atmosphere across a spectrum of friendly and threat weapons systems, sensors, platforms, and operations. It provides detailed model applications for various effects of the atmosphere on electro-optical and acoustic target detection, location, and identification. Information can be applied to mission planning and execution; battlefield visualization; reconnaissance, surveillance, and target acquisition, route planning to maximize stealth and efficiency, web-enabled tactical decision aids, long-range precision fires; and modeling of environmental impacts for combat simulations and war games\n\nThis work provides technologies for evaluation by and\/or transitions to the Department of Defense weather and operations community including: Program Executive Office (PEO) Ammunition-PM Combat Ammunition Systems (CAS) and Marine Corps Systems Command (MCSC) for meteorological message input to field artillery targeting systems; Project Manager, Distributed Common Ground System-Army (DCGS-A); the US Air Force 557th Weather Wing and the Air Force Life Cycle Management Center (AFLCMC) to improve their operational weather support to the Army.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Atmospheric Characterization, Modeling, and Impacts"
                                    },
                                    "Description": {
                                        "val": "This effort develops environmental situational understanding enabled though coupled sensing, modeling, and decision support technologies for data-sparse, computationally-limited, and network-constrained domains."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.812"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.812"
                                            },
                                            "Text": {
                                                "val": "Will apply stochastic collocation methods to Weather Running Estimate ? Nowcast (WRE-N) and Atmospheric Boundary Layer Environment (ABLE) model simulations over the Meteorological Sensor Array (MSA) region in and adjacent to White Sands Missile Range, NM, to compute quantitative forecast uncertainty metrics, improve risk understanding (or management), and increase decisiveness; examine model uncertainty and optimize WRE-N physics configurations over diverse geographic settings; update model algorithms to enable efficient operations on mobile computing architectures supporting decide-faster scenarios; demonstrate upgraded model operation in complex terrain domains for improved targeting for long range fires; enhance atmospheric impacts decision aids for ground and air maneuver including strategic-level solutions (e.g. climatology data inputs), route optimization (i.e., including environmental variables and urban area buildings), assessing autonomous systems at the Dense Urban Environment (DUE) MSA testbed, implementing fuel consumption computations along a mission route, characterizing atmospheric hazards for airfields; and develop techniques to implement environmental inputs into a next-generation acoustic propagation decision support tool to support threat detection."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602784 (Military Engineering Technology) \/ Project H71 (Meteorological Research for Battle Command) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AV9"
                    },
                    "ProjectTitle": {
                        "val": "Advanced PNT for GPS Independent Environments Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "6.974"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.974"
                        },
                        "BudgetYearTwo": {
                            "val": "6.662"
                        },
                        "BudgetYearThree": {
                            "val": "6.838"
                        },
                        "BudgetYearFour": {
                            "val": "8.743"
                        },
                        "BudgetYearFive": {
                            "val": "8.841"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "38.058"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0602705 Electronics and Electronic Devices:\n* Project H94 Elect & Electronic Dev"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project develops technologies that will enable precise and assured Positioning, Navigation and Timing (PNT) in Global Positioning System (GPS)-denied environments.  This research addresses the PNT Scenarios 1 (GPS operations that start good and have good GPS signals throughout the mission duration) through Scenario 3 (GPS operations have 'bad' or limited availability of GPS signals throughout the entire mission).  This is achieved with research addressing the ability to transmit jam-resistant, precision timing synchronized signals using optical fibers, free-space using lasers, and in the RF domain using innovative radio frequency (RF) antenna concepts to extend the reach of Soldier compatible capabilities in heavily contested GPS environments.   \n\nThis Project also develops technologies addressing the PNT's toughest Scenario - Scenario 4 (no available GPS signal during the mission duration) with a goal of enabling Soldier missions of up to 7 days in a GPS denied environment.  This conducts research in advanced quantum timing circuits, advanced inertial measurement unit (IMU) components, multi-sensor modalities, perception techniques, geolocation data, vision aided navigation sensors, and available RF signals.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Precision Measurement Technology for Contested Environments"
                                    },
                                    "Description": {
                                        "val": "This effort will develop technologies that will enable precise and assured PNT in GPS-denied environments for up to 1 hour. This research will improve the accuracy while also focusing on size, weight, power, cost (SWAP-C) of current micro-Inertial Measurement Units (IMUs) through the design, fabrication, and testing of novel micro-electromechanical system (MEMS) sensor designs and materials and the integration of multiple sensor modalities with the IMUs using sensor fusion and perception techniques to reduce drift and increase positional accuracy. Research will also include the ability to transmit jam-resistant precision position, navigation, and timing signals via electro-optical and\/or RF transmission methods."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.057"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.057"
                                            },
                                            "Text": {
                                                "val": "Will refine modeling designs for novel MEMS IMU using advanced MEMS materials, cavity designs, and micro-structures; fabricate and evaluate micro-structures demonstrating improved MEMS IMU accuracy; refine algorithms enabling vision-based geolocalization, and demonstrate impact of drift correction techniques on the performance of MEMS IMU operations in representative operational environments (temperature and vibration); and fabricate and evaluate core components, techniques, and methods for chip-scale fiber combs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602705 (Electronics and Electronic Devices) \/ Project H94 (Elect & Electronic Dev) in FY20 as part of the financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Quantum Effects for Assured PNT in Zero-GPS Environments"
                                    },
                                    "Description": {
                                        "val": "This effort will conduct research on SWAP-C quantum based timing sub-systems, incorporating advanced sensors, RF signals (beyond GPS), navigation databases, and advanced algorithms. This effort incorporates advanced quantum timing circuits, advanced IMU components, multi-sensor modalities, perception techniques, geolocation data, vision aided navigation sensors, and available RF signals in order to increase precise and assured PNT operations in a GPS ? denied environments for up to 7 days."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.917"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.917"
                                            },
                                            "Text": {
                                                "val": "Will refine quantum based timing designs (e.g., materials, cavity, integrated optical coupling) with modeled performance and representative operational environments (temperature and vibration); develop and evaluate a laboratory quantum based timing design compatible blue laser (blue laser required for full functionality of the quantum timing operations); develop designs and methods for chip-scale, integrated opto-electronic controls for SWaP-C constrained quantum based timing methods; develop an embedded hybrid multi-sensor fusion engine with continuous Inertial Navigation System (INS) calibration; and develop an integrated, multi-modal, inertial navigation capability to evaluate the multi-sensor fusion engine and perform continuous INS calibration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602705 (Electronics and Electronic Devices) \/ Project H94 (Elect & Electronic Dev) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AW1"
                    },
                    "ProjectTitle": {
                        "val": "Autonomous Navigation Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0.4"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.4"
                        },
                        "BudgetYearTwo": {
                            "val": "0.3"
                        },
                        "BudgetYearThree": {
                            "val": "0.3"
                        },
                        "BudgetYearFour": {
                            "val": "0.3"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.300"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0602782A Command, Control, Communications Technology:\n* Project 779 Command, Control and Platform Electronics Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates use of sensors on the platform and available navigation signals to the localization and decision making of Robotic\/Autonomous Systems. Additionally, it examines the use of machine learning algorithms for cooperative navigation to aid in a Positioning, Navigation and Timing (PNT) solution. This will enable the user to achieve operational overmatch in a Global Positioning System (GPS) impeded environment as well as enhanced navigation (reducing dependence on GPS) through challenging terrains.\n\nWork in this Project complements PE060343A (Network C3I Advanced Technology) \/ Project AW2 (Autonomous Navigation Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Autonomous Navigation Technology"
                                    },
                                    "Description": {
                                        "val": "This effort leverages Assured PNT efforts that improve localization and decision making of Robotic\/Autonomous Systems by optimizing use of sensors on the platform and taking advantage of all available navigation signals. It examines the use of machine learning algorithms for cooperative navigation to aid in a PNT solution. Work accomplished under PE 0603463A\/Project AW2 (Autonomous Navigation Advanced Technology) complements this effort."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.4"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.4"
                                            },
                                            "Text": {
                                                "val": "Will develop and evaluate a ground vehicle navigation algorithm based on unmanned aerial vehicle (UAV) imagery data for the localization and heading estimation of unmanned ground vehicles (UGVs). Will develop and investigate alternative methods of UAV-based ground vehicle identification utilizing fiducial markers and deep learning algorithms. Will investigate and validate methodologies to combine UGV localization and identification algorithms through simulation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602782A (Command, Control, Communications Technology) \/ Project 779 (Command, Control and Platform Electronics Tech) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AW3"
                    },
                    "ProjectTitle": {
                        "val": "DoD PNT M&S Collaborative Initiative (CI) Technolo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "2"
                        },
                        "BudgetYearOneBase": {
                            "val": "2"
                        },
                        "BudgetYearTwo": {
                            "val": "2"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0602782A Command, Control, Communications Technology:\n* Project 779 Command, Control and Platform Electronics Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs and develops Positioning, Navigation and Timing (PNT) modeling and simulation (M&S) frameworks and tools to provide Department of Defense (DoD) with the capability to conduct analysis and create quantifiable data on the impact of PNT technologies on warfighters and missions operating in a denied or degraded Global Positioning System (GPS) environment. Additionally, it provides senior leadership with the information required to understand the value of PNT investment versus the improvement in mission performance and operational effectiveness. This Project also assess the effectiveness and maturity of complementary PNT systems\/sensors.\n\nWork in this Project complements PE 0603463 (Network C3I Advanced Technology) \/ Project AW4 (DoD PNT M&S Collaborative Initiative Adv Tech).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DoD PNT M&S Collaborative Initiative (CI)"
                                    },
                                    "Description": {
                                        "val": "This effort designs and develops PNT M&S frameworks and tools to provide DoD with the capability to conduct analysis and create quantifiable data on the impact of PNT technologies on warfighters and missions operating in a denied or degraded GPS environment. Additionally, it provides Senior leadership with the information required to understand the value of PNT investment versus the improvement in mission performance and operational effectiveness. This effort also assess the effectiveness and maturity of complementary PNT systems\/sensors. Work accomplished under PE 0603463A\/Project AW4 (DoD PNT M&S Collaborative Initiative Advanced Technology) complements this effort."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Will design and develop an architecture, framework, catalogue, repository and models for complementary PNT technologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602782A (Command, Control, Communications Technology) \/ Project 779 (Command, Control and Platform Electronics Tech) in FY20 as part of the financial restructure.."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AW5"
                    },
                    "ProjectTitle": {
                        "val": "Modular GPS Independent Sensors Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "4.14"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.14"
                        },
                        "BudgetYearTwo": {
                            "val": "4.334"
                        },
                        "BudgetYearThree": {
                            "val": "4.432"
                        },
                        "BudgetYearFour": {
                            "val": "4.527"
                        },
                        "BudgetYearFive": {
                            "val": "4.881"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "22.314"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0602782A Command, Control, Communications Technology:\n* Project 779 Command, Control and Platform Electronics Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project performs research and development of modular Global Positioning System (GPS)-independent sensors and an open architecture sensor fusion core enabling simple, plug-and-play sensor modules that can be tailored for any platform based on mission needs and requirements.\n\nWork in this Project complements PE 0603463A (Network C3I Advanced Technology) \/ Project AW6 (Modular GPS Independent Sensors Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Modular GPS Independent Sensors"
                                    },
                                    "Description": {
                                        "val": "This effort performs research and development of modular GPS-independent sensors and an open architecture sensor fusion core enabling simple, plug-and-play sensor modules that can be tailored for any platform based on mission needs and requirements. Work accomplished under PE 0603463A\/Project AW6 (Modular GPS Independent Sensors Advanced Technology) complements this effort."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.14"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.14"
                                            },
                                            "Text": {
                                                "val": "Will continue to develop Quad Mass Gyro Inertial Measurement Units and investigate Infrared Vision Sensors for use in PNT solutions. Will develop a PNT sensor fusion core and sensor fusion modules; Will develop algorithms for PNT integrity. Will design a PNT Software Defined Receiver; Will investigate other existing sensors to be used in a PNT solution."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602782A (Command, Control, Communications Technology) \/ Project 779 (Command, Control and Platform Electronics Tech) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}