{
    "id": "2020-Army-PB-2040-JBOOK-bbfb861aa2459c788128b03572c321536da98358a56d59849bf889b375dfd80d-6",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603007A"
        },
        "ProgramElementTitle": {
            "val": "Manpower, Personnel and Training Advanced Technology"
        },
        "R1LineNumber": {
            "val": "47"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "5.063"
            },
            "CurrentYear": {
                "val": "8.038"
            },
            "BudgetYearOne": {
                "val": "11.038"
            },
            "BudgetYearOneBase": {
                "val": "11.038"
            },
            "BudgetYearTwo": {
                "val": "11.189"
            },
            "BudgetYearThree": {
                "val": "14.758"
            },
            "BudgetYearFour": {
                "val": "16.054"
            },
            "BudgetYearFive": {
                "val": "16.36"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "82.500"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures and validates applied behavioral and social science technologies that enhance the Soldier Lifecycle (e.g., selection, assignment, training, leader development) and human relations (e.g. unit cohesion). These technologies provide advanced personnel measures that more fully assess potential and predict performance, behavior, attitudes, and resilience. These technologies also provide innovative and effective Talent Management methods to optimize individual and team performance to ensure the Army can meet mission requirements in uncertain and complex environments. This PE evaluates new selection measures, assignment methods, and performance metrics for individuals and units, assesses innovative training methods, and conducts scientific assessments to inform Human Capital policy and programs. Work in this PE will result in effective non-materiel solutions to help the Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints.\n\nWork in this PE complements and is fully coordinated with PE 0602785A (Manpower\/Personnel\/Training Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, the Army Vision, the Army's Talent Management Strategy, and the Army Modernization Strategy\n\nWork in this PE is performed by the U.S. Army Research Institute (ARI) for the Behavioral and Social Sciences in Ft. Belvoir, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "6.466"
                },
                "CurrentYear": {
                    "val": "8.044"
                },
                "BudgetYearOne": {
                    "val": "12.632"
                },
                "BudgetYearOneBase": {
                    "val": "12.632"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.063"
                },
                "CurrentYear": {
                    "val": "8.038"
                },
                "BudgetYearOne": {
                    "val": "11.038"
                },
                "BudgetYearOneBase": {
                    "val": "11.038"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.403"
                },
                "CurrentYear": {
                    "val": "-0.006"
                },
                "BudgetYearOne": {
                    "val": "-1.594"
                },
                "BudgetYearOneBase": {
                    "val": "-1.594"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.003"
                    },
                    "CurrentYear": {
                        "val": "-0.006"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.26"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.14"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.594"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.594"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY 2020, funding reduction aligns program requirements to Army Modernization priorities in support of the National Defense Strategy."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "792"
                    },
                    "ProjectTitle": {
                        "val": "Personnel Performance & Training"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.063"
                        },
                        "CurrentYear": {
                            "val": "8.038"
                        },
                        "BudgetYearOne": {
                            "val": "11.038"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.038"
                        },
                        "BudgetYearTwo": {
                            "val": "11.189"
                        },
                        "BudgetYearThree": {
                            "val": "14.758"
                        },
                        "BudgetYearFour": {
                            "val": "16.054"
                        },
                        "BudgetYearFive": {
                            "val": "16.36"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "82.500"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and validates applied behavioral and social science technologies that enhance the Soldier Lifecycle (e.g., selection, assignment, training, leader development) and human relations (e.g., unit cohesion). These technologies provide advanced personnel measures that more fully assess potential and predict performance, behavior, attitudes, and resilience. These technologies also provide innovative and effective Talent Management methods to optimize individual and team performance to ensure the Army can meet mission requirements in uncertain and complex environments. This Project evaluates new selection measures, assignment methods, and performance metrics for individuals and units, assesses innovative training methods, and conducts scientific assessments to inform Human Capital policy and programs. Work in this Project will result in effective non-materiel solutions to help the Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering  priority focus areas, the Army Vision, the Army's Talent Management Strategy, and the Army Modernization Strategy.\n\nWork in this Project is performed by the U.S. Army Research Institute (ARI) for the Behavioral and Social Sciences in Ft. Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Talent Assessment and Development"
                                    },
                                    "Description": {
                                        "val": "Previously titled ?Talent Management\",? this effort refines and assesses innovative talent management approaches to provide the Army the flexibility to adapt to changes in force structure and recruiting environments. This effort validates Soldier selection measures, techniques, and tools to more fully assess Soldier potential and better predict behavior, attrition, and performance. This effort also matures and validates methods to develop and model Soldier talents\/competencies longitudinally across a career."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.04"
                                            },
                                            "Text": {
                                                "val": "Validated competency model (i.e., a collection of competencies that together define successful performance in a particular work setting) of critical military occupations (e.g., cyber operations for more flexible personnel management of enlisted Soldiers)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.452"
                                            },
                                            "Text": {
                                                "val": "Demonstrate differential prediction of cognitive and non-cognitive abilities among Military Occupational Specialty clusters for incorporation into the assignment process to support forecasting of future talent management and human performance needs in near-peer operational environments; provide research to assess the validity of integrated personnel assessments augmented with archival human capital data; provide research to empirically validate instructional approaches to prepare instructors\/trainers to train complex skills required for emerging high-tempo operational environments that necessitate decisive and timely decision making (e.g., dense urban and distributed units)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.038"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.038"
                                            },
                                            "Text": {
                                                "val": "Will validate expanded screening tools to more comprehensively identify high-potential and high-risk individuals; will validate Leader and advisor competency-assessment methods; will mature assessment models augmented with archival human capital data."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Research into Talent Assessment and Development is being accelerated in support of the National Defense Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unit Performance and Cohesion"
                                    },
                                    "Description": {
                                        "val": "Previously titled ?Personnel Readiness, Performance, and Conduct,? this effort will mature and refine measures and methods to ensure cohesive, high performing teams for future operational environments. This effort will mature and assess methods to optimize team composition to enhance unit performance, methods to rapidly build and sustain team cohesion, and metrics and assessments of unit performance, command climate, unit resilience, and cohesion."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.023"
                                            },
                                            "Text": {
                                                "val": "Validated integrated holistic assessment that leverages existing personnel data (i.e., integrated measures collected across the Soldier Lifecycle that feeds holistic assessments and predictive models of behaviors, performance, and outcomes); demonstrated the effectiveness of strategies to optimize individual training performance (e.g., deliver prototype training tool to enhance air defense launch control crewmembers? fire control decision-making)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.385"
                                            },
                                            "Text": {
                                                "val": "Refine measures of collective performance in combat training exercises."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Work in this effort ends in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.201"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}