{
    "id": "2020-Army-PB-2040-JBOOK-8fe49b4c986f6d8357230baf1ceec92b6131841a97e0b6b68e62a85179b80ae2-4",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA1-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601121A"
        },
        "ProgramElementTitle": {
            "val": "Cyber Collaborative Research Alliance"
        },
        "R1LineNumber": {
            "val": "5"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "4.982"
            },
            "BudgetYearOneBase": {
                "val": "4.982"
            },
            "BudgetYearTwo": {
                "val": "5.082"
            },
            "BudgetYearThree": {
                "val": "5.186"
            },
            "BudgetYearFour": {
                "val": "5.29"
            },
            "BudgetYearFive": {
                "val": "5.349"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "25.889"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) was previously funded, with continuity of effort realigned from the following PE:\n* PE 0601104A University and Industry Research Centers"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE fosters research performed through the Cyber Security Collaborative Research Alliance (CSEC CRA), a competitively selected consortium, formed to advance the theoretical foundations of cyber science in the context of Army networks. This CRA consists of academia, industry and government researchers working jointly with the objective of developing a fundamental understanding of cyber phenomena so that fundamental laws, theories, and theoretically grounded and empirically validated models can be applied to a broad range of Army domains, applications, and environments. This research focuses on three interrelated aspects of cyber security and is conducted using a trans-disciplinary approach that takes into account the human element of the network. The three aspects of cyber that are addressed are: 1) vulnerabilities and risks of cyber networks to malicious activities, 2) anticipating, detecting, and analyzing malicious activities, and 3) agile cyber maneuver to thwart and defeat malicious activities. Overarching goals of cyber security are to significantly decrease the adversary's return on investment when considering cyber attack on Army networks, and minimizing the impact on (Army) network performance related to implementing cyber security. The CRA research creates a framework that effectively integrates the knowledge of cyber assets and potential adversary capabilities and approaches, and provides defense mechanisms that dynamically adjust to changes related to mission, assets, vulnerability state, and defense mechanisms. \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "4.982"
                },
                "BudgetYearOneBase": {
                    "val": "4.982"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "4.982"
                },
                "BudgetYearOneBase": {
                    "val": "4.982"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "4.982"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.982"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY20 funding increase adjustments related to Science and Technology Financial Restructuring."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CB5"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Collaborative Research Alliance"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "4.982"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.982"
                        },
                        "BudgetYearTwo": {
                            "val": "5.082"
                        },
                        "BudgetYearThree": {
                            "val": "5.186"
                        },
                        "BudgetYearFour": {
                            "val": "5.29"
                        },
                        "BudgetYearFive": {
                            "val": "5.349"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "25.889"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0601104A (University and Industry Research Centers)\n* EA6 Cyber Collaborative Research Alliance"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project fosters research performed through the CSEC CRA, a competitively selected consortium, formed to advance the theoretical foundations of cyber science in the context of Army networks. This CRA consists of academia, industry and government researchers working jointly with the objective of developing a fundamental understanding of cyber phenomena so that fundamental laws, theories, and theoretically grounded and empirically validated models can be applied to a broad range of Army domains, applications, and environments. This research focuses on three interrelated aspects of cyber security and is conducted using a trans-disciplinary approach that takes into account the human element of the network. The three aspects of cyber that are addressed are: 1) vulnerabilities and risks of cyber networks to malicious activities, 2) anticipating, detecting, and analyzing malicious activities, and 3) agile cyber maneuver to thwart and defeat malicious activities.  Overarching goals of cyber security are to significantly decrease the adversary's return on investment when considering cyber attack on Army networks, and minimizing the impact on (Army) network performance related to implementing cyber security. The CRA research creates a framework that effectively integrates the knowledge of cyber assets and potential adversary capabilities and approaches, and provides defense mechanisms that dynamically adjust to changes related to mission, assets, vulnerability state, and defense mechanisms. \n\nWork in this Project supports key Army needs and provides the technical underpinnings to PE 0602146A Network C3I Technology.  \n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus area and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Security Collaborative Research Alliance"
                                    },
                                    "Description": {
                                        "val": "The Cyber Security Collaborative Research Alliance (CSEC CRA) supports basic research to enable capabilities for rapid development and adaptation of cyber tools for dynamically assessing cyber risks, detecting hostile activities on friendly networks, and supporting agile maneuver in cyber space in spite of the emergence of novel threats."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.982"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.982"
                                            },
                                            "Text": {
                                                "val": "Will model distributed, dynamic, secure coalition communication\/information infrastructures that support distributed analytics to derive situational understanding; develop techniques for dynamic self-configuring services \"on demand\" based on mission needs, context and resource constraints; model underlying distributed analytics and situational understanding that supports dynamic coalition operations involving complex multi-actor situations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0601104A (University and Industry Research Centers) \/ Project EA6 (Cyber Collaborative Research Alliance) in FY20."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}