{
    "id": "2020-Navy-PB-1319-MJBOOK-3-0-a56c7a9b227f9c34d6c2010c1b75789785589abe64a46931357add0057a031c6-0",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604256N"
        },
        "ProgramElementTitle": {
            "val": "Threat Simulator Development"
        },
        "R1LineNumber": {
            "val": "174"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "89.491"
            },
            "CurrentYear": {
                "val": "94.576"
            },
            "BudgetYearOne": {
                "val": "66.678"
            },
            "BudgetYearOneBase": {
                "val": "66.678"
            },
            "BudgetYearTwo": {
                "val": "29.986"
            },
            "BudgetYearThree": {
                "val": "29.109"
            },
            "BudgetYearFour": {
                "val": "29.238"
            },
            "BudgetYearFive": {
                "val": "29.843"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This is a continuing program that consolidates the design, fabrication and integration of Naval Electronic Warfare (EW) threat simulators for increased managerial emphasis and coordination. These simulator development efforts provide realistic Developmental and Operational Test and Evaluation environments to test EW systems and defensive tactics. These projects develop threat Anti-Air and Anti-Ship weapon system simulators in accordance with the Services' requirements.\n\nThe 0602 Project, Electronic Warfare Environment Simulation, directly supports the Test and Evaluation resource requirements for all Naval Air EW development programs to include multi-spectral situational awareness and countermeasures. Programs in development and future programs include: Joint Strike Fighter, EA-18G, Low Band Transmitter, Next Generation Jammer, Advanced Anti-Radiation Guided Missile (AARGM), Long Range Anti-Ship Missile (LRASM), and Triton.\n\nJUSTIFICATION FOR BUDGET ACTIVITY: This program is funded under RESEARCH, DEVELOPMENT, TEST and EVALUATION MANAGEMENT SUPPORT because it supports efforts directed toward sustaining or modernizing installations or operations required for general research, development, test and evaluation."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "91.819"
                },
                "CurrentYear": {
                    "val": "94.576"
                },
                "BudgetYearOne": {
                    "val": "69.602"
                },
                "BudgetYearOneBase": {
                    "val": "69.602"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "89.491"
                },
                "CurrentYear": {
                    "val": "94.576"
                },
                "BudgetYearOne": {
                    "val": "66.678"
                },
                "BudgetYearOneBase": {
                    "val": "66.678"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.328"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-2.924"
                },
                "BudgetYearOneBase": {
                    "val": "-2.924"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.328"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.924"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.924"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The funding decrease from FY 2019 to FY 2020 due to the completion of the beam measurement system in FY 2019 for NAWCAD and NAWCWD. Additionally, it reflects the purchase of the final L-Band radar signal emulators occurs in FY 2019 with the purchase of spare parts and logistical equipment in FY 2020 for NAWCWD.\n\nThe FY 2020 request was reduced by $1.924 million to reflect the availability of prior year execution balances.\n\nTechnical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0602"
                    },
                    "ProjectTitle": {
                        "val": "Eletronics W\/F Env Simulation (ECHO)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "74.630"
                        },
                        "CurrentYear": {
                            "val": "80.936"
                        },
                        "BudgetYearOne": {
                            "val": "54.241"
                        },
                        "BudgetYearOneBase": {
                            "val": "54.241"
                        },
                        "BudgetYearTwo": {
                            "val": "14.430"
                        },
                        "BudgetYearThree": {
                            "val": "13.901"
                        },
                        "BudgetYearFour": {
                            "val": "14.339"
                        },
                        "BudgetYearFive": {
                            "val": "14.626"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The objective of this project is development of necessary simulation facilities and approaches to allow determination of the effectiveness of Electronic Warfare (EW) in real world engagement situations and to support the introduction of modern, effective systems into Naval Aviation. The heavy use of test resources by all Services demonstrates the importance of these assets. \n\nThe Electronic Warfare Environment Simulation project is unique because it is the only program within the Department of Defense which develops and provides Naval anti-air warfare threat assets for Test and Evaluation (T&E).\n\nThis project directly supports the T&E resource requirements for all Naval Air EW development programs, to include multi-spectral situational awareness and countermeasures. Programs in development and future programs include: Joint Strike Fighter, EA-18G, Low Band Transmitter, Next Generation Jammer, Advanced Anti-Radiation Guided Missile (AARGM), Long Range Anti-Ship Missile (LRASM), and Triton.\n\nThis project provides for the development of an Integrated Air Defense T&E capability to be fielded at each of the three sites comprising the Navy's Tri-Center complex: Naval Air Warfare Center Weapons Division, China Lake and Point Mugu in CA, and Naval Air Warfare Center Aircraft Division, Patuxent River, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "REQUIREMENTS AND VALIDATION"
                                    },
                                    "Description": {
                                        "val": "Validate and track intel updates of the threat systems necessary for the operation and continuous improvement of Navy laboratories and ranges which provide engineering support, testing and analysis to the developers, integrators, testers and users of systems and technologies that counter or penetrate air defenses."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.775"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued to provide program management, systems engineering, and requirements identification for the development of simulators and foreign material acquisition.\n- Continued to validate simulators and stimulators at the Navy tri-lab centers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.590"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to provide program management, systems engineering, and requirements identification for the development of simulators and foreign material acquisition.\n- Continue to validate simulators and stimulators at the Navy tri-lab centers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.590"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.590"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to provide program management, systems engineering, and requirements identification for the development of simulators and foreign material acquisition.\n- Continue to validate simulators and stimulators at the Navy tri-lab centers."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ACQUISITION AND MEASUREMENT CAPABILITIES"
                                    },
                                    "Description": {
                                        "val": "Provide the test community with modern threat target acquisition systems and effective measurement systems necessary for Test and Evaluation of airborne early warning, situational awareness, detection and targeting systems and airborne response systems.   Project investments in FY 2018, FY 2019 and FY 2020 support procurement of  advanced, threat representative electronic warfare (EW) target acquisition radars to establish a frequency diverse, dense and geographically dispersed threat integrated air defense system to support operationally realistic testing of F-35, Next Generation Jammer, EA-18G and Triton in a threat representative multi-axis anti-access area denial environment that does not currently exist on any Department of Defense open air range."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "63.806"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of an open air radio frequency beam measurement capability.\n- Initiated upgrades to the Naval Air Warfare Center ranges to support OT of the JSF.\n- Initiated the site preparation and integration of radar signal emulators at the Electronic Combat Range.\n- Initiated the development of a threat signal augmentation capability.  \n- Initiated the procurement of three L-Band radar signal emulators for Naval Air Warfare Center Weapons Division (NAWCWD).\n- Initiated and complete the upgrade of two S-Band radar signal emulators for NAWCWD.\n- Initiated the procurement of three passive radar systems for NAWCWD.\n- Initiated the procurement of three early warning radar systems for NAWCWD."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "71.491"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Complete development of an open air radio frequency beam measurement capability.\n- Continue upgrades to the Naval Air Warfare Center ranges to support OT of the JSF by preparing sites for L-Band radar signal emulators, passive radar systems, early warning radar systems and signal detection and location systems.\n- Continue the site preparation and integration of radar signal emulators at the Electronic Combat Range.\n- Continue the development of two threat signal augmentation simulators for NAWCWD.\n- Continue the procurement of three L-Band radar signal emulators for NAWCWD by procuring the second system.\n- Continue the procurement of three passive radar systems for NAWCWD by procuring the second and third systems.\n- Continue the procurement of three early warning radar systems for NAWCWD by procuring the first system.\n- Initiate the procurement of three signal detection and location systems for NAWCWD by procuring the first two systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "41.221"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "41.221"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Complete the site preparation and integration of radar signal emulators at the Electronic Combat Range.\n- Complete the procurement of three L-Band radar signal emulators for NAWCWD by procuring spares and logistic items.\n- Complete the procurement of two passive radar systems for NAWCWD by procuring the second system.\n- Complete the procurement of three early warning radar systems for NAWCWD by procuring the second and third systems.\n- Complete the procurement of three signal detection and location systems for NAWCWD by procuring the third system.\n- Continue upgrades to the Naval Air Warfare Center ranges to support OT of the JSF by preparing sites for L-Band radar signal emulators, passive radar systems, early warning radar systems and signal detection and location systems.\n- Continue the development of two threat signal augmentation simulators for NAWCWD."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2019 to FY 2020 due to the completion of the beam measurement system in FY 2019 for NAWCAD and NAWCWD. Additionally, the purchase of the final L-Band radar signal emulators occurs in FY 2019 with the purchase of spare parts and logistical equipment in FY 2020 for NAWCWD."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ENGAGEMENT CAPABILITIES"
                                    },
                                    "Description": {
                                        "val": "Provide the test community with the modern threat engagement systems necessary for Test and Evaluation of airborne alert, Situation Awareness, targeting systems and airborne response systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.049"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued the upgrade and integration of missile simulation models.\n- Continued the development of a closed-loop threat surface to air missile system simulator.\n- Continued the conversion of a threat system.\n- Continued the minor upgrades to open air and laboratory threat systems.\n- Continued the integration of a threat engagement system at ECR.\n- Initiated the development of a naval based threat radar closed-loop simulator for installation in  laboratories at Naval Air Warfare Center Weapons Division and Naval Air Warfare Center Aircraft Division and designed for open air range implementation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.855"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Complete the development of a closed-loop threat surface to air missile system simulator.\n- Complete the integration of a threat engagement system at ECR.\n- Continue the upgrade and integration of missile simulation models.\n- Continue the conversion of a threat system.\n- Continue the minor upgrades to open air and laboratory threat systems.\n- Continue the development of a naval based threat radar closed-loop simulator for installation in laboratories at Naval Air Warfare Center Weapons Division and Naval Air Warfare Center Aircraft Division and designed for open air range implementation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.430"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.430"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue the upgrade and integration of missile simulation models.\n- Continue the conversion of a threat system.\n- Continue the minor upgrades to open air and laboratory threat systems.\n- Continue the development of a naval based threat radar closed-loop simulator for installation in laboratories at Naval\nAir Warfare Center Weapons Division and Naval Air Warfare Center Aircraft Division and designed for open air range\nimplementation.  The project will move from performing trade studies to design and material purchases."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2019 to FY 2020 supports the final material purchases and integration on the threat system conversion project. The naval based threat radar closed-loop simulator has been developing requirements and performing design trade studies since its inception; material purchases for the developmental laboratory systems will begin in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Successfully achieve Initial Operational Capability of Navy Threat Simulation projects within 60 days of approved schedule and have test capabilities scheduled in support of Navy test programs within 180 days."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0672"
                    },
                    "ProjectTitle": {
                        "val": "Effect Nav E\/W (ENEWS)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "14.861"
                        },
                        "CurrentYear": {
                            "val": "13.640"
                        },
                        "BudgetYearOne": {
                            "val": "12.437"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.437"
                        },
                        "BudgetYearTwo": {
                            "val": "15.556"
                        },
                        "BudgetYearThree": {
                            "val": "15.208"
                        },
                        "BudgetYearFour": {
                            "val": "14.899"
                        },
                        "BudgetYearFive": {
                            "val": "15.217"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The objective of the Effectiveness of Naval Electronic Warfare (EW) Systems (ENEWS) Project is the development and application of necessary simulation assets to determine the effectiveness of Electronic Warfare for Navy ships in simulated real-world engagement situations.  The project primarily supports the introduction of modern, effective shipboard and off-board Electronic Warfare systems, and tactics for the Surface Navy.  The heavy use of ENEWS resources by Naval Sea Systems Command, Operational Test and Evaluation (OT&E) Force, Special Operations, and other Electronic Warfare Research, Development, Test and Evaluation (T&E) agencies speaks to the overall importance of this project.  The project provides support for Electronic Warfare system design, Engineering Test (ET), Development Test (DT), Operational Test (OT), and the development of utilization tactics.  In the past ENEWS quick reaction capabilities have had great impact on crisis situations such as the Libyan crises, Iran threat, Persian Gulf crisis, and Operation Desert Shield\/Storm.  Simulation Display (SIMDIS) is an ENEWS modeling tool that was developed to support Testing and Evaluation.  Simulation Display has been adopted by most Department of Defense (DoD) Testing and Evaluation and training ranges to provide visualization of Testing and Evaluation and training scenarios.  One of the primary threats to surface ships is Anti-Ship Capable Missile systems.  The Effectiveness of ENEWS Project is unique in that it is the only project within the Department of Defense dedicated to developing and providing realistic Anti-Ship Capable Missile assets to test and evaluate the effectiveness of shipboard Electronic Warfare systems and tactics against these type threats.  The Effectiveness of ENEWS Project is a critical part of the Office of the Secretary of Defense Test Resource Master Plan.  This plan employs many of the Effectiveness of ENEWS assets for planning, analysis, testing, and verification of shipboard and off-board Electronic Warfare systems techniques and tactics.  As part of its normal activities, ENEWS provides Development Test and Evaluation (DT&E), Operational Test and Evaluation (OT&E), and Follow-on Operational Test and Evaluation (FOT&E) support to the surface Navy for all ship classes.  Development Test, Operational Test and Follow-on Operational Test and Evaluation support includes AN\/SLQ-32 Surface Electronic Warfare Improvement Program (SEWIP), Nulka, Rapid Anti-ship Integrated Defense System, all MK245 Giant tests, advanced InfraRed (IR) decoys, decoy placement, ship InfraRed signature and radar cross section measurement of DDG-51, LPD-17, DD-21 and Patrol Craft class ships, High Power Microwave program, and other ship self-defense initiatives, including Test and Evaluation of Future Naval Capability process.  In addition, ENEWS assets are regularly employed to test the effectiveness of North Atlantic Treaty Organization (NATO) ships' Electronic Warfare systems in joint allied exercises. ENEWS assets also support Joint Electronic Warfare exercises that are conducted with Rim of the Pacific (RIMPAC) nations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CLASSIFIED PROGRAM"
                                    },
                                    "Description": {
                                        "val": "Details about this program are classified.\n\nDetails about this program and any changes are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Details are of a higher classification."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.139"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Details are of a higher classification."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Details are of a higher classification."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "- Details are of a higher classification."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HARDWARE SIMULATION SYSTEMS"
                                    },
                                    "Description": {
                                        "val": "Maintain and perform Hardware and Software Upgrades to the inventory of Effectiveness of Naval Electronic Warfare Systems (ENEWS) flyable and shore based Anti-Ship Capable Missile (ASCM) Electro-Optic\/Infrared (EO\/IR), Visible and Radio Frequency (RF) Simulators.  Perform characterization of Infrared and Radio Frequency simulators as part of the periodic evaluation of simulation performance and collect performance data for comparison with previously recorded data.  Also includes development and maintenance of all simulator control panels."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.564"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued hardware upgrades to the SUMMIT Simulator.\n- Continued software upgrades to the VICTOR Standard Instrumentation Pod (SIP).\n- Continued hardware upgrades to the FOXTROT 3 TOWSIM(IOTA).\n- Continued hardware upgrades for VICTOR 1 SIP and Anti-Ship Imaging Missile (AIMS) simulators\n- Continued software upgrade for FOXTROT 1 Sim 1 simulator\n- Continued to maintain and perform hardware and software upgrades to the inventory of Effectiveness of Naval Electronic Warfare Systems (ENEWS) flyable and shore based Anti-Ship Capable Missile (ASCM) Electro-Optic\/Infrared (EO\/IR), Visible and Radio Frequency (RF) Simulators and simulator control panels.\n- Completed software upgrade for the FOXTROT 1 Sim 1 simulator \n- Initiated hardware upgrades for the EPSILON, FOXTROT 1 (ground based) and FOXTROT 1 SIP simulators \n- Initiated software upgrades for the FOXTROT 1 (ground based), FOXTROT SIP simulators \n- Maintained and upgraded 21 hardware simulators, 5 programmable simulators and the Antenna Test Rig to support the SEWIP Block 3 and AOEW effectiveness evaluations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.538"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue hardware upgrades to the SUMMIT Simulator. \n- Continue software upgrades to the VICTOR Standard Instrumentation Pod (SIP). \n- Continue hardware upgrades to the FOXTROT 3 TOWSIM(IOTA). \n- Continue hardware upgrades for VICTOR 1 SIP and Anti-Ship Imaging Missile (AIMS) simulators \n- Continue software upgrade for FOXTROT 1 Sim 1 simulator \n- Continue to maintain and perform hardware and software upgrades to the inventory of Effectiveness of Naval Electronic Warfare Systems (ENEWS) flyable and shore based Anti-Ship Capable Missile (ASCM) Electro-Optic\/Infrared (EO\/IR), Visible and Radio Frequency (RF) Simulators and simulator control panels.\n- Complete hardware upgrades for the EPSILON, FOXTROT 1 (ground based) and FOXTROT 1 SIP simulators\n- Complete software upgrades for the FOXTROT 1 (ground based) and FOXTROT 1 SIP simulators\n- Initiate hardware upgrades for the NU (towed configuration) and VICTOR 1 SIP simulators\n- Introduce and initiate flight certification of one new simulator into the ENEWS inventor\n- Initiate software upgrades for the IOTA (towed configuration), VICTOR 1 SIP simulators\n- Maintain and upgrade 22 hardware simulators, 5 programmable simulators and the Antenna Test Rig to support the SEWIP Block 3 and AOEW effectiveness evaluations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2019 less those noted as completed above. \n- Continue to maintain and perform hardware and software upgrades to the inventory of ENEWS flyable and shore based Anti-Ship Capable Missile (ASCM) Electro-Optic\/Infrared (EO\/IR), Visible and Radio Frequency (RF) simulators and simulator control panels. Introduce a new simulator into the ENEWS inventory and prepare simulator for flight and field testing \n- Initiate software upgrades for one EO\/IR simulator \n- Maintain and upgrade 23 hardware simulators, 5 programmable simulators and the Antenna Test Rig to support the SEWIP Block 3 and AOEW effectiveness evaluations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 reflects delays to the deployment of a new hardware threat simulator and a reduction in hardware and software updates to existing ENEWS inventory of Radio Frequency (RF), Electro-Optic (EO) and Infra-Red (IR) simulators."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SIMULATION CHARACTERIZATION, VERIFICATION AND REQUIREMENTS"
                                    },
                                    "Description": {
                                        "val": "Provides for the documentation of Anti-Ship Capable Missile (ASMC) threat simulators. Develops reports that contain detailed descriptions and parametric data of the Anti-Ship Capable Missile threat simulators and compares the simulator's parametric data to the actual threat's parametric data.  Provide technical management functions in support of the Effectiveness of Naval Electronic Warfare Systems (ENEWS) project; engineering and technical support requirements for the Anti-Ship Capable Missile simulators and upgrades to meet DT\/ OT testing requirements, development of detailed test resource requirements and provides an interface between OPNAV N2\/N6, Office of Naval Research, and ENEWS oversight activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.691"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued BETA hardware simulator documentation report.\n- Continued LAMBDA simulator hardware validation report.\n- Continued to develop reports that compare the parametric data of the ASCM threat simulators to the parametric data of the actual threat and provide technical management functions in support of the Effectiveness of ENEWS.\n- Initiated and completed the FY 2018 ENEWS Program Management Plan. \n- Initiated and completed FY 2018 status reviews, performance based management and analysis, financial execution reporting and assessment. \n- Initiated characterization assessment and hardware simulator documentation report for upgraded OMEGA simulator."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.632"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop reports that compare the parametric data of the ASCM threat simulators\nto the parametric data of the actual threat and provide technical management functions in support of the ENEWS project.\n- Initiate and complete the FY 2019 ENEWS Program Management Plan.\n- Initiate and complete FY 2019 status reviews, monthly reports, performance based management and analysis, financial execution reporting and assessment.\n- Complete characterization and hardware simulator documentation report for the upgraded OMEGA simulator."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop reports that compare the parametric data of the Anti-Ship Capable Missile (ASCM) threat simulators to the parametric data of the actual threat and provide technical management functions in support of the Effectiveness of Naval Electronic Warfare Systems (ENEWS) project. \n- Initiate and complete the FY 2020 ENEWS Program Management Plan. \n- Coordinate and conduct FY 2020 status reviews \n- Draft and submit monthly reports, performance based management and analysis, financial execution reports and assessments. \n- Initiate characterization and hardware simulator documentation report for an RF simulator."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 reflects a reduction in program management support and  deferral of verification and characterization of an RF hardware simulator until FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SUPPORT AND COMPUTERS SIMULATION SYSTEMS"
                                    },
                                    "Description": {
                                        "val": "Perform maintenance and intelligence upgrades to Electro-Optic\/Infrared, Digital, and Radio Frequency Laboratory Simulation Testing facilities and flight support equipment based on existing and emerging complex threat systems.  Development of Testing & Evaluation scenarios and environmental modeling to support Electronic Support (ES) and Electronic Attack (EA) testing; modify Anti-Ship Cruise Missile (ASCM) threat simulators based on the latest intelligence data obtained from threat databases."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.406"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued to perform maintenance and intelligence upgrades to Electro-Optic\/Infrared, Digital, and Radio Frequency Laboratory Simulation testing facilities and flight support equipment and provide ES and EA test support.\n- Continued target models to support Surface Electronic Warfare Improvement Program Block 3 and Advanced Offboard Electronic Warfare (AOEW) effectiveness assessments.\n- Continued update to the Scenario and Environmental Model used to support open and closed loop simulations.\n- Continued maintenance and upgrades to shore-based test facilities and mobile test vans as required to conduct testing in support of Surface Electronic Warfare Improvement Program, Nulka and multi-function Electronic Warfare programs.\n- Continued to transition environmental, threat and platform simulations from Subversion to Mercurial Distributed Version Control System.\n- Continued upgrades to configuration control software library as new releases became available.\n- Continued to develop new digital models of Anti-Ship Cruise Missile (ASCM) threats as they became available.\n- Continued upgrades and maintenance of flight support systems as necessary to support the infrared \/ radio frequency Effectiveness of Naval Electronic Warfare Systems (ENEWS) simulators.\n- Continued upgrades and user friendly enhancements to the Simulation Display (SIMDIS) toolset\n- Continued development of LIMA III and LIMA IV digital models\n- Continued digital model upgrades to support Surface Electronic Warfare Improvement Program (SEWIP) Block 3 test and evaluation.\n- Continued simulator upgrades to support SEWIP Block 3 test and evaluation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.331"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to perform maintenance and intelligence upgrades to Electro-Optic\/Infrared, Digital, and Radio Frequency Laboratory Simulation testing facilities and flight support equipment and provide ES and EA test support. \n- Continue target models to support Surface Electronic Warfare Improvement Program Block 3 and Advanced Offboard Electronic Warfare (AOEW) effectiveness assessments. \n- Continue update to the Scenario and Environmental Model used to support open and closed loop simulations. \n- Continue maintenance and upgrades to shore-based test facilities and mobile test vans as required to conduct testing in support of Surface Electronic Warfare Improvement Program, Nulka and multi-function Electronic Warfare programs. \n- Continue to transition environmental, threat and platform simulations from Subversion to Mercurial Distributed Version Control System.\n- Continue upgrades to configuration control software library as new releases became available.\n- Continue to develop new digital models of Anti-Ship Cruise Missile (ASCM) threats as they became available.\n- Continue upgrades and maintenance of flight support systems as necessary to support the infrared \/ radio frequency Effectiveness of Naval Electronic Warfare Systems (ENEWS) simulators.\n- Continue upgrades and user friendly enhancements to the Simulation Display (SIMDIS) toolset \n- Continue development of LIMA III and LIMA IV digital models \n- Continue digital model upgrades to support Surface Electronic Warfare Improvement Program (SEWIP) Block 3 test and evaluation.\n- Continue simulator upgrades to support SEWIP Block 3 test and evaluation. \n- Continue to perform maintenance and intelligence upgrades to Electro-Optic\/Infrared, Digital, and Radio Frequency Laboratory Simulation testing facilities and flight support equipment and provide Electronic Support (ES) and Electronic Attack (EA) test support.\n- Update and install new ship models into database and evaluate performance.\n- Initiate Hardware-In-the-Loop (HWIL) capability update."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.437"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.437"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2019 less those noted as completed above.\n- Continue to perform maintenance and intelligence upgrades to Electro-Optic\/Infrared, Digital, and Radio Frequency Laboratory Simulation testing facilities and flight support equipment and provide ES and EA test support.\n- Update and install new ship models into database to support Navy studies, Development Test (DT)\/Operational Test (OT) events; ENEWS digital models will be updated to allow modeling and simulation (M&S) based EW testing for SEWIP Block 3, Advanced Offboard Electronic Warfare (AOEW) and Navy Enterprise Testbed programs.\n- Complete HWIL millimeter wave capability update."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 reflects a deferral of updates to the Simulation Display (SIMDIS) visualization and display tool until FY 2021 and a reduction in updates to missile and target models for modeling and simulation based evaluations."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics are discussed within each project (R2a)."
                        }
                    }
                }
            ]
        }
    }
}