{
    "id": "2020-Navy-PB-1319-JBOOK-9da760a8280e5c477a40ce5d303141285b83ab4a577b7d5903632d5298d41e17-7",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602236N"
        },
        "ProgramElementTitle": {
            "val": "Warfighter Sustainment Applied Res"
        },
        "R1LineNumber": {
            "val": "8"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "48.606"
            },
            "CurrentYear": {
                "val": "65.782"
            },
            "BudgetYearOne": {
                "val": "63.825"
            },
            "BudgetYearOneBase": {
                "val": "63.825"
            },
            "BudgetYearTwo": {
                "val": "64.558"
            },
            "BudgetYearThree": {
                "val": "66.263"
            },
            "BudgetYearFour": {
                "val": "67.788"
            },
            "BudgetYearFive": {
                "val": "68.361"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) supports innovation-based efforts that will provide technology options for future Navy and Marine Corps capabilities. Efforts focus on advanced Naval materials; biocentric technologies; environmental quality; human factors and organizational design; medical technologies; and Naval training technologies. Within the Naval Transformation Roadmap, this investment maps to future transformational capabilities and the FORCEnet pillar of the CNO and the Commandant of the Marine Corps vision for the future -- Naval Power 21. \n\nThis PE supports the Office of Naval Research (ONR) Global mission to serve as the preeminent external facilitator for the Naval Research Enterprise.  This is accomplished by establishing quality, relevant connections between the international research and development community, Naval fleet\/forces, DOD, other US Government agencies and international partners.\n\nThe efforts described in this Program Element PE are based on investment directions as defined in the Naval Research and Development Framework which is developed from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps). It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.  \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "48.649"
                },
                "CurrentYear": {
                    "val": "56.197"
                },
                "BudgetYearOne": {
                    "val": "56.133"
                },
                "BudgetYearOneBase": {
                    "val": "56.133"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "48.606"
                },
                "CurrentYear": {
                    "val": "65.782"
                },
                "BudgetYearOne": {
                    "val": "63.825"
                },
                "BudgetYearOneBase": {
                    "val": "63.825"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.043"
                },
                "CurrentYear": {
                    "val": "9.585"
                },
                "BudgetYearOne": {
                    "val": "7.692"
                },
                "BudgetYearOneBase": {
                    "val": "7.692"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "9.585"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "1.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.043"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "7.692"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.692"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The funding increase from FY 2019 to FY 2020 is due to the original PE structure being retained. Warfighter Sustain Applied Research project reflects the realignment of resources from PE: 0603671N (U)Navy Advanced Technology Development(ATD) Proj. 3433 for Human Research Protection Program (HRPP) back into PE: 0602236N Warfighter Sustainment Applied Res Proj: 0000 and into the Human Research Protection Program (HRPP) R2 Activity."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Sustainment Applied Res"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "48.606"
                        },
                        "CurrentYear": {
                            "val": "58.882"
                        },
                        "BudgetYearOne": {
                            "val": "63.825"
                        },
                        "BudgetYearOneBase": {
                            "val": "63.825"
                        },
                        "BudgetYearTwo": {
                            "val": "64.558"
                        },
                        "BudgetYearThree": {
                            "val": "66.263"
                        },
                        "BudgetYearFour": {
                            "val": "67.788"
                        },
                        "BudgetYearFive": {
                            "val": "68.361"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Efforts in this PE focus on; advanced naval materials; biocentric technologies; environmental quality; human factors and organizational design; medical technologies; international science and science advisor programs; and Naval systems training and education. \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ADVANCED NAVAL MATERIALS"
                                    },
                                    "Description": {
                                        "val": "Advanced Naval Materials efforts support several Science and Technology (S&T) Focus Areas, in particular Platform Design & Survivability, and perform research across a broad spectrum of technical areas including:  structural materials to increase platform performance and survivability at reduced weight and cost; advanced, high-performance materials for energy systems; corrosion mitigation strategies; high-temperature propulsion systems; and enhanced sonar transducers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.004"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "ADVANCED NAVAL MATERIALS:  Expand research on structural materials, including, but not limited to, the following: Nanostructured materials processing, composite development, cellular materials and high temperature materials.  Conduct applied research related to critical S&T to investigate corrosion control modeling, acoustic transduction technologies and environmental quality. Complete the development of low AC loss high temperature superconductors for advanced power.\n\nMATERIALS AND PROCESSES:  Develop novel and scalable processing methods to produce mechanically robust high temperature superconductor tapes with minimal AC loss for various naval applications such as transformers, inductors, stators and for pulsed power delivery systems for all electric ships.  Design new microfluidic system for direct write additive manufacturing to significantly improve the existing techniques.  Design of multifunctional material systems for use in new helmet suspension to mitigate multiple threats. Compositional modifications and processing parameters to optimize material performance have been demonstrated."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.455"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "ADVANCED NAVAL MATERIALS:  \nConduct research on structural materials to include the following: Nanostructured materials processing, composite development, cellular materials, high temperature materials and alternative hull materials. Conduct applied research related to critical S&T to investigate corrosion control modeling, high strength corrosion resistant compositionally complex alloys, corrosion resistant additive manufactured alloys and acoustic transduction technologies.\n\nMATERIALS AND PROCESSES:  \nDevelopment of novel and scalable processing methods to produce mechanically robust high temperature superconductor tapes with minimal AC loss for various naval applications such as transformers, inductors, stators and for pulsed power delivery systems for all electric ships.  Conduct design new microfluidic system for direct write additive manufacturing to significantly improve the existing techniques.  Design multifunctional material systems for use in new helmet design to mitigate multiple threats.  Conduct compositional modifications and processing parameters to optimize material performance that have been demonstrated, leading to current plans for their utilization."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.715"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.715"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Conduct research on Agile Manufacturing Integrated Computational Materials Engineering (ICME).  This effort will establish a robust collection of predictive capabilities based on quantitative experimentation and characterization at all appropriate length scales to accelerate the development and optimization of new materials, and the design of advanced components while reducing the time required for qualification.  Application of these tools will enable greater confidence and utilization of additive manufacturing and other advanced manufacturing technologies.\n\n-Conduct ongoing research on materials development and advanced processing technologies for acoustic transduction.\n\n- Conduct research on structural materials to include the following: nanostructured materials and coatings processing, composite development, cellular materials, high temperature materials, metals and alloys for structural applications, and alternative hull materials.\n\n- Conduct applied research related to critical S&T to investigate corrosion control modeling, high strength corrosion resistant coatings and compositionally complex alloys, and corrosion resistant additive manufactured alloys. \n\n-Conduct ongoing research that develops enabling manufacturing technology to scale up and improve affordability of science and technology products.  Key tasks for this period include development of affordable fabrication technology for submarine coatings.\n\nMaterials and Chemistry: Develop novel and scalable processing methods to produce mechanically robust high temperature superconductor tapes with minimal AC loss for various naval applications such as transformers, inductors, stators and for pulsed power delivery systems for all electric ships.  Design new microfluidic system for direct write additive manufacturing to significantly improve the existing techniques.  Design of multifunctional material systems for use in new helmet design to mitigate multiple threats.  Compositional modifications and processing parameters to optimize material performance have been demonstrated leading to current plans for their utilization."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2019 to FY 2020 is due to the Agile Manufacturing Integrated Computational Materials Engineering effort initiating in FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "BIOCENTRIC TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "Applied research to provide solutions for Naval needs based upon bio-inspired systems, sensors, robotics, and technologies; synthetic biology to produce high-value materials or to develop sentinel organisms; marine mammal diagnostics to support the Navy's Fleet Marine Mammal Systems; and augmented Warfighter performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.709"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "NAVAL BIOSCIENCE:  \nContinue research into the development of innovative naval biosensors, biomaterials, and bioprocess technology.\nInvestigate engineering development and optimization of sea-floor sediment energy harvesting system for sustainable and\nautonomous powering of underwater sensor networks and AUV's. Conduct research on the development of microbial\nfuel cells for powering a linear sensor array. Study microbial electrochemical systems for shipboard desalination\/\nwaste-to-energy conversion and the closed-loop microbial fuels cells. Research explosive-sensing plants and microbial\nelectrobiosynthesis of liquid fuels. Initiate development of microbial electronic devices.\n\nSYNTHETIC BIOLOGY FOR SENSING & ENERGY PRODUCTION:  \nContinue research on synthetic biology studies of engineered sentinel organisms for environmental surveillance. Initiate\nintegration of programmable cellular controllers with robotic devices. \n\nLIFE SCIENCE AND BIOENGINEERING:  \nContinue marine mammal diagnostics efforts, including immunobioassays for stress and infection detection and efforts to detect, treat, and prevent diseases in dolphins, including diabetes and kidney stones.   \n\nNEURAL, SENSORY AND BIOMECHANICAL SYSTEMS:  \nContinue efforts on naval biosensor to detect brain structures and blood vessels through skull bones. Investigate advanced biomimetic sensing and neural control for human-robot interaction to enable effective collaboration of warfighters and autonomous systems. Integrate biomimetic sonar with bioinspired autonomous undersea vehicles (with high-lift propulsors)to achieve closed loop control. Conduct research into bioinspired quiet, and maneuverable self-propelled line array using high-lift propulsors based on animal wing and fin biomechanics and in efforts of bio-inspired massively parallel vision systems. Study the development of brain-based intelligent systems to support high level interaction between warfighters and autonomous systems. Continue studies to develop electrosence and biosonar for MOC and Explosive Ordnance Disposal (EOD) missions and the development of improved recombinant antibodies for biothreat agents.\n\nMATERIALS AND CHEMISTRY:  Develop novel approaches to rapidly identify antibiotic resistant genes in bacterial pathogens of importance for the entire US military force. This effort will enable our transitional partners, the Naval Medical Research Center and the Naval Medical Research Laboratories, for rapid identification of highly resistant bacterial pathogens."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.684"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "NAVAL BIOSCIENCE:  \nConduct research into the development of innovative naval biosensors, biomaterials, and bioprocess technology.\nInvestigate engineering development and optimization of sea-floor sediment energy harvesting system for sustainable and\nautonomous powering of underwater sensor networks and AUV's. Conduct research on the development of microbial\nfuel cells for powering a linear sensor array. Study microbial electrochemical systems for shipboard desalination\/\nwaste-to-energy conversion and the closed-loop microbial fuels cells. Research explosive-sensing plants and microbial\nelectrobiosynthesis of liquid fuels. Continue development of microbial electronic devices.\n\nSYNTHETIC BIOLOGY FOR SENSING & ENERGY PRODUCTION:  \nConduct research on synthetic biology studies of engineered sentinel organisms for environmental surveillance and\nintegration of programmable cellular controllers with robotic devices. \n\nLIFE SCIENCE AND BIOENGINEERING:  \nConduct marine mammal diagnostics efforts, including immunobioassays for stress and infection detection and efforts to detect, treat, and prevent diseases in dolphins, including diabetes and kidney stones.   \n\nNEURAL, SENSORY AND BIOMECHANICAL SYSTEMS:  \nConduct efforts on naval biosensor to detect brain structures and blood vessels through skull bones. Investigate advanced biomimetic sensing and neural control for human-robot interaction to enable effective collaboration of warfighters and autonomous systems. Integrate biomimetic sonar with bioinspired autonomous undersea vehicles (with high-lift propulsors)to achieve closed loop control. Conduct research into bioinspired quiet, and maneuverable self-propelled line array using high-lift propulsors based on animal wing and fin biomechanics and in efforts of bio-inspired massively parallel vision systems. Study the development of brain-based intelligent systems to support high level interaction between warfighters and autonomous systems. Continue studies to develop electrosence and biosonar for Mine Counter Measures (MCM) and Explosive Ordinance Device (EOD) missions.\n\nMATERIALS AND CHEMISTRY: \nConduct development of novel approaches to rapidly identify antibiotic resistant genes in bacterial pathogens of importance for the entire US military force.  Success of this effort will enable our transitional partners, the Naval Medical Research Center and the Naval Medical Research Laboratories, for rapid identification of highly resistant bacterial pathogens.  A major success has been demonstrated by utilizing NRL developed microbial resistant determinant assay for its advances to system design."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.596"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.596"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Bio-Inspired Systems: Applied research in areas of: Control of bio-inspired autonomous vehicles in complex maneuvers; and Integration of biomimetic sonar with bio-inspired underwater vehicles for obstacle detection and avoidance.\n\nHuman Interaction with Autonomous Systems: Applied research in areas of: Development of brain-based intelligent systems to support collaboration between humans and autonomous systems; and Research on human and robotic teammates. \n\nBiocentric Technology: Applied research of Naval biosensors, biomaterials, and bioprocess technologies: Accelerate engineering development and optimization of microbial undersea energy harvesting systems for sustainable and autonomous powering of Naval underwater sensor and communication nodes; Examine feasibility of microbial electrochemical systems for shipboard waste-to-energy conversion (including disabled submarine scenarios); Accelerate research in human microbiome for divers, combat swimmers, and submariners; Applied research of devices incorporating engineered sentinel organisms for environmental monitoring (including the human gut); and Integration of programmable cellular controllers with robotic devices. \n\nBioengineering and Life Sciences: Applied research in the areas of: Sequencing technologies as diagnostic tools for viral pathogens in chemical and environmental samples; Various formulations of polymer mimics of mussel adhesion proteins for underwater applications; Highly-efficient proton exchange membrane fuel cells based on designer catalysts and novel catalyst supports for Naval applications; and Improving the health and welfare of the Navy's marine mammals including development of immunobioassays for stress and infection detection and acoustic analysis of dolphin sounds as an indicator of their well-being; \n\nWarfighting Augmentation: Applied research in multi-functional textiles that interact with autonomous life support, neuromuscular control and waste management, biosensors and bio-electronics, and adaptive and integrative protection.\n\nMaterials and Chemistry:  Develop novel approaches to rapidly identify antibiotic resistant genes in bacterial pathogens of importance for the entire US military force.  Success of this effort will enable our transitional partners, the Naval Medical Research Center and the Naval Medical Research Laboratories, for rapid identification of highly resistant bacterial pathogens.  A major success has been demonstrated by utilizing Naval Research Laboratory (NRL) developed microbial resistant determinant assay for its advances to system design."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increases from FY19 to FY20 reflects Biocentric Technologies R2 Activity focus to reduce scope in decision support\/uncertainty analysis for operational environments, and increase scope in providing solutions for Naval needs based upon bio-inspired systems."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ENVIRONMENTAL QUALITY"
                                    },
                                    "Description": {
                                        "val": "Environmental Quality technologies enable sustained world-wide Navy operations in compliance with all local, state, regional, national and international laws, regulations and agreements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.574"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of new, advanced, environmentally benign Anti-Fouling (AF)\/Anti-Corrosive (AC) coating systems for Navy platforms.\n- Continue development of advanced environmentally sound technologies for shipboard waste treatment and pollution abatement systems.\n- Continue field evaluation of prototype robotic Hull BUG to identify gaps needed to refine and advance the technology for reduced drag, and significant fuel savings.\n- Complete studies on oil emulsion issues and development of novel bilge water treatment systems for existing and new\nships."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.764"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Development of new, advanced, environmentally benign Anti-Fouling (AF)\/Anti-Corrosive (AC) coating systems for Navy platforms.\n\n- Development of advanced environmentally sound technologies for shipboard waste treatment and pollution abatement systems.\n\n- Conduct field evaluation of prototype robotic Hull BUG to identify gaps needed to refine and advance the technology for reduced drag, and significant fuel savings."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.672"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.672"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Ongoing development of new, advanced, environmentally benign Anti-Fouling (AF)\/Anti-Corrosive (AC) coating systems for Navy platforms. \n\n- Ongoing development of advanced environmentally sound technologies for shipboard waste treatment and pollution abatement systems."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HUMAN FACTORS AND ORGANIZATIONAL DESIGN"
                                    },
                                    "Description": {
                                        "val": "Applied research to improve system interface designs and human-level decision support in Naval contexts. Research areas include human-machine teaming, social networks and computational social science, and command decision making."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.161"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "HUMAN COMPUTER INTERACTION\/VISUALIZATION:  Continue research on audio-visual cue integration for 360-degree periscope displays by utilizing eye-tracking, sleep studies and traditional behavioral measures to characterize human performance on periscope-related tasks under a variety of physiological conditions.\n\nCOMMAND DECISION MAKING (CDM):  Continue development of task management algorithms applicable to agile supervisory control of teams involving human and autonomous agents. Research the development of an information infrastructure that is operational context sensitive to allow the dynamic prioritization of date based on its anticipated information value and mission criticality. Study building proactive decision support tools for Command and Control. Investigate Navigating in Uncertainty.\n\nSOCIAL NETWORK ANALYSIS:  Continue research on socio-technical aspects of community mobilization and complex humanitarian operations, including the use of novel platforms, social networks and the impact of novel technologies on human behavior in crisis and collaborative contexts. Continue development of novel information feeds for Pacific Command and for testbeds and tool chains for rapid disaster analysis and response. Continue efforts on information conflicts, social-cyber behavior and hybrid warfare.  Initiate research on competitive narrative and digital media assessment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.777"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "HUMAN COMPUTER INTERACTION\/VISUALIZATION:  Conduct research on audio-visual cue integration for 360-degree periscope displays by utilizing eye-tracking, sleep studies and traditional behavioral measures to characterize human performance on periscope-related tasks under a variety of physiological conditions.\n\nCOMMAND DECISION MAKING (CDM):  Development of task management algorithms applicable to agile supervisory control of teams involving human and autonomous agents. Research the development of an information infrastructure that is operational context sensitive to allow the dynamic prioritization of date based on its anticipated information value and mission criticality. Study building proactive decision support tools for Command and Control. Investigate Navigating in Uncertainty.\n\nSOCIAL NETWORK ANALYSIS:  Initiate development of warfighting experiments for information environment assessment, civil-military communications (public affairs), information operations and psychological operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.745"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.745"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Human-Machine Teaming: Applied research on system interface designs and human-machine interaction methodologies that enable or enhance Warfighter performance and human-machine teaming. Focus areas include: (i) Physiological monitoring and cognitive state estimation; (ii) Psychoacoustics and audio-visual scene interpretation; and (iii) Rapid interface design evaluation. \n\nSocial Networks and Computational Social Science: Applied research in information environment assessment, civil-military communications (public affairs) information operation, and psychological operations. This research addresses problems of countering influence operations, dealing with polarized audiences, and mitigation of social hysteria propagation in online and real-world information campaigns. These efforts include gamification to provide principles and foundational frameworks for development of training and exercises, including operating in contested information environments.   \n\nCommand Decision Making: Applied research in decision aid algorithms and human interfaces for command and control processes, to include alerting command staff when mission re-planning is required. Research technologies to capture and share practical knowledge that is learned on the job and effectively share with peers as a supplement to formal training. Conduct applied research for the development of supervised learning algorithms that capture mission planning workflow for a range of missions."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MEDICAL TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "Applied research in reducing operational health threats and enhancement of human performance; development of point-of-injury medical equipment, diagnostic capabilities and treatments; technologies to improve Warfighter safety and to enhance personnel performance under adverse conditions. To prevent duplication of effort, research is coordinated with other Services through the Armed Services Biomedical Research Evaluation and Management (ASBREM) Committee."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.462"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "UNDERSEA MEDICINE:  \nContinue efforts to reduce operational injuries. Study decompression sickness (DCS) and arterial gas embolism (AGE), to include novel approaches to the prevention, detection and treatment of DCS\/AGE, particularly by non-recompressive methods. Investigate the development of prophylactic agents preventing hyperbaric oxygen toxicity. Prolonged exposure to hyperbaric oxygen can be toxic to lungs, nervous system and eyes. Study the optimization of diver and submariner health and performance when exposed to a variety of environmental and unique stressors (heat and cold, prolonged deployments, effects of altered diurnal rhythms, non-standard breathing gases, lack of sunlight, etc). Explore novel pharmaceutical interventions for hyperbaric oxygen toxicity. Initiate research on improving performance in extreme environments including integrated diving helmet audio-visual displays; human-machine symbiosis; nutrition, hydration and gut microbiome studies; and genomics\/metabolomic approaches.\n\nREGENERATIVE MEDICINE:  \nContinue the program with the Armed Forces Institute for Regenerative Medicine (AFIRM).\n\nNOISE INDUCED HEARING LOSS (NIHL): \nContinue research to reduce noise at the source, i.e. jet engine quieting and flight deck noise reduction. Study the\nbiomedical effects of underwater sound as military divers must operate safely and effectively in potentially complex\nunderwater sound fields. Mitigate the impact of exposure to stressful combat environments prior to deployment through\n\"stress inoculation\". Study the incidence, susceptibility, and mitigation strategies of NIHL and tinnitus. Research the\nprevention, treatment and reversal of NIHL and tinnitus. Investigate the improvement of personal protective equipment\ntechnology. Continue Jet Noise Reduction Project to utilize analytical modeling and simulation tools anchored by\nexperiment to develop and assess solutions enabling mitigation of jet induced noise from high performance tactical aircraft."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.839"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "UNDERSEA MEDICINE:  \nConduct efforts to reduce operational injuries. Study Decompression Sickness (DCS) and Arterial Gas Embolism (AGE), to include novel approaches to the prevention, detection and treatment of DCS\/AGE, particularly by non-recompressive methods. Investigate the development of prophylactic agents preventing hyperbaric oxygen toxicity. Prolonged exposure to hyperbaric oxygen can be toxic to lungs, nervous system and eyes. Study the optimization of diver and submariner health and performance when exposed to a variety of environmental and unique stressors (heat and cold, prolonged deployments, effects of altered diurnal rhythms, non-standard breathing gases, lack of sunlight, etc). Explore novel pharmaceutical interventions for hyperbaric oxygen toxicity. Continue research on improving performance in extreme environments including integrated diving helmet audio-visual displays; human-machine symbiosis; nutrition, hydration and gut microbiome studies; and genomics\/metabolomic approaches.\n\nREGENERATIVE MEDICINE:  \nContinue the program with the Armed Forces Institute for Regenerative Medicine (AFIRM).\n\nNOISE INDUCED HEARING LOSS (NIHL): \nConduct research to reduce noise at the source, i.e. jet engine quieting and flight deck noise reduction. Study the\nbiomedical effects of underwater sound as military divers must operate safely and effectively in potentially complex\nunderwater sound fields. Mitigate the impact of exposure to stressful combat environments prior to deployment through\n\"stress inoculation\". Study the incidence, susceptibility, and mitigation strategies of NIHL and tinnitus. Research the\nprevention, treatment and reversal of NIHL and tinnitus. Investigate the improvement of personal protective equipment\ntechnology. Continue Jet Noise Reduction Project to utilize analytical modeling and simulation tools anchored by\nexperiment to develop and assess solutions enabling mitigation of jet induced noise from high performance tactical aircraft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.771"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.771"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Undersea Medicine and Performance: Applied research efforts include: Integrated diving helmet audio-visual displays; and Pharmacological agents and technologies to mitigate decompression sickness and oxygen toxicity.\n\nSensory Neuroscience and Whole-body Physiology: Applied research to improve personal protective equipment and monitoring systems in order to mitigate biomedical effects of exposure to high-levels of acoustic pressure or electromagnetic energy."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HUMAN RESEARCH PROTECTION PROGRAM  (HRPP)"
                                    },
                                    "Description": {
                                        "val": "Part 46 of Title 45, Code of Federal Regulations (CFR), Protection of Human Subjects (henceforth: \"Common Rule\") is codified in the Department of Defense (DoD) as 32 CFR 219, and implemented through DoD Instruction 3216.02, which is the policy that must be followed for human subjects research conducted, supported, or otherwise subject to regulation by any federal department or agency. The Secretary of the Navy Instruction SECNAVINST 3900.39E identifies the Chief of Naval Research (CNR) as providing support and expertise for human research protection in the systems commands, operational forces, training commands and DON-supported non-DoD institutions. The HRPP program satisfies the aforementioned regulations and policies by: 1) ensuring that research involving human subjects complies with Federal, DoD, and DON research protection requirements; and 2) providing education programs in human research ethics to all levels of staff involved in the review, approval, conduct, management, or support of DON research involving human subjects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.685"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Implement the DON Human Research Protection Program (HRPP) in the Navy's Systems Commands, operational forces, training commands, and DON-supported research involving human subjects performed by non-DoD institutions, and enforce regulatory compliance in human subjects research conducted and supported by the DON. Specific tasks include: DON-wide training for the revised Common Rule at 45 Code of Federal Regulations Part 46 Subpart A, develop new Human Research Protection Programs for 3 non-medical commands, and create non-medical DON human research protection community of excellence network"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.705"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.705"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Execute DON HRPP Management Plan; provide day-to-day oversight of DON HRPP activities; conduct periodic site inspections and assist visits; conduct training for Exempt Determination Officials, conduct Component and Headquarters-level review of DON-supported human subjects research; provide subject matter expertise and guidance on all DON-supported research involving human subjects; implement revisions to Standard Operating Procedures in light of revisions to the Common Rule and SECNAVINST 3900.39E; and provide DON input to USD(R&E) and other DoD policy guidance impacting DON human research-related efforts."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2019 to FY 2020 reflects the realignment of resources from PE: 0603671N (U)Navy Advanced Technology Development(ATD) Proj. 3433 for Human Research Protection Program (HRPP) back into PE: 0602236N Warfighter Sustainment Applied Res Proj: 0000 and into the Human Research Protection Program (HRPP) R2 Activity."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "THE OFFICE OF NAVAL RESEARCH GLOBAL"
                                    },
                                    "Description": {
                                        "val": "Supports the Office of Naval Research (ONR) Global mission to serve as the preeminent external facilitator for the Naval Research Enterprise.  This is accomplished by establishing quality, relevant connections between the international research and development community, Naval fleet\/forces, DOD, other US Government agencies and international partners.\n\nScience Advisors (SA):  This effort ensures that the operational Naval fleet\/force help shape the DON investment in science and technology (S&T), develops teaming relationships to rapidly prototype, experiment, demonstrate and transition technology, supports development of technology-based capability options for Naval forces, and enables warfighting innovations based on technical and conceptual possibilities. The SA Program also informs capability-based war games using current and future technology to identify future capability strengths and shortfalls that assist in shaping the DON investment strategy. The ONR Global SA Program enables continuous communication and collaboration between the warfighters, the Naval Research & Development Enterprise, and strategic development commands. \n \nINTERNATIONAL SCIENCE: The ONR Global mission is also accomplished through PhD-level scientists located in Asia, Europe and South America, providing coverage in these regions as well as Africa, Australia\/New Zealand and the Middle East. ONR Global scientists actively search the globe for emerging scientific research and promising technologies, collaborating with international organizations and researchers through liaison visits and grants in innovative applied research. The direct impact of this investment is to leverage international research during increasingly dynamic global interdependence and improve the ability to solve DON S&T challenges through shared knowledge and technologies with partners. In addition, this investment builds global S&T awareness to reduce the risk of potential technological surprise, and supports theater security cooperation goals to sustain cooperative relationships with an expanding set of international partners. \n\nINTERNATIONAL ENGAGEMENT: ONR Global also supports international engagement with partner nations through the development and maintenance of bilateral and multilateral relationships, international agreements, and other activities that promote RDT&E collaboration and interoperability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.737"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "ONR Global will continue to support all Science Advisor program efforts and will continue to engage with the international\nS&T community through 28 PhD-level scientists, placed in seven overseas offices, utilizing liaison visits and awarding\napplied research grants. Complete the establishment of an office in India."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.760"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "ONR Global will support 28 PhD level scientists, in seven overseas offices, continuing to engage with international scientists and engineers through liaison visits to research institutions and continue actively fostering international collaboration by awarding research grants."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.733"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.733"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Support all Science Advisor program efforts across Fleet and Forces Commands; objectively assess placement of current Science Advisors and requests for additional support in terms of impact to the Fleet and S&T return on investment. \n-Support PhD-level scientists, in seven overseas offices, continuing to engage with international scientists and engineers through liaison visits to research institutions and continue actively fostering international collaboration by awarding research grants.\n\n- Support international engagement with ten partner nations, three multi-lateral groups, and support to the Northern Atlantic Treaty Organization (NATO), in order to increase collective Naval capability, capacity, and interoperability."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TRAINING TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "Applied research to enhance the Navy's ability to \"train as they fight\" in classroom settings, simulated environments, and during deployment to operate effectively in complex, high stress, information-rich, and ambiguous environments of modern warfare. Improved efficiency and cost-effectiveness is achieved by applying operations research, modeling and simulation, and instructional, cognitive, and computer sciences to the development, delivery, evaluation, and execution of training and education. To prevent duplication of effort, research is coordinated with other Services via the Human Systems Community of Interest."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.959"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "COGNITIVE SCIENCE OF LEARNING:  \nResearch and assess advanced gaming technology for enhanced training. Conduct experiments to validate automated\nperformance assessment and after action reviews. Develop a systematic program of applied research addressing\nunanswered questions regarding effective instructional strategies in artificially intelligent tutoring. Research the neurobiology of learning including integration of the role of white matter. Develop games that incorporate artificial intelligence (AI) techniques to teach complex warfighter skills decision-making and problem solving. Develop optimal training strategies for intelligent jobs on mobile devices (e.g., IPad) and immersive environments for training interpersonal and leadership skills. Design and conduct experiment to assess training effectiveness of intelligent tutor for training ship handling skills. Design features and develop novel psychometric approaches to assess human performance in medical\/military simulations and simulators. Conduct field studies and user tests evaluating new features and job aiding tools. Research computational neuron-models in the design of training systems. Develop skill decay models for psychomotor, perceptual, and cognitive skills and refresher training strategies. Create intelligent avatars to interact with learners from different cultural, linguistic backgrounds, and preferences. Design scenarios generators that produce integrated (e.g.,individual and collective) training. Initiate development of computational model for learning theory to drive design of instruction and continue research on individual differences.\n\nENHANCING WARFIGHTER COGNITIVE CAPABILITY:\nContinue research to understand the structural relations among the latent variables of short-term memory, working memory, executive attentional control, and fluid intelligence. Assess the improvement in recruit classification provided by the addition of measures of fluid intelligence and working memory. Understand the role of intrinsic motivation in facilitating the transfer of working memory training to other cognitive capabilities. Study the efficacy of game-based brain training using hand-held (fieldable) hardware platforms. Determine the relationship between induced gains in fluid intelligence and cognitive adaptability and agility, considered from the perspective of military decision-making. Develop multi-agent based architectures for modeling human behavior, improve techniques for human cognitive and behavioral modeling, and create highly realistic simulated teammates.\n\nCOMPUTATIONAL MODELS OF HUMAN BEHAVIOR:  \nResearch game based training to more effectively enable better warfighter understanding of languages and cultures to enhance their regional expertise.  Develop software tools to facilitate building natural language tutorial dialogs for artificially intelligent tutoring.  Integrate cognitive and neuron-computational models of human learning."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.918"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "COGNITIVE SCIENCE OF LEARNING:  \nConduct research and associated efforts to assess advanced gaming technology for enhanced training. Conduct experiments to validate automated performance assessment and after action reviews. Development a systematic program of applied research addressing unanswered questions regarding effective instructional strategies in artificially intelligent tutoring. Conduct research the neurobiology of learning including integration of the role of white matter. Develop games that incorporate Artificial Intelligence (AI) techniques to teach complex warfighter skills decision-making and problem solving. Continue work to develop optimal training strategies for intelligent jobs on mobile devices (e.g., IPad) and immersive environments for training interpersonal and leadership skills. Work to design and conduct experiment to assess training effectiveness of intelligent tutor for training ship handling skills.  Efforts to design features and develop novel psychometric approaches to assess human performance in medical\/military simulations and simulators. Conduct field studies and user tests evaluating new features and job aiding tools. Continue research in computational neuron-models in the design of training systems. Conduct ongoing efforts to develop skill decay models for psychomotor, perceptual, and cognitive skills and refresher training strategies. Work to create intelligent avatars to interact with learners from different cultural, linguistic backgrounds, and preferences. Continue design scenarios generators that produce integrated (e.g.,individual and collective) training. Development of computational model for learning theory to drive design of instruction and continue research on individual differences.\n\nENHANCING WARFIGHTER COGNITIVE CAPABILITY:\nConduct research to understand the structural relations among the latent variables of short-term memory, working memory, executive attentional control, and fluid intelligence. Work to assess the improvement in recruit classification provided by the addition of measures of fluid intelligence and working memory. Efforts to understand the role of intrinsic motivation in facilitating the transfer of working memory training to other cognitive capabilities. Continue the study the efficacy of game-based brain training using hand-held (fieldable) hardware platforms. Conduct work to determine the relationship between induced gains in fluid intelligence and cognitive adaptability and agility, considered from the perspective of military decision-making. Develop multi-agent based architectures for modeling human behavior, improve techniques for human cognitive and behavioral modeling, and create highly realistic simulated teammates.\n\nCOMPUTATIONAL MODELS OF HUMAN BEHAVIOR:  \nResearch game based training to more effectively enable better warfighter understanding of languages and cultures to enhance their regional expertise.  Development of software tools to facilitate building natural language tutorial dialogs for artificially intelligent tutoring.  Continue integration of cognitive and neuron-computational models of human learning."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.888"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.888"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Technologies for Naval Training: Applied research to augment training, skill maintenance, and evaluation through gaming, and learning theory. Research includes developing effective instructional strategies in intelligent tutors and conducting evaluation of intelligent job aids. Develop computational models of skill decay for psychomotor, perceptual, and cognitive skills, and refresher training strategies. \n\nAdvanced Integrated Maritime Mission Modeling: Applied research in the development of live, virtual, and constructive training and experimentation technologies. Efforts will include developing tools for training in denied and degraded electromagnetic environments and in extreme weather environments."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "As discussed in Section A, there are a significant number of varied efforts within this PE. Each effort is measured against both technical and financial milestones. Each program effort and its projects are reviewed in depth for technical and transition performance against established goals. The Program Managers conduct routine site visits to performing organizations to assess programmatic and technical progress and most projects conduct an annual or biannual review by an independent board of visitors who assess the level and quality of the Science and Technology (S&T) basis for the project."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "6.900"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "6.900"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "2.400"
                                        },
                                        "Text": {
                                            "val": "Research into social networks and the impact of novel technologies on human behavior in crisis and collaborative contexts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warfighter Safety and Performance"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4.500"
                                        },
                                        "Text": {
                                            "val": "Conduct research to include: continued studies on decompression sickness, oxygen toxicity, optimization of diver performance, and assessment of the impact of thermal stress on operational performance."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Interest Items not included in other Projects."
                        }
                    }
                }
            ]
        }
    }
}