{
    "id": "2020-DefenseInformationSystemsAgency-PB-0400-MJBOOK-0-3-20c9efcf6d605b32d3d5f083f831185effe1f78c53559fcdc9809c2a22add379-8",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-VOL5_ALL-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Defense Information Systems Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0302019K"
        },
        "ProgramElementTitle": {
            "val": "Defense Info. Infrastructure Engineering and Integration"
        },
        "R1LineNumber": {
            "val": "210"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Information Systems Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "145.582"
            },
            "PriorYear": {
                "val": "20.059"
            },
            "CurrentYear": {
                "val": "16.121"
            },
            "BudgetYearOne": {
                "val": "15.798"
            },
            "BudgetYearOneBase": {
                "val": "15.798"
            },
            "BudgetYearTwo": {
                "val": "16.226"
            },
            "BudgetYearThree": {
                "val": "16.453"
            },
            "BudgetYearFour": {
                "val": "16.787"
            },
            "BudgetYearFive": {
                "val": "17.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Information Infrastructure Engineering and Integration effort encompasses two projects: Modeling and Simulation and DoD Information Network (DODIN) Systems Engineering and Support. There are two major activities under the Modeling and Simulation project: Modeling and Simulation and DODIN Enterprise Wide Systems Engineering (EWSE).\n\nThe DODIN EWSE activity resolves near term (one to three years) high-priority technical issues defined by DoD Chief Information Officer (DoD CIO) and Defense Information Systems Agency (DISA), that impact operational capabilities affecting DODIN End-to-End (E2E) interoperability and performance. \n\nThe Modeling and Simulation project provides architecture, systems engineering and E2E analytical functions for DISA and its customers, ensuring integrated capabilities to fulfill warfighter mission requirements. Ongoing beneficiaries of these capabilities include DoD CIO, the DISA Network Services Directorate, the DISA Enterprise Services Directorate, Program Executive Office-Mission Assurance, the Defense Information Systems Network Command Center and Joint Communications Simulation System users in DoD.\n\nThe DODIN Systems Engineering and Support project performs discovery, research, development and experimentation of emerging and commercial technologies through the Office of the Chief Technology Officer (OCTO) to fill capability shortfalls and technology gaps across the Future Years Defense Program (FYDP).   The OCTO identifies these gaps\/shortfalls, pursues leading innovative solutions from industry, academia, and the Federal sector, and engages industry partners for commercial best practices.  The OCTO Develops technology forecasts and innovation roadmaps for existing and nascent DISA Programs in the following areas:  Process\/Automation, Cloud, Cyber Security, End-User Devices, Communication (DODIN\/Mobile\/End-User Devices).   The OCTO conducts technical system engineering reviews and oversight of DISA and DoD enterprise products and services.  The OCTO performs early identification of technology needs and explores, develops, and delivers recommended emerging technologies to the DISA Requirements & Analysis Office."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "21.564"
                },
                "CurrentYear": {
                    "val": "16.561"
                },
                "BudgetYearOne": {
                    "val": "15.719"
                },
                "BudgetYearOneBase": {
                    "val": "15.719"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "20.059"
                },
                "CurrentYear": {
                    "val": "16.121"
                },
                "BudgetYearOne": {
                    "val": "15.798"
                },
                "BudgetYearOneBase": {
                    "val": "15.798"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.505"
                },
                "CurrentYear": {
                    "val": "-0.440"
                },
                "BudgetYearOne": {
                    "val": "0.079"
                },
                "BudgetYearOneBase": {
                    "val": "0.079"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.634"
                    },
                    "CurrentYear": {
                        "val": "-0.440"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.871"
                                },
                                "BudgetYearOne": {
                                    "val": "0.079"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.079"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The decrease in FY 2018 reflects a transfer of funding to Small Business Innovation Research (SBIR) and Small Business Technology Transfer (STTR) programs (-$0.634) and due to completion of the major phases of two projects, QUICKWIN and LIFI.  QUICKWIN delivered tablets with the same DISANet office automation solution, functionality, and security as DISANet laptops, including implementation of the DoD PKI Purebred derived credential concept instead of CAC cards, with key attestation and root of trust (RoT) (-$0.871).  \n\nThe decrease in FY 2019 reflects a transfer of funding to Small Business Innovation Research (SBIR) and Small Business Technology Transfer (STTR) programs (-$0.440).\n\nThe increase of +$0.079 in FY 2020 is due to the expansion of technical system engineering reviews and oversight of DISA and DoD enterprise products and services for Return on Investment (ROI) analysis, analysis of alternatives, and mission partner support."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "E65"
                    },
                    "ProjectTitle": {
                        "val": "Modeling and Simulation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "92.243"
                        },
                        "PriorYear": {
                            "val": "11.409"
                        },
                        "CurrentYear": {
                            "val": "4.343"
                        },
                        "BudgetYearOne": {
                            "val": "3.896"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.896"
                        },
                        "BudgetYearTwo": {
                            "val": "4.071"
                        },
                        "BudgetYearThree": {
                            "val": "4.154"
                        },
                        "BudgetYearFour": {
                            "val": "4.243"
                        },
                        "BudgetYearFive": {
                            "val": "4.322"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Modeling and Simulation project provides architecture, systems engineering and end-to-end (E2E) analytical functions for the Defense Information Systems Agency (DISA) and its customers, ensuring integrated capabilities to fulfill warfighter mission requirements. Modeling and Simulation activities support the Department of Defense (DoD) communications planning and investment strategy, including: application performance assessments, contingency planning, network capacity planning and diagnostics, and systems-level modeling and simulation. Project efforts provide across-theater information awareness for Combatant Commands through application solutions for integrated networks, including DoD’s missions in Afghanistan and the Defense Information Systems Network (DISN) by: (1) supporting the development and implementation of DoD Information Network (DODIN) Enterprise Wide Systems Engineering (EWSE) processes essential to evolving the DODIN in a manner that enables interoperability and E2E performance for critical DODIN programs; (2) developing standardized DISA systems analyses and integration processes to improve systems integration across DISA for all DISA developed communication systems and services; and (3) providing the underlying modeling and simulation and analytical support for E2E DISA and DoD systems engineering and assessment. \n\nProject efforts provide DoD decision makers with services and a suite of tools capable of identifying key points of impact on DoD command and control information systems and recommending trade-offs within the DODIN configuration with regard to prioritized performance, availability, and security. This effort will reduce the risk in products deployed to the warfighter through improved network performance and traffic analysis, and an efficient means of troubleshooting and subsequent redesign."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Modeling and Simulation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.409"
                                            },
                                            "Text": {
                                                "val": "Will develop modeling and simulation tools to analyze planned changes to the DISN optical and IP core network, data centers, internet and commercial cloud computing gateways, and network security solutions.  Will develop capabilities for analysis of software defined networking.  Will perform test and evaluation of DISN Internet Access Point security solutions with government and contracted labor support.  Will research technologies and solutions that can be transitioned to operations and will demonstrate feasibility through solutions analysis and proof-of-concept development and test. Will perform product and solution assessments using developed modeling tools to provide technical solutions for IT capabilities to ensure compatibility and interoperability with the DISN, data centers, and JIE solution architectures. Will develop application performance monitoring framework to support reliable operation of enterprise services and applications.\n\nThe increase of +$1.366 from FY 2017 to FY 2018 is attributed to increased efforts in evaluating tools and solutions for a regional defensive cyber security systems, performance of cloud computing and security.  Additionally, the increase is associated with test and evaluation of larger scale software defined data centers and network function virtualization. This increase is partially offset by a decrease of -$0.207 is attributed to the Service Requirements Review Board (SSRB) contract reduction."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.343"
                                            },
                                            "Text": {
                                                "val": "Will develop modeling and simulation tools to analyze planned changes to the DISN optical and  Internet Protocol (IP) core network, data centers, internet and commercial cloud computing gateways, and network security solutions.  Will develop capabilities for analysis of software defined networking.  Will perform test and evaluation of DISN Internet Access Point security solutions with government and contracted labor support.  Will research technologies and solutions that can be transitioned to operations and will demonstrate feasibility through solutions analysis and proof-of-concept development and test. Will perform product and solution assessments using developed modeling tools to provide technical solutions for IT capabilities to ensure compatibility and interoperability with the DISN, data centers, and JIE solution architectures. Will develop application performance monitoring framework to support reliable operation of enterprise services and applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.896"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.896"
                                            },
                                            "Text": {
                                                "val": "Will provide architecture and model development to Cyber Development architecture for developing future DODIN cyber architecture and cyber portfolio management. This task will develop DoD Cybersecurity Analysis and Review (DoDCAR) analysis tools for implementing DoDCAR based cyber architecture and system assessment methods. This effort will develop modeling and simulation tools to analyze planned changes to the DISN optical and IP core network, data centers, internet and commercial cloud computing gateways, and network security solutions. Will develop capabilities for analysis of software defined networking. Will perform test and evaluation of DISN Internet Access Point security solutions with government and contracted labor support. Will research technologies and solutions that can be transitioned to operations and will demonstrate feasibility through solutions analysis and proof-of-concept development and test. Will perform product and solution assessments using developed modeling tools to provide technical solutions for IT capabilities to ensure compatibility and interoperability with the DISN, data centers, and JIE solution architectures. Will develop application performance monitoring framework to support reliable operation of enterprise services and applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease of -$0.447 is due to the completion of pilot assessments on innovative and emerging technologies."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PE 0302019K"
                                    },
                                    "Title": {
                                        "val": "Operation & Maintenance, Defense-Wide"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "15.606"
                                        },
                                        "CurrentYear": {
                                            "val": "16.437"
                                        },
                                        "BudgetYearOne": {
                                            "val": "16.579"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "16.579"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "16.911"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "EWSE uses contractors to assist\/supplement the Government lead\/team for technical activities. Subject matter experts in both large and small businesses are sought for the engineering support. Firm fixed price contracts with one option year are typically used in open competition. Furthermore, technical work with Federally Funded Research and Development Centers (FFRDCs) such as MITRE and MIT Lincoln Lab are established and coordinated when the Government can leverage their expertise and R&D in the key technology.  \n\nModeling and Simulation uses a range of contractors for modeling support to the various projects. Contractors range from small to large business, predominantly using open competition methods and Firm Fixed Price (FFP) tasks and utilizing multi-year (base plus option years) contracts where possible. Support includes network modeling tool and processes development to adapt to ever-evolving OSD\/DISA programs and projects, analyses, capacity planning, and network redesign using the models. Some specific support (e.g., integration with proprietary software) will require contracting with OPNET (e.g., sole source). FFRDCs are also considered depending upon the task."
                        },
                        "PerformanceMetrics": {
                            "val": "DISN core transport bandwidth sufficiency, tied to capacity planning and activation of bandwidth in the DISN optical core to keep at least 25% spare capacity, to allow for provisioning of unforeseen requirements and rerouting under outages.\n\nDISN IP Core bandwidth sufficiency tied to capacity planning and activation of IP bandwidth to maintain average bandwidth utilization of DISN IP Core and NIPRNet backbone circuits under 65% during daily peak periods.\n\nDISN SIPRNet bandwidth sufficiency tied to capacity planning and activation of IP bandwidth to maintain average bandwidth utilization of SIPRNet backbone circuits under 50% during daily peak periods.\n\nThe EWSE projects will be measured by the number of technical studies performed with associated systems engineering artifacts (market research reports, technology assessments, solutions analyses, etc.) that are developed to support DODIN capabilities; and the number of proof-of-concept demonstrations or pilots executed to support viability of the technical approach\/recommendation. These products will be coordinated with the stakeholders, users and\/or Program Management Offices (PMO) to ensure EWSE provides the right deliverables for solution development decisions.  \n\nFY 2018 planned target: Will complete 2 technical studies, 6 engineering artifacts, and 2 concept demonstrations. \/ Actual: Completed 2 technical studies, 6 engineering artifacts and 2 concept demonstrations.\nFY 2019 planned target: Will complete 2 technical studies, 6 engineering artifacts, and 2 concept demonstrations.\nFY 2020 planned target: Will complete 2 technical studies, 6 engineering artifacts, and 2 concept demonstrations.\n\nThe Modeling and Simulation project provides architecture, systems engineering and E2E analytical functions for DISA and its customers, ensuring integrated capabilities to fulfill warfighter mission requirements. Ongoing beneficiaries of these capabilities include DoD Enterprise Activities, the DODIN and DISA applications, as well as engineering capabilities support to programs and projects to address technical and engineering solutions to activities such as information assurance and cyber security; mobility and cloud technologies and warfighter and mission support activities."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development 1"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OPNET Tech, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bethesda, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.506"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.449"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.342"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.124"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.124"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 2"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "APPTIS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Chantilly, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.822"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.812"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.418"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 3"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Falls Church, VA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Falls Church, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.312"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.312"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 4"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen, Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "McLean, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.333"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.648"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.250"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.120"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.120"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 5"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NRL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.100"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.100"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 6"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Soliel, LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.862"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.862"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 7"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "COMPTEL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.805"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.805"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 8"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "COMPTEL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.926"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.926"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 9"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MIT Lincoln Labs"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Cambridge, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.439"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.860"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "13.299"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 10"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.501"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.767"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.268"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Enterprise Wide Systems Engineering 11"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fairfax, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.784"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.784"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Clear Sky Pilot"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFRL Terremark"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "24.083"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "24.083"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Narus"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFRL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rome, NY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.450"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.450"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Cyber Accelerator"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DTIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.516"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.516"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Commercial Integration Demonstration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DTIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.750"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.750"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Web Content Filtering: Perimeter Defense Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Oberon Associates"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Meade, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.854"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.854"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Host Based Security Ops Assessment"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Summit Technologies, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft Meade, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.700"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.700"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Secure Configuration Management Ops Assessment"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Cyber Security research and Solutions Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft Meade"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.964"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.964"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development 11"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Johns Hopkins University Applied Physics"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Laurel, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.450"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.350"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.141"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.941"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Technical Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Axom Technologies"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fort Meade"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.502"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.478"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.201"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.181"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Requirements Analysis\/Program Management: Civilian Pay"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.445"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.092"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.072"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.520"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.520"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Cloud Hosted Shared Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Nisga's Data Systems LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Herndon, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.350"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.350"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Cloud\/ Gateway Pilot"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Alvarez and Associates"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Tysons Corner, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.304"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.304"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Cloud\/ Gateway Pilot"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BY Light Professional IT Services"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ": Arlington, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.413"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.413"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "IP Network Modeling"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Riverbed"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bethesda, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.056"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-09"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.576"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.576"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JCSS\/JRSS Modeling"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen, Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "McLean, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.131"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.471"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.323"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.323"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JRSS Modeling"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "IPKEYS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Annapolis Junction, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.373"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.373"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "E2E Performance"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Tapestry"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Chambersburg, PA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.251"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.251"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "E2E Performance"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.142"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.248"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.233"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.233"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Comptel"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.072"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.072"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Horizontal Engineering"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Horizontal Engineering"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modeling and Simulation Applications"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Modeling and Simulation Applications"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T62"
                    },
                    "ProjectTitle": {
                        "val": "DoD Information Network (DODIN) Systems Engineering and Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "53.339"
                        },
                        "PriorYear": {
                            "val": "8.650"
                        },
                        "CurrentYear": {
                            "val": "11.778"
                        },
                        "BudgetYearOne": {
                            "val": "11.902"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.902"
                        },
                        "BudgetYearTwo": {
                            "val": "12.155"
                        },
                        "BudgetYearThree": {
                            "val": "12.299"
                        },
                        "BudgetYearFour": {
                            "val": "12.544"
                        },
                        "BudgetYearFive": {
                            "val": "12.678"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The DoD Information Network (DODIN) Systems Engineering and Support project aligns with the updated DISA Strategic Plan, which includes the Chief Technology Officer’s Outlook and a Technology Watchlist. The Watchlist identifies key technology areas that are essential for Defense Information Systems Agency (DISA) including:  Process\/Automation, Cloud, Cyber Security, End-User Devices, and Communication (DODIN, Mobile\/End-User Devices).   \n\nThe DODIN Systems Engineering and Support Project ensure the technical strategies for the Defense Information Systems Agency (DISA) are in line with the DoD IT Efficiency strategy and the latest Department of Defense Chief Information Office (DoD CIO) Capabilities Planning Guidance (CPG) through the Office of the Chief Technology Officer (OCTO). These strategies will establish the foundation for DISA's technology investments and technical development. The OCTO leverages emerging technology to drive efficiencies and cost savings to the DoD, the Warfighter, and other Federal Agencies, and provides actionable, decision-oriented information to the Secretary of Defense, Joint Staff, Military Services, Combatant Commands, and other mission partners in satisfying DoD mission objectives.\n\nCyber security and cloud computing present critical near term challenges, especially the ability to securely leverage commercial cloud service offerings. The OCTO’s partnership with Defense Advanced Research Projects Agency (DARPA) will assess and transition technologically relevant and mature solutions. Included are applications with a security wrapper that detect and mitigate cyberattacks; smart routing and managed reputation capability; embedded system defense capabilities; and resilient and intrusion-tolerant network capabilities.\n\nPartnerships with industry, academia, and the Federal sectors will produce requisite cyber measures and ensure optimal use of commercial cloud services. The OCTO will conduct technology assessments, process improvements, as well as the analysis and review of potential technology solutions, products, capabilities and services to ensure consistency with DODIN architecture and standards. Enabled by the Technology Assessment Framework (TAF) and the DISA Technology Information Repository (DTIR), the OCTO will perform “quick looks” and deeper technology evaluations to provide critical awareness, characterization, and suitability of specific technologies. These include the assessments of advanced cloud management capabilities; physical containers to enable mobile data center; emerging open source Storage Service Application Programming Interfaces (APIs) and\/or abstractions and global standards for storage services; analytic platform performance baselines of emerging commercial analytic platform products; advanced approaches to Continuity of Operations (COOP) in a hybrid cloud environment; and the next generation software defined networks for automating and virtualizing the DODIN.  The Agency's internal innovation suggestion program, DISAruptive, previously resourced by available government civilian time, will be revamped in FY2019 with relaunch by FY20 to deliver technical expertise and including training for potential innovators and innovation suggestion technical support including limited test conduct, instrumentation, or test materials."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Department of Defense Information Network (DODIN) Systems Engineering and Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.650"
                                            },
                                            "Text": {
                                                "val": "The CTO will expand its focus on laboratory prototyping known as Software Defined Everything (SDE) which is based on the notion of using software to keep redefining itself, rather than being locked into operating in a specific way.  It is easily reconfigurable and extensible software that rapidly morphs to adapt to newly emerging situations.  SDE will serve as an enabler to leverage capabilities from five principal areas. These five areas are; Process\/Automation, Cloud, Cyber Security, End-User Devices, Communication (DoDIN, Mobile\/End-User Devices).   CTO will conduct technical assessments for future cloud computing technologies and innovative service delivery models, mobile devices, application development and vetting best practices, and next generation virtualized Software Defined Networks (SDN) for automating and virtualizing the DODIN.   CTO will partner with commercial partners, academia, technical analysis centers, as well as organizations within the Intelligence Community, to bring state of the art capabilities to the DISA\/DoD resulting in better communications and monitoring tools, enterprise services and improved end-user services and capabilities.  CTO will continue to pursue and refine methods, processes and strategies to assist in the acceleration of capability into the operational environment.                  \n\nThere is a increase of +$1.771 from FY 2017 to FY 2018.  Funding will be used to morph to an internet 2.0 environment where DoD, other government organizations, coalition members, first responders, private industry, academia and commercial vendors will be able to share secured data and information in such a way that adversaries can be identified, found, brought to Justice before inflicting harm on innocent citizens and allies anywhere in the world.  CTO will aggressively pursue next generation technologies to feed the internet 2.0 environment.  These technologies will be leveraged through the expansion of a CTO futuristic Skunk Works effort known as Software Defined Everything (SDE) which is based on the notion of using software to keep redefining itself, rather than being locked into operating in a specific way.  It is easily reconfigurable and extensible software that rapidly morphs to adapt to newly emerging situations.  SDE will serve as an enabler for the internet 2.0 environment. This increase is partially offset by a decrease of -$0.276 is attributed to the Service Requirements Review Board (SSRB) contract reduction."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.778"
                                            },
                                            "Text": {
                                                "val": "The CTO will expand its focus on laboratory prototyping known as Software Defined Everything (SDE) which is based on the notion of using software to keep redefining itself, rather than being locked into operating in a specific way.  It is easily reconfigurable and extensible software that rapidly morphs to adapt to newly emerging situations.  SDE will serve as an enabler to leverage capabilities from five principal areas. These five areas are; Process\/Automation, Cloud, Cyber Security, End-User Devices, Communication (DODIN, Mobile\/End-User Devices).   CTO will conduct technical assessments for future cloud computing technologies and innovative service delivery models, mobile devices, application development and vetting best practices, and next generation virtualized Software Defined Networks (SDN) for automating and virtualizing the DODIN.  CTO will partner with commercial partners, academia, technical analysis centers, as well as organizations within the Intelligence Community, to bring state of the art capabilities to the DISA\/DoD resulting in better communications and monitoring tools, enterprise services and improved end-user services and capabilities.  CTO will continue to pursue and refine methods, processes and strategies to assist in the acceleration of capability into the operational environment.  Develop revision to DISAruptive process, develop training support curriculum, and update user portal."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.902"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.902"
                                            },
                                            "Text": {
                                                "val": "Perform discovery, research, development and experimentation of emerging and commercial technologies to fill capability shortfalls and technology gaps across the Future Years Defense Program (FYDP). Identify gaps\/shortfalls, pursues leading innovative solutions from industry, academia, and the Federal sector, and engages industry partners for commercial best practices. Develop technology forecasts and innovation roadmaps for existing and nascent DISA Programs in the following areas: Process\/Automation, Cloud, Cyber Security, End-User Devices, Communication (DODIN\/Mobile\/End-User Devices). Early identification of technology need and explores, develops, and delivers recommended emerging technologies to the DISA Requirements & Analysis Office. Operationalize DISAruptive enhancements, begin training support curriculum, and begin R&D support to innovative ideas received through the DISAruptive portal."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase of +$0.124 from FY2019 to FY2020 is due to innovation identification and integration."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "O&M, DW\/PE 0302019K"
                                    },
                                    "Title": {
                                        "val": "Operation & Maintenance, Defense-Wide"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.773"
                                        },
                                        "CurrentYear": {
                                            "val": "2.814"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.899"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.899"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.962"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.035"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Market research during the acquisition process includes a review of DISA contracts, other DoD contract vehicles, and other Federal Government agency contracts which are advertised for Government-wide usage.  This market research also includes consideration of small businesses including minority\/women owned (8A) businesses, Historically Black Colleges and Universities, mentor\/protégé and other specialized contract vehicles and processes. Market research evaluates all contractors available from DISA sources for their ability to deliver the products specifically required for the unique program efforts.  The program works collaboratively with vendors to obtain generic cost data for planning and analysis purposes.  Past and current contract prices for similar work and other government-wide agency contracts provide additional sources of information.  Quotes from multiple sources help provide averages for more realistic cost estimates.  DISA makes a concerted effort to award many of its contracts to small businesses.  Additionally, many of the DISA contracts are awarded with multiple option periods. These have the benefit of fixing labor costs over an extended period and minimizing the administrative costs associated with re-issuing short-term contracts."
                        },
                        "PerformanceMetrics": {
                            "val": "Number of Technology Assessments \n\nPerformance is measured by the number of technologies assessed and the technologies transitioned or presented to DISA decision-making bodies such as the Service Portfolio Council (SPC) for acquisition decisions.  The assessments identify, promote, channel and align technology research and investments.  The objectives are to satisfy warfighter requirements by addressing capability gaps, to improve operational effectiveness and efficiency, and to reduce the time needed to field emerging technologies.   \n\nMeasure\/Goal:   Number of technology assessments instantiated within the CTO Technology Environment.  Number of research initiatives designed, developed, demonstrated, and transitioned or presented to DISA decision-making bodies such as the SPC for acquisition decisions.\n\nFY 2018 Target:  12 Assessed and 8 transitioned \/ Actual: 12 Assessed and 8 transitioned.\nFY 2019 Target:  12 Assessed and 8 transitioned.\nFY 2020 Target:  12 Assessed and 8 transitioned."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "FFRDC"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "McLean, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.410"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.323"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.323"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.323"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Industry Tech Res"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Gartner"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.249"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.249"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GIG Technical Insertion Engineering"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SRA, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fairfax, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.211"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.211"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.601"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.601"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DAMA-C"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Defense Micro-electronics Activity"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.794"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.794"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Thin Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MIT Lincoln Labs"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lexington, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.260"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.260"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Moya Technologies, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.212"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.212"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Technical Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Chambersburg, PA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.315"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.084"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Science and Technology Associates, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.091"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.091"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SPAWAR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Charleston, SC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.376"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.376"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Meade, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.691"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.691"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TWM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Falls Church, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.202"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.202"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SOLERS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.373"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.650"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.023"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "McLean, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.500"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.562"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.062"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JITC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Meade, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.351"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.351"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Technical Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Meade, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.953"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.528"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.481"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "IV2: IT Consulting Services, LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Jackson, WY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.674"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.674"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Information Assurance TWM Follow On"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.741"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.741"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TIE NEMS: B&D Consulting"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.564"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.564"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Tapestry Technologies, INC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.637"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.536"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.173"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Management Services - Civilian Pay"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Meade, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.134"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.294"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.428"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PMPC-Itility LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Meade, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.580"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.227"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.229"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.229"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Information Assurance"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Tapestry Tech"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Chambersburg, PA"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.583"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Sys Engineering"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Meade, MD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.650"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.124"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.124"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Management Services - Civilian Pay"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Meade"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.911"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.897"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.897"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management and Knowledge Management"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.229"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.229"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "(DODIN) Systems Engineering and Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Technical Direction Agent (TDA)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Technical Direction Agent (TDA)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering Support"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Engineering Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Industry\/University Technical Research"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Industry\/University Technical Research"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technology Assessments"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Technology Assessments"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "DISA Ruptive"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "DISA Ruptive"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Research and Development for technical solutions"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Research and Development for technical solutions"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}