{
    "id": "2020-Army-PB-2040-JBOOK-caa98a5fe7b001fc6e9636b55add742024da70b1a5204a85a180c10adbb25455-34",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602787A"
        },
        "ProgramElementTitle": {
            "val": "Medical Technology"
        },
        "R1LineNumber": {
            "val": "40"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "88.891"
            },
            "CurrentYear": {
                "val": "92.003"
            },
            "BudgetYearOne": {
                "val": "99.155"
            },
            "BudgetYearOneBase": {
                "val": "99.155"
            },
            "BudgetYearTwo": {
                "val": "94.786"
            },
            "BudgetYearThree": {
                "val": "93.903"
            },
            "BudgetYearFour": {
                "val": "94.955"
            },
            "BudgetYearFive": {
                "val": "96.392"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "660.085"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020, Projects in this Program Element (PE) have been realigned as noted on each applicable R-2A.  \n\nAll FY20 adjustments realign program financial structure to Army Modernization Priorities in support of the National Defense Strategy."
        },
        "ProgramElementMissionDescription": {
            "val": "This PE supports application of knowledge gained through basic research to refine drugs, vaccines, medical devices, diagnostics, medical practices\/ procedures, and other preventive measures essential to the protection and sustainment of Warfighter health. Research is conducted in five principal areas: Combat Casualty Care, Military Operational Medicine, Military Relevant Infectious Diseases, Clinical and Rehabilitative Medicine, Medical Capabilities to Support Dispersed Operations, and Systems Biology\/Network Sciences.\n\nProject 869 Warfighter Health Prot & Perf Stnds \nDescription: Refines knowledge and technologies on screening tools and preventive measures for post-traumatic stress disorder (PTSD) and behavioral health problems (e.g., suicide, substance abuse) and mild traumatic brain injuries, physiological monitors, and interventions to protect Warfighters from injuries resulting from operational stress, and exposure to hazardous environments and materials. Also conducts research on medically valid testing devices (i.e., the test mannequins that are true to the human form and physiologically and anatomically accurate) and predictive models used for the refinement of Warfighter protective equipment. This Project is being coordinated with the Defense Health Agency.\n\nProject 870 Dod Med Def Ag Inf Dis \nDescription: Designs and refines drugs, vaccines, medical diagnostic assays\/tests devices, other preventive measures for protection and treatment against naturally occurring infectious diseases as identified by worldwide medical surveillance and military threat analysis. This Project is being coordinated with the Defense Health Agency.\n\nProject 874 Cbt Casualty Care Tech\nDescription: Identifies and evaluates drugs, biologics (medical products derived from living organisms), medical devices, and associated clinical practices for field trauma care systems, resuscitation, and life support, with emphasis on provision of prolonged field care when medical evacuation and access to definitive surgical care is delayed. Focus is identification of more effective critical care technologies and clinical practices to treat severe bleeding, traumatic brain injury, burns and other combat related injuries. This Project is being coordinated with the Defense Health Agency.\n\nProject ET4 Appl Resch in Clinical and Rehabilitative Medicine \nDescription: Identifies and evaluates drugs, biologics, medical devices, treatments and diagnostics for post-evacuation restorative, regenerative and rehabilitative care, as well as systems for use by field medics and surgeons for ocular trauma. Research focus is on identifying more effective technologies and protocols to treat ocular injury and visual system dysfunction, as well as laboratory and animal studies for regenerating skin, muscle, nerves, vascular and bone tissues for the care and treatment of wounded Service Members. This Project is coordinated with the Defense Health Agency.\n\nProject VB4 System Biology and Network Science Technology \nDescription: Includes strategic oversight, direction and management of applied research in integrative systems biology of military relevant conditions, and the Systems Biology Collaboration Center (SBCC). The SysBioCube (a biomedical research data integration and analysis system), managed by the SBCC, provides the ability for multi-site collaborative efforts to integrate, visualize and evaluate complex data using innovative technologies. Post-Traumatic Stress Disorder and coagulopathy (a disorder that impairs the blood's ability to form clots) projects have utilized the systems biology analytical and visualization within the SysBioCube to inform the development of prognostic indicators, objective diagnostics, and improved and personalized therapeutic strategies more quickly than non-systems approaches. The SBCC also serves as a Medical Research Materiel Command (MRMC) resource for data sharing and data management for maximizing the value of all research efforts across the Command.\n\nProject XV5 Medical Capabilities to Support Dispersed Ops \nDescription: Research to design, develop, and improve medical robotic and autonomous systems (Med-RAS), Virtual Health for telemedicine and remotely delivered patient care, and unmanned capabilities of providing or supporting combat casualty care in far-forward and dispersed geographic environments. This research includes the design of semi-autonomous and closed-loop combat casualty triage, diagnosis, physiological monitoring, therapeutic intervention, casualty evacuation, telemedicine\/tele-mentoring and emergency medical resupply technologies for integration with emerging multi-purpose Army Robotics and Autonomous Systems (RAS) and Virtual Health\/Telemedicine delivery platforms while optimizing the medical logistic footprint.\n\nProject MK4 Warfighter Health Applied Rsch Technology \nDescription: Refines knowledge and technologies on screening tools and preventive measures for PTSD, behavioral health problems, and mild traumatic brain injuries, physiological monitors, and interventions to protect Warfighters from injuries resulting from operational stress and exposure to hazardous environments and materials. Also conducts research on medically valid testing devices and predictive models used for the refinement of Warfighter protective equipment.\n\nProject MM4 Cbt Casualty Care Applied Rsch Technology\nDescription: Identifies and evaluates drugs, biologics (medical products derived from living organisms), medical devices and associated clinical practices for field trauma care, resuscitation, and life support with emphasis on provision of prolonged field care when medical evacuation and access to definitive surgical care is delayed. Focus is identification of more effective critical care technologies and clinical practices to treat severe bleeding, traumatic brain injury, burns and other combat related injuries.\n\nProject MM8 Infectious Diseases Applied Rsch Technology\nDescription: Applied research to design and refine drugs, vaccines, and other medical countermeasures against naturally occurring infectious diseases as identified by worldwide medical surveillance and capability needs assessments.\n\nProject MN1 Applied Sensory Systems Trauma Technology\nDescription: Research to understand the influence of stress on the effectiveness of pain relief drugs (analgesics).  This Project conducts laboratory and animal studies  for the purpose of developing novel, non-opioid drugs to treat pain in the austere battlefield environment with minimal side effects. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the United States Army Medical Research Materiel Command (USAMRMC), Fort Detrick, MD.\n\nAll medical applied research is conducted in compliance with Food and Drug Administration (FDA) or Environmental Protection Agency (EPA) regulations. The FDA requires thorough testing in animals (preclinical testing) to ensure safety and, where possible, effectiveness prior to evaluation in controlled human clinical trials (upon transition to Advanced Technology Development). This PE focuses on research and refinement of technologies such as product formulation and purification and laboratory test refinement with the aim of identifying candidate solutions. This work often involves testing in animal models. The EPA also requires thorough testing of products, such as sterilants, disinfectants, repellents, and insecticides to ensure the environment is adequately protected before these products are licensed for use. \n\nProgram refinement and execution is externally peer-reviewed and fully coordinated with all Services as well as other agencies through the Joint Technology\nCoordinating Groups of the Armed Services Biomedical Research Evaluation and Management (ASBREM) Community of Interest (COI). The ASBREM COI, formed under the authority of the Assistant Secretary of Defense for Research and Engineering, serves to facilitate coordination and prevent unnecessary duplication of effort within the Department of Defenses (DoD) biomedical research and refinement community, as well as their associated enabling research areas."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "83.434"
                },
                "CurrentYear": {
                    "val": "90.075"
                },
                "BudgetYearOne": {
                    "val": "94.708"
                },
                "BudgetYearOneBase": {
                    "val": "94.708"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "88.891"
                },
                "CurrentYear": {
                    "val": "92.003"
                },
                "BudgetYearOne": {
                    "val": "99.155"
                },
                "BudgetYearOneBase": {
                    "val": "99.155"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "5.457"
                },
                "CurrentYear": {
                    "val": "1.928"
                },
                "BudgetYearOne": {
                    "val": "4.447"
                },
                "BudgetYearOneBase": {
                    "val": "4.447"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.039"
                    },
                    "CurrentYear": {
                        "val": "-0.072"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "6"
                    },
                    "CurrentYear": {
                        "val": "2"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "1.413"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.917"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "4.447"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.447"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "869"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Health Prot & Perf Stnds"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "39.254"
                        },
                        "CurrentYear": {
                            "val": "35.754"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "75.008"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned to:\nProgram Element (PE) 0602787A Medical Technology\n* Project MK4 Warfighter Health Applied Rsch Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project conducts research to prevent and protect Warfighters from training and operational injuries; refine mechanisms for detection of physiological (human physical and biochemical function) and psychological (mental) health problems; evaluate hazards to head, neck, spine, eyes, and ears; set the standards for rapid return to duty, and determine new methods to sustain and enhance performance across the operational spectrum. This research provides medical information important to the design and operational use of military systems, and this work forms the basis for behavioral, training, pharmacological (drug actions), and nutritional interventions. \n\nThe four main areas of study are:\n\n(1)\tEnvironmental Health and Protection\n(2)\tPhysiological Health and Performance\n(3)\tInjury Prevention and Reduction\n(4)\tPsychological Health and Resilience\n\nAdditionally, the Warfighter Systems Engineering Architecture task advances medical science and technology in the areas of injury prevention and performance sustainment in the context of human interaction with new Soldier systems, and provides greater insight into informing new research in developing Warfighter systems and the interactions between Warfighters and the systems they employ.\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy.\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this project is performed by the United States Army Medical Research Materiel Command (USAMRMC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Physiological Health - Nutritional Sustainment and Fatigue Interventions"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates methods for managing and controlling the effects of fatigue on Warfighter operational performance and the impact of nutritional strategies to optimize operational performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.584"
                                            },
                                            "Text": {
                                                "val": "Conducted field studies to determine the efficacy of energy and\/or protein supplementation for preventing declines in lean body mass and cognition during and after caloric deficit (shortage of calories consumed). From the results of field studies, continued to develop a descriptive model outlining factors linking the central nervous system and other organs\/systems that impact resilience. Assessed the effect of nutritionally optimized snack products for maintaining body composition and nutritional status during and after military training and operations in a field study. Developed interventions promoting resistance to physical, cognitive and environmental stressors. Evaluated the role of nutritional factors in the maintenance of physiological and neurobehavioral health under operationally relevant conditions. Analyzed the effects of nutritional interventions on indicators of nutritional status. Demonstrated the effectiveness of nutrient and dietary strategies (e.g., omega-3 polyunsaturated fatty acids, zinc, and hydration) for reducing the vulnerability to and\/or accelerating the recovery from mild TBI."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physiological Health and Performance"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates methods for managing and controlling the effects of fatigue on Soldier operational performance and the impact of nutritional strategies to optimize operational performance. Efforts will also contribute to human health and performance optimization and enhancement."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.173"
                                            },
                                            "Text": {
                                                "val": "Develop nutritional interventions for resistance to stress (environmental\/physical\/cognitive) in the field. Evaluate individual differences of environmental influences on Soldier eating behavior. Improve the health of muscle and bone through characterization of protein source effects on metabolic kinetics. Develop a military-specific eating questionnaire for evaluation of nutritional approaches to resist military stress. Conduct studies to determine the effectiveness of energy and\/or protein supplementation for preventing declines in lean body mass and cognition during and after caloric deficit. Continue to develop a descriptive model outlining factors linking the central nervous system and other organs\/systems that impact resilience. Investigate physiological aspects of human health and performance optimization and enhancement."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602787A (Medical Technology) \/ MK4 (Warfighter Health Applied Rsch Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Concussion\/Mild Traumatic Brain Injury (mTBI) Interventions"
                                    },
                                    "Description": {
                                        "val": "This effort refines and evaluates methods to detect and treat concussion as well as identify and evaluate the effects of cognitive deficits (decreases in the ability of individuals to acquire knowledge and understanding through thought experience and the senses) and risk factors for spinal injury in military vehicle occupants during operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.207"
                                            },
                                            "Text": {
                                                "val": "Developed models of military vehicle occupant exposures that will be used for predicting cervical spine injury risk. Collected exposure outcome data from the operational environments to improve provisional spinal injury criteria and assessment methods for occupant protection. Assessed the effects of sleep duration, timing, and continuity of Mild Traumatic Brain Injury (mTBI) patients versus controls using actimetry sensors (non-invasive method of monitoring human activity\/rest cycles) with the goal of determining differences in baseline sleep between mTBI patients, non-mTBI controls, and recovered mTBI controls in their home environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Health and Protection - Physiological (human physical and biochemical functions) Awareness Tools and Warrior Sustainment in Extreme Environments"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates the combined impact of extreme temperatures, humidity, and altitude on human health and performance and determines novel mitigation strategies to enhance tolerance, sustain performance, and protect the Warfighter against environmental injury. This effort provides evidence-based practice recommendations, biomarkers of adaptation, and models for protecting health and performance against combinations of environmental threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.285"
                                            },
                                            "Text": {
                                                "val": "Evaluated the reliability, reproducibility, and validity of a novel militarily-relevant dexterity assessment instrument during cold- air exposures. Developed a low-power microclimate forearm heating prototype to maintain finger blood flow and hand dexterity during cold-air exposures. Determined the areas on the human that, when warmed, cause a physiological reflex response that increases finger blood flow and maintains manual dexterity in a cold environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Health and Protection"
                                    },
                                    "Description": {
                                        "val": "This effort involves applied research addressing the physiological (human physical and biochemical functions) mechanisms of exposure to extreme heat, cold, altitude, and other environmental stressors. This effort establishes scientific evidence for specific and sensitive diagnostics of exertional heat illness to optimize Soldier performance in austere environments. This effort also supports and maturates non-invasive technologies, decision-aid tools, and models to enhance Soldier protection and sustainment across the operational spectrum. This effort provides the scientific basis for developing focused heating and cooling solutions to maintain fine motor dexterity, core temperature, and optimize physical and cognitive performance during cold-weather and hot-humid operations. This effort will develop knowledge and materiel solutions that enable Soldier individualized metabolic assessments and optimization during training and operations."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.949"
                                            },
                                            "Text": {
                                                "val": "Determine the combined impact of heat, humidity, and high altitude on human health and performance. Quantify Heat Tolerance Test specificity to include the effects of heat acclimation on the prediction of heat illness susceptibility and return to duty guidelines. Quantify how physiological adaptations and acquired thermal tolerance to heat stress protect against acute mountain sickness susceptibility as well as physical and cognitive performance at high altitude. Develop new technologies that enable quantitative measurements at a point-in-time during training and operational activities. Increase dexterity performance in cold environments by combining facial and forearm microclimate heating interventions. Develop computational models of individualized Soldier health, readiness, and physiological performance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602787A (Medical Technology) \/ MK4 (Warfighter Health Applied Rsch Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biomarkers of Exposure and Environmental Biomonitoring (measurement of the body?s response to toxic chemical compounds, elements, or their metabolites, in biological substances)"
                                    },
                                    "Description": {
                                        "val": "This effort supports refinement and evaluation of methods to detect exposure to environmental contaminants and toxic chemicals during military operations. This effort develops an integrated experimental and computational platform to characterize host responses to environmental hazards in terms of pathogenic (disease causing) and adaptive processes, yielding mechanistically based drug targets and molecular diagnostics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.794"
                                            },
                                            "Text": {
                                                "val": "Utilized an integrated experimental and computational platform to evaluate host responses to exposure (through the mouth, nose and skin) to environmental hazards (including toxic industrial chemicals [TICs] and metals such as chromium) in terms of pathogenic and adaptive processes. Developed several physiological-based dosimetery models of toxicity for TICs and heavy metals with adverse outcome pathways of liver, kidney, cardiac, and\/or neural injury based on published and experimentally-derived data. Modeled output will guide small unit decision making through the generation of actionable health risk information that can predict the risk of adverse health effects in Warfighters with high sensitivity and specificity. Developed a methodology of evaluating central nervous system toxicity in order to determine sensitive and specific indicators of central nervous system injury."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction - Neurosensory Injury Prevention"
                                    },
                                    "Description": {
                                        "val": "This area includes research efforts to develop prevention based strategies and medically based injury criteria for hearing, vestibular (sensory system supporting movement and sense of balance, located in the inner ear), and ocular\/facial protection devices, develop and evaluate neurosensory operational risk factors, develop medically based guidelines to assess neurosensory performance and model the effects of acoustic and impact trauma, as stressors on vision and hearing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.657"
                                            },
                                            "Text": {
                                                "val": "Assessed the complex interaction between auditory and vestibular protective systems. Validated blast exposure conditions that lead to cellular level ocular injury and continued to refine scaling laws to be able to relate experiments conducted in small animal models to exposure conditions in humans, which will enable the development of computational models that can help predict the effects of the primary blast wave on the eyes and visual system in humans. Analyzed potential neuroprotective (preserve nerve function) chemicals against primary blast injuries to the visual system. Evaluated provisional mandible blunt impact injury risk using two models (Facial and Ocular Countermeasures for Safety Headform (FOCUS) and Post Mortem Human Subjects (PMHS) to improve standards requirements for Warfighter protective gear."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction - Musculoskeletal Injury Prevention"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates and assesses the effects of repetitive motion during military operations and training on the human body; provides mathematical models to predict the likelihood of physical injuries following continuous operations and muscle fatigue; evaluates current standards for return-to-duty; and establishes improved medical test methods with the goal of rapid return to duty of Warfighters following injury."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.153"
                                            },
                                            "Text": {
                                                "val": "Consolidated results from animal- and human-based studies to refine the roles of endocrine (i.e., hormonal) and intracellular (i.e., within the cell) signaling molecules that are involved in skeletal muscle and bone development, utilizing animal and human models for transition to clinical trials. Refined a mathematical model of ideal bone density and structure that offsets risk of stress fracture. Utilized the Total Army injury and Health Outcomes Database (TAIHOD) to evaluate situations that create unnecessary musculoskeletal risk-hazards, and provide recommendations for mitigation. Analyzed incidence and risk factors during the last 10 years for spinal injury in military personnel. Studied the military vehicle occupant environment for the development of vibration health hazard assessment models"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the Army?s number one priority of readiness by improving musculoskeletal injury prevention efforts as well as contributing to preparing Soldiers for potential threats (e.g., directed energy) in and developing capabilities for the multi domain battle environment; evaluates and assesses the effects of repetitive motion during military operations and training on the human body; provides mathematical models to predict the likelihood of physical injuries following continuous operations and muscle fatigue; evaluates current standards for return-to-duty; and establishes improved medical test methods with the goal of rapid return to duty of Soldiers following injury. This effort also develops prevention based strategies and medically based injury criteria for hearing, vestibular (sensory system supporting movement and sense of balance, located in the inner ear), and ocular\/facial protection devices, develops and evaluates neurosensory operational risk factors, develops medically based guidelines to assess neurosensory performance and models the effects of acoustic and impact trauma, as stressors on vision and hearing. Efforts will investigate the medical aspects of manned\/unmanned teaming (MUM-T) and medical aspects of and protection against directed energy."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.484"
                                            },
                                            "Text": {
                                                "val": "Develop injury criteria for the prevention of acute and chronic cervical neck injury and pain that will guide the development of helmets and technologies added to the helmet. Develop mTBI injury thresholds for repetitive blast exposure that can guide the development of head protection. Refine physical performance thresholds for potential improvements to the Occupational Physical Assessment Test (OPAT) which will improve how well recruits are screened to do Department of Defense (DoD) relevant physically demanding tasks. Develop countermeasures to reduce the risk of overuse injury within the training and operational environment. Identify cognitive and sensory performance metrics associated with optimal MUM-T and identify physiological and behavioral fitness for duty metrics to operate in MUM-T paradigms. Develop medical standards and health hazard assessment algorithms for exposure to directed energy threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602787A (Medical Technology) \/ MK4 (Warfighter Health Applied Rsch Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health - Psychological Resilience"
                                    },
                                    "Description": {
                                        "val": "This effort refines and evaluates early interventions to prevent and reduce combat-related behavioral health problems, including symptoms of post-traumatic stress disorder (PTSD), depression, anger problems, anxiety, substance abuse, post-concussive symptoms, and other health risk behaviors. Also assesses and refines tools and interventions to enhance and sustain psychological resilience throughout the Warfighter's career."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.315"
                                            },
                                            "Text": {
                                                "val": "Determined if a diet formulated with a balanced omega-3\/6 fatty acids ratio, glutamine, and antioxidants provides enhanced resiliency against psychological stressors in humans. Evaluated the effects of novel compounds active in the glucocorticoid system (steroid hormones that are essential for the utilization of carbohydrate, fat and protein by the body and for the normal response to stress) and the endocannabinoid system (brain receptors that are involved in various physiological processes including appetite, pain sensation, mood and memory) for their ability to mitigate the adverse behavioral effects of traumatic stress and traumatic conditioning processes. Evaluated at least one drug candidate modulating the activity of orexin\/hypocretin (a peptide found in the nervous system that regulates arousal, wakefulness and appetite) for its ability to mitigate the adverse behavioral effects of traumatic stress and traumatic conditioning processes. Continued studies focused upon identification of PTSD subtypes, stage of disease progression, and development of associated biomarkers for use in the identification and development of matched risk-based prevention interventions and development of a precision medicine algorithm approach to PTSD treatment. Determined the influence of sleep history on the efficacy and durability of Attention Bias Modification Training (ABMT), which is a computerized treatment that involves retraining an individual's interpretation of other's facial expressions away from predisposed perceptions of hostility, shifting interpretations in the direction of neutrality, to reduce his or her level of anxiety. Conducted a study with Soldiers in an operational unit to determine the predictive validity of trial-by-trial attention bias analytics versus traditional measures. Developed and piloted an evidence-based, self-discipline education program that positively influences Soldier outcomes related to resilience and readiness through the development of adaptive self-control and emotion regulation. Developed and piloted emotion regulation leadership training modules for unit leaders. Developed and piloted an evidence-based, team-level intervention that positively influences Soldier outcomes related to behavioral health, resilience, and unit readiness through the regulation of small- team dynamics (e.g., group-affect). Developed and piloted an individual-to-tool matching paradigm that allows leaders to optimally tailor intervention strategies to precisely meet their personnel and operational health needs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health & Resilience - Suicide Prevention"
                                    },
                                    "Description": {
                                        "val": "This effort supports methods to identify and modify causative and preventive factors in military suicides."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.778"
                                            },
                                            "Text": {
                                                "val": "Assessed key high risk emotional and behavioral transition points to decrease suicide behaviors. Developed and refined guidelines and tools for leaders, which will include evidence-based recommendations for identifying and addressing difficulties with post-combat adjustment and military community transformation and a revised Unit Behavioral Health Needs Assessment tool with metrics from combat operations, non-combat operations, and garrison. Developed a non-contact screening tool that identifies Service members at-risk for suicidal behaviors. Evaluated a theory-based suicide screen and clinical decision-making tool that identifies at-risk Service members. Conducted studies to develop tools to decrease suicide behaviors during key transition points of Service Members' careers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health and Resilience"
                                    },
                                    "Description": {
                                        "val": "This effort refines and evaluates early interventions to prevent and reduce combat-related behavioral health problems, including symptoms of PTSD, depression, anger problems, anxiety, substance abuse, suicide, and other health risk behaviors. This effort assesses and refines tools and interventions to enhance and sustain psychological resilience throughout Soldiers? careers. Efforts also address the health and well-being of families."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.403"
                                            },
                                            "Text": {
                                                "val": "Assess risk and resilience markers (e.g., moral injury) for male and female Soldiers? psychological and behavioral health; determine the optimal dosing of Attention Bias Modification Training, a computerized treatment that reduces anxiety. Evaluate evidence-based individual (e.g., self-distancing education, emotion regulation leadership training) and team-level (e.g., regulation of small-team dynamics) interventions that positively influence behavioral health, resilience, and unit readiness. Assess key high-risk emotional and behavioral transition points, develop a non-contact screening tool and other interventions to decrease suicide behaviors. Adapt and evaluate a diet formulated with a balanced omega-3\/6 fatty acid ratio, glutamine, and antioxidants in an animal model for pilot study in humans in order to provide neuroprotection against military stressors. Develop molecular pharmacological approaches and novel compounds to mitigate the adverse behavioral effects of traumatic stress. Continue studies focused upon identification of PTSD subtypes, stage of disease progression, and development of associated biomarkers in order to develop a precision medicine approach to PTSD treatment. Initiate studies for enhancing behavioral health treatment engagement, improving provider clinical support tools for return-to-duty decisions and  identifying dissemination models for optimal behavioral health provider education."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602787A (Medical Technology) \/ MK4 (Warfighter Health Applied Rsch Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Millennium Cohort Research"
                                    },
                                    "Description": {
                                        "val": "This effort supports a long-term study of Warfighters that includes psychological and physical impacts of military service throughout their lifetime. The Millennium Cohort and Deployment Health Task area employs prospective epidemiological (study of health-event patterns in a society) surveillance research designed to address mental health and comorbid (multiple concurrent) disorders, including neurological and other chronic degenerative disorders, fitness and readiness performance outcomes, and longer-term physical and mental health illnesses and disease over the life cycle of military Service Members."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.583"
                                            },
                                            "Text": {
                                                "val": "Continued to evaluate the impact of military service on Warfighter and Family physical and psychological health. Specifically, determined factors associated with persistent and long-term mental health and evaluated factors moderating or mediating associations between service-related experiences and mental disorders. Evaluated associations between behavioral health characteristics (e.g. physical activity, alcohol and tobacco use, and sleep hygiene) and short- and long-term outcomes among Service members and Veterans. Established a program to investigate chronic disease risk among Service members and Veterans. Developed a program area focusing on environmental exposures experienced during deployments. Evaluated the representativeness and generalizability of the Millennium Cohort Family Study and initiate a study examining the impact of family relations on the Service member spouse. Developed a program area focusing on physical injury (traumatic and chronic) experienced during military service and mental health resilience, and established agreements for access to objective data sources. Initiated processing of completed 2017-2018 paper surveys.."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Systems Engineering Architecture"
                                    },
                                    "Description": {
                                        "val": "This effort will advance medical science in the areas of injury prevention to optimize and sustain performance. This effort develops bio- mathematical models and networked physiological sensor systems that accurately predict metabolic cost, thermal strain and other negative health impacts to the Warfighter during physical challenges, i.e., during load carriage or operating in extreme environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.898"
                                            },
                                            "Text": {
                                                "val": "Evaluated newly developed bio-mathematical models, algorithms, and networked physiological sensor systems that accurately predict human metabolism rates, thermal strain and negative health impacts of Warfighters during physical challenges (i.e., complex operational scenarios in extreme environments). Computationally-intelligent network-capable sensors will have the ability to monitor and predict individual Warfighter physiological status (thermal, hydration, sleep status) in response to environmental conditions. Informed the research and development community of new research in the development of optimized systems and the interactions between Warfighters and the systems they employ. Leveraged research in the Military Operational Medicine portfolio areas of Physiological Health and Protection, Injury Prevention and Reduction (both musculoskeletal and neurosensory), Psychological Health and Resilience and Environmental Health and Protection to inform the Warfighter Systems Engineering Architecture initiative."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.745"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "870"
                    },
                    "ProjectTitle": {
                        "val": "Dod Med Def Ag Inf Dis"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "21.928"
                        },
                        "CurrentYear": {
                            "val": "21.638"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "43.566"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned to:\nProgram Element (PE) 0602787A Medical Technology\n* Project MM8 Infectious Diseases and Applied Rsch Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project conducts applied research for medical countermeasures to naturally occurring infectious diseases that pose a significant threat to the operational effectiveness of forces deployed outside the United States. Effective preventive countermeasures (protective\/therapeutic drugs and vaccines and insect repellents and traps) protect the Force from disease and sustain operations by avoiding the need for evacuations from the theater of operations. Diseases of military importance are malaria, bacterial diarrhea, and viral diseases (e.g., dengue fever and hantavirus). In addition to countermeasures, this project funds refinement of improved diagnostic tools to facilitate early identification of infectious disease threats in an operational environment, informing Commanders of the need to institute preventive actions and improve medical care. Major goals are to integrate genomics (deoxyribonucleic acid (DNA)-based) and proteomics (protein-based) as well as other new biotechnologies into the refinement of new concepts for new vaccine, drug, and diagnostics candidates.\n\nResearch conducted in this Project focuses on the following four areas:\n\n(1) Prevention\/Treatment of Parasitic (organisms living in or on another organisms) Diseases\n(2) Bacterial Disease Threats (diseases caused by bacteria)\n(3) Viral Disease Threats (diseases caused by viruses)\n(4) Diagnostic Systems and Vector Identification and Control\n \nFor the refinement of drugs and biological products, studies in the laboratory and in animal models provide a proof-of-concept for these candidate products, including safety, toxicity (degree to which a substance can damage an organism), and effectiveness, and are necessary to provide evidence to the Food and Drug Administration (FDA) to justify approval for a product to enter into future human subject testing. Additional non-clinical studies are often needed in applied research even after candidate products enter into human testing during advanced technology development, usually at the direction of the FDA, to assess potential safety issues. Drug and vaccine refinement bears high technical risk. Of those candidates identified as promising in initial screens, the vast majority are eliminated after additional safety, toxicity, and\/or effectiveness testing. Similarly, vaccine candidates have a high failure rate, because animal testing may not be a good predictor of human response, and therefore candidate technologies\/products are often eliminated after going into human trials. Because of this high failure rate, a continuing effort to identify other potential candidates to sustain a working pipeline of countermeasures is critical for replacing those products that fail in testing.  \n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy.\n\nWork is managed by the United States Army Medical Research and Materiel Command (USAMRMC) in coordination with the Naval Medical Research Center (NMRC). The Army is responsible for programming and funding all Department of Defense (DoD) naturally occurring infectious disease research requirements, thereby precluding duplication of effort within the Military Departments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Applied Research on drugs and vaccines against parasitic diseases"
                                    },
                                    "Description": {
                                        "val": "This effort assesses and improves on candidate drugs coming from the Department of Defense (DoD) discovery program and from other collaborations for prevention and treatment of malaria; to counter the continuing spread of drug resistance to current drugs; assesses currently available drugs for use against cutaneous leishmaniasis (a skin-based disease transmitted by sand flies) in animal models; and select the most effective and safe candidates for continued refinement and possible clinical testing. This effort also conducts studies to investigate new candidate vaccines for preventing malaria and selects the best candidate(s) for continued refinement. A highly effective vaccine would reduce or eliminate the use of anti-malarial drugs and would minimize the progression and impact of drug resistance to current\/future drugs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.826"
                                            },
                                            "Text": {
                                                "val": "Continued studies in validated animal models to test reformulated chemical compounds for safety and efficacy against malarias. Continued assessment of pyramidinlyguanidine compounds (a newly discovered family of similar chemical compounds that are active against malaria parasites in experimental animals) for the treatment of malaria. Continued assessment of primaquine- like compounds (Primaquine is an FDA-licensed drug capable of preventing relapsing malaria) for use in treatment of relapsing malarias in the monkey model. Completed safety testing in validated animal models in order to test reformulated and down-selected vaccines against falciparum malaria (the most lethal of four types of malaria species). Continued to evaluate new vaccine candidates against vivax malaria (the most common of four types of malaria species) in small animals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.856"
                                            },
                                            "Text": {
                                                "val": "Complete studies in validated animal models to test reformulated triazine lead compound for safety and the dissemination in blood and tissues. These studies are required by FDA to enable oral dosing studies in humans. Complete testing of pyrimidinylguanidine (a newly discovered family of similar chemical compounds that are active against malaria parasites in experimental animals) and primaquine-like compounds in primate malarias to enable initial human testing. Complete laboratory based analyses of human immune cells from Plasmodium falciparum malaria vaccine trials to enable down selection of a lead vaccine for transition to advanced development. Conduct initial effectiveness trials of potential lead vaccine formulations in primate models of a relapsing malaria, Plasmodium vivax."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602787A (Medical Technology) \/ MM8 (Infectious Diseases and Applied Rsch Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Diagnostic Systems and Vector Identification and Control"
                                    },
                                    "Description": {
                                        "val": "This effort designs and prototypes new medical diagnostic and surveillance tools for the field, focusing on bedside and field-deployable diagnostic systems and refines interventions that protect Warfighters from biting insects such as sand flies (transmitters of leishmaniasis) and mosquitoes (transmitters of dengue, Japanese encephalitis, malaria, etc.)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.362"
                                            },
                                            "Text": {
                                                "val": "Developed new vector repellant and control methods. Confirmed spatial repellent efficacy testing protocols and systems that enable testing and development of best candidates for military use. Advanced the capability for fabrics treated with repellants to protect or resist against biting insects and other arthropod vectors. Developed the multiplexed pathogen detection systems (capable of detecting multiple pathogens at the same time) that are cost effective, sustainable and usable to screen for priority emerging or re- emerging pathogens."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.514"
                                            },
                                            "Text": {
                                                "val": "Further develop and evaluate the capability for fabrics treated with repellants to protect or resist against biting insects and other arthropod vectors. Continue to evaluate multiplexed pathogen detection systems (capable of detecting multiple pathogens at the same time) to screen for priority emerging or re-emerging pathogens."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Research effort ends in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Viral Threats Research"
                                    },
                                    "Description": {
                                        "val": "This effort designs and laboratory tests new vaccine candidates against hemorrhagic fever viruses (i.e., dengue virus, Hantaviruses, Lassa fever virus and Crimean-Congo hemorrhagic fever virus) and assesses other non-vaccine technologies to protect against hemorrhagic fever viruses. Efforts also include establishing and maintaining of clinical trial sites worldwide."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.243"
                                            },
                                            "Text": {
                                                "val": "Expanded vaccine test site infrastructure in selected communities at risk for dengue virus exposure and support research partner efforts in testing dengue vaccine immunogenicity (ability to provoke an immune response) and effectiveness. Continued to assess new vaccine formulations for safety and immunogenicity. Further developed additional DNA vaccines and combination vaccines against viruses of interest, e.g. Crimean Congo hemorrhagic fever. Explored multi-agent (combination of two or more molecules capable of inducing an immune response) vaccine concepts e.g., pan-Hantavirus vaccine, Rift Valley fever virus, and Crimean Congo hemorrhagic fever vaccine. Developed an animal model of disease to test drugs and vaccines for protection against Hantavirus."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.755"
                                            },
                                            "Text": {
                                                "val": "Sustain field sites as part of ongoing research partner efforts in testing dengue vaccine immunogenicity (ability to provoke an immune response) and effectiveness. Conduct immune cell and antibody assessments in human subjects exposed to dengue by dengue human infection model. Conduct immune cell and antibody assessments in human subjects immunized with purified inactivated virus and live attenuated virus vaccines. Explore multi-agent (combination of two or more molecules capable of inducing an immune response) vaccine concepts e.g., pan-hantavirus vaccine, Rift Valley fever, and Crimean Congo hemorrhagic fever vaccine."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602787A (Medical Technology) \/ MM8 (Infectious Diseases and Applied Rsch Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Bacterial Threats"
                                    },
                                    "Description": {
                                        "val": "This effort conducts studies to refine bacterial countermeasures, including vaccine candidates, to prevent diarrhea (most commonly caused by enterotoxigenic E. coli, Campylobacter and Shigella), wound infection and scrub typhus (a debilitating mite-borne disease)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.497"
                                            },
                                            "Text": {
                                                "val": "Continued with the development of additional vaccine candidates against Shigella, Campylobacter and enterotoxigenic E.coli. Down-selected vaccine candidates for further testing in animal models of diarrhea caused by Shigella, Campylobacter and enterotoxigenic E.coli. Continued to test the feasibility of clinical field sites for evaluation of vaccine candidates. Conducted studies on mechanisms of immune response to scrub typhus infection. Maintained an animal model for scrub typhus and will characterize host- pathogen interactions in animal models."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.065"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and advance additional vaccine candidates against Shigella, Campylobacter and enterotoxigenic E. coli (ETEC). Continue to down select vaccine candidates for testing in animal models of diarrhea caused by Shigella, Campylobacter and ETEC. Perform an assessment of multivalent (different types) vaccine candidates for Shigella and ETEC in animal models of diarrhea. Produce vaccine candidates for testing in humans using Good Manufacturing Processes. Continue to evaluate the feasibility of clinical field sites for the assessment of vaccine candidates in humans. Continue to maintain the animal model for scrub typhus infection and will continue studies on characterization of host-pathogen interactions in these animal models."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602787A (Medical Technology) \/ MM8 (Infectious Diseases and Applied Rsch Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.448"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "874"
                    },
                    "ProjectTitle": {
                        "val": "Cbt Casualty Care Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.232"
                        },
                        "CurrentYear": {
                            "val": "12.769"
                        },
                        "BudgetYearOne": {
                            "val": "0.869"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.869"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "25.870"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned to:\nProgram Element (PE) 0602787A Medical Technology\n* MM4 Cbt Casualty Care Applied Rsch Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "Applied technology development of burn recovery optimization technologies: applied technologies for acute burn treatment that remove dead tissue, prevent infection, and protect the wound from further damage until definitive burn care is available; diagnostic technologies to predict skin graft success or failure, identify patients at heightened risk for scarring, and monitor effectiveness of treatment.\n\nAll drugs, biological products, and medical devices are refined in accordance with US Food and Drug Administration (FDA) regulations, which govern testing in animals to assess safety, toxicity, and effectiveness and subsequent human subject clinical trials.\n\nPromising efforts identified in this Project are further matured under PE 0603002A (medical Advanced Technology) \/ Project 840 (Combat Injury Mgmt).  \n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Medical Research Materiel Command (USAMRMC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Damage Control Resuscitation"
                                    },
                                    "Description": {
                                        "val": "This effort develops and refines knowledge products (such as clinical practice guidelines, manuals, protocols, studies, and media), materials, and systems for control of internal bleeding; minimizing the effects of traumatic blood loss; preserving, storing, and transporting blood and blood products; and resuscitation following trauma."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.335"
                                            },
                                            "Text": {
                                                "val": "Conducted studies to optimize performance metrics and assays of stem cells for treatment of trauma- or infection- induced impairment of blood clotting ability. Developed sensor technology for early assessment of blood clot strength. Evaluated novel products and approaches, including aortic balloon occlusion, automatically operated tourniquets, and new wound packing materials, to treat bleeding from chest, abdomen, arm pit and groin wounds and large, soft tissue wounds. Worked to investigate drugs and key molecular components of blood required to optimize low volume resuscitation adjuncts to control bleeding and stabilize tissues in the pre-hospital phase of care. In FY18, Damage Control Resuscitation efforts increased by $1,204,000 due to reprogramming from 0603002A Project 840 Combat Injury Management."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.442"
                                            },
                                            "Text": {
                                                "val": "Begin study of new techniques to control bleeding using catheters or other devices that are introduced into damaged blood vessels. Conduct studies of new hemostatic (stops bleeding) dressings to determine if they may be safely left in place on wounds to control bleeding for extended periods of time. Start a new research focus area on endovascular (refers to device that is directly introduced into a major blood vessel) hemorrhage control and resuscitation. Continue studies to optimize performance metrics and assays of stem cells for treatment of trauma- or infection-induced impairment of blood clotting ability. Continue development of new technologies for early assessment of blood clot strength. Continue work to investigate drugs and blood products to optimize treatment of impaired blood clotting and destabilized tissues due to traumatic bleeding."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602787A (Medical Technology) \/ Project MM4 (Cbt Casualty Care Applied Rsch Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Trauma Therapies"
                                    },
                                    "Description": {
                                        "val": "This effort conducts research to enhance the ability to diagnose, stabilize, and accelerate wound healing and repair of damaged tissue for casualties with severe wounds to the face, mouth and extremities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.482"
                                            },
                                            "Text": {
                                                "val": "Developed preclinical wound model to examine effect of various resuscitation strategies (e.g., fluids, timing, volume) on healing of injured muscle and bone.  Continued work from FY17 to develop and test combined agents (containing agents to kill bacteria, prevent bacteria from becoming infective, and to control inflammation) to treat contaminated facial, mouth and extremity wounds.  In FY18, Combat Trauma Therapies efforts increased by $209,000 due to reprogramming from 0603002A Project 840 Combat Injury Management."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.232"
                                            },
                                            "Text": {
                                                "val": "Conduct animal studies to assess adverse effects of inflammation factors released in response to blast injury. Examine potential treatments to mitigate adverse effects of hemorrhage resuscitation on severe extremity wounds. Evaluate stem cell therapy and drugs to promote healing in severe extremity injuries. Continue development and testing of combined agents (containing agents to kill bacteria, prevent bacteria from becoming infective, and to control inflammation) to treat contaminated facial, mouth and extremity wounds."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.869"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.869"
                                            },
                                            "Text": {
                                                "val": "Will develop preclinical models in which to evaluate biomarkers of burn wound severity and healing, and will develop preclinical models in which to evaluate new anti-microbial burn wound therapies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602787A (Medical Technology) \/ Project MM4 (Cbt Casualty Care Applied Rsch Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Critical Care Engineering"
                                    },
                                    "Description": {
                                        "val": "This effort refines diagnostic and therapeutic medical devices as well as associated algorithms, software, and data-processing systems for resuscitation, stabilization, life support, surgical support and preservation of vital organ function that can be applied across the pre-hospital, operational field setting, and initial definitive care facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.433"
                                            },
                                            "Text": {
                                                "val": "Studied means to mitigate risk of blood clot formation within the tubing of external life support devices (devices that oxygenate and purify the blood outside of the body) while at the same time allowing normal blood clotting to occur in the patient. Continued work from FY17 to validate treatment algorithms in animal burn injury model. Continued work from FY17 to validate technologies to reduce preventable deaths due to difficult airway management."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.399"
                                            },
                                            "Text": {
                                                "val": "Conduct animal studies to determine whether currently used pain-relieving drugs produce detrimental cardiovascular effects during hemorrhage resuscitation. Study use of different stem cell products in animal models of lung injury. Will develop a small animal model of acute kidney injury caused by cessation of kidney blood flow due to severe, prolonged blood loss in which to assess new agents that protect the blood-deprived kidney. Determine the whole-body effects of tourniquet release after prolonged use. Design an automated, closed-loop burn and trauma resuscitation system that continuously monitors the patient's condition and automatically executes, without human intervention, an immediate and appropriate therapeutic response whenever the patient's condition deviates from normal. Examine the ability of different critical care treatment algorithms to accurately detect and diagnose changes in patient condition and elicit an appropriate therapeutic response. Develop and evaluate new technologies that will enable combat medics to provide basic critical care in out-of-hospital settings when medical evacuation is either delayed or prolonged. Continue work to mitigate risk of blood clot formation within the tubing of external life support devices (devices that oxygenate and purify the blood outside of the body) while at the same time allow normal blood clotting to occur in the patient. Continue work to assess physiological responses to airway compromise and to test new airway management techniques."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602787A (Medical Technology) \/ Project MM4 (Cbt Casualty Care Applied Rsch Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Traumatic Brain Injury"
                                    },
                                    "Description": {
                                        "val": "This effort supports refinement of drug (includes mature drug technologies and those that are FDA approved for other indications) and therapeutic (i.e., novel use of stem cells or selective brain cooling) strategies to manage traumatic brain injury (TBI ) resulting from battlefield trauma."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.982"
                                            },
                                            "Text": {
                                                "val": "Used data from neuroplasticity (ability of the nervous system to adapt to injury) marker studies to refine current animal models of military relevant brain injury to support studies of TBI treatments that work by affecting the injured brain's ability to use energy and repair itself.  Refined animal models of acute, severe TBI in combination with severe bleeding and lung and other vital organ injuries for evaluation of neurotherapeutic (therapies to protect brain tissue from further damage following a TBI event) resuscitation strategies for treatment of TBI and hemorrhagic (bleeding) shock."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.65"
                                            },
                                            "Text": {
                                                "val": "Evaluate mild TBI treatment strategies using animal models. Evaluate potential stem cell therapies in a severe TBI animal model. Complete development of large animal models of TBI and TBI-polytrauma (TBI in combination with severe bleeding and lung and other vital organ injuries). Perform studies to determine which biomarkers effectively indicate whether a particular therapy works and recovery is occurring."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602787A (Medical Technology) \/ Project MM4 (Cbt Casualty Care Applied Rsch Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prolonged Field Care"
                                    },
                                    "Description": {
                                        "val": "This effort performs applied research to study the physiological implications of delayed medical evacuation and limited access to definitive surgical care in severely injured casualties"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.68"
                                            },
                                            "Text": {
                                                "val": "This effort begins in FY19, planned accomplishments include development and testing of animal models of prolonged care for life-threatening extremity injuries and combat casualty injuries leading to kidney failure."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602787A (Medical Technology) \/ Project MM4 (Cbt Casualty Care Applied Rsch Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.366"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ET4"
                    },
                    "ProjectTitle": {
                        "val": "Appl Resch in Clinical and Rehabilitative Medicine"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.557"
                        },
                        "CurrentYear": {
                            "val": "12.123"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "19.680"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned to:\nPE 0602787A Medical Technology\n* Project MN1 Applied Sensory Systems Trauma Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project identifies and evaluates drugs, biologics (products derived from living organisms), medical devices, treatments and diagnostics for post-evacuation restorative, regenerative and rehabilitative care, as well as systems for use by field medics and surgeons for ocular trauma. Research focuses on identifying more effective technologies and protocols to treat ocular injury and visual system dysfunction, as well as laboratory and animal studies for regenerating skin, muscle, nerves, vascular and bone tissues for the care and treatment of traumatic injury. This Project is being coordinated with the Defense Health Program. Research involves extensive collaboration with multiple academic institutions to refine treatments for combat wounds through the Armed Forces Institute of Regenerative Medicine (AFIRM). This Project is coordinated with the Military Departments and other government organizations to avoid duplication. Research conducted in this Project focuses on Clinical and Rehabilitative Medicine.\n\nAll drugs, biological products, and medical devices are refined in accordance with Food and Drug Administration (FDA) regulations, which govern testing in animals to assess safety, toxicity, and effectiveness and subsequent human subject clinical trials.\n\nPromising efforts identified in this project are further matured under PE 0603002A (Medical Advanced Technology \/ Project ET5 (Adv Tech Dev in Clinical & Rehabilitative Medicine).\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Medical Research Materiel Command (USAMRMC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Clinical and Rehabilitative Medicine"
                                    },
                                    "Description": {
                                        "val": "This effort conducts laboratory and animal studies for the purpose of regenerating and restoring traumatically-injured tissues, including skin, muscle, nerve, bone tissue, and the ocular system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.557"
                                            },
                                            "Text": {
                                                "val": "Optimized preclinical design of a novel ocular medical device designed to deliver therapeutics, protect, and preserve vision post-injury. Established the effects of treatment of up to three promising pharmaceuticals designed to restore vision in the scarred eye after injury for down selection. Conducted pre-clinical safety and efficacy testing of an eye bandage with therapeutics to optimize vision restoration post-injury. Evaluated methods for enhancing skin substitute performance for improvement of skin function following burns and loss from trauma. Examined pharmacologic (drug) treatments to prevent scarring from deep partial-thickness burns.  Established effectiveness of treatment methodologies for large volume muscle loss to restore muscle form and function. Developed devices and biologics for regeneration or restoration of genitourinary (genital and urinary) tissues lost or damaged due to traumatic injury."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.092"
                                            },
                                            "Text": {
                                                "val": "Continue to optimize the preclinical design of a novel ocular medical device designed to deliver therapeutics, protect, and preserve vision post-injury. Advance evaluations of stem-cell based therapies to regenerate damaged eye tissues into pre-clinical animal testing. Utilize intra-eye large animal drug delivery system to deliver and evaluate effectiveness of nerve therapeutics to preserve and regenerate injured optic nerves. Continue to conduct pre-clinical safety and effectiveness testing of an eye bandage with therapeutics to optimize vision restoration post-injury. Continue to develop and evaluate methods for enhancing skin substitute performance for improvement of skin function following burns and loss from trauma. Continue the examination of pharmacologic (drug) treatments to prevent scarring from deep partial-thickness burns. Examine the effectiveness of treatment methodologies for large volume muscle loss to restore muscle form and function. Continue to develop devices and biologics for regeneration or restoration of genitourinary (genital and urinary) tissues lost or damaged due to traumatic injury."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602787A (Medical Technology) \/ Project MN1 (Applied Sensory Systems Trauma Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlefield Pain Management"
                                    },
                                    "Description": {
                                        "val": "This effort performs applied research in laboratory and animal studies to develop novel, non-opioid drugs to treat pain in the austere battlefield environment with minimal side effects."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.599"
                                            },
                                            "Text": {
                                                "val": "Conduct animal studies to investigate the role of ion channel receptors and pain signaling; will develop peripheral nerve or antagonist analgesics to preserve the fighting force and maximize pain relief from combat wounds in austere and prolonged care environments while minimizing adverse side effects such as tolerance, dependence and chronification (occasional\/intermittent pain that progresses to a chronic state) of acute pain."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602787A (Medical Technology) \/ Project MN1 (Applied Sensory Systems Trauma Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.432"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MK4"
                    },
                    "ProjectTitle": {
                        "val": "Warfigher Health Applied Rsch Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "38.392"
                        },
                        "BudgetYearOneBase": {
                            "val": "38.392"
                        },
                        "BudgetYearTwo": {
                            "val": "37.911"
                        },
                        "BudgetYearThree": {
                            "val": "38.028"
                        },
                        "BudgetYearFour": {
                            "val": "39.275"
                        },
                        "BudgetYearFive": {
                            "val": "40.001"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "193.607"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned from:\nProgram Element (PE) 0602787A Medical Technology\n* Project 869 Warfighter Health Prot & Perf Stnds"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project conducts research to prevent and protect Warfighters from training and operational injuries; refine mechanisms for detection of physiological (human physical and biochemical function) and psychological (mental) health problems; evaluate hazards to head, neck, spine, eyes, and ears; set the standards for rapid return to duty; and determine new methods to sustain and enhance performance across the operational spectrum. This research provides medical information important to the design and operational use of military systems, and this work forms the basis for behavioral, training, pharmacological (drug actions), and nutritional interventions.\n\nThe four main areas of study are:\n(1)\tEnvironmental Health and Protection\n(2)\tPhysiological Health and Performance\n(3)\tInjury Prevention and Reduction\n(4)\tPsychological Health and Resilience\n\nAdditionally, the Warfighter Systems Engineering Architecture task advances medical science and technology (S&T) in the areas of injury prevention and performance sustainment in the context of human interaction with new Soldier systems, and provides greater insight into informing new research in developing Warfighter systems and the interactions between Warfighters and the systems they employ.\n\nPromising efforts identified in this project are further matured under PE 0603002A (Medical Advanced Technology) \/ Project MG4 (Tech Base\/Enabling Research in Military Occupation), Project MN6 (Blast & Head Impact Exposure Monitor Advanced Tech), Project MN7 Musculoskeletal Injury Screening Tool Adv Tech, Project MN9 Far Forward Behavioral Health Care Advanced Tech, Project MO3 Military Occupational Fitness Standards Adv Tech, Project MO8 Expeditionary Performance Nutrition Advanced Tech, and Project MP3 Phys Chem Toxicity Assessment Sys Adv Tech.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Medical Research Materiel Command (USAMRMC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Physiological Health and Performance"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates methods for managing and controlling the effects of fatigue on Soldier operational performance and the impact of nutritional strategies to optimize operational performance. Efforts will also contribute to new high-priority medical investments in human biomedical performance enhancement and medical aspects of manned-unmanned machine teaming (MUM-T)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.125"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.125"
                                            },
                                            "Text": {
                                                "val": "Will characterize effects of nutritional energy balance on inflammatory response. Will refine understanding of the environmental influences on eating behavior, to include extreme environmental influences such as heat, cold and altitude. Will determine effects of protein source on protein kinetics and muscle growth and strength. Will evaluate scheduling and fatigue management tools for rotary-wing aviation. Will refine models of aviator risks during Degraded Visual Environment (DVE) operations as a function of neurosensory limitations and physiological condition. Will evaluate degraded Army Manned-Unmanned Teaming operator performance through characterization of medical and work requirements, under operational stressors. Will characterize predictors of resilience during United States Army Special Forces training. Will evaluate exogenous testosterone for maintenance of physiological and psychological performance under conditions of medically relevant hypogonadism (a failure of the gonads, testes in men and ovaries in women, to function properly) induced by high operational tempo military activity. Will provide medical and Solider integration criteria for single-joint exoskeleton to enhance Soldier physical performance in military operations. Will evaluate the effectiveness of slow wave sleep (SWS) augmentation via acoustic stimulation (AS) for enhancing tactical performance and reducing sleepiness during a subsequent period of sustained wakefulness."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602787A (Medical Technology) \/ Project 869 (Warfighter Health Prot & Perf Stnds) in FY20 as part of the financial restructuring.\n\nIn FY20, increased funding for Physiological Health & Performance is due to normal and planned progression of existing efforts in the high priority of program efforts in sleep, nutrition and human performance. Significant increases in funding are due to new investments in high-priority areas of biomedical performance enhancement of Soldier physiological, cognitive and psychological capabilities as well as medical aspects of MUM-T."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Health and Protection"
                                    },
                                    "Description": {
                                        "val": "This effort involves applied research addressing the physiological (human physical and biochemical functions) mechanisms of exposure to extreme heat, cold, altitude, and other environmental stressors. This effort establishes scientific evidence for specific and sensitive diagnostics of exertional heat illness to optimize Soldier performance in austere environments. This effort also supports and maturates non-invasive technologies, decision-aid tools, and models to enhance Soldier protection and sustainment across the operational spectrum. This effort provides the scientific basis for developing focused heating and cooling solutions to maintain fine motor dexterity, core temperature, and optimize physical and cognitive performance during cold- weather and hot-humid operations. This effort will develop knowledge and materiel solutions that enable Soldier individualized metabolic assessments and optimization during training and operations."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.129"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.129"
                                            },
                                            "Text": {
                                                "val": "Will evaluate human performance in heat, cold and altitude studies which provide physiological monitoring data for algorithms for an integrated Soldier sensor system to sustain lethality, optimize performance, and improve health and readiness. Will evaluate strategies to improve Soldier health, readiness and mission performance through interventions designed to prevent injuries which result from multi-environmental stressors. Will evaluate interventions to reduce environmental injuries in the heat and cold weather operations. Will develop physiologically based algorithm to detect organ and system toxicity post chemical exposure. Will develop physiologically based algorithm to monitor Soldier performance after exposure to toxic chemicals or hazardous materials. Will develop tools that sustain lethality, improve health, and optimize performance to reduce injuries following exposures to heat, cold, terrestrial altitude and toxic chemicals and hazardous materials for squad leaders and mission planners."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602787A (Medical Technology) \/ Project 869 (Warfighter Health Prot & Perf Stnds) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the Army's number one priority of readiness by improving musculoskeletal injury prevention efforts as well as contributing to preparing Soldiers for potential threats (e.g., directed energy) in and developing capabilities for the multi domain battle environment; evaluates and assesses the effects of repetitive motion during military operations and training on the human body; provides mathematical models to predict the likelihood of physical injuries following continuous operations and muscle fatigue; evaluates current standards for return-to-duty; and establishes improved medical test methods with the goal of rapid return to duty of Soldiers following injury. This effort also develops prevention based strategies and medically based injury criteria for hearing, vestibular (sensory system supporting movement and sense of balance, located in the inner ear), and ocular\/facial protection devices, develops and evaluates neurosensory operational risk factors, develops medically based guidelines to assess neurosensory performance and models the effects of acoustic and impact trauma, as stressors on vision and hearing. Efforts will investigate the medical aspects of MUM-T and medical aspects of and protection against directed energy."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.428"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.428"
                                            },
                                            "Text": {
                                                "val": "Will continue to develop injury based head supported mass criteria, behind helmet blunt trauma, behind armor blunt trauma, and blast exposure injury criteria in order to inform next generation integrated head protection systems, vital torso protection systems, and the next generation bomb suit (program of record). Will develop military relevant fitness and return to duty standards for combat Military Occupational Specialties (MOSs). Will continue to develop medical standards for directed energy threats and develop computational models that will predict organ injury severity and systemic pathological effects."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602787A (Medical Technology) \/ Project 869 (Warfighter Health Prot & Perf Stnds) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health and Resilience"
                                    },
                                    "Description": {
                                        "val": "This effort refines and evaluates tools and early interventions to prevent and reduce the impact of military stressors and combat-related exposures on behavioral health problems, including symptoms of post-traumatic stress disorder (PTSD), depression, anger problems, anxiety, substance abuse, suicide, and other health risk behaviors. This effort assesses and refines tools and interventions to enhance and sustain psychological resilience throughout Soldiers' careers. Efforts also address the health and well-being of families."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.71"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.71"
                                            },
                                            "Text": {
                                                "val": "Will continue to assess and characterize risk and resilience markers for Soldiers' psychological and behavioral health. Will identify objective molecular markers for PTSD and PTSD subtypes, treatment response, and return to duty status.  Will continue evaluating candidate compounds for treatment of PTSD symptoms through use of a laboratory maintained PTSD animal model. Will develop and test a provider tool kit for standardizing behavioral health provider determinations of Service Members? return to duty status.  Will identify and adapt suitable brief acute stress interventions for use in a far-forward setting.  Will determine optimal dosing of Cognitive Bias Modification Training, a computerized treatment that reduces specific cognitive biases (e.g., anxiety-sensitivity, threat, and anger). Will continue to develop and refine evidence-based individual (e.g., self-distancing education, emotion regulation, leadership training) and team-level (e.g., regulation of small-team dynamics) interventions that positively influence behavioral health, resilience, and unit readiness."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602787A (Medical Technology) \/ Project 869 (Warfighter Health Prot & Perf Stnds) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MM4"
                    },
                    "ProjectTitle": {
                        "val": "Cbt Casualty Care Applied Rsch Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "17.909"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.909"
                        },
                        "BudgetYearTwo": {
                            "val": "18.092"
                        },
                        "BudgetYearThree": {
                            "val": "19.1"
                        },
                        "BudgetYearFour": {
                            "val": "19.431"
                        },
                        "BudgetYearFive": {
                            "val": "19.626"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "94.158"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned from:\nProgram Element (PE) 0602787A Medical Technology\n* Project 874 Cbt Casualty Care Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project refines and assesses concepts, techniques, and materiel that improve survivability and treatment outcomes for Warfighters wounded during combat operations, as well as treatment under austere field conditions. Combat casualty care research addresses control of severe bleeding; resuscitation and stabilization; advanced automated life support systems suitable for use in forward areas, treatment of burns, and traumatic injuries to hard and soft tissues of the face, mouth, and extremities and traumatic brain injury (TBI).\n\nPromising efforts identified in this Project are further matured under PE 0603002A (Medical Advanced Technology) \/ Project MM5 (Tech Base\/Enabling Res Combat Cas Care Adv Tech).\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Medical Research Materiel Command (USAMRMC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Damage Control Resuscitation"
                                    },
                                    "Description": {
                                        "val": "This effort develops and refines knowledge products (such as clinical practice guidelines, manuals, protocols, studies, and media), materials, and systems for control of internal bleeding; minimizing the effects of traumatic blood loss; preserving, storing, and transporting blood and blood products; and resuscitation following trauma."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.961"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.961"
                                            },
                                            "Text": {
                                                "val": "Will conduct studies to model optimal treatment for acute traumatic coagulopathy (bleeding disorder) using blood products and drugs.  Will conduct studies of new platelet preservative solutions to determine ability to rejuvenate platelets during storage. Will develop assays to characterize stem cell effectiveness for trauma care."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602787A (Medical Technology) \/ Project 874 (Cbt Casualty Care Tech) in FY20  as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Trauma Therapies"
                                    },
                                    "Description": {
                                        "val": "This effort conducts research to enhance the ability to diagnose, stabilize, and accelerate wound healing and repair of damaged tissue for casualties with severe burn, facial or extremity wounds."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.31"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.31"
                                            },
                                            "Text": {
                                                "val": "Will conduct studies to determine the impact of immune response and life-saving interventions on healing of extremity wounds.  Will characterize burn wound fluid proteins to identify potential candidate biomarkers that signal adequacy of wound healing in preclinical animal models. Will evaluate alternative anti-infective\/anti-inflammation drugs in animal wound models. Will study technological approaches for diagnosis and treatment of sepsis (life-threatening organ dysfunction caused by the body?s dysregulated response to infection) in a prolonged field care environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602787A (Medical Technology) \/ Project 874 (Cbt Casualty Care Tech) in FY20  as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pre-Hospital Tactical Combat Casualty Care"
                                    },
                                    "Description": {
                                        "val": "This effort refines diagnostic and therapeutic medical devices, drugs, and new clinical practices for resuscitation, stabilization, and preservation of vital organ function that can be applied by combat medical personnel in the pre-hospital combat setting."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.91"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.91"
                                            },
                                            "Text": {
                                                "val": "Will determine whether current battlefield analgesics (pain relief drugs) produce detrimental cardiovascular effects during hemorrhage.  Will determine the systemic effects of tourniquet release after prolonged use and identify potential therapeutic targets."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602787A (Medical Technology) \/ Project 874 (Cbt Casualty Care Tech) in FY20  as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Traumatic Brain Injury (TBI)"
                                    },
                                    "Description": {
                                        "val": "This effort supports refinement of drug (includes mature drug technologies and those that are Food and Drug Administration [FDA] approved for other indications) and therapeutic (i.e., novel use of stem cells or selective brain cooling) strategies to manage TBI resulting from battlefield trauma."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.404"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.404"
                                            },
                                            "Text": {
                                                "val": "Will complete animal studies examining neurotherapeutic resuscitation strategies for TBI with polytrauma (injuries to multiple body parts and organ systems). Will complete brain imaging studies using positron emission tomography.  Will begin studies evaluating correlative relationships between TBI-induced non-convulsive seizures, TBI-specific biomarkers, and TBI clinical outcomes.  Will complete small animal studies evaluating potential beneficial effects of resuscitative endovascular occlusion of the aorta in TBI with polytrauma (will elevate to large animal TBI model if indicated)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602787A (Medical Technology) \/ Project 874 (Cbt Casualty Care Tech) in FY20  as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prolonged Field Care"
                                    },
                                    "Description": {
                                        "val": "This effort performs applied research to study the physiological implications of delayed medical evacuation and limited access to definitive surgical care in severely injured casualties."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.324"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.324"
                                            },
                                            "Text": {
                                                "val": "Will develop animal models of machine perfusion of vascularly isolated limbs that can be used to evaluate oxygen carrying solutions for limb preservation during extended tourniquet application. Will conduct large animal studies of stem cell products to treat acute respiratory distress syndrome. Will develop and test automated control for partial resuscitative endovascular balloon occlusion of the aorta during application of prolonged cardiovascular support."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602787A (Medical Technology) \/ Project 874 (Cbt Casualty Care Tech) in FY20  as part of the financial restructuring."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MM6"
                    },
                    "ProjectTitle": {
                        "val": "Medical Technologies to Support Dispersed Ops Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "12.109"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.109"
                        },
                        "BudgetYearTwo": {
                            "val": "13.575"
                        },
                        "BudgetYearThree": {
                            "val": "12.058"
                        },
                        "BudgetYearFour": {
                            "val": "13.961"
                        },
                        "BudgetYearFive": {
                            "val": "14.081"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "65.784"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned from:\nProgram element (PE) 0602787A Medical Technology\n* Project XV5 Medical Capabilities to Support Dispersed Ops"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project will focus on the delivery of healthcare and class VIII by ground or air in dispersed and multi-domain battle environments. Will enable teaming to deliver medical care, and establish medical performance criteria to ensure Soldiers have the physiological, cognitive, and psychological capacity to perform man-machine teaming.  This project supports prolonged care and deciding faster by exploiting emerging communications and information technology for remote telemonitoring and telementoring between providers in Roles of Care 3 and 4 to patients in Roles of Care 1 and 2\n\nPromising work in this Project will be further matured in PE 0603002A (Medical Advanced Technology) \/ Project MM7 (Enabling Med Cap to Support Dispersed OPS Adv Tech).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Medical Research Materiel Command (USAMRMC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Medical Robotic and Autonomous Systems (Med-RAS)"
                                    },
                                    "Description": {
                                        "val": "Research, design, and prototype autonomous and unmanned capabilities to deliver high quality combat casualty care in dispersed operations with limited or absent medical care personnel, and future medical robotic systems capable of providing autonomous combat casualty care while optimizing the medical logistic footprint in far-forward and dispersed geographic environments in support of the Army Multi-Domain Battle concept and the Army Force 2025 and Beyond vision."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.033"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.033"
                                            },
                                            "Text": {
                                                "val": "Will research the design of robotic systems, including physical interfaces and hardware configurations, to effectively implement and control resuscitation and critical care procedures driven by artificial intelligence (AI) and machine learning.   Will explore the feasibility of using robotic perception systems to detect and visualize combat casualties for autonomous treatment & extraction.  Will research methods for integrating medical systems with emerging unmanned aerial system (UAS) platforms that address patient transport safety concerns, reliability of medical systems in flight, and low-bandwidth and cyber-secure transmission of medical data. Will design and prototype a medic?s AI assisted decision support system using lightweight ruggedized patient monitoring devices, hands-free input of medic observations, and approved joint tactical combat casualty\/prolonged field care guidelines as inputs to provide first responders at the point of injury with adaptive treatment and patient disposition recommendations in the absence of reach-back capabilities for remote telementoring.  Will research and design autonomy-based countermeasures to signal latency and constrained bandwidth capabilities for conducting tele-robotic surgical tasks and  procedures in low-comms environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602787A (Medical Technology) \/ Project XV5 (Medical Capabilities to Support Dispersed Ops) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Virtual Health"
                                    },
                                    "Description": {
                                        "val": "Develop future Virtual Health enterprise process architectures and integrated physical solutions capable of supporting prolonged field care in conditions with limited or lacking traditional field communications."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.076"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.076"
                                            },
                                            "Text": {
                                                "val": "Will research and validate models of novel Virtual Health (VH) enterprise process architectures to provide new intersections of health information and knowledge far forward to support the Multi-Domain Operations. Will research and validate models for the Virtual Health support and integration with autonomous (real time) and\/or semi-autonomous patient care capabilities. Will research and validate means to leverage contemporary VH data components to drive future semi-autonomous and autonomous VH system support tools. Will determine strategies for future linkages between the tactical environment and garrison based VH functions. Will determine novel strategies to identify VH consultants based on both availability and proximity to the VH needs. Will explore strategies for VH solutions that align with best practices to counteract threats from electronic warfare (EW). Will explore mechanisms to streamline the engagement with VH solutions by clinical end users in the operational environment. Will research and develop strategies and mechanisms to provide VH solutions when an established synchronous VH consultation is disrupted due to communication failure\/outages to include, but not limited to, closed loop systems and machine learning techniques."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602787A (Medical Technology) \/ Project XV5 (Medical Capabilities to Support Dispersed Ops) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MM8"
                    },
                    "ProjectTitle": {
                        "val": "Infectious Diseases and Applied Rsch Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "21.661"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.661"
                        },
                        "BudgetYearTwo": {
                            "val": "18.241"
                        },
                        "BudgetYearThree": {
                            "val": "17.892"
                        },
                        "BudgetYearFour": {
                            "val": "18.543"
                        },
                        "BudgetYearFive": {
                            "val": "18.887"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "95.224"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned from:\nProgram Element (PE) 0602787A Medical Technology\n* Project 870 DoD Med Def Ag Inf Dis"
                        },
                        "ProjectMissionDescription": {
                            "val": "Applied research to design and refine drugs, vaccines, other medical countermeasures against naturally occurring infectious diseases as identified by worldwide medical surveillance and capability needs assessments.\n\nPromising medical countermeasures identified in this Project are further matured under PE 0603002A (Medical Advanced Technology) \/ Project MM9 (Tech Base\/Enabling Rsrch for Infect Dis Adv Tech), Project MN8 (Drugs to Prevent and Treat Malaria Advanced Tech), and Project MO9 (Vaccines to Prevent Dengue Fever Advanced Tech).\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy.\n\nWork is managed by the United States Army Medical Research and Materiel Command (USAMRMC) in coordination with the Naval Medical Research Center (NMRC). The Army is responsible for programming and funding all Department of Defense (DoD) naturally occurring infectious disease research requirements, thereby precluding duplication of effort within the Military Departments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Applied research on drugs and vaccines against parasitic diseases"
                                    },
                                    "Description": {
                                        "val": "Identify and optimize lead drug compounds to identify candidates for human studies.  Test lead drug candidates for safety and toxicity in animals. Down-select lead candidates as a malaria drug for use in humans. Optimize antigens and platforms for use in animal studies.  Evaluate new vaccine candidates for safety, effectiveness, and immunogenicity in animal models to advance to human clinical trials."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.123"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.123"
                                            },
                                            "Text": {
                                                "val": "Will complete studies in validated animal models to test reformulated triazine lead compound for safety and the dissemination in blood and tissues. These studies are required by the United States Food and Drug Administration (FDA) to enable oral dosing studies in humans. Will complete testing of pyrimidinylguanidine (a newly discovered family of similar chemical compounds that are active against malaria parasites in experimental animals) and primaquine-like compounds in primate malarias to enable initial human testing. Will complete laboratory based analyses of human immune cells and antibodies from Plasmodium falciparum malaria vaccine trials to enable down selection of a lead vaccine for transition to advanced development. Will conduct initial effectiveness trials of potential lead vaccine formulations in primate models of a relapsing malaria, Plasmodium vivax."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602787A (Medical Technology) \/ Project 870 (DoD Med Def Ag Inf Did) as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Viral Threats Research"
                                    },
                                    "Description": {
                                        "val": "Optimize vaccine components and platforms for use in animal studies.  Evaluate new vaccine candidates against dengue and Hantaviruses for safety, and immunogenicity in animal models to advance to human clinical trials."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.666"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.666"
                                            },
                                            "Text": {
                                                "val": "Will continue to sustain field sites as part of ongoing research partner efforts in testing dengue vaccine immunogenicity (ability to provoke an immune response) and effectiveness. Will continue to conduct immune cell and antibody assessments in human subjects exposed to dengue by dengue human infection model. Will continue to conduct immune cell and antibody assessments in human subjects immunized with purified inactivated virus and live attenuated virus vaccines. Will continue to explore multi-agent (combination of two or more molecules capable of inducing an immune response) vaccine concepts e.g., pan-hantavirus vaccine, Rift Valley fever, and Crimean Congo hemorrhagic fever vaccine."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602787A (Medical Technology) \/ Project 870 (DoD Med Def Ag Inf Did) as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Bacterial Threats"
                                    },
                                    "Description": {
                                        "val": "Optimize antigens and platforms for use in animal studies.  Evaluate bacterial diarrheal vaccine candidates for safety, effectveness, and immunogenicity in animal models to advance to human clinical trials (ETEC, Shigella and Campylobacter). Examine host\/pathogen\/vector interactions for scrub typhus and other Rickettsial diseases."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.872"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.872"
                                            },
                                            "Text": {
                                                "val": "Will continue to develop and advance existing vaccine candidates against ETEC, Shigella and Campylobacter. Will continue to down select vaccine candidates for testing in animal models of diarrhea caused by ETEC, Shigella and Campylobacter. Will perform an assessment of multivalent (different types) vaccine candidates for ETEC, Shigella and Campylobacter in animal models of diarrhea. Will produce vaccine candidates for testing in humans using Good Manufacturing Processes. Will continue to evaluate the feasibility of clinical field sites for the assessment of vaccine candidates in humans. Will continue to maintain DoD subject matter expertise and laboratory capability in Rickettsiology to effectively detect, diagnose and treat rickettsial disease."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602787A (Medical Technology) \/ Project 870 (DoD Med Def Ag Inf Did) as part of the financial restructuring."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MN1"
                    },
                    "ProjectTitle": {
                        "val": "Applied Sensory Systems Trauma Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "7.615"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.615"
                        },
                        "BudgetYearTwo": {
                            "val": "6.967"
                        },
                        "BudgetYearThree": {
                            "val": "6.825"
                        },
                        "BudgetYearFour": {
                            "val": "3.745"
                        },
                        "BudgetYearFive": {
                            "val": "3.797"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "28.949"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned from:\nProgram Element (PE) 0602787A Medical Technology\n* Project ET4 Appl Resch in Clinical and Rehabilitative Medicine"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project conducts laboratory and animal studies for the purpose of developing novel, non-opioid drugs to treat pain in the austere battlefield environment with minimal side  effects.  Research to understand the influence of stress on the effectiveness of pain relief drugs (analgesics). All drugs, biological products, and medical devices are refined in accordance with Food and Drug Administration (FDA) regulations, which govern testing in animals to assess safety, toxicity, and effectiveness and subsequent human subject clinical trials.\n\nPromising efforts identified in this Project are further matured under PE 0603002A (Medical Advanced technology \/ Project MN2 Tech\/Enabling Research for Sensory Systems Advanced Technology.\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Medical Research Materiel Command (USAMRMC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Applied Sensory Systems Trauma Technology"
                                    },
                                    "Description": {
                                        "val": "Applied research on the treatment of severe injuries to sensory systems. Design, develop, and improve technologies to deliver therapeutics, protect, and preserve vision following severe eye trauma; early evaluation of stem-cell therapies to regenerate damaged eye tissues; and early evaluation of nerve therapeutics to preserve or regenerate the optic nerve. Research to understand the influence of stress on the effectiveness of pain relief drugs (analgesics)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.615"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.615"
                                            },
                                            "Text": {
                                                "val": "Will conduct preclinical testing to identify new targets (including peripheral ion channels) and to explore the potential of novel non-opioid drugs for improved pain management strategies.  Also will investigate medical countermeasures to directed energy exposures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602787A (Medical Technology) \/ Project ET4 (Appl Resch in Clinical and Rehabilitative Medicine) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VB3"
                    },
                    "ProjectTitle": {
                        "val": "MEDICAL TECHNOLOGY INITIATIVES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6"
                        },
                        "CurrentYear": {
                            "val": "2"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "8.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item for Medical Technology applied research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Burn Patient Transfer System"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "2"
                                        },
                                        "Text": {
                                            "val": "Burn Patient Transfer System"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "2"
                                        },
                                        "Text": {
                                            "val": "Burn Patient Transfer System"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4"
                                        },
                                        "Text": {
                                            "val": "Program Increase"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VB4"
                    },
                    "ProjectTitle": {
                        "val": "System  Biology And Network Science Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.92"
                        },
                        "CurrentYear": {
                            "val": "2.006"
                        },
                        "BudgetYearOne": {
                            "val": "0.6"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.6"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.526"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports biological and clinical applied research using the data analysis and integration grid (SysBioCube) as an overarching means of complex data usage to solve critical health problems. The primary capability of systems biology (field of study that focuses on complex interactions within biological systems, using a holistic approach) is the integration and analysis of complex human and animal study data and development of computational disease models, using global multi-omic methods to identify and discriminate unique combinations of biological molecules corresponding to clinical conditions (physiologic, immunologic, endocrine, etc.), supporting transition of research to clinical applications. This capability applies a systematic integrated approach to trace progression of illnesses and diseases and has already shown that the approach significantly reduces time, funds and effort invested in medical product development and refinement as seen in biomarker development for Post-Traumatic Stress Disorder (PTSD) and enhanced analyses of coagulopathy. Another application of systems biology is to characterize physiological pathways altered by toxic substances enabling identification of the causative toxic substances as well as to understand the injury mechanisms. The detection\/identification of physiological markers of exposure to toxic substances can then be used to support medical countermeasure decisions or development of targeted therapeutic drugs.\n\nThese examples of more complex, yet integrated approaches to Projects studying biological systems have been shown to reduce both the time and expense of medical product development for the Army.\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the United States Army Medical Research Materiel Command (USAMRMC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Systems Biology"
                                    },
                                    "Description": {
                                        "val": "The core capability for multidisciplinary applied research in systems biology enables integration and analysis of complex data from human and animal studies and development of computational network models, allowing researchers to differentiate among molecular signatures (unique combinations of biological molecules corresponding to clinical conditions) of disease, and supports transition of research to clinical applications for diseases of military relevance. Applied research is being conducted to identify biological networks that are causative of illness in PTSD and co-morbidities (presence of one or more diseases or disorders), coagulopathy (impaired ability to clot blood) of trauma, traumatic brain injury, pain, suicide, infectious disease, and immune responses. In particular, the studies of PTSD are directed to refine biomarkers for screening, early diagnosis and therapeutic target discovery."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.92"
                                            },
                                            "Text": {
                                                "val": "Expanded Systems Biology capabilities, to facilitate collaborative intramural and extramural partnerships, and to accommodate an expected increase in the number of end-users of the SysBioCube (USAMRMC's information management suite, hosted by the National Cancer Institute (NCI) \/ National Institutes of Health (NIH) via the Frederick National Laboratory for Cancer Research). Oversaw data sharing and data integration of large, complex datasets. Increased capabilities to develop novel methods that integrate different systems biology data (e.g., genetics and metabolism data) that, in turn, lead to new knowledge products.\nProvided support to the Integrative Systems Biology Program at United States Army Center for Environmental Health Research (USACEHR) for oversight of research efforts. Collected time-dependent clinical data and integrated omics analyses of treatment efficacies to be used in a wide range of studies including biomarker development and the understanding the altered molecular mechanisms that underlie PTSD, coagulopathy (blood's ability to form clot is impaired), chronic pain perception, infectious diseases, and micro-gravitational stress on bone. Built a data-repository capability within the SysBioCube that will initially be for publications and associated datasets from 6.1 (Basic Research)-funded intramural research."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.942"
                                            },
                                            "Text": {
                                                "val": "Expand Systems Biology capabilities through collaborative intramural and extramural partnerships, and accommodate an expected increase in the number of end-users of the SysBioCube. Expand the data repository capability within the SysBioCube. Continue to oversee data sharing and data integration of large, complex datasets. Continue to increase capabilities to develop novel methods that integrate different systems biology data (e.g., genetics, microbiome, and metabolism data) that, in turn, will lead to new knowledge products. Continue to provide support to the Integrative Systems Biology Program at USACEHR for oversight of research efforts. Continue development of SysBioCube capabilities and functions such as integration and harmonization of additional data types (variant level Next Generation Sequencing data), browse and filtering functions to search for and sort specific assay types and associated data, tracking of assays conducted, and additional tools for longitudinal analysis and visualization of integrated data. Use time-dependent clinical data collections and integrated omics (omics refers to the collective technologies used to explore the roles, relationships, and actions of the various types of molecules that make up the cells of an organism) analyses of treatment efficacies to support a wide range of research efforts that will include additional biomarker development and understanding of the underlying altered molecular mechanisms of a) PTSD (including changes in the microbiome (gut microbes) and in metabolism) that will begin to correlate co-morbid (concurrent) conditions, and b) infectious diseases."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.6"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.6"
                                            },
                                            "Text": {
                                                "val": "Will complete all studies under this effort."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Remaining funding is to close out this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.064"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "XV5"
                    },
                    "ProjectTitle": {
                        "val": "Medical Capabilities to Support Dispersed Ops"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "5.713"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.713"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned to:\nProgram Element (PE) 0602787A Medical Technology\n* Project MM6 Medical Technologies to Support Dispersed Ops Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project line will support the following three new medical task areas: 1) Autonomous and Unmanned medical capability - will focus on developing the ability to use platforms to perform evacuations and deliver emergency resupply of Class VIII medical supplies, such as blood products, by ground or air, 2) Virtual Health - will enable prolonged care and deciding faster by exploiting emerging communications and information technology for remote telemonitoring and telementoring, 3) Medical Aspects of man- machine teaming - will enable teaming to deliver medical care, and establish medical performance criteria to ensure Soldiers have the physiological, cognitive, and psychological capacity to perform man-machine teaming.\n\nPromising work in this Project will be further matured in PE 0603002A (Medical Advanced Technology) \/ Project MM7 (Enabling Med Cap to Support Dispersed OPS Adv Tech).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Medical Research Materiel Command (USAMRMC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Medical Robotic and Autonomous Systems (Med-RAS)"
                                    },
                                    "Description": {
                                        "val": "Research, design, and prototype autonomous and unmanned capabilities to deliver high quality combat casualty care in dispersed operations with limited or absent medical care personnel in support of the Army Multi-Domain Battle concept and the Army Force 2025 and Beyond vision."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.648"
                                            },
                                            "Text": {
                                                "val": "Utilize invasive and non-invasive sensor systems to define new models for human physiologic responses to injury.  Data from these models will be used to define new algorithms that drive resuscitation and critical care procedures in animal models. Define algorithms for implementation across a full spectrum of automation capabilities. Define the physiological process associated with injury in trauma simulations that would be amenable to automated therapeutics with autonomous medical systems. Explore feasibility of integrating medical capabilities and information systems with Army unmanned systems (UMS) Programs of Record in order to leverage multipurpose robotic platforms for medical capabilities. Research standardization of medical device interfaces for use in an autonomous platform. Research feasibility of Unmanned Aerial Systems (UAS) to support remote patient monitoring research prototypes, closed-loop patient support systems, and prototype automated diagnostic and therapeutic en route care capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602787A (Medical Technology) \/ Project MM6 (Medical Technologies to Support Dispersed Ops Tech) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Virtual  Health"
                                    },
                                    "Description": {
                                        "val": "To develop future virtual health enterprise process architectures and integrated physical solutions capable of supporting prolonged field care in conditions with limited or lacking traditional field communications."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.928"
                                            },
                                            "Text": {
                                                "val": "Generate an overall virtual health technology research plan with detailed research tasks to support the multi-domain battlefield concept to include potential cross-domain with other research task areas. Research and model novel virtual health enterprise process architectures to provide new intersections of health information and knowledge far forward to support the multi-domain battlefield concept. Conduct a gap analysis of mechanisms for virtual health secure data transmission and communications in the tactical environment leveraging novel means to reduce virtual health encounter data packet sizes through novel compression algorithms to facilitate use in very limited communication scenarios to support the multi-domain battlefield concept. Determine key physiological constructs that are predictive of health status and readiness for development of a micro-footprint biosensor-based assessment tools."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602787A (Medical Technology) \/ Project MM6 (Medical Technologies to Support Dispersed Ops Tech) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medical Aspects of Man-Machine Teamining\/Medical Robotics"
                                    },
                                    "Description": {
                                        "val": "Research, design, and prototype future medical robotic systems capable of providing autonomous combat casualty care while optimizing the medical logistic footprint in far-forward and dispersed geographic environments in support of the Army Multi-Domain Battle concept and the Army Force 2025 and Beyond vision."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.928"
                                            },
                                            "Text": {
                                                "val": "Research the design of robotic systems, including physical interfaces and hardware configurations, to effectively implement and control resuscitation and critical care procedures driven by algorithms defined by complementary research described in the Autonomous and Unmanned Medical Capability Task Area. Research and design a proof of concept field robotic fold-up litter to show the feasibility of deploying soft robotics sensors and also show the capability to apply pressure using a soft robotics manipulator. Model and characterize the problems caused by signal latency and constrained bandwidth on complex tele-robotic surgical tasks. Research and prioritize procedures amenable to full automation of tele-robotic operations. Research and explore the feasibility of using robotic perception systems to detect casualties from a standoff distance and at closer ranges using both conventional computer vision approaches and recent advancements in deep learning techniques. Will research and prioritize procedures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602787A (Medical Technology) \/ Project MM6 (Medical Technologies to Support Dispersed Ops Tech) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.209"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}