{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-2da06648be01af3e3586c70d627e29e7f571c412db103c0685f2e8b518a81021-22",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603680D8Z"
        },
        "ProgramElementTitle": {
            "val": "Defense Wide Manufacturing Science and Technology Program"
        },
        "R1LineNumber": {
            "val": "47"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "576.107"
            },
            "PriorYear": {
                "val": "206.257"
            },
            "CurrentYear": {
                "val": "174.489"
            },
            "BudgetYearOne": {
                "val": "96.397"
            },
            "BudgetYearOneBase": {
                "val": "96.397"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "79.543"
            },
            "BudgetYearThree": {
                "val": "78.423"
            },
            "BudgetYearFour": {
                "val": "76.965"
            },
            "BudgetYearFive": {
                "val": "78.469"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "N\/A"
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense-wide Manufacturing Science and Technology (DMS&T) program is the joint, defense-wide component of the DoD Manufacturing Technology (ManTech) Program directed in Title 10 U.S.C. Section 2521.\n\nThe DMS&T program supports the National Defense Strategy (2018) which states a healthy defense industrial base is a critical element of U.S. power and the National Security Innovation Base.  The ability of the military to surge in response to an emergency depends on our Nation’s ability to produce needed parts and systems, healthy and secure supply chains, and a skilled U.S. workforce.  The objective of the DMS&T program is to increase the speed of innovation and provide frequent technology off-ramp opportunities, turning inventions and scientific discoveries into actual equipment and capabilities for our men and women in uniform as quickly and affordably as possible.  The DMS&T program has created and is sustaining an ecosystem that addresses near term critical technology requirements and accelerates promising technology (hypersonics, directed energy, artificial intelligence, etc.) to the warfighter via innovative manufacturing methods through a two-pronged strategy: (1) OSD Manufacturing Technology (ManTech) R&D projects and the (2) Manufacturing Innovation Institutes (MIIs).\n\nThis program also supports many of the recommendations in the Executive Order Report “Assessing and Strengthening the Manufacturing and Defense Industrial Base and Supply Chain Resiliency of the United States” September 2018.\n\nThere are two project codes in this Program Element (PE) : P680 OSD Manufacturing Technology and P350 the DoD Manufacturing USA Institutes.  \n\nP680 OSD Manufacturing Technology:\nThe OSD Manufacturing Technology (ManTech) program was established to address needs beyond the risk of a single Service or agency. It focuses on cross-cutting defense manufacturing needs and stimulates early development of manufacturing processes and enterprise business practices, concurrent with S&T development, to achieve the largest cost-effective impact and facilitate development of enabling capabilities for the warfighters.\n\nP350 DoD Manufacturing USA Innovation Institutes: \nThis project is focused on supporting eight DoD led manufacturing innovation institutes which are part of the Manufacturing USA network of manufacturing innovation institutes.  The technologies that are being pursued include (1) additive manufacturing; (2) digital manufacturing, design and manufacturing cybersecurity; (3) lightweight metals; (4) integrated photonics; (5) flexible hybrid microcircuits; (6) smart fibers and textiles; (7) advanced tissue biofabrication and; (8) advanced robots for manufacturing.  Each institute is a public\/private partnership that matches DoD funding at a one to one ratio or greater and has established a consortium of members from industry and academia to mature the manufacturing processes in their respective areas, to build out the ecosystems that supports these areas, and provides resources supporting advanced manufacturing education and workforce development.  Through the government investment, DoD maintains strategic influence in the work accomplished by the institutes and realizes accelerated technological innovation for defense products."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "136.159"
                },
                "CurrentYear": {
                    "val": "114.637"
                },
                "BudgetYearOne": {
                    "val": "87.647"
                },
                "BudgetYearOneBase": {
                    "val": "87.647"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "206.257"
                },
                "CurrentYear": {
                    "val": "174.489"
                },
                "BudgetYearOne": {
                    "val": "96.397"
                },
                "BudgetYearOneBase": {
                    "val": "96.397"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "70.098"
                },
                "CurrentYear": {
                    "val": "59.852"
                },
                "BudgetYearOne": {
                    "val": "8.750"
                },
                "BudgetYearOneBase": {
                    "val": "8.750"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "75.500"
                    },
                    "CurrentYear": {
                        "val": "60.250"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Reductions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.262"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-5.140"
                                },
                                "CurrentYear": {
                                    "val": "-0.398"
                                },
                                "BudgetYearOne": {
                                    "val": "8.750"
                                },
                                "BudgetYearOneBase": {
                                    "val": "8.750"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2018 Congressional Add for $75.500 million supports efforts for: Manufacturing Engineering Programs; Gallium Nitride (GAN) Semiconductor Technology; engagements in Manufacturing USA institutes; and National Security Technology Accelerator.  The FY 2019 Congressional Add for $60.250 million supports the acceleration of efforts for: manufacturing engineering programs; manufacturing innovation institutes; advanced manufacturing; and National Security Technology Accelerator.  The FY 2020 increase of $8.750 million supports activities in the Manufacturing Institute Initiatives project."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "680"
                    },
                    "ProjectTitle": {
                        "val": "Manufacturing Science and Technology Program"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "174.930"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "30.162"
                        },
                        "BudgetYearOneBase": {
                            "val": "30.162"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "32.102"
                        },
                        "BudgetYearThree": {
                            "val": "32.783"
                        },
                        "BudgetYearFour": {
                            "val": "33.039"
                        },
                        "BudgetYearFive": {
                            "val": "33.651"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "N\/A"
                        },
                        "ProjectMissionDescription": {
                            "val": "Established to address needs beyond the risk of a single Service or Agency and to complement the Component ManTech programs, the OSD ManTech program concentrates on cross-cutting defense manufacturing needs that are beyond the ability of a single service to address and stimulates the development of manufacturing processes concurrent with S&T development to reduce total ownership cost and facilitate transition of technology to capability for our Warfighters.  As a technology investment program, OSD ManTech serves its joint mission requirements by investing in enterprise wide issues with joint service applicability and seeks to enhance manufacturing capability for defense-essential\/defense-unique technologies that are beyond reasonable\/normal industry and program office risk.  In support of this mission the OSD ManTech program invests in broad technology initiatives that support multiple systems’ requirements as well as specific individual projects meeting more focused and immediate warfighter needs.\n\nKey OSD ManTech technical areas include Advanced Electronics and Optics, Advanced Materials and Composites, Advanced and Emerging Manufacturing Processes, and Advanced Energetics Manufacturing."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Manufacturing Science and Technology Program"
                                    },
                                    "Description": {
                                        "val": "The OSD ManTech (P680) portfolio includes a focus on above-the-shop-floor new manufacturing processes and practices having the potential to improve manufacturing efficiencies at broader, enterprise levels. Single specific projects address investment opportunities and enable the program to more surgically apply investments to compelling and sometimes urgent manufacturing needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Manufacturability of Vertical-Cavity Surface Emitting Lasers – Phase II: continue device development and additional product transitions; obtain feedback from end users and implement improvements.\n\nNanocomposite Optical Ceramics (NCOC):  Continue powder conditioning, blank forming, heat treatment, optical finishing and coating related activities; measure results and assess Manufacturing Readiness Levels."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "30.162"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "30.162"
                                            },
                                            "Text": {
                                                "val": "• Mature ManTech tools, technology and talent capabilities and capacity into projects across Electronics, Composites, Energetics, and Manufacturing processes.  \n• Incorporate JDMTP, S&T, DARPA, IARPA, Service strategies, Manufacturing USA Institutes, and IPL inputs into evolving portfolio structure.\n• Develop best practices and relationships with industry, academia, and Service components.\n• New Project Starts (NDS Alignment; USD R&E Alignment) – Hypersonic RF Window Manufacturing Development (Hypersonics, Directed Energy, Joint Lethality; Hypersonics, Electronic Warfare, Directed Energy), Advanced Mixing for Infrared Countermeasures (Joint Lethality), Lightweight Hydrogen Fuel Cell (Joint Lethality, Autonomy; Electronic Warfare, Command, Control and Communications) .\n• Continuing Projects – Foamed Celluloid Materials (Joint Lethality), Light Weight Gradient Index Lenses (Joint Lethality), DBX-1 (Joint Lethlity), Circular Polarizers for Color Day Cameras (Joint Lethality), MOC3HA (Hypersonics; Hypersonics, Missile Defense, Space Offense and Defense), Monolithic Spectral Beam Combiners (Directed Energy; Directed Energy, Electronic Warfare, Space Offense and Defense), High Density Reactive Materials (Joint Lethlity).\n• Completing Projects – Fabrication of Non-Eroding Metallic Throat (Hypersonics; Hypersonics, Missile Defense, Space Offense and Defense), MEMS Navigation Grade Inertial Sensors (Joint Lethality; Command, Control and Communications, Microelectonics), Oxide-Oxide (Hypersonics, Joint Lethality; Hypersonics), Magnesium Oxide Binder for Thermal Batteries (Joint Lethality, Hypersonics; Hypersonics, Space Offense and Defense, Missile Defense), Stabilized Alpha Alane (Hypersonic, Joint Lethality; Hypersonics, Missile Defense)."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease from 52.238 to 30.162 to reflect completion of Congressional Add programs."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item. Outyear data for \"Other Program Funding\" is contained within the Service budgets."
                        },
                        "PerformanceMetrics": {
                            "val": "The majority of DMS&T investment project performance metrics are specific to each effort and include specific key performance parameters and transition\/implementation plans and metrics identified in the project plans. Typical metrics include target dates and conditions-based milestones in project work breakdown schedules, production measures, production goals, production numbers and demonstration goals and dates."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "350"
                    },
                    "ProjectTitle": {
                        "val": "Manufacturing Innovation Institutes"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "401.177"
                        },
                        "PriorYear": {
                            "val": "206.257"
                        },
                        "CurrentYear": {
                            "val": "174.489"
                        },
                        "BudgetYearOne": {
                            "val": "66.235"
                        },
                        "BudgetYearOneBase": {
                            "val": "66.235"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "47.441"
                        },
                        "BudgetYearThree": {
                            "val": "45.640"
                        },
                        "BudgetYearFour": {
                            "val": "43.926"
                        },
                        "BudgetYearFive": {
                            "val": "44.818"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "N\/A"
                        },
                        "ProjectMissionDescription": {
                            "val": "DoD supports eight manufacturing innovation institutes which are public\/private partnerships that address both commercial and defense manufacturing needs within specific, defense-relevant technology areas and receive active participation and support from the military departments and defense agencies. The institutes’ flexible business models and strong focus on enabling highly collaborative R&D are catalyzing important new organizational relationships across government, industry and academia. This is bringing together both traditional defense and non-traditional sectors, accelerating key innovation cycles and expanding U.S. industrial capability and assisting in creating resilient supply chains that will support innovative defense products."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Manufacturing Engineering Programs"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "25.000"
                                        },
                                        "Text": {
                                            "val": "This program increase entitled \"Manufacturing Engineering Programs\" supports Department efforts to engage in manufacturing related efforts that support improving the productivity of the defense industrial base, assisting small and medium size manufacturers (SMMs) manufacturing ability to adapt advanced manufacturing processes, engaging with the Manufacturing Extension Partnership (MEP) to support small manufacturers in areas such as manufacturing cyber security, replicating and deploying manufacturing education and work force development efforts that have been established by the Manufacturing USA institutes.  This compliments efforts performed within the National Defense Education Program.  Additionally, funding will be used to support Service\/Agency collaboration in additive manufacturing to accelerate the adoption of additive manufacturing for acquisition and sustainment of DoD weapon systems."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "This program increase entitled \"Manufacturing Engineering Programs\" supports Department efforts to engage in manufacturing related efforts to assist in maintaining a technically trained workforce to meet the defense industrial base requirements of the Department of Defense. Competitive grants and awards are planned that will engage community colleges, technical schools and the DoD institutes to accomplish this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "General Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "This program increase funded engagements with the Manufacturing USA institutes to address specific Defense manufacturing technology challenges and opportunities. This included developing a strategy to expand the Institutes to new regions, which will allowed the Institutes to have a broader impact on the adoption of advanced manufacturing technologies by SMMs, MEPs, educational providers, and industries across the country."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Manufacturing Institutes"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.250"
                                        },
                                        "Text": {
                                            "val": "This program increase will be used to support activities at the Digital Manufacturing and Design Innovation Institute in the following areas:  (1) digital design, product development and systems engineering; (2) the digital factory of the future; (3) creating agile, resilient supply chains; and (4) cybersecurity for manufacturing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "National Security Technology Accelerator"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "25.000"
                                        },
                                        "Text": {
                                            "val": "Education Portfolio: The Education Portfolio programs contribute to workforce development by cultivating innovators and entrepreneurs inside DoD who are adept at creative problem solving, the development of innovative approaches and technologies, and venture formation that will improve national security, as well as deliver economic and social value.  Efforts include:\n\n1. “Boot Camps” are 4-day short courses that provide military organizations instruction on topics related to innovation and intrapreneurship (including human centered design, lean methodology, technology literacy, and psychology of innovation) and taught to apply these skills to a set of command-sponsored problem topics. \n2. “Startup Innovation Fellowship (SIF)” is a 6-week fellowship opportunity for service members and civilians to be embedded in private companies to learn best practices in critical areas applicable to DoD such as data science, artificial intelligence and machine learning, cyber security, logistics, rapid prototyping, etc. \n3. Collaboration Portfolio (CP): The CP programs connect communities of innovators around problems and technologies relevant to national security to enable formation of new ventures.\n• Hacks exposes college students and local ventures to DoD customer problems over a 48 hour period and aims to provide Minimal Viable Product (MVP) or low-TRL solutions to the sponsor. \n• Hacking for Defense exposes college students to DoD customer problems over an academic semester and aims to provide MVP solutions through 1 of 3 channels: formation of a venture; direct solution adoption by the problem sponsor; or reframing the original problem.\n• Source invites bottom-up, innovation from inside a military formation by providing either new solutions or novel applications directly to leadership from sponsoring command.\n• Catalyst exposes local ventures to DoD customer problems over a 6-18month period and provides high-TRL solutions for immediate adoption by the problem sponsor or a DoD contracting entity (e.g., DIU).  \n• Acceleration Portfolio (AP): The AP programs grow and mature civil-military technology ventures by ensuring that innovators can access critical resources, including design and engineering support, mentorship services, and commercial and DoD R&D infrastructure to build, test, and enhance venture concepts.\n• Maker provides facilities, access, materials, and training to entrepreneurs to fabricate, develop, and facilitate rapid prototyping of their technology.\n• Fed Tech pairs cutting edge inventor teams and technologies from the United States federal government laboratory system with highly qualified entrepreneurs to conduct customer discovery and build business models.\n• MD5 Starts is a format for showcasing early stage startups who are working on technologies and products that are pursuing a dual-use market strategy.\n• Hatch helps entrepreneurs\/teams with an idea (i.e., from H4D) learn how to form and build a venture using industry best practices. \n• Propel provides companies that have prototypes or initial customers with world-class education, mentorship, and relevant business connections to prepare the venture for scale while elevating their visibility in the venture community. \n• Gauge provides facilities, access, materials, and training to entrepreneurs to develop, iterate, and refine their technology up to TRL 6\/7. Also provide access to test and development ranges.\n• Launch identifies existing government technology that can be applied to a stated customer problem or problem set and to then work with a team on a path to commercialize the technology.\n• Boost provides opportunities for companies to secure early, non-dilutive government funding in the form of grants or contracts working the SBIR program.\n• Bridge provides founding teams with mentors and advisors who can help them in business, customer, and product development by providing the right advice and insights at the right time."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "15.000"
                                        },
                                        "Text": {
                                            "val": "The FY 2019 Congressional Add supports continuation of activities initiated in FY 2018."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Gallium Nitride (GAN) Semiconductor Technology"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "14.738"
                                        },
                                        "Text": {
                                            "val": "The $15.000 million increase for GaN Semiconductor Technology will leverage existing GaN ManTech efforts looking to support and expand the GaN ecosystem in the areas of design, fabrication, and test."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Manufacturing"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "30.000"
                                        },
                                        "Text": {
                                            "val": "Coordinating with Service Matter Experts (SMEs) in Cold Spray Technology to expand usage of Cold Spray technology to DoD organic repair and maintenance facilities, develop part families for land, air, and sea applications, and expand the Cold Spray supply chain to meet additional DoD applications."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DoD Manufacturing Innovative Institutes"
                                    },
                                    "Description": {
                                        "val": "DoD’s eight institutes are: (1) America Makes (Additive Manufacturing); (2) Digital Manufacturing and Design Innovation Institute (Digital Manufacturing, Design and Cybersecurity); (3) Lightweight and Modern Metals Manufacturing (Lightweighting Innovations – materials and processes); (4) American Institute for Manufacturing Integrated Photonics (Device Manufacturing and Packaging); (5) Flexible Hybrid Electronics Manufacturing Innovation Institute (Flexible Hybrid Electronics Manufacturing); (6) Advanced Functional Fabrics of America (Smart Fibers and Textiles); (7) Advanced Tissue Biofabrication Manufacturing Innovation Institute (regenerative tissue manufacturing); (8) Advanced Robotics Manufacturing (Smart Collaborative Robotics for Manufacturing).\n\nThe funding provided for the manufacturing innovation institutes is focused in the following areas:\n\n• Conducting (or funding) pre-competitive applied research and development projects to reduce the cost, time, and technical uncertainty related to new manufacturing technologies and to improve existing technologies, processes, and products.\n• Developing and implementing education, training, and workforce recruitment courses, materials, and programs.\n• Developing innovative methodologies and practices for supply chain integration and introduction of new technologies into supply chains.\n• Engaging with small and mid-sized manufacturers, including women and minority-owned manufacturing enterprises, and larger-sized manufacturing firms.\n\nWhile each institute has a different model there are similar in the following ways;\n\n• Each is a public-private partnership with representatives from industry, academia, state and local governments, and the DoD that co-invest in world-leading technologies and capabilities.\n• Each institute provides facilities needed to allow collaborative, precompetitive development of promising technologies and to promote the creation of stable and sustainable innovation ecosystems for advanced manufacturing. \n• The partnerships forming the institutes must commit non-federal resources that equal or exceed the federal contribution during a five- to seven-year establishment period. \n• Each institute is part of the Manufacturing USA network."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "110.007"
                                            },
                                            "Text": {
                                                "val": "Complete technical performance of all projects awarded in FY 2016 and make results available in the knowledge base. The period of performance for technical work under the Cooperative Agreement ends on August 31, 2017. Program management subsequently continues to provide oversight through August 31, 2019 for the close-out of all R&D projects, cost share accrual, final reporting, and transition to sustainability, in addition to completion of RDT&E fiduciary responsibilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "91.911"
                                            },
                                            "Text": {
                                                "val": "The major areas of emphasis for the eight DoD led manufacturing innovation institutes are:\n1. Qualification and certification of additive manufacturing (AM) materials, processes, and parts, together with rigorous training and workforce development that enables DoD to further integrate AM technologies into their depots, arsenals, and shipyards to modernize their supply chains and strengthen their position.\n2. Mature technology to institutionalize the digital thread across DoD manufacturing enterprises by enabling the modernization of DoD assets, lowering barriers to virtual prototyping and validation; accelerating the innovation cycle; generating dynamic responses to material needs; and lowering total system lifecycle costs form design thorough disposal.  Develop tools to assist small and medium size companies for manufacturing cybersecurity.\n3. Mature innovative metal lightweighting technologies across all platforms and services that save fuel and increase combat payload. Investments would address both targeted application spaces and cross-cutting enabling technologies.  This includes activity in linear friction welding; design and manufacturing methods for promising high strength alloys; develop lightweight engineered structures; optimize ultra-fast heat treatment and quenching and extend the use of thin-walled casting technology to cast components for military vehicles.\n4. Utilize the existing world-class 300mm integrated silicon photonics foundry in Albany, NY, the indium phosphide photonics foundry in Silicon Valley, and the world’s first photonic integrated circuit test, assembly, and packaging facility in Rochester, NY to accelerate low cost, volume manufacturing of devices for LIDAR, 5G telecom, and quantum dot lasers and the integration of advanced assembly and packaging techniques for optical elements. \n5. Mature flexible hybrid technology to support a supply chain that can produce electronics on flexible, stretchable, and 3-dimensional structures. This will create new innovative products that can be used for warfighter wearable health sensors, portable x-ray imagers, precision navigation timing packages and phased array antennas for electronic warfare and radar systems.\n6. Mature the manufacturing processes that will enable industry to produce and use smart fibers and textiles and incorporated them into innovative products using conventional weaving and knitting equipment. Advanced fabric technology offers unique solutions to critical national security challenges, including soldier communication systems; functional composite materials for ground and air vehicles; and distinctive undersea and space capabilities.  Through the recently created Defense Fabric Discovery Center continue to develop a fabric-based solutions in Free Space Optical Communications (Identification Friend\/Foe (IFF)) that eliminates issues of detection and jamming and is affordable and easily deployable.\n7. Mature the technology for large scale, cost-effective, reproducible manufacturing of high-quality tissues that can be used to treat severely wounded warfighters, which contributes to force readiness and saves lives on the battlefield.  This includes (1) cell selection, culture and scale-up, (2) biomaterial selection and scale-up, (3) tissue process automation and monitoring, (4) tissue maturing technologies, and (5) tissue preservation and transport.\n8. Accelerate research, development, and implementation of collaborative robotic technologies for use in manufacturing. Early use include smart companion robots for vehicle assembly, perception-aided collaborative robotic wire harness assembly, robot assistance for composites manufacturing, and robotic sanding and finishing. The focus is on (1) Versatility — robots that can perform a variety of tasks; (2) Flexibility — robots that can be deployed and re-deployed rapidly and easily; (3) Lower cost — reducing the overall cost of robot systems; and (4) Collaboration — robots that safely work alongside and with people.\n\nAs institutes come off their initial agreement, new assistance agreements will be established.  In FY19 new agreements for LIFT and DMDII will be established."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "66.235"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "66.235"
                                            },
                                            "Text": {
                                                "val": "Continue developing and maturing the ecosystem that supports the manufacturing innovation institute technology areas.  Continue to look for other DoD customers that can invest in the institutes to address specific program problems. Develop an acquisition strategy that will allow for the institutes to produce prototypes that can be used by DoD customers.  Establish follow on agreements with institutes as the complete their startup phase.  Continue to support efforts that are aligned to the National Defense Strategy (NDS) and OUSDR&E modernization priorities. Continue to work with inter-agency partners involved in the Manufacturing USA Network."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There was a Congressional add of $15.250M to P350 in FY 2019.  Additional reduction is from the change in the yearly funding profile for the institutes."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Manufacturing Science and Technology Program"
                                    },
                                    "Description": {
                                        "val": "The OSD ManTech (P680) portfolio includes a focus on above-the-shop-floor new manufacturing processes and practices having the potential to improve manufacturing efficiencies at broader, enterprise levels. Single specific projects address investment opportunities and enable the program to more surgically apply investments to compelling and sometimes urgent manufacturing needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.512"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.328"
                                            },
                                            "Text": {
                                                "val": "• Mature ManTech tools, technology and talent capabilities and capacity into projects across Electronics, Composites, Energetics, and Manufacturing processes.  \n• Incorporate JDMTP, S&T, DARPA, IARPA, Service strategies, Manufacturing USA Institutes, and IPL inputs into evolving portfolio structure.\n• Develop best practices and relationships with industry, academia, and Service components.  \n• New Project Starts (NDS Alignment; USD R&E Alignment) – Magnesium Oxide Binder for Thermal Batteries (Joint Lethality, Hypersonics; Hypersonics, Space Offense and Defense, Missile Defense), Foamed Celluloid Materials (Joint Lethality), Light Weight Gradient Index Lenses (Joint Lethality), Circular Polarizers for Color Day Cameras (Joint Lethality), Monolithic Spectral Beam Combiners (Directed Energy; Directed Energy, Electronic Warfare, Space Offense and Defense), High Density Reactive Materials (Joint Lethality).\n• Continuing Projects (NDS Alignment; USD R&E Alignment) – Fabrication of Non-Eroding Metallic Throat (Hypersonics; Hypersonics, Missile Defense, Space Offense and Defense), MEMS Navigation Grade Inertial Sensors (Joint Lethality; Command, Control and Communications, Microelectonics), Oxide-Oxide (Hypersonics, Joint Lethality; Hypersonics), Stabilized Alpha Alane (Hypersonic, Joint Lethality; Hypersonics, Missile Defense), DBX-1 (Joint Lethality), MOC3HA (Hypersonics; Hypersonics, Missile Defense, Space Offense and Defense).\n•\tCompleting Projects – Advanced Technology Capability (Classified), Cold Spray Additive Manufacturing and Structural Repair (Joint Lethality), High Yield Infrared Focal Plane Arrays (Joint Lethality, Hypersonics; Hypersonics, Space Offense and Defense), Manufacturability of Vertical Cavity Surface Emitting Lasers (Joint Lethality; Command, Control and Communications), Nanocomposite Optical Ceramic Dome (Joint Lethality, Hypersonics; Hypersonics, Missile Defense), Novel Printed Countermeasures (Joint Lethality), HighTEC (Joint Lethality), Portable X-Ray Detectors for the Dismounted Soldier (Joint Lethality), pWave (Joint Lethality; Electronic Warfare, Command, Control and Communications), Critical Energetic Materials Working Group Formulations (Joint Lethality)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There was a realignment of funds to another project."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Each Manufacturing USA institute is established through a competitive selection process. The executing military department or agency, in close and continuous coordination with OSD ManTech, publishes a formal solicitation (funding opportunity announcement) for proposals describing the scope of required activities and extensive proposal evaluation criteria. Non-Profit Organizations (including universities) are eligible to bid, and each bidder forms a broad consortium of industry and academic partners. The executing military department or agency, in close coordination with OSD, uses a team of government experts to evaluate each proposal against the evaluation criteria and selects a winning consortium. The final terms of the cooperative agreement\/technology investment agreement between the selectee and the federal government are then negotiated and the CA or TIA is signed. Throughout and after completion of this process, the federal government makes clear that members of non-selected teams are encouraged to join the selected consortium as conditions permit."
                        },
                        "PerformanceMetrics": {
                            "val": "Assessing the performance of the DoD-led manufacturing institutes, part of the whole-of-government Manufacturing USA Program, requires a multi-faceted view of ‘performance,’ given the program’s layered base of DoD, government-wide, and national level public-private stakeholders and interests. Notwithstanding this complexity, the Department is careful to maintain orientation with the DoD ManTech program’s statutory goals and objectives and has concluded that those requirements are highly complementary to, and supportive of, the broader national goals of the Manufacturing USA Program as laid out in the Revitalize American Manufacturing and Innovation (RAMI) Act of 2014. Performance relative to both sets of goals\/objectives is necessarily measured in both qualitative and quantitative terms, and many of the institutes accomplishments previously addressed represent rich and highly descriptive qualitative and quantitative measure of program performance. The Department actively reviews or oversees the review of institute metrics at four levels: 1) the overall Manufacturing USA network level (this is done in coordination with the DoD’s Manufacturing USA interagency partners), 2) at the DoD\/funding agency level (per the statutory requirements of DoD ManTech Program), 3) at the individual institute level (in coordination with each institute), and 4) at the specific technology project level (via DoD technical expert involvement in the institutes). Broadly, the institutes themselves are charged by the DoD, the Administration and Congress with ensuring that key elements of their innovation ecosystems will be matured and made widely available by fostering collaborations between appropriate elements of that ecosystem. \n\nThe following four categories of metrics have emerged as common focus areas:\n1.  Impact on U.S. Innovation Ecosystem\n2.  Financial Leverage\/Sustainability\n3.  Education and Advanced Manufacturing Workforce Development\n4.  Technical Advancement\nSpecific metrics and the annual cycle for measuring progress against benchmarks are developed for each institute consortium and reflect that institute’s unique technology capability, expertise, and organizational structure. The Department strives to ensure that the assessment process captures and articulates the benefits to national security based upon technological advancements and the industrial base."
                        }
                    }
                }
            ]
        }
    }
}