{
    "id": "2020-DefenseAdvancedResearchProjectsAgency-PB-0400-MJBOOK-0-0-1fdb0f1c66d0ab6447cfd3048415933b63f540457bcabf86723831bdf6128b20-6",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-DARPA-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602715E"
        },
        "ProgramElementTitle": {
            "val": "MATERIALS AND BIOLOGICAL TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "18"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "191.880"
            },
            "CurrentYear": {
                "val": "208.898"
            },
            "BudgetYearOne": {
                "val": "223.976"
            },
            "BudgetYearOneBase": {
                "val": "223.976"
            },
            "BudgetYearTwo": {
                "val": "245.397"
            },
            "BudgetYearThree": {
                "val": "242.845"
            },
            "BudgetYearFour": {
                "val": "265.429"
            },
            "BudgetYearFive": {
                "val": "279.273"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Materials and Biological Technology Program Element is budgeted in the Applied Research Budget Activity because its objective is to develop materials and biological technologies that make possible a wide range of new military capabilities.\n\nThe major goal of the Materials Processing Technology project is to develop novel materials, fabrication and processing techniques, models, devices and components that will lower the cost, increase the performance, and\/or enable new missions for military platforms and systems. Included in this project are efforts across a wide range of technology areas including manufacturing, electronics, sensors, optics, and complex and autonomous systems.\n\nThe Biologically Based Materials and Devices project will leverage the growing and pervasive influence of the biological sciences for the development of new DoD capabilities.  Contained in this project are thrusts that apply biology's unique fabrication and manufacturing capabilities to produce and detect novel DoD relevant chemicals, materials at scale, and devices for overmatch.  Example projects include analyzing biological threats at the cellular and molecular level, mitigating the effect of threat agents on deployed warfighters, and developing remote, persistent sensor systems to detect terrestrial and maritime threats.  This project also includes efforts to develop novel technologies for maintaining human combat performance."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "224.440"
                },
                "CurrentYear": {
                    "val": "226.898"
                },
                "BudgetYearOne": {
                    "val": "224.572"
                },
                "BudgetYearOneBase": {
                    "val": "224.572"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "191.880"
                },
                "CurrentYear": {
                    "val": "208.898"
                },
                "BudgetYearOne": {
                    "val": "223.976"
                },
                "BudgetYearOneBase": {
                    "val": "223.976"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-32.560"
                },
                "CurrentYear": {
                    "val": "-18.000"
                },
                "BudgetYearOne": {
                    "val": "-0.596"
                },
                "BudgetYearOneBase": {
                    "val": "-0.596"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-22.544"
                    },
                    "CurrentYear": {
                        "val": "-18.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.667"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-9.349"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.596"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.596"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018:  Decrease reflects Congressional reduction, SBIR\/STTR transfer and reprogrammings.\nFY 2019:  Decrease reflects Congressional reduction.\nFY 2020:  Decrease reflects minor program repricing."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MBT-01"
                    },
                    "ProjectTitle": {
                        "val": "MATERIALS PROCESSING TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "85.376"
                        },
                        "CurrentYear": {
                            "val": "95.676"
                        },
                        "BudgetYearOne": {
                            "val": "108.803"
                        },
                        "BudgetYearOneBase": {
                            "val": "108.803"
                        },
                        "BudgetYearTwo": {
                            "val": "129.628"
                        },
                        "BudgetYearThree": {
                            "val": "130.738"
                        },
                        "BudgetYearFour": {
                            "val": "151.839"
                        },
                        "BudgetYearFive": {
                            "val": "161.839"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The major goal of the Materials Processing Technology project is to develop novel materials, fabrication and processing techniques, models, devices and components that will lower the cost, increase the performance, and\/or enable new missions for military platforms and systems.  Included in this project are efforts across a wide range of technology areas including manufacturing, electronics, sensors, optics, and complex and autonomous systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Materials Processing and Manufacturing"
                                    },
                                    "Description": {
                                        "val": "The Materials Processing and Manufacturing thrust is exploring new manufacturing and processing approaches that will dramatically lower the cost and decrease the time required to fabricate DoD parts and systems.  Constantly changing specifications for DoD platforms combined with recent manufacturing advances, such as 3D printing and manufacture on demand, drive a need for greater efficiency in development and design cycles as well as scalable and reconfigurable manufacturing processes that incorporate advanced materials with superior properties.  Research within the Materials Processing and Manufacturing thrust is focused on achieving the following capability objectives:  (1) scalable processes to assemble fully 3D devices that include nanometer- to micron-scale components; (2) processes that yield new materials, materials capabilities and parts that cannot be made through conventional processing approaches; (3) efficient, low volume manufacturing; (4) approaches that reduce manufacturing complexity through new material feedstock formats with reconfigurable processing techniques; and (5) material processing that enhances platform survivability in extreme environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.997"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated capability to fabricate metallic hardware using direct metal laser sintering (DMLS) displaying defect distribution similar to prediction of process simulation hardware.\n-  Demonstrated ability of process-microstructure-property models to define optimized probabilistic process window for electron beam additive manufacturing (EBAM) to ensure fabricated material meets minimum properties.\n-  Developed and demonstrated integrated hierarchical framework of empirical, process, and physics models that predicts cumulative density functions for component quantities of interest.\n-  Demonstrated aligned short fiber preforms capable of accommodating forming strains of greater than 30%\n-  Demonstrated 90% reduction in composite forming cycle times without degradation in part performance. \n-  Developed a high rate, integrated electrospinning assembly process to assemble nanoscale collagen fibers into highly aligned centimeter and larger patches for ligament and tendon repair.\n-  Investigated the applicability of printing technology for the assembly of micron and larger structured particles into heterogeneous systems with one-micron precision alignment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "27.678"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate pilot-scale production of tailorable, high-performance carbon fiber-based feedstock that meets or exceeds state-of-the-art aerospace materials capability.\n-  Demonstrate that a multifunctional element can be incorporated into the feedstock while maintaining performance.\n-  Demonstrate that a multifunctional component can be formed without degradation of performance in either the structural or the functional component. \n-  Investigate methods for the scale-up of nano- and micro-assembly techniques.\n-  Test and evaluate retention of nanoscale properties when assembly process is scaled-up.\n-  Initiate development of new models for improved understanding of physical, chemical and mechanical properties of high entropy materials.\n-  Identify new processing approaches for manufacturing high temperature materials in large and\/or complex shapes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "29.039"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "29.039"
                                            },
                                            "Text": {
                                                "val": "-  Explore approaches that leverage new computational and manufacturing tools to fabricate large complex structures for enhanced platform survivability in harsh environments.\n-  Leverage recent breakthroughs in metrology to characterize atomic- through meso-scale material behaviors.\n-  Develop model guided testing tools to validate the behavior of new materials under extreme environmental conditions.\n-  Investigate mechanical\/physical\/chemical properties of high entropy alloys for applications in extreme environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Functional Materials and Devices"
                                    },
                                    "Description": {
                                        "val": "The Functional Materials and Devices thrust is developing advanced materials, components and systems to improve device performance for DoD sensing, imaging and communication applications.  One focus of this thrust involves development of advanced transductional materials that convert one form of energy to another for DoD-relevant applications in areas such as thermoelectrics.  While promising transduction materials are known for a variety of applications, integration into devices has not been realized.  Another focus area is the development of physics based models that predict material behavior when illuminated by high peak power electromagnetic interference.  A third focus area involves development of new multi-functional materials and device designs that will radically decrease the size, weight and power requirements of neutron and gamma sources for high-resolution neutron, gamma and x-ray imaging.  Such devices should enable fieldable detection units for non-destructive evaluation of parts, detection of explosives and other DoD-relevant targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.228"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated integrated transductional materials and device multi-physics models.\n-  Performed final round of optimization of transductional materials and devices, and characterized their technical performance.\n-  Provided updates to transductional models and delivered them in modeling software codes.\n-  Integrated earlier developed materials\/devices into a system proof of concept.\n-  Refined final integrated compact neutron source prototypes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.215"
                                            },
                                            "Text": {
                                                "val": "-  Evaluate compositions, fabrication processes and applications of high-performance textured piezoelectric materials. \n-  Perform final integrated compact neutron source prototype testing.\n-  Explore innovative design concepts for intense, mobile, mono-energetic gamma sources.\n-  Identify component technologies with potential for enabling intense, mobile, mono-energetic gamma sources for elemental imaging and advanced diagnostics.\n-  Initiate development of advanced physics-based models for predicting material behaviors under high peak electromagnetic power."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.164"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.164"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate performance of compact gamma source component technologies.\n-  Initiate efforts to integrate component technologies into a compact, mono-energetic gamma source prototype.\n-  Validate experimentally the ability of physics-based models to predict material behaviors under high peak electromagnetic power.\n-  Initiate efforts to incorporate physics-based models in device design tools to improve operational robustness in the presence of noisy electromagnetic environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Reconfigurable Systems"
                                    },
                                    "Description": {
                                        "val": "In the Reconfigurable Systems thrust, new approaches are being developed to enable more rapid and robust adaptation of defense systems and systems-of-systems to changing mission requirements and unpredictable environments.  This includes development of capabilities across sensing, perception, planning and control for autonomous, high-speed operation in cluttered environments without Global Positioning System (GPS) information.  This also includes development of capabilities to manipulate and control adversary sensory perception and\/or situational awareness.  Additional work in this thrust focuses on how sensing systems and military systems-of-systems are designed for real-time resilient response to dynamic, unexpected signals and contingencies.  Research is developing a more unified view of system behavior that allows better understanding and exploitation of complex interactions among components, including development of formal mathematical approaches to complex adaptive system composition and design.  These capabilities will impact autonomous systems and systems-of-systems, including those that involve humans, in a variety of DoD-relevant contexts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.280"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated high speed (>10 m\/s) GPS-free flight in moderate urban and natural clutter.\n-  Demonstrated end-to-end mission capabilities including transition from outdoor to indoor flight.\n-  Coordinated technology transition with military and agency partners.\n-  Determined formal properties and constraints for compositional mathematical methods. \n-  Demonstrated utility of integrated mathematical and algorithmic capabilities to dynamically compose system-of-systems and capabilities to achieve improved resilience in representative limited scope scenarios spanning multiple application areas."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.791"
                                            },
                                            "Text": {
                                                "val": "-  Develop capability for self-diagnosis of current system performance from arbitrary set of sensors, behaviors, and constraints.\n-  Demonstrate closed-loop single functional recomposition from a set of sub-system components. \n-  Demonstrate redesign of system function to attrition and environmental change.\n-  Initiate efforts to determine conditions in which special effects can manipulate human and\/or machine sensory inputs to control perception."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.058"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.058"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate redesign of coordinated functions to achieve maximum resilience.\n-  Demonstrate dynamic adaptive response to achieve system re-design.\n-  Demonstrate system design for adaptive response to a co-evolving threat coupled to attrition and environment change.\n-  Investigate potential for altering human and\/or machine perception by leveraging new breakthroughs in projection technologies across the electromagnetic spectrum."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects expanded research in the development of capabilities to manipulate and control adversary sensory perception and situational awareness."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Accelerating Discovery and Innovation"
                                    },
                                    "Description": {
                                        "val": "The Accelerating Discovery and Innovation thrust is developing new approaches, tools and technologies to speed the pace of scientific discoveries and technological innovations from idea generation and fundamental research through integration of technologies into fieldable products and systems in production.  The path from idea generation to a discovery is a lengthy, complex process involving many unpredictable steps, cycles and stages across fundamental and applied research and development.  Research in this thrust is focused on developing and implementing strategies to address many of the challenges and bottlenecks inherent along this path and to speed the rate at which an idea can be advanced into a concrete capability.  Specific approaches include advanced multiplayer gaming technologies to catalyze development of new technology concepts, development of tools for data collection and visualization to accelerate fundamental and applied research, and strategies to understand how seemingly benign commercially available technologies may be converted or combined into threats to military operations, equipment or personnel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.437"
                                            },
                                            "Text": {
                                                "val": "-  Developed a unique online interaction platform that engaged a large technical community in scientific and technical evidence analysis and research idea generation.\n-  Developed structured online scientific discovery methods to support scientific discovery and engineering innovation in areas of agency focus.\n-  Designed and built four sets of interoperable kits for military applications from easily obtainable components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.630"
                                            },
                                            "Text": {
                                                "val": "-  Develop software tools to facilitate an analytic multi-disciplinary conversation to facilitate the collective understanding and potential implications of emerging science and technology.\n-  Develop software systems to aid in identifying emerging science and technology concepts and applications based on existing understanding.\n-  Design and build additional sets of interoperable kits for military applications from easily obtainable components.\n-  Design and build a highly capable reconnaissance-strike system that integrates the interoperable kits.\n-  Test the reconnaissance-strike system(s) with military partners.\n-  Investigate the understanding of what enables projected animations to be perceived as real."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.155"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.155"
                                            },
                                            "Text": {
                                                "val": "-  Create software tools to expedite the synthesis of multi-disciplinary conversations about emerging science and technology into evidence supported research proposals.\n-  Develop tools that allow for incorporation of the needs of research and development requirement generators with the capabilities of research and development performers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Scale Modeling"
                                    },
                                    "Description": {
                                        "val": "The Multi-Scale Modeling thrust, an outgrowth of the Reconfigurable Systems thrust, is developing advanced, multi-physics models that can predict the effect of disturbances and\/or perturbations in the space environment in order to inform operational decisions based on current space environment conditions.  Current space environment models are limited to predicting long term climatic averages or regularly occurring phenomena and do not fully account for coupling effects where perturbations in one region of the space environment may produce disturbances in another region.  Approaches for addressing these limitations under the Multi-Scale Modeling thrust include the following:  (1) development of observation driven\/first-principles theory of magnetosphere-ionosphere-thermosphere coupling; (2) creation of an extensible assimilation framework for unifying space environment monitoring systems and data; and (3) non-traditional space environment measurement approaches.  These developments will ensure the accuracy and spatiotemporal resolution of space weather models and is sufficient to enable prediction of operationally relevant perturbations and disturbances in the space environment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.362"
                                            },
                                            "Text": {
                                                "val": "-  Initiate efforts to explore advanced methods and tools, such as hybridized particle\/fluid methods, adaptive mesh computational techniques, and vector processing, to extend capabilities of state-of-the-art \"nowcast\" space weather predictions.\n-  Initiate efforts to develop fully coupled space environment model suite capable of assimilating high resolution 4D data (observed and synthetic).\n-  Initiate development of an extensible framework to unify traditional and non-traditional ionospheric measurements, both terrestrial and in-situ.\n-  Initiate development of multi-physics models that can predict ionospheric perturbations, such as plasma \"holes\" and acoustic shock waves, associated with various air and space platform trajectories."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.387"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.387"
                                            },
                                            "Text": {
                                                "val": "-   Identify promising approaches that dynamically utilize computational architectures (adaptive meshes, vector processing, cloud architecture) to drive down space weather prediction times to the nowcast (hourly) regime. \n-   Demonstrate in simulation the ability to predict and track space weather phenomena with scale lengths as small as one hundred kilometers.\n-   Demonstrate an extensible assimilation framework capable of processing data sources from at least two major space environment observations networks in less than fifteen minutes.\n-  Demonstrate in simulation the ability of multi-physics models to predict ionospheric perturbations, such as plasma \"holes\" and acoustic shock waves, associated with various air and space platform trajectories."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects expansion into demonstrations of the abilities to predict space weather phenomena and ionospheric perturbations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Chemical Processing for Force Protection"
                                    },
                                    "Description": {
                                        "val": "Research in this thrust is focused on the development of new chemical approaches and technologies across a broad spectrum of DoD needs.  One area involves development of innovative approaches for scalable small molecule synthesis coupled with predictive tools for route design, possibly offering a new strategy to discover how to make new molecules such as pharmaceuticals and explosives.  Another focus combines existing strategies for destruction of chemical agents with development of new processing methods to provide a remediation system that can process any chemical agent at the site of storage.  In addition, investments in this thrust will advance chemical characterization, information management and analysis, and automation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.434"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated chemical remediation\/conversion of DoD-relevant model compounds to 99.999%.\n-  Developed initial prototype that integrates inline monitoring with remediation\/conversion.\n-  Initiated design of a mobile chemical warfare agent destruction system to meet mission partner requirements.\n-  Demonstrated the automated route design and continuous flow synthesis of imatinib, a structurally complex active pharmaceutical ingredient (API).\n-  Integrated the automated route design with the continuous flow system to yield a fully automated synthesis of three DARPA-defined challenge molecules: warfarin, tranexamic acid, and 6- carboxytetramethylrhodamine."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate continuous flow synthesis of a molecule requiring a convergent approach (e.g., synthesis and subsequent combination of two intermediates).\n- Adapt continuous flow technology to low cost, portable chemical reactors for distributed manufacturing. \n-  Develop a computational map of synthetic capabilities for existing modules that outlines the potential suite of molecules that can be generated in the automated device.\n-  Demonstrate rapid search of reaction conditions (1,000s of reactions per hour) and initiate integration of these data into route design algorithms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects program completion."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MBT-02"
                    },
                    "ProjectTitle": {
                        "val": "BIOLOGICALLY BASED MATERIALS AND DEVICES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "106.504"
                        },
                        "CurrentYear": {
                            "val": "113.222"
                        },
                        "BudgetYearOne": {
                            "val": "115.173"
                        },
                        "BudgetYearOneBase": {
                            "val": "115.173"
                        },
                        "BudgetYearTwo": {
                            "val": "115.769"
                        },
                        "BudgetYearThree": {
                            "val": "112.107"
                        },
                        "BudgetYearFour": {
                            "val": "113.590"
                        },
                        "BudgetYearFive": {
                            "val": "117.434"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Biologically Based Materials and Devices project will leverage the growing and pervasive influence of the biological sciences for the development of new DoD capabilities.  Contained in this project are thrusts that apply biology's unique fabrication and manufacturing capabilities to produce and detect novel DoD relevant chemicals, materials at scale, and devices for overmatch.  Example projects include analyzing biological threats at the cellular and molecular level, mitigating the effect of threat agents on deployed warfighters, and developing remote, persistent sensor systems to detect terrestrial and maritime threats.  This project also includes efforts to develop novel technologies for maintaining human combat performance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enhancing Neuroplasticity"
                                    },
                                    "Description": {
                                        "val": "The DoD needs tools to rapidly and effectively train military personnel in multifaceted and complex tasks.  The Enhancing Neuroplasticity program is exploring and developing peripheral nerve stimulation methods and non-invasive devices to promote synaptic plasticity for improved learning paradigms.  Key advances anticipated from this research will both create an anatomical and functional map of the underlying biological circuitry that mediates plasticity and optimize stimulation and training protocols to enable long-term retention for military personnel.  Once successfully identified, the underlying mechanisms of targeted plasticity training can be applied to a broad range of cognitive skill training within the DoD, including foreign language learning, or data and intelligence analysis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.430"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated effects of training on neurons and neuronal network connectivity in task-specific areas of the brain.\n-  Evaluated mechanistic components of targeted neuroplasticity training on brain neurophysiology and learning rate.\n-  Investigated mechanisms for modulating neuroplasticity in humans with peripheral neurostimulation devices.\n-  Tested for off-target effects of peripheral neurostimulation and training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.222"
                                            },
                                            "Text": {
                                                "val": "-  Compare effects of various nerve stimulation targets on brain neurophysiology and learning rate in animal models.\n-  Assess the combined impacts of neuromodulator receptor optimization with peripheral nerve stimulation to improve cognitive, motor, or sensory task performance in animal models.\n-  Determine efficacy of various biomarkers to validate target nerve stimulation in animal models.\n-  Initiate human studies of non-invasive nerve stimulation on learning.\n-  Identify technologies capable of in vivo characterization of human microbiome systems at the scale of microbial interactions.\n-  Characterize how information is passed between microorganisms (microbial communicome) and how that information is passed through generations and their host locations, including gut, brain, and skin."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.543"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.543"
                                            },
                                            "Text": {
                                                "val": "-  Utilize biomarkers to guide effective engagement of nerve targets in human studies.\n-  Evaluate combined efficacy of pharmacological neuromodulation with peripheral nerve stimulation for learning in human trials.\n-  Assess the longevity of effects of targeted peripheral nerve stimulation on cognitive, motor, or sensory task performance. \n-  Demonstrate statistically valid improvement in performance and\/or decrease in the time to achieve proficiency after pairing peripheral nerve stimulation with training."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Genome Protection Technologies"
                                    },
                                    "Description": {
                                        "val": "The Genome Protection Technologies program is developing advances in critical efforts to generate a biodefense capability to control, counter, and reverse the effects of accidental or malicious misuse of gene editing technologies.  This research will investigate new approaches for developing tunable controls to enable the safe and predictable use of synthetic genes and pathways.  Additional work will develop protecting measures to prevent or limit unintended genome editing or engineering and develop new tools to recall or reverse engineered changes.  Advances within this program will ensure that the U.S. remains at the vanguard of this now widespread, rapidly advancing field that poses potential national security threats due to the large-scale democratization of gene editing technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.844"
                                            },
                                            "Text": {
                                                "val": "-  Investigated novel small molecule and genetic countermeasures to prevent gene editing in cells.\n-  Designed and created engineered, reversible genetic elements for evaluation in a laboratory testbed.\n-  Characterized the efficacy, stability, and fitness of engineered genetic constructs and countermeasures in a contained laboratory testbed.\n-  Refined computational models to inform the design and function of engineered genetic controls and countermeasures and predict experimental outcomes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.357"
                                            },
                                            "Text": {
                                                "val": "-  Conduct laboratory animal model testing for safety and efficacy of small molecule and genetic countermeasures.\n-  Use computational models to evaluate efficacy, stability, and fitness of gene editing controllers and countermeasures.\n-  Demonstrate efficacy, stability, and fitness of gene editing controllers and countermeasures in laboratory animal models.\n-  Characterize failure modes of gene editor controllers and countermeasures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.150"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.150"
                                            },
                                            "Text": {
                                                "val": "-  Conduct advanced in vivo testing of genome editors to include characterization of off-target effects, failure modes, target editing efficiency, and stability. \n-  Design safety measures and characterize toxicity and immunogenicity of genome editors.\n-  Determine safety and efficacy and characterize off-target effects of genome editor countermeasure candidates in vivo.\n-  Incorporate empirical data such as gene flow, fitness, generational stability, and failure modes into advanced computational models.\n-  Demonstrate the ability to revert or eliminate target genes in organisms in laboratory environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defend Against Crop System Attack"
                                    },
                                    "Description": {
                                        "val": "The Defend Against Crop System Attack program is developing a platform technology aimed at increasing the speed of DoD response to state or non-state actor release of biological threats directed at our crop systems. Conventional methods to defend against these threats are generally slow and ineffective.  This program will leverage recent advances in molecular and synthetic biology to enable rapid delivery of gene therapies to plants for large-scale trait modification, improving resilience against adversary attack or emerging natural threats.  Research within this program will develop an agnostic, scalable capability for protecting entire crop systems from emerging threats posed to food security by U.S. adversaries."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.700"
                                            },
                                            "Text": {
                                                "val": "-  Developed a flexible plant transformation platform to genetically protect plants.\n-  Demonstrated deployment of gene therapies in contained greenhouse settings using environmental vectors.\n-  Integrated technologies developed for controlled deployment of genetic materials with the late-stage plant gene protection methods.\n-  Demonstrated the alteration of plant protein production in a contained laboratory testbed."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.018"
                                            },
                                            "Text": {
                                                "val": "-  Scale deployment of flexible plant transformation platforms in a controlled greenhouse setting.\n-  Initiate integration of novel and existing failsafe capabilities for the trait delivery platform.\n-  Investigate new approaches to increase the efficacy of genetic transmission.\n-  Demonstrate predictable and repeatable transmission of genetic materials to plants."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.718"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.718"
                                            },
                                            "Text": {
                                                "val": "-  Ensure two week-long stable viral transformation resulting in gene-based protection in plant target.\n-  Determine adequate virus concentration to achieve adult plant transformation.\n-  Perform risk mitigation of potential delivery challenges within complex laboratory environments.\n-  Integrate virus delivery approach to achieve adult plant transformation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Persistent Terrestrial Living Sensors"
                                    },
                                    "Description": {
                                        "val": "The Persistent Terrestrial Living Sensors program is developing engineered biological sensor platforms capable of detecting land-based threats (e.g., chemicals, radiation, explosives) and relaying unique signals to existing DoD ground, air, and space assets.  Unlike conventional methods that passively monitor threats and are limited by sensor energy needs, these biological sensors are effectively energy independent, increasing the potential for wide distribution and environmental robustness.  Resulting platforms developed within this program will enable a variety of remote, persistent monitoring and reporting capabilities to address threat scenarios relevant for national security, including detecting improvised explosive devices (IEDs) and protecting infrastructure.  These sensors will provide a flexible suite to complement conventional sensor systems within the DoD."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Investigated novel approaches and genetic machinery designs for developing biology-based sensor systems.\n-  Identified plant resource allocation strategies to accommodate plant sensing and reporting operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.582"
                                            },
                                            "Text": {
                                                "val": "-  Develop a quantitative model to guide plant-based sensor resilience and environment flexibility.\n-  Demonstrate the feasibility of combining high-specificity detection traits with physiological response traits by first exploring plant cell expression and quantitative modeling, and then by altering the physiology of plants.\n-  Begin production of plants with individual sense and report traits.\n-  Investigate methods to use soil-based microorganisms to sense subterranean events and propagate signals to the soil surface."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.174"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.174"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate genetic modification of plant-expressed sensory proteins associated with DoD-relevant compounds.\n-  Demonstrate genetic modification of plant-expressed reporting signals at detectable levels.\n-  Identify internal plant resource issues that will have to be addressed to develop a real-world detection platform.\n-  Identify external biotic and abiotic challenges that need to be addressed to avoid practical use of plants as sensors.\n-  Test methods for stand-off detection of signals produced by microorganisms in response to subterranean sensing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Preemptive Expression of Protective Alleles (PREPARE)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Transient CBRN Threat Defense\n\nThe Preemptive Expression of Protective Alleles (PREPARE) program is creating a transient, near immediate prophylaxis to protect military personnel and civilians against public health and national security threats.  Currently, protection against chemical, biological, and radiological threats relies on physical barrier technology.  This program will include research to develop novel transient and reversible gene modulator therapies to bolster intrinsic host defenses.  Work within this project will provide novel solutions that extend beyond the DoD's limited protective capabilities to respond to re-emerging, newly emerging, or engineered threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.510"
                                            },
                                            "Text": {
                                                "val": "-  Generated foundational knowledge concerning cellular stress resistance against a broad range of public health and national security threats.\n-  Initiated investigation of novel delivery toolsets to facilitate threat resistance in vivo.\n-  Explored scalable and adaptable gene modulator platforms for public health and national security threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.712"
                                            },
                                            "Text": {
                                                "val": "-  Begin development of bioinformatics tools and validation methods that will improve the design and specificity of transient gene therapy strategies.\n-  Demonstrate genetic basis for cellular stress resistance in vitro.\n-  Characterize effective delivery tools for gene modulators that enable stress resistance.\n-  Characterize specificity of transient gene therapy in animal models.\n-  Demonstrate effectiveness of stress resistance constructs to specific threats.\n-  Initiate development of platform capabilities for scalable and adaptable threat response platform."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.097"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.097"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate multiplexed targeting of multiple cellular resistance genes to confer resistance to multiple threats.\n-  Demonstrate and optimize specificity and duration of modulation of gene modulators in animal models.\n-  Optimize delivery tool specificity for gene modulators.\n-  Demonstrate target-agnostic platform that can address multiple threats using a common set of gene modulation and delivery components.\n-  Investigate timing of optimal countermeasure administration to maximize therapeutic and prophylactic performance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Persistent Aquatic Living Sensors"
                                    },
                                    "Description": {
                                        "val": "The Persistent Aquatic Living Sensors program will develop novel capabilities to sense and surveil submersibles (e.g., submarines, unmanned underwater vehicles) and divers in littoral waters using living organisms present in the environment.  This effort will focus on characterizing marine biological behavior in response to targets of interest and developing the hardware, software, and algorithms that will translate organism behavior into DoD actionable information.  By harnessing the unique capabilities of biology, including adaptation, response, and replication, work in this program will enable persistent dominance in contested waters.  Results from this research will enhance security for maritime activities and provide DoD naval operations with new sensing paradigms to complement current sensor technologies used in traditionally challenging regions across the world."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.799"
                                            },
                                            "Text": {
                                                "val": "-  Investigate organism response to targets of interest in a laboratory environment using benchtop instrumentation.\n-  Initiate research to convert organism response into robust sensing system by developing algorithms to classify organism response in relation to targets.\n-  Research new reporting schemes to communicate signal detection and actionable information to existing DoD systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.066"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.066"
                                            },
                                            "Text": {
                                                "val": "-  Characterize biological responses to targets and confounders at greater distances and in more realistic environments.\n-  Investigate approaches to evoke biological responses in marine organisms.\n-  Harden engineered components for persistent deployments, and perform validation testing on system endurance.\n-  Develop fully integrated seaworthy prototype combining biology and engineered components.\n-  Demonstrate system ability to detect and classify targets and confounders in ecosystem-style aquaria or open waters, analyze results, and produce alerts via satellite link."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects ongoing research and development efforts, construction of seaworthy prototype, and prototype demonstration, as well as new efforts initiated to evoke biological responses in marine organisms."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Expanding Human Resiliency"
                                    },
                                    "Description": {
                                        "val": "The Expanding Human Resiliency program aims to maximize warfighter performance and resiliency by leveraging the signals of the human microbiome to improve physiology. This program will develop new technologies to control and manipulate the microbiome to enable peak human performance. Current state-of-the-art approaches are focused on metagenomics to inventory and categorize the microbes in a given sample. In order to have more precise and on-demand control of the human microbiome, technologies will be developed to elucidate the complex interactions between the microorganisms and their human host as well as the interactions between consortia of adapted and evolved microorganisms. Additional work will be performed to facilitate human functions (e.g., immunity to disease, metabolic performance, tolerance to chemical exposure, etc.) and behaviors (e.g., mood, decision making, ability to work as a cohesive team, etc.) using specific microbial consortia living in the gastrointestinal tract, respiratory tract, skin or mouth. Advances in this area will both develop novel technologies to interrogate complex microbial communities in human systems and discover ways to beneficially harness microbiomes to expand warfighter resiliency and performance."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.425"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.425"
                                            },
                                            "Text": {
                                                "val": "-  Investigate ways to improve methods for interpretation and prediction of microbial interactions and their ability to regulate host function.\n-  Initiate testing of methods to alter chemical production by microbiomes.\n-  Begin longitudinal studies to track host function and behavior with changes in the microbiome.\n-  Begin development of initial microbiome modulation approaches and assess host functional response."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Living Foundries"
                                    },
                                    "Description": {
                                        "val": "The goal of the Living Foundries program is to create a revolutionary, biologically-based manufacturing platform for the DoD and the Nation.  With its ability to perform complex chemistries, be flexibly programmed through DNA code, scale, adapt to changing environments, and self-repair, biology represents one of the most powerful manufacturing platforms known.  Living Foundries seeks to develop the foundational technological infrastructure to transform biology into an engineering practice, speeding the biological design-build-test-learn cycle and expanding the complexity of systems that can be engineered.  Ultimately, Living Foundries aims to provide game-changing manufacturing paradigms for the DoD, enabling adaptable, on-demand production of critical and high-value molecules.\n\nResearch thrusts focus on the development and demonstration of open technology platforms to prove out capabilities for rapid (months vs. years) design and construction of new bio-production systems.  The result will be an integrated, modular infrastructure across the areas of design, fabrication, debugging, analysis, optimization, and validation -- spanning the entire development life-cycle and enabling the ability to rapidly assess and improve designs.  Success is predicated on tight coupling of computational design, fabrication of systems, debugging using multiple characterization data types, analysis, and further development such that iterative design and experimentation will be accurate, efficient and controlled.  Demonstration platforms will be challenged to build a variety of DoD-relevant, novel molecules with complex functionalities, such as synthesis of advanced, functional chemicals, materials precursors, and polymers (those tolerant of harsh environments).  This program has basic research efforts funded in PE 0601101E, Project TRS-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.020"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated infrastructure pipelines capable of rapidly prototyping and generating DoD-relevant molecules in a semi-automated manner and initiate efforts to achieve full automation.\n-  Demonstrated the ability to produce an additional set of ten molecules that are relevant to the DoD.\n-  Demonstrated that the infrastructure pipeline is capable of rapidly prototyping strains that produce molecules.\n-  Characterized impact of machine learning capabilities on design algorithms and identify increases in prototyping process efficiency."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.298"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate a fully automated infrastructure pipeline capable of prototyping and generating DoD-relevant molecules.\n-  Demonstrate ability to scale production of molecules from multi-gram to kilogram scale using biology.\n-  Investigate methods to generate molecules that have not been previously synthesized using traditional chemistry."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Immunomodulation-Based Therapeutics"
                                    },
                                    "Description": {
                                        "val": "The Adaptive Immunomodulation-Based Therapeutics program is developing platform technologies to interrogate and define the biological pathways that will enhance operational readiness for DoD personnel.  This program will aid the warfighter by improving immune response, minimizing inflammation, and restoring critical organ function post trauma.  One approach to achieve this capability will require the development of new tools to stimulate and measure responses of the nervous system in order to harness the bioelectric code, enabling targeted therapy without the need for pharmacological products, ultimately reducing logistical requirements.  An additional approach involves characterizing the host response in patients with severe infections, which provides a quantitative framework to guide therapy.  Algorithms will be developed to evaluate and predict various physiological conditions for military personnel.  Advances made under the Adaptive Immunomodulation-Based Therapeutics program will improve the response capabilities against severe biological threats and offer new avenues for treating disease or organ function to improve force readiness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.212"
                                            },
                                            "Text": {
                                                "val": "-  Refined anatomical maps and computational models of function for target neurophysiological circuits.\n-  Quantified on-target responses to neurostimulation to validate computational models of feedback signals and therapeutic benefit.\n-  Demonstrated the components comprising an integrated, closed-loop neuromodulation system to control health status in human or large animal studies.\n-  Conducted in vivo safety and efficacy studies to evaluate long-term bio-interface functionality in preparation for human studies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.234"
                                            },
                                            "Text": {
                                                "val": "-  Quantify on-target responses to neurostimulation to validate feedback biomarkers, evaluate therapeutic benefit, and demonstrate circuit specificity.\n-  Implement computational models of integrated neuromodulation and biomarker signaling for feedback control of health status.\n-  Demonstrate sustained functionality of novel bio-interfaces for neuromodulatory control of health status in animal models.\n-  Initiate clinical studies of feedback-controlled  neuromodulation system to treat inflammation, pain, and the effects of Post-traumatic stress disorder (PTSD)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "BioDesign"
                                    },
                                    "Description": {
                                        "val": "BioDesign employed system engineering methods in combination with advances in biological and chemical technologies to create novel methods for threat response.  This thrust developed new high-throughput technologies for monitoring the function of cellular machinery at the molecular level and the response(s) of that machinery to physical, chemical, or biological threats.  While conventional approaches typically require decades of research, new high-throughput approaches permit rapid assessment of the impact of known or unknown threats on identified biomolecules and cell function.  Successful research in this thrust both reduced the time required to understand the mechanism of action for new pharmaceutical compounds and enhanced response capabilities for emerging and engineered threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.747"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated the ability to localize relevant molecules and events to all intracellular compartment(s) (e.g., membrane, nucleus, or cytoplasm) upon the application of a challenge compound.\n-  Demonstrated the ability to identify intracellular components and events that occur within milliseconds after the application of a challenge compound.\n-  Reconstructed and confirmed greater than 95 percent of the molecules and mechanistic events that comprise the canonical mechanism of action for a demonstration compound which has been applied to cells.\n-  Demonstrated the ability to detect proteins at low concentrations after exposure to a challenge compound."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biological Robustness in Complex Settings (BRICS)"
                                    },
                                    "Description": {
                                        "val": "The Biological Robustness in Complex Settings (BRICS) program developed innovative approaches to engineer forensic microbial systems, creating unique microbial signatures for environmental forensic operations and modulation of host function.  Integrating the fundamental component technologies developed under PE 0601101E, TRS-01, this program focused on engineering microbial communities, detection signatures, and mechanisms of robustness.  This deeper knowledge helped assemble the constructs needed for new microbial systems that could be used for DoD relevant applications including forensics and warfighter health and performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.041"
                                            },
                                            "Text": {
                                                "val": "-  Integrated promising component technologies to engineer forensic microbial communities.\n-  Tested the robustness, stability, and safety of newly engineered microbial communities in environments of interest.\n-  Evaluated the utility of forensic microbial communities to determine whether objects have traversed an area of interest."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}