{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-2da06648be01af3e3586c70d627e29e7f571c412db103c0685f2e8b518a81021-5",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602251D8Z"
        },
        "ProgramElementTitle": {
            "val": "Applied Research for the Advancement of S&T Priorities"
        },
        "R1LineNumber": {
            "val": "12"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "47.550"
            },
            "CurrentYear": {
                "val": "60.550"
            },
            "BudgetYearOne": {
                "val": "62.200"
            },
            "BudgetYearOneBase": {
                "val": "62.200"
            },
            "BudgetYearTwo": {
                "val": "60.240"
            },
            "BudgetYearThree": {
                "val": "56.948"
            },
            "BudgetYearFour": {
                "val": "56.887"
            },
            "BudgetYearFive": {
                "val": "57.361"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Applied Research for the Advancement of Science and Technology (S&T) Priorities (ARAP) program element (PE) enables the early launch of S&T applied research projects to shape Components' investments.  The PE focuses on the design, development, and improvement of prototypes and new processes to achieve general mission requirements and to translate promising research into solutions for military needs.  In addition, the PE enables concept exploration efforts and studies of alternative concepts.  The research projects are aligned with the Department of Defense (DoD) S&T priorities and designated focus areas that include non-system specific technology efforts and feasibility assessments and are formulated and managed by teams of subject matter experts drawn from the Office of the Secretary of Defense, the Military Services, and the Defense Agencies.  The PE also provides support to the S&T Communities of Interest (CoIs)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "49.226"
                },
                "CurrentYear": {
                    "val": "60.688"
                },
                "BudgetYearOne": {
                    "val": "53.356"
                },
                "BudgetYearOneBase": {
                    "val": "53.356"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "47.550"
                },
                "CurrentYear": {
                    "val": "60.550"
                },
                "BudgetYearOne": {
                    "val": "62.200"
                },
                "BudgetYearOneBase": {
                    "val": "62.200"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.676"
                },
                "CurrentYear": {
                    "val": "-0.138"
                },
                "BudgetYearOne": {
                    "val": "8.844"
                },
                "BudgetYearOneBase": {
                    "val": "8.844"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.581"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.095"
                                },
                                "CurrentYear": {
                                    "val": "-0.138"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Internal Realignment for Higher Priorities"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "8.995"
                                },
                                "BudgetYearOneBase": {
                                    "val": "8.995"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.151"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.151"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2020 internal program realignment will allow the Applied Research for the Advancement of S&T Priorities (ARAP) program to complete the third and final year of the Defense Optical Channel Program (DOC-P); continue the second year of the Enhanced Energetics Effects (EEE) program; and sustain a third ARAP program to be initiated and selected in FY 2019.\n\nProgram adjustments are consistent with higher priority DoD requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "227"
                    },
                    "ProjectTitle": {
                        "val": "Applied Research for the Advancement of S&T Priorities"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "47.550"
                        },
                        "CurrentYear": {
                            "val": "60.550"
                        },
                        "BudgetYearOne": {
                            "val": "62.200"
                        },
                        "BudgetYearOneBase": {
                            "val": "62.200"
                        },
                        "BudgetYearTwo": {
                            "val": "60.240"
                        },
                        "BudgetYearThree": {
                            "val": "56.948"
                        },
                        "BudgetYearFour": {
                            "val": "56.887"
                        },
                        "BudgetYearFive": {
                            "val": "57.361"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Applied Research for the Advancement of Science and Technology (S&T) Priorities program was established to implement Department-wide technology development portfolios and foster Tri-Service research areas of common interest within cross-cutting S&T efforts.  The program has three investment areas:  (1) large, three-year applied research programs selected by the S&T Executives; (2) smaller, two-year technology ‘seedling’ programs nominated by the Communities of Interest (CoIs) to address technology gaps or opportunities; and (3) technical support to the CoIs.  The execution of the program by the Office of the Secretary of Defense and the support it provides to the CoIs assures strategic oversight and multi-agency coordination."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Applied Research for the Advancement of S&T Priorities"
                                    },
                                    "Description": {
                                        "val": "The program focuses on fostering tri-service research areas of common interest within cross-cutting S&T efforts that give the joint warfighter a technological advantage.  It is intended to focus on emerging areas of science, to build experience within Department of Defense laboratories, to include investment in laboratory infrastructure and people, and will be a foundation for further investments by the Services following the completion of the projects.\n\nCross-cutting efforts align with the S&T Priorities, such as Electronic Warfare, Human Systems, Autonomy, and Cyber, as well other focus areas, such as Advanced Materials, Biomedical, Weapons, Quantum, and Command, Control, Communications, Computers and Intelligence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "40.169"
                                            },
                                            "Text": {
                                                "val": "Continue concept exploration efforts that focus on the S&T priority areas.  The challenge areas within the priorities include:\n\nQuantum Science and Engineering Program (QSEP) ($15.000 million):  Will complete three-year research project;\n− Enhance the performance of silicon carbide quantum memories through the use of isotopically pure elements in the crystal growth process;\n‎‎− Demonstrate spin-photon entanglement using silicon carbide crystals as the photon source;\n− Improve quantum dot material properties to enhance the indistinguishably of photons‎, which is an important property of photons that enables the design and fabrication of more advanced quantum repeaters and quantum communication experiments;\n− Conduct single and dual stage frequency conversion with single photons to improve the transport of photons through telecommunications fiber and allows coupling of disparate quantum systems;\n− Demonstrate a quantum repeater with four quantum memory system;\n− Analyze ion-photon interface to enable long-distance quantum communication and demonstrate remote entanglement in a trapped in experiment.\n\nSynthetic Biology for Military Environments (SBME) ($15.000 million):\n− Continue efforts to establish a biological open system architecture and chassis relevant to military environments and to create a cell-free system for gene network optimization; \n− Develop transcriptomic, proteomic and metabolomic tools.  The tools will be applied to identify chassis network architectures, measure compensatory changes, and determine circuit yields;\n− Design complex circuits and initiate the synthesis, incorporation, and testing of the circuit;\n− Initiate the validation and optimization of the circuits in both cell-based and cell-free platforms;\n− Explore ruggedization of the cell-free platform to improve stability for storage and field use;\n− Continue iterations of in silico predictions, test bed optimization and in vivo validation; these testing scenarios will be used to establish calibration transfer between systems;\n− Complete baseline measurements of the simple circuits in chassis organisms and extend the circuit designs to produce modulating output.\n\nDefense Optical Channel Program (DOC-P) ($11.000 million):\n− Evaluate bandwidth and power efficient waveforms for laser communications;  \n− Begin development of lab tools that emulate measured channel data (effects of scintillation\/weather) with high fidelity;  \n− Begin development of chip scale circuit prototype for optical frequency comb and investigate optical clock designs for small size, weight and power implementation;  \n− Integrate atmospheric propagation physics and optical beam control principles with quantum information theory to define capabilities, limitations, and technology requirements for Quantum Key Distribution (QKD) protocols;\n− Assess commercial-off-the-shelf based testbed with adaptive spatial filtering for daylight QKD demonstration; \n− Develop technical requirements for Quantum receiver\/transmitter testbed.\n\nSelect and initiate FY 2018 Applied Research for the Advancement of S&T Priority Project ($1.000 million)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "45.003"
                                            },
                                            "Text": {
                                                "val": "Continue concept exploration efforts that focus on the S&T priority areas.  The challenge areas within the priorities include:\n\nSynthetic Biology for Military Environments (SBME) ($15.003 million):  Will complete three-year research project.\n− Optimize chassis organisms with respect to production of synthesis products and fitness for targeted environments.\n− Refine tools within the open system architecture.\n− Increase characterization throughput of engineered circuits in both chassis organisms and cell free platforms.\n− Develop specialized characterization approaches.\n− Test additional circuits using the cell-free platform.\n− Refine transcriptomic, proteomic and metabolomic tools.\n− Select a strategy for ruggedization of the cell-free platform to improve stability for storage and field use.\n− Document completed circuits.\n− Document the findings.\n\nDefense Optical Channel Program (DOC-P) ($15.000 million):\n− Develop and assess adaptive laser communications protocols for tolerance to dynamic and intermittent contacts.\n− Begin Space-Ground laser communication scintillation characterization.\n− Laboratory demonstration of microwave photonics modulation of lasercom payload.\n− Integrate atmospheric propagation physics and optical beam control principles with quantum information theory to define capabilities, limitations, and technology requirements for Quantum Entanglement Distribution.\n− Integrate classical\/quantum channels and prototype atomic-line spectral filter.\n− Begin engineering and outfitting of Startfire Optical Range optical comm facility for Quantum Key Distribution demonstration.\n\nEnhanced Energetics Effects (EEE) ($14.000 million):\n− Purchase and prepare database and start defining discriminators for machine-learning of energetic material synthesis routes and propellant burn rate prediction.\n− Setup instrumentation and start preliminary experiments on plasma synthesis of aluminum nanoclusters encapsulated in fullerenes and aluminum-carbon core\/shell structures.\n− Scale up nano-CL20 and amorphous-CL20 production to multiple lbs scale, then begin aluminized CL20 explosive and propellant formulations with these.\n− Assess concepts for additively manufacturing the XM1113 missile's energetics and case to define architectures, and start feedstock development and print head development.\n− Three laboratories with continuous flow processing equipment to run a Bourne Reaction (a typical test reaction) to obtain baseline materials and performance metrics.\n− Synthesis of ingredients and preparation of formulations of both minimum-smoke and reduced smoke rocket propellants, and burn rate characterization tests.\n\nSelect and initiate FY 2019 Applied Research for the Advancement of S&T Priorities project ($1.000 million)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "51.883"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "51.883"
                                            },
                                            "Text": {
                                                "val": "Defense Optical Channel Program (DOC-P) ($19.048 million):\n− Finalize DoD relevant applications for both digital and microwave Free Space Optical.\n− Build Free Space Optical brass board terminals for both digital and microwave forms.\n− Perform outdoor range testing on new free space optical terminals.\n− Validate Modulated laser format for Optical Time Transfer at 2.3 km outdoor range.\n− Demonstrate pulsed based Optical Time Transfer.\n− Demonstrate Multi-use and Multi-access Optical Time Transfer and communication links with frequency combs.\n− Validate propagation losses through free-space Quantum-communication experiments and characterize channel through quantum information metrics.\n\nEnhanced Energetics Effects (EEE) ($17.835 million):\n− Machine-learning model development, for energetic material synthesis, and for propellant burn rate predictions.\n− In-depth characterization and reaction mechanisms studies of aluminum nanoclusters encapsulated in fullerenes and aluminum-carbon core\/shell structures, and lab-scale detonation velocity measurements of these materials.\n− Characterization and testing of aluminized nano-CL20 and amorphous-CL20 explosive and propellant formulations to measure burn rates and detonation velocities.\n− Begin additive manufacturing production of chosen concept, and post-production characterization to include initiator\/ignitor, propelling charge, rocket assist grain\/motor, and warhead.\n− Three labs with continuous flow processing equipment will perform a comparative DNAN (2,4-Dinitroanisole) synthesis study, and then start scale-up studies.\n− A few minimum-smoke and reduced smoke rocket propellant formulation will be chosen for scale up and small-motor testing.\n\nContinue FY 2019 Applied Research for the Advancement of S&T Priorities project ($14.000 million).\n\nSelect and initiate FY 2020 Applied Research for the Advancement of S&T Priorities project ($1.000 million).\n\nSelect and initiate FY 2020 Applied Research for the Advancement of S&T Priorities project ($1.000 million)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2019 to FY 2020 will allow the program to execute three Applied Research for the Advancement of S&T Priorities projects."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "S&T Communities of Interest (CoIs)"
                                    },
                                    "Description": {
                                        "val": "The S&T CoIs effort facilitates cooperation and collaboration among Components; it optimizes the development of critical S&T efforts across the DoD enterprise.  The efforts include the development of technology roadmaps and the integration of technology planning.  The CoIs select and examine critical technology areas to address gaps or opportunities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.381"
                                            },
                                            "Text": {
                                                "val": "Continue to provide technical support to CoIs.\n\nConclude Seedling projects initiated in FY 2017, and select a new set of Seedling projects to address gaps identified by the CoIs. Concluding Seedling Projects are:\n\nPreparing for Enhanced Energetic Materials: An affordable CL-20: The singular solution to range and energy challenges is to make both propellant formulations (for range) and explosive formulations (for energy) using the most powerful, mature energetic crystal, CL-20. Current use of CL-20 is extremely limited because of its cost of large-scale manufacture ($1,000\/lb). The proposed work intends to achieve new, cheaper, high-yield, production routes to CL-20.\n- Research CL-20 production with fewer organic synthesis reactions, thereby reducing production costs; these reactions will employ commercially available metal catalysts, instead of the current expensive Palladium catalyst required.\n- Pursue the CL-20 precursor known as TetraAcetylDiAminohexaazaisowurtzitane (TADA), utilizing commercial off-the-shelf (COTS) starting materials.\n- Work on small-scale mixing of CL-20 propellant formulations to achieve reasonable viscosity, pot life, mechanical and safety properties.\n\nDevelopment of Prototype Soft Epidermal Biosystems with Advanced Sensing Capabilities for Warfighters in Triage Settings: To develop a wireless epidermal system that integrates flexible electronics and a range of biosensors to provide rapid vital sign screening solution for battlefield triage of combat casualties. \n- Development of stretchable circuit and biosensor designs.\n- Integration of soft elastomeric substrates and fluidic channel.\n- Validation of porcine animal model and test conditions for future evaluation of novel epidermal biosystems.\n- Evaluation of epidermal biosystems in porcine animal models and clinical settings."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.547"
                                            },
                                            "Text": {
                                                "val": "Continue to provide technical support to the CoIs ($5.131 million).\n\nComplete FY 2018 Seedling project: Optical Multichannel Beamforming for Electronic Warfare ($0.750 million).\n\nSelect a new set of Seedling projects to address gaps identified by the CoIs ($1.500 million)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.317"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.317"
                                            },
                                            "Text": {
                                                "val": "Continue to provide technical support to the CoIs ($6.200 million).\n\nContinue FY 2019 Seedling projects ($1.500 million).\n\nSelect a new set of Seedling projects to address gaps identified by the CoIs ($2.617 million)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2019 to FY 2020 will support a new Seedling project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Additive Manufacturing (AM) of Energetics"
                                    },
                                    "Description": {
                                        "val": "Additive manufacturing (AM) of energetics provides the ability for tailored and integrated munitions with enhanced capabilities.  Integration of unique printed structures and printed energetics with smart fusing can allow for more agile manufacturing processes with reduced development times.  As a cross-service area of interest, the Department of Defense Communities of Interest in Materials and Manufacturing Processes and Weapons Technologies have engaged in discussions to identify areas of collaboration.  In order to rapidly advance additive manufacturing of energetics, a joint effort across the services and the Department of Energy would support the programs interested in AM of energetics, such as Program Executive Office for Ammunition, Next Generation Hand-Grenade, Harpoon, and Lightweight torpedo."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "Explore preliminary concepts of low volume direct write energetics within smart fusing in tailored AM structures.  In addition, systemically explore the relationship between low volume direct write energetics and tailored AM metallic structures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This is a single-year investment effort for FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Project performance metrics specific to each effort are identified in the project plans established by the program leads and the Communities of Interest (CoI).  Individual project success will be monitored through these metrics."
                        }
                    }
                }
            ]
        }
    }
}