{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-855515f7cbe1443b1cc76e32ff869263061a887974718017fcc8f688288c6578-89",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0307588D8Z"
        },
        "ProgramElementTitle": {
            "val": "Algorithmic Warfare Cross Functional Team (AWCFT)"
        },
        "R1LineNumber": {
            "val": "193"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "221.235"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "221.235"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Algorithmic Warfare Cross Functional Team (AWCFT) funds Project Maven, a rapid fielding Artificial Intelligence (AI) program to augment and automate Processing, Exploitation and Dissemination (PED) for Full Motion Video (FMV) Tactical Unmanned Aerial Vehicles (TUAVs), Medium Altitude, High Altitude, and Wide Area Motion Imagery (WAMI) Intelligence, Surveillance and Reconnaissance (ISR) platforms in support of defeat-ISIS and National Defense Strategy (NDS) peer\/near peer competitor strategy. Maven also brings AI to Captured Enemy Material (CEM), Acoustical Intelligence (ACINT), Overhead Persistent Infrared program (OPIR) and Public Available Information (PAI) exploitation. Maven uses AI, deep learning, and computer vision algorithms to detect, classify, and track objects within FMV images (e.g., person, vehicle, and weapon) and other AI algorithms for CEM and text based projects. Maven algorithms increase the intelligence value of ISR, reduce the human burden of screening so analysts can multi-task increasing productivity, and seeds the generation of insight from Geospatial Intelligence (GEOINT). Project Maven is a commercial technology initiative that inserts commercial AI into existing programs of records. Most military intelligence exploitation systems were designed pre-AI and require specialized integration to enable the insertion of algorithms into their software baseline. Project Maven is the pathfinder AI initiative for the DoD and is investing in critical AI architecture to support the rapid expansion of AI to other mission areas besides GEOINT. As Maven algorithms increase in capability, the algorithms will move to the edge (on the sensor platform)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "221.235"
                },
                "BudgetYearOne": {
                    "val": "45.261"
                },
                "BudgetYearOneBase": {
                    "val": "45.261"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "221.235"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-45.261"
                },
                "BudgetYearOneBase": {
                    "val": "-45.261"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Departmental Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-45.261"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-45.261"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funds are transferred from BA-6 to BA-8 Software and Digital Technology Pilot programs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "590"
                    },
                    "ProjectTitle": {
                        "val": "Algorithmic Warfare Cross Functional Team (AWCFT)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "221.235"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "221.235"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Algorithmic Warfare Cross Functional Team funds Project Maven which fields increasing amounts of automation to FMV ground exploitation stations for TUAVs, Medium Altitude, High Altitude ISR platforms and accelerates the development and deployment of AI capabilities across the Defense Intelligence Enterprise, including exploitation of CEM, ACINT, OPIR and PAI exploitation. Maven uses artificial intelligence, deep learning, and computer vision algorithms to detect, classify, and track objects within FMV images (e.g., person, vehicle, and weapon) and other AI algorithms for CEM and text based projects. Maven algorithms increase the intelligence value of ISR, reduce the human burden of screening so analysts can multi-task increasing productivity, and seeds the generation of insight from GEOINT. Project Maven is a commercial technology initiative that inserts commercial AI into existing programs of records. Most military intelligence exploitation systems were designed pre-AI and require specialized integration to enable the insertion of algorithms into their software baseline. Project Maven is the pathfinder AI initiative for the DoD and is investing in critical AI architecture to support the rapid expansion of AI to other mission areas besides GEOINT. As Maven algorithms increase in capability, the algorithms will move to the edge (on the sensor platform)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Algorithmic Warfare Cross Functional Team (AWCFT)"
                                    },
                                    "Description": {
                                        "val": "AWCFT funds Project Maven, a rapid fielding AI program to augment and automate PED for FMV of TUAVs, Medium Altitude, High Altitude, and WAMI ISR platforms in support of defeat-ISIS and NDS peer\/near peer competitor strategy. Maven also brings AI to CEM, ACINT, OPIR and PAI exploitation. Maven uses artificial intelligence, deep learning, and computer vision algorithms to detect, classify, and track objects within FMV images (e.g., person, vehicle, and weapon) and other AI algorithms for CEM and text based projects. Maven algorithms increase the intelligence value of ISR, reduce the human burden of screening so analysts can multi-task increasing productivity, and seeds the generation of insight from GEOINT. Project Maven is a commercial technology initiative that inserts commercial AI into existing programs of records. Most military intelligence exploitation systems were designed pre-AI and require specialized integration to enable the insertion of algorithms into their software baseline. Project Maven is the pathfinder AI initiative for the DoD and is investing in critical architecture to support the rapid expansion of AI to other mission areas besides GEOINT. As Maven algorithms increase in capability, the algorithms will move to the edge (on the sensor platform)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "221.235"
                                            },
                                            "Text": {
                                                "val": "Project Maven uses rapid prototype sprints to field increasing amounts of automation to FMV ground exploitation stations for TUAVs, Medium Altitude, High Altitude and WAMI ISR platforms and accelerate the development and deployment of AI capabilities across the Defense Intelligence Enterprise, including exploitation of CEM, ACINT,OPIR and PAI exploitation Maven will continue to use artificial intelligence, deep learning, and computer vision algorithms to detect, classify, and track objects within FMV images (e.g., person, vehicle, and weapon) and other AI algorithms for CEM and text based projects. This initiative brings artificial intelligence, deep learning, and computer vision into the process of object detection, identification, and tracking at computer process speed versus human speed. Incorporating computer vision and algorithms will reduce the human burden and provide efficient and effective exploration of data. Project Maven plans to develop algorithms focused on tactical UAV FMV Automatic Target Recognition (ATR) and an operational PED environment for platforms and ground stations. AW will build capabilities, integrate AI and ML to provide actionable intelligence and enhancement to military decision-making by providing algorithms for object detection, classification and user alerts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funds are transferred from BA-6 to BA-8 Software and Digital Technology Pilot programs."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "O&M PE0307588D8Z"
                                    },
                                    "Title": {
                                        "val": "Algorithmic Warfare Cross Functional Team (AWCFT)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "11.825"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.993"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.993"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.993"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.993"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.993"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.993"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PROC PE0307588D8Z"
                                    },
                                    "Title": {
                                        "val": "Algorithmic Warfare Cross Functional Team (AWCFT)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "8.206"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "8.206"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "AWCFT’s contracting strategy follows guidance outlined in the DoD 5000 series directives, Federal Acquisition Regulation (FAR), Defense Federal Acquisition Regulation (DFAR) and rapid prototyping policies and procedures. Management uses project management tools and meetings to ensure delivery of stated capabilities and performance criteria are achieved."
                        }
                    }
                }
            ]
        }
    }
}