{
    "id": "2021-DefenseAdvancedResearchProjectsAgency-PB-0400-MJBOOK-0-0-2716d21dbc896f45f0ab55d1cbc64884530e2bcd27618d8f0e40b216a43f556d-11",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-DARPA-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603760E"
        },
        "ProgramElementTitle": {
            "val": "COMMAND, CONTROL AND COMMUNICATIONS SYSTEMS"
        },
        "R1LineNumber": {
            "val": "57"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "178.074"
            },
            "CurrentYear": {
                "val": "229.134"
            },
            "BudgetYearOne": {
                "val": "221.724"
            },
            "BudgetYearOneBase": {
                "val": "221.724"
            },
            "BudgetYearTwo": {
                "val": "283.864"
            },
            "BudgetYearThree": {
                "val": "269.986"
            },
            "BudgetYearFour": {
                "val": "245.909"
            },
            "BudgetYearFive": {
                "val": "226.491"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Command, Control and Communications Systems Program Element is budgeted in the Advanced Technology Development Budget Activity because its purpose is to demonstrate and evaluate advanced information systems research and development concepts.\n\nThe success of military operations depends on timely, reliable, secure, and synchronized dissemination of command and control and relevant situational awareness information to every military echelon.  While wired communications and networks are fairly well developed, providing assured high-bandwidth mobile wireless capabilities that match or exceed commercial wired infrastructure is needed to meet the demands of military users.  The goal of the Information Integration Systems project is to develop and demonstrate technologies that will provide effective communications to U.S. forces.  Approaches to this goal include developing technologies in these areas:\n-  High-Capacity Links technologies - enables greater back-haul capability.\n-  Advanced Networking technologies - supports resilience, adaptability, scalability, and composable systems to enable adaptive effects webs.\n-  Low Probability of Detection and Anti-Jam (LPD\/AJ) technologies - provides assured communications in very high-threat environments.\n-  Novel Radio Frequency and Spectral Sensing (RF\/SS) - supports efficient spectrum management in congested environments and detection of electromagnetic threats."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "185.984"
                },
                "CurrentYear": {
                    "val": "232.134"
                },
                "BudgetYearOne": {
                    "val": "188.881"
                },
                "BudgetYearOneBase": {
                    "val": "188.881"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "178.074"
                },
                "CurrentYear": {
                    "val": "229.134"
                },
                "BudgetYearOne": {
                    "val": "221.724"
                },
                "BudgetYearOneBase": {
                    "val": "221.724"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-7.910"
                },
                "CurrentYear": {
                    "val": "-3.000"
                },
                "BudgetYearOne": {
                    "val": "32.843"
                },
                "BudgetYearOneBase": {
                    "val": "32.843"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-10.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "7.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "3.176"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-11.086"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "32.843"
                                },
                                "BudgetYearOneBase": {
                                    "val": "32.843"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019:  Decrease reflects SBIR\/STTR transfer, offset by reprogrammings.\nFY 2020:  Decrease reflects congressional adjustments.\nFY 2021:  Increase reflects initiation of several Information Integration Systems programs and expansion of classified programs in FY 2021."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CCC-02"
                    },
                    "ProjectTitle": {
                        "val": "INFORMATION INTEGRATION SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "99.823"
                        },
                        "CurrentYear": {
                            "val": "130.539"
                        },
                        "BudgetYearOne": {
                            "val": "110.555"
                        },
                        "BudgetYearOneBase": {
                            "val": "110.555"
                        },
                        "BudgetYearTwo": {
                            "val": "204.112"
                        },
                        "BudgetYearThree": {
                            "val": "226.992"
                        },
                        "BudgetYearFour": {
                            "val": "222.109"
                        },
                        "BudgetYearFive": {
                            "val": "226.491"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The success of military operations depends on timely, reliable, secure, and synchronized dissemination of command and control and relevant situational awareness information to every military echelon.  While wired communications and networks are fairly well developed, providing assured high-bandwidth mobile wireless capabilities that match or exceed commercial wired infrastructure is needed to meet the demands of military users.  The goal of the Information Integration Systems project is to develop and demonstrate technologies that will provide effective communications to U.S. forces.  Approaches to this goal include developing technologies in these areas:\n-  High-Capacity Links technologies - enables greater back-haul capability.\n-  Advanced Networking technologies - supports resilience, adaptability, scalability, and composable systems to enable adaptive effects webs.\n-  Low Probability of Detection and Anti-Jam (LPD\/AJ) technologies - provides assured communications in very high-threat environments.\n-  Novel Radio Frequency and Spectral Sensing (RF\/SS) - supports efficient spectrum management in congested environments and detection of electromagnetic threats."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Satellite Antenna Technology"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "7.000"
                                        },
                                        "Text": {
                                            "val": "-  Conduct research in technology for satellite antennas."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Secure Handhelds on Assured Resilient networks at the tactical Edge (SHARE)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Secure Handhelds on Assured Resilient networks at the tactical Edge (SHARE) program is to develop innovative networking and information sharing approaches that enable U.S. and coalition forces to coordinate tactical operations effectively, efficiently, and securely by eliminating today's prohibitive security cost and complexity barriers.  SHARE will provide the level of security provided by today's communications systems, while managing trust at the tactical edge, and provide new opportunities for U.S. and coalition forces to gain and maintain a tactical advantage on the battlefield.  Coordination includes providing all the information required to enable the command and control necessary to plan and execute operations in all phases of warfare.  Technology from this program will transition to the Services and DoD Agencies that work with coalition partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.503"
                                            },
                                            "Text": {
                                                "val": "-  Integrated and tested multi-level, handheld software and new networking architecture supporting the sharing of information at multiple security levels.\n-  Evaluated user interfaces with operational transition partners.\n-  Conducted controlled, limited field experimentation on handheld devices, demonstrating multi-level secure information sharing and network security.\n-  Developed and updated automated network configuration software, ensuring compatibility with handheld and network approach.\n-  Conducted system security assessment and compliance with overall program sharing and security objectives."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.963"
                                            },
                                            "Text": {
                                                "val": "-  Conduct research and experimentation using SHARE software prototype that further supports creation of automated network configuration software.  Experiments will test compatibility with existing operationally deployed handheld devices. \n-  Conduct research and begin integrating SHARE security and networking capabilities into operational airborne and ground networks that support larger DoD command & control (C2) enterprise systems in addition to tactical handhelds.   \n-  Conduct field experimentation during multiple DoD-sponsored coalition exercises to validate SHARE system security and performance.\n-  Begin co-development of SHARE software with DoD partners for follow-on software configuration management."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.655"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.655"
                                            },
                                            "Text": {
                                                "val": "-  Complete integration of SHARE security and networking capabilities onto DoD handheld devices and conduct final prototype testing to include automated network configuration software.\n-  Conduct testing of SHARE security and networking capabilities integrated onto operational airborne and ground networks that support larger DoD C2 enterprise systems.  \n-  Continue co-development of SHARE software with DoD partners for follow-on software configuration management and begin accreditation for use on approved DoD handheld systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects a shift from research and experimentation to system integration and transition."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dynamic Network Adaptation for Mission Optimization (DyNAMO)"
                                    },
                                    "Description": {
                                        "val": "Wireless networks have evolved into complex systems having many configurable parameters and features, including link data rates, power settings, inter-network gateways, and security associations.  The optimal settings for these features vary greatly depending on the mission for which the network is deployed and the environment in which it is operating.  Currently, the majority of these features are optimized off-line for specific scenarios and assumptions and are pre-set before use in a mission.  There is no capability for the settings to adapt if the actual mission or environment differs from the original assumptions used to configure the network.  The problem is exacerbated in scenarios in which intelligent adversaries can affect the topology and operation of the network unpredictably and on short timescales.  Furthermore, future operations will include multiple, different radios interconnected on the same platform, and those existing networks lack a common standard for interoperability.  The DyNAMO program will develop software that addresses the incompatibilities preventing information sharing across independent airborne networks and develop new approaches to configure and control networks and networks of networks for operation in dynamic and contested environments.  The program will address optimization within legacy and future military networks, interactions between networks, and availability of necessary network services to support mission success.  Technologies developed under this program will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.965"
                                            },
                                            "Text": {
                                                "val": "-  Continued development and integration of initial instantiation of real-time network optimization algorithms in radio hardware.\n-  Conducted emulation of a 58-node network using DyNAMO technologies that demonstrated inter-network coordination, mission-based control, interoperability, and real-time optimization results.\n-  Created hardware-in-the-loop testbed with tactical radios for integration into emulation network with instantiations of inter-network coordination, mission-based control, and real-time optimization.\n-  Integrated updated instantiation of inter-network coordination, mission-based control, and real-time optimization algorithms in radio hardware."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.330"
                                            },
                                            "Text": {
                                                "val": "-  Conduct ground test of integrated system.\n-  Conduct field test of integrated system with instantiations of inter-network coordination, mission-based control, and real-time optimization to show the quantitative and qualitative value of DyNAMO for a variety of military missions.\n-  Integrate program software into tactical radio hardware.\n-  Demonstrate Army, Navy, Marine, and Air Force inter-network scenarios."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.989"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.989"
                                            },
                                            "Text": {
                                                "val": "-  Integrate advanced security elements into DyNAMO in order to operate over multiple security enclaves that exist when using multiple radio platforms and networks.\n-  Demonstrate the integrated system of DyNAMO to service partners, illustrating the usefulness of DyNAMO in a tactical environment with multiple security enclaves.\n-  Provide DyNAMO software in government controlled repository for use by the Military Services."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects a shift from testing and initial integration to final demonstrations and further refinement of the system."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Geospatial Cloud Analytics (GCA)"
                                    },
                                    "Description": {
                                        "val": "The Geospatial Cloud Analytics (GCA) program will develop technology to access and analyze global-scale, multimodal geospatial data and pilot an analytics-as-a-service business model.  Exploiting multiple sources and modalities at a global scale requires the development of technologies and systems that provide common access points to commercial data, computational power to preprocess data and make it exploitable by analytical tools, and new models supporting sensing and analytics as services, including sharing of tools and results between individuals and consortiums.  GCA creates a capability for near real time monitoring of global events and change detection across various environments and warfighting domains.  By exploiting the vast amounts of geospatial information from new commercial satellite constellations and other sources, GCA will create the technology foundations needed to provide global awareness of gray zone activities for DoD military mission planning and execution.  It will do so by augmenting commercial capabilities with defense assets, not vice versa, and thereby will improve speed, agility, and scalability.  Technology from this program will transition to the Services and DoD Agencies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.965"
                                            },
                                            "Text": {
                                                "val": "-  Analyzed computational architectures and frameworks for GCA analytics services at global scale.\n-  Demonstrated the ability of the software infrastructure to support global-scale analytics on relevant problem sets.\n-  Demonstrated gray zone indicators and warnings for high-impact, destabilizing global events such as droughts, crop failures, and illegal fishing.\n-  Experimented with approaches for offering analytics services for use by DoD users and others.\n\n."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.993"
                                            },
                                            "Text": {
                                                "val": "-  Complete a multi-source, multi-modality platform with global-scale analytics.\n-  Demonstrate ability for DoD users to use the analytics services in an operationally relevant environment.\n-  Refine the analytics services based on feedback from end users"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.889"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.889"
                                            },
                                            "Text": {
                                                "val": "-  Begin development of additional future advanced analytics services based on feedback from end users.\n-  Transition analytics services to additional DoD military users and other Government entities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects a shift from platform and software development into testing of the analytics services in operationally relevant environments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Universal Persistence (Network UP)"
                                    },
                                    "Description": {
                                        "val": "Current radios send network control information and data using the same wireless link.  This produces a common failure mode when that wireless link degrades.  In many of today's military wireless networks, even brief wireless link outages create a loss of network connectivity that can take more than two minutes to recover once the wireless link is re-established.  During these network outages, data transmission is not possible.  The Network UP program will develop and demonstrate radio technology that maintains network reliability through periods of frequent signal degradation that routinely occur in military operational environments.  Isolation of critical control channel information in a separate, robust wireless link will allow creation of a protected control channel that can maintain network reliability even when the data channel is lost.  The Network UP program will develop technology and a prototype system that enables military wireless networks to send data over dynamic, unstable wireless links.  The program will develop approaches to separate the control and data planes across different wireless links and design and implement mechanisms to maintain synchronization across those separate links.  Technologies developed under this program will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.377"
                                            },
                                            "Text": {
                                                "val": "-  Created preliminary design of a radio architecture and supporting technology that implemented separate control and data channels showing viable paths forward.\n-  Completed preliminary design of network architectures and technologies that enable creation of a network with physically separated control and data links.\n-  Conducted early lab testing of radio and network architectures and technology approaches that showed the Network UP approach was viable.\n-  Finished preliminary simulation and emulation testing, demonstrating positive results for maintaining network connectivity while sending voice, images, and video in the presence of interference."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.934"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate a communication system that provides reliable communications in the presence of jamming.\n-  Demonstrate physical communications channel divided into two separate functions and radio frequency bands.\n-  Complete design of radio architectures and build and test prototypes.\n-  Complete design of network architectures and build and test prototypes.\n-  Demonstrate radio architectures in highly mobile scenarios with large amounts of environmental attenuation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.829"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.829"
                                            },
                                            "Text": {
                                                "val": "-  Design and build a wireless hardware and software demonstration platform.\n-  Complete integration of network control algorithms onto multi-band or multiple radio platforms.\n-  Test and verify that the operation of the integrated hardware and software meet program goals.\n-  Demonstrate network connectivity and data throughput on wireless channels in the presence of high levels of interference."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects a shift from system development to testing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Protected Forward Communications (PFC)"
                                    },
                                    "Description": {
                                        "val": "The collaborative application of combat power in ground tactical operations demands reliable exchange of rich information and precise coordination of actions across various echelons.  These operations take place over three critical conversations: (1) to coordinate the actions of a local group, (2) to coordinate group and airborne assets, and (3) to interact with rear echelon command.  The communication links over which these three conversations take place are at risk from jamming and geolocation operations conducted with increasingly sophisticated exploitation and denial technology employed by our adversaries.  This problem is compounded by demands for ever-increasing capacity of these links.  The Protected Forward Communications (PFC) program will build on technical advances in resilient, efficient, and aware communications technology to design a single communication architecture to protect all three conversations from jamming and geolocation.  PFC is generally applicable to small unit operations and is particularly relevant to the close air support (CAS) function typically executed by the Joint Terminal Attack Controller (JTAC) or Forward Air Controller (FAC).  The PFC program will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.593"
                                            },
                                            "Text": {
                                                "val": "-  Commenced algorithm design for implementation and control of all three communication techniques.\n-  Began concept validation through modeling and simulation.\n-  Established readiness of constituent link technologies for all three communication techniques."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.924"
                                            },
                                            "Text": {
                                                "val": "-  Conduct simulation and modeling of systems in representative operating environments to assess resistance to geolocation and jamming.\n-  Conduct system engineering reviews to ensure design readiness for further development.\n-  Conduct experimental validation of key design elements.\n-  Develop size, weight, and power estimates for complete prototype and complete system.\n-  Develop bread board implementations of communications technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.069"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.069"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate bread board implementations designed to performance goals established for the program and conduct lab bench testing.\n-  Develop brass board implementations of a subset of the communications links.\n-  Conduct experimentation with brass board implementations in a realistic environment with real operators and assess performance against realistic threat systems.\n-  Produce complete objective system design of PFC communication system with data artifacts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects transitioning from design and prototyping activities to experimentation and assessment activities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Composable Logistics and Information Omniscience (LogX)"
                                    },
                                    "Description": {
                                        "val": "The Composable Logistics and Information Omniscience (LogX) program will develop and demonstrate software for real-time logistics and supply chain system situational awareness (diagnosis), future state prediction (prognosis) and resilience at unprecedented scale and speed.  The software will integrate a range of technical innovations spanning human-machine interface, dynamic data visualization, and distributed\/collaborative software design.  Based upon technologies developed in the Prototype Resilient Operations Testbed for Expeditionary Urban Systems of Systems (PROTEUS) program (budgeted in PE 0603766E, Project NET-01), the LogX capability will allow users to achieve a more distributed and resilient logistics command and control (C2) system utilizing planned cloud-based data environments.  The new capability will be tested in an experimental environment tied to current logistics datasets.  Technologies from this program will be transitioned to the Services, Combatant Commands, including U.S. Transportation Command and the Defense Logistics Agency (DLA)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.395"
                                            },
                                            "Text": {
                                                "val": "-  Initiate development and demonstration of the technology and the underlying enabling capabilities.\n-  Demonstrate diagnostic and prognostic capabilities enabling situational awareness.\n-  Begin integration of test environment with limited complexity logistics data set."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.552"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.552"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate capabilities to detect and mitigate supply chain fluctuations and disruptions.\n-  Demonstrate capability to address multiple operational applications simultaneously. \n-  Produce systems for use by actual logistics and operations planners.\n-  Begin to prepare systems for deployment to operational settings."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects additional effort required to conduct demonstrations and prepare systems for deployment in operational settings."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Domain Analytics (MDA)"
                                    },
                                    "Description": {
                                        "val": "The Multi-Domain Analytics (MDA) program will develop network and data management tools for automating the establishment of cross-domain networks in support of data analytics and decision making tools.  The tools will manage information flow to support data correlation and fusion across multiple, isolated databases and networks. Technology advances are making it possible to pass messages across heterogeneous waveforms and networks, but there are no technologies today that can determine if it is the data that is most important to end users and systems.  Building upon technologies developed in the Secure Handhelds on Assured Resilient networks at the tactical edge (SHARE) program (budgeted in this PE\/Project), MDA will combine network management with data analytics, information exploitation and fusion technology to route information in an understandable context, based upon information need and value.  MDA also seeks to address multi-level security configuration issues that often add delays and limit interoperability. The MDA program will enable automated data analysis across different networks without manually moving impracticably large amounts of data. Technology developed by this program will transition to the Services."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.232"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.232"
                                            },
                                            "Text": {
                                                "val": "-  Create initial machine learning, artificial intelligence (AI), and other techniques for understanding context and information value at user, system, and mission level.\n-  Begin development of algorithmic techniques for determining global information relevance and importance and converting it to local context.\n-  Create initial Course of Action Analyses for tactical level decision making using information from multiple security levels."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in FY 2021 reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dynamic Airspace Control"
                                    },
                                    "Description": {
                                        "val": "The Dynamic Airspace Control program will develop and demonstrate alternate means of creating the local airspace picture and dynamically managing the local airspace without requiring high power radars or communications. This capability will support the simultaneous operations and airspace deconfliction of a wide array of airborne systems, such as manned and unmanned weapons systems and non-combatant aircraft.  Based on technologies developed in the Systems of Systems-Enhanced Small Units (SESU) program (budgeted in PE 0603766E\/Project NET-01), Dynamic Airspace Control will consist of an artificial intelligence engine and a mix of traditional and non-traditional sensors to create the air picture.  It will also leverage legacy Airspace management tools to take advantage of prior investments in technologies, such as human-machine interfaces, and to minimize the impact on training.  The artificial intelligence engine will generate a real-world model enabling automated airspace deconfliction for a variety of simultaneous missions (e.g., helicopter search and rescue, fires, and surveillance with unmanned airborne vehicles). The program will use traditional and non-traditional sensors, such as flight plans, air platform self-reporting, and passive sensing in order to confirm flight plans or to detect unidentified air platforms in the airspace.  Technologies from this program will transition to the Air Force."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.693"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.693"
                                            },
                                            "Text": {
                                                "val": "-  Develop representative airspace vignettes and identify performance metrics.\n-  Design and develop the software architecture, development environment (DEVOPS), and interface specifications to host the artificial intelligence engine algorithms and interoperate with legacy airspace management tools.\n-  Define required training data sets. \n-  Identify non-traditional sensor options and develop models."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resilient Networked Distributed Multi-Transceiver Communications (RNDMC)"
                                    },
                                    "Description": {
                                        "val": "Resilient Networked Distributed Multi-Transceiver Communications (RNDMC) aims to provide Beyond-Line-Of-Sight (BLOS) tactical communications for an Anti-Access\/Area Denial (A2\/AD) environment by developing low-cost expendable repeaters that may be hosted on ground platforms, including hand-carried, autonomous air vehicles, high altitude platforms, and low-cost\/low earth orbit satellites.  RNDMC plans to use a combination of synchronized repeaters and tactical radios to enhance desired signals and reject intentional and unintentional interference.  Based on technologies developed in the Protected Forward Communications (PFC) program (budgeted in this PE\/Project), RNDMC will design, develop, and demonstrate a distributed field of expendable transceivers, providing a robust, low-cost, BLOS tactical communications system that degrades gracefully as repeater nodes become unavailable. The ultimate RNDMC goal is a demonstration on ground and air platforms and will not be reliant on Global Positioning System (GPS).  Technologies from this program will transition to the Services."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.365"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.365"
                                            },
                                            "Text": {
                                                "val": "-  Develop representative communication vignettes and identify performance metrics for ground, air, high altitude, and space CEWEC configurations. \n-  Begin development of specifications for tactical terminals and repeater nodes.\n-  Verify designs using modeling and simulation in ground and air vignettes."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Network Exploitation (MNE)"
                                    },
                                    "Description": {
                                        "val": "Multi-Network Exploitation (MNE) will create an end-to-end logical network to enable tactical network resilience and assurance to ensure critical information is exchanged between systems and their users.  This will include the research and development of a common underlying (physical or virtual) infrastructure that permits the transfer of information across multiple paths and between multiple systems.  Based on technologies developed in the Secure Handhelds on Assured Resilient Networks at the Tactical Edge (SHARE) program (budgeted in this PE\/Project), the MNE program will develop networking systems that are sensitive to the tradeoffs of delivery of both timely and precise information. MNE will investigate innovations to layers in the network stack to offer new opportunities for ensuring critical systems and user information are delivered in virtual slices across multiple networking paths, including combinations of tactical and commercial networks, even when the underlying physical networks are not designed to operate with each other. MNE will demonstrate improved access, quality of service, and data rates with reduced latency on scaled networks to ease application to enterprise and tactical networks.   Technology developed by the MNE program will transition to the Services."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.942"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.942"
                                            },
                                            "Text": {
                                                "val": "-  Identify technologies that contribute to overall end-to-end system design. \n-  Conduct individual sub-system laboratory testing to validate technology performance and suitability for overall MNE system design.  \n-  Select and initiate development of multi-network test site for at-scale evaluation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Trusted Networks (TNets)"
                                    },
                                    "Description": {
                                        "val": "The Trusted Networks (TNets) program will create technology that allows any underlying network path to be used for command and control, enables automated command and control functions to be distributed using trusted platforms (e.g. trusted Distributed Computing), and supports distributed network forensics and continuous verification. Based on technologies developed in the Secure Handhelds on Assured Resilient Networks at the Tactical Edge (SHARE) program (budgeted in this PE\/Project), TNets will build architectural redundancy and trust at multiple levels with trusted hardware, software-defined radio and networking protocols, and network-level integrity using novel, distributed security. TNets will also develop a trusted network appliance and networking design principles that enable resilient and secure tactical and strategic communications regardless of the underlying physical infrastructure.  This will provide mission-adaptive military connectivity, while minimizing network logistics and interoperability burdens. Technologies developed under this program will transition to the Services."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.340"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.340"
                                            },
                                            "Text": {
                                                "val": "-  Initiate research into hardware and networking component technologies. \n-  Begin hardware research and laboratory analysis to verify system building block capabilities.\n-  Conduct operating system and application research and laboratory analysis to determine network architectures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY2021 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Spectrum Efficiency and Access"
                                    },
                                    "Description": {
                                        "val": "The Federal Government is working to transition large swaths of spectrum (up to 500 MHz) from Federal (DoD is the primary contributor) to civilian use for broadband telecommunications.  The DoD will need more highly integrated and networked sensor and data capacity over the next decades and will therefore need new technology that requires less spectrum to operate.  The objective of the Spectrum Efficiency and Access program was to investigate improvements in spectral reuse, such as spectrum sharing of sensor and radar bands with communication systems.  The program leveraged technologies originally developed for radar anti-jam and interference mitigation that could enable spectrum sharing by allowing overlay of communications within the same spectral footprint.  The approach included exploring real-time control data links between radars and communications systems and developing the advanced waveforms and components to enable radars and communication networks to operate in close proximity.  The ultimate goal was to turn the DoD spectrum loss into a net gain of up to hundreds of MHz in capacity.  Technology from this program transitioned to the Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.987"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated spectrum maneuver command and control concepts.\n-  Finalized design of a system capable of dynamically controlling radio frequency signatures while maintaining high accuracy target tracking."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "100 Gb\/s RF Backbone"
                                    },
                                    "Description": {
                                        "val": "The proliferation of video, voice, chat, and other important data-streams on the battlefield has driven a need for higher capacity, reliable, assured, and all-weather communications that are deployable on a wide range of air, ground, and maritime platforms.  The goal of this High-Capacity Links technologies program was to demonstrate a 100 Gigabit-per-second (Gb\/s) radio frequency (RF) backbone that could meet the anticipated mid-term (within 3-10 years) wireless networking capacity needs of deployed military forces.  The primary focus of the program was a millimeter-wave (mmW) solution to provide high capacity and all-weather resiliency.  The program developed the constituent subsystems (waveform generation, efficient power amplifiers, and receivers) and spatial multiplexing architectures to construct an all-weather mmW 100 Gb\/s backbone at half the SWaP consumption of the current Optical RF Communications Adjunct (ORCA) system.  Technology developed under this program transitioned to the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.433"
                                            },
                                            "Text": {
                                                "val": "-  Integrated prototype onto test aircraft and conducted air-to-ground testing.\n-  Completed air-to-ground testing and conducted flight demonstrations."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CCC-06"
                    },
                    "ProjectTitle": {
                        "val": "COMMAND, CONTROL AND COMMUNICATION SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "78.251"
                        },
                        "CurrentYear": {
                            "val": "98.595"
                        },
                        "BudgetYearOne": {
                            "val": "111.169"
                        },
                        "BudgetYearOneBase": {
                            "val": "111.169"
                        },
                        "BudgetYearTwo": {
                            "val": "79.752"
                        },
                        "BudgetYearThree": {
                            "val": "42.994"
                        },
                        "BudgetYearFour": {
                            "val": "23.800"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds classified DARPA programs that are reported in accordance with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Classified DARPA Program"
                                    },
                                    "Description": {
                                        "val": "This project funds Classified DARPA Programs.  Details of this submission are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "78.251"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "98.595"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "111.169"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "111.169"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Details will be provided under separate cover."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}