{
    "id": "2021-Army-PB-2040-JBOOK-7f1ee284016a103cbd6a4d63ea727aa617711f15268cf669f26149e7ae172ad5-36",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602787A"
        },
        "ProgramElementTitle": {
            "val": "Medical Technology"
        },
        "R1LineNumber": {
            "val": "42"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "87.229"
            },
            "CurrentYear": {
                "val": "112.955"
            },
            "BudgetYearOne": {
                "val": "95.496"
            },
            "BudgetYearOneBase": {
                "val": "95.496"
            },
            "BudgetYearTwo": {
                "val": "95.558"
            },
            "BudgetYearThree": {
                "val": "100.807"
            },
            "BudgetYearFour": {
                "val": "102.483"
            },
            "BudgetYearFive": {
                "val": "103.020"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "697.548"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020, Projects in this Program Element (PE) have been realigned as noted on each applicable R-2A.  \n\nAll FY20 adjustments realign program financial structure to Army Modernization Priorities in support of the National Defense Strategy."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) supports application of knowledge gained through basic research to refine drugs, vaccines, medical devices, diagnostics, medical practices\/ procedures, and other preventive measures essential to the protection and sustainment of Warfighter health. Research is conducted in six principal areas: Combat Casualty Care, Military Operational Medicine, Military Relevant Infectious Diseases, Clinical and Rehabilitative Medicine, Medical Capabilities to Support Dispersed Operations, and Systems Biology\/Network Sciences.  Projects are coordinated with the Defense Health Agency.\n\nProject 869: Warfighter Health Prot & Perf Stnds\nDescription: Refines knowledge and technologies on screening tools and preventive measures for post-traumatic stress disorder (PTSD), behavioral health problems (e.g., suicide, substance abuse), and mild traumatic brain injuries; physiological monitors and interventions to protect Warfighters from injuries resulting from operational stress; and exposure to hazardous environments and materials. \n\nProject 870: Dod Med Def Ag Inf Dis\nDescription: Designs and refines drugs, vaccines, medical diagnostic assays\/tests devices, other preventive measures for protection and treatment against naturally occurring infectious diseases as identified by worldwide medical surveillance and military threat analysis.\n \nProject 874: Cbt Casualty Care Tech\nDescription: Identifies and evaluates drugs, biologics (medical products derived from living organisms), medical devices, and associated clinical practices for field trauma care systems, resuscitation, and life support, with emphasis on provision of prolonged field care when medical evacuation and access to definitive surgical care are delayed. Focus is identification of more effective critical care technologies and clinical practices to treat severe bleeding, traumatic brain injury, burns and other combat related injuries. This Project is coordinated with the Defense Health Agency.\n\nProject ET4: Appl Resch in Clinical and Rehabilitative Medicine\nDescription: Identifies and evaluates drugs, biologics, medical devices, treatments and diagnostics for post-evacuation restorative, regenerative and rehabilitative care, as well as systems for use by field medics and surgeons for ocular trauma. Research focus is on identifying more effective technologies and protocols to treat ocular injury and visual system dysfunction, as well as laboratory and animal studies for regenerating skin, muscle, nerves, vascular and bone tissues for the care and treatment of wounded Service members. \n\nProject MK4: Warfighter Health Applied Rsch Technology\nDescription: Refines knowledge and technologies on screening tools and preventive measures for PTSD, behavioral health problems, and mild traumatic brain injuries, physiological monitors, and interventions to protect Warfighters from injuries resulting from operational stress and exposure to hazardous environments and materials. Also conducts research on medically valid testing devices and predictive models used for the refinement of Warfighter protective equipment.\n\nProject MM4 Cbt Casualty Care Applied Rsch Technology\nDescription: Identifies and evaluates drugs, biologics (medical products derived from living organisms), medical devices and associated clinical practices for field trauma care, resuscitation, and life support with emphasis on provision of prolonged field care when medical evacuation and access to definitive surgical care is delayed. Focus is identification of more effective critical care technologies and clinical practices to treat severe bleeding, traumatic brain injury, burns and other combat related injuries.\n\nProject MM6: Medical Technologies to Support Dispersed Ops Technology\nDescription: Medical Robotic and Autonomous Systems (Med-RAS) - Research to develop the ability to deliver emergency resupply of Medical material including repair parts peculiar to medical equipment by ground or air, such as blood products, and, utilization of autonomous platforms to perform medical treatment and medical evacuations in dispersed and multi-domain battle environments.  \n\nProject MM8: Infectious Diseases Applied Rsch Technology\nDescription: Applied research to design and refine drugs, vaccines, and other medical countermeasures against naturally occurring infectious diseases as identified by worldwide medical surveillance and capability needs assessments.\n\nProject MN1: Applied Sensory Systems Trauma Technology\nDescription: Research to understand the influence of stress on the effectiveness of pain relief drugs (analgesics). This Project conducts laboratory and animal studies for the purpose of developing novel, non-opioid drugs to treat pain in the austere battlefield environment with minimal side effects.\n\nProject VB3: Medical Technology Initiatives (CA)\nDescription: Congressional Special Interest funding for Medical Technology applied research.\n\nProject VB4: System Biology and Network Science Technology\nDescription: Includes strategic oversight, direction and management of applied research in integrative systems biology of military relevant conditions, and the Systems Biology Collaboration Center (SBCC). The Sys Bio Cube (a biomedical research data integration and analysis system), managed by the SBCC, provides the ability for multi-site collaborative efforts to integrate, visualize and evaluate complex data using innovative technologies. Post-Traumatic Stress Disorder and coagulopathy (a disorder that impairs the blood's ability to form clots) projects have utilized the systems biology analytical tools and visualization within the Sys Bio Cube to inform the development of prognostic indicators, objective diagnostics, and improved and personalized therapeutic strategies more quickly than non-systems approaches. The SBCC also serves as a US Army Medical Research and Development Command (USAMRDC) resource for data sharing and data management for maximizing the value of all research efforts across the Command.\n\nProject XV5: Medical Capabilities to Support Dispersed Ops\nDescription: Research to design, develop, and improve Med-RAS, Virtual Health for telemedicine and remotely delivered patient care, and unmanned capabilities for providing or supporting combat casualty care in far-forward and dispersed geographic environments. This research includes the design of semi-autonomous and closed-loop combat casualty triage, diagnosis, physiological monitoring, therapeutic intervention, casualty evacuation, telemedicine\/ tele-mentoring and emergency medical resupply technologies for integration with emerging multi-purpose Army Robotics and Autonomous Systems (RAS) and Virtual Health\/Telemedicine delivery platforms while optimizing the medical logistic footprint.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering science and technology focus areas and the Army Modernization Strategy.  \n\nWork in this PE is performed by the United States Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD.\n\nAll medical applied research is conducted in compliance with Food and Drug Administration (FDA) or Environmental Protection Agency (EPA) regulations. The FDA requires thorough testing in animals (preclinical testing) to ensure safety and, where possible, effectiveness prior to evaluation in controlled human clinical trials (upon transition to Advanced Technology Development). This PE focuses on research and refinement of technologies such as product formulation and purification and laboratory test refinement with the aim of identifying candidate solutions. This work often involves testing in animal models. The EPA also requires thorough testing of products, such as sterilants, disinfectants, repellents, and insecticides to ensure the environment is adequately protected before these products are licensed for use.\nProgram refinement and execution is externally peer-reviewed and fully coordinated with all Services as well as other agencies through the Joint Technology Coordinating Groups of the Armed Services Biomedical Research Evaluation and Management (ASBREM) Community of Interest (COI). The ASBREM COI, formed under the authority of the Assistant Secretary of Defense for Research and Engineering, serves to facilitate coordination and prevent unnecessary duplication of effort within the Department of Defenses (DoD) biomedical research community, as well as their associated enabling research areas."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "92.003"
                },
                "CurrentYear": {
                    "val": "99.155"
                },
                "BudgetYearOne": {
                    "val": "94.786"
                },
                "BudgetYearOneBase": {
                    "val": "94.786"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "87.229"
                },
                "CurrentYear": {
                    "val": "112.955"
                },
                "BudgetYearOne": {
                    "val": "95.496"
                },
                "BudgetYearOneBase": {
                    "val": "95.496"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.774"
                },
                "CurrentYear": {
                    "val": "13.8"
                },
                "BudgetYearOne": {
                    "val": "0.71"
                },
                "BudgetYearOneBase": {
                    "val": "0.71"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "13.8"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.51"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.264"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.71"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.71"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funds reprogrammed out for higher priority Army requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "869"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Health Prot & Perf Stnds"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "38.883"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "38.883"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20) this Project is being realigned to:\nProgram Element (PE) 0602787A Medical Technology\n* Project MK4 Warfighter Health Applied Rsch Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project conducts research to prevent and protect Warfighters from training and operational injuries; refine mechanisms for detection of physiological (human physical and biochemical function) and psychological (mental) health problems; evaluate hazards to head, neck, spine, eyes, and ears; set the standards for rapid return to duty, and determine new methods to sustain and enhance performance across the operational spectrum. This research provides medical information important to the design and operational use of military systems, and this work forms the basis for behavioral, training, pharmacological (drug actions), and nutritional interventions.\n\nThe four main areas of study are:\n\n(1)  Physiological Health and Performance\n(2)  Environmental Health and Protection\n(3)  Injury Prevention and Reduction\n(4)  Psychological Health and Resilience\n\n\nThis effort is coordinated with and complimentary to work done in PE0602143A Soldier Lethality Technology and PE0603118A Soldier Lethality Advanced Technology.\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy.\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this project is performed by the United States Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Physiological Health and Performance"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates methods for managing and controlling the effects of fatigue on Soldier operational performance and the impact of nutritional strategies to optimize operational performance. Efforts will also contribute to human health and performance optimization and enhancement."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.228"
                                            },
                                            "Text": {
                                                "val": "Developed nutritional interventions for resistance to stress (environmental\/physical\/cognitive) in the field. Evaluated individual differences of environmental influences on Soldier eating behavior. Improved the health of muscle and bone through characterization of protein source effects on metabolic kinetics. Developed a military-specific eating questionnaire for evaluation of nutritional approaches to resist military stress. Conducted studies to determine the effectiveness of energy and\/or protein supplementation for preventing declines in lean body mass and cognition during and after caloric deficit. Continued to develop a descriptive model outlining factors linking the central nervous system and other organs\/systems that impact resilience. Investigated physiological aspects of human health and performance optimization and enhancement."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Health and Protection"
                                    },
                                    "Description": {
                                        "val": "This effort involves applied research addressing the physiological (human physical and biochemical functions) mechanisms of exposure to extreme heat, cold, altitude, and other environmental stressors. This effort establishes scientific evidence for specific and sensitive diagnostics of exertional heat illness to optimize Soldier performance in austere environments. This effort also supports and maturates non-invasive technologies, decision-aid tools, and models to enhance Soldier protection and sustainment across the operational spectrum. This effort provides the scientific basis for developing focused heating and cooling solutions to maintain fine motor dexterity, core temperature, and optimize physical and cognitive performance during cold- weather and hot-humid operations. This effort will develop knowledge and materiel solutions that enable Soldier individualized metabolic assessments and optimization during training and operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.932"
                                            },
                                            "Text": {
                                                "val": "Determined the combined impact of heat, humidity, and high altitude on human health and performance. Quantified Heat Tolerance Test specificity to include the effects of heat acclimation on the prediction of heat illness susceptibility and return to duty guidelines. Quantified how physiological adaptations and acquired thermal tolerance to heat stress protect against acute mountain sickness susceptibility as well as physical and cognitive performance at high altitude. Developed new technologies that enable quantitative measurements at a point-in-time during training and operational activities. Increased dexterity performance in cold environments by combining facial and forearm microclimate heating interventions. Developed computational models of individualized Soldier health, readiness, and physiological performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the Army's number one priority of readiness by improving musculoskeletal injury prevention efforts as well as contributing to preparing Soldiers for potential threats (e.g., directed energy) in and developing capabilities for the multi domain battle environment; evaluates and assesses the effects of repetitive motion during military operations and training on the human body; provides mathematical models to predict the likelihood of physical injuries following continuous operations and muscle fatigue; evaluates current standards for return-to-duty; and establishes improved medical test methods with the goal of rapid return to duty of Soldiers following injury. This effort also develops prevention based strategies and medically based injury criteria for hearing, vestibular (sensory system supporting movement and sense of balance, located in the inner ear), and ocular\/facial protection devices, develops and evaluates neurosensory operational risk factors, develops medically based guidelines to assess neurosensory performance and models the effects of acoustic and impact trauma, as stressors on vision and hearing. Efforts will investigate the medical aspects of manned\/unmanned teaming (MUM-T) and medical aspects of and protection against directed energy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.373"
                                            },
                                            "Text": {
                                                "val": "Developed injury criteria for the prevention of acute and chronic cervical neck injury and pain that will guide the development of helmets and technologies added to the helmet. Established mTBI injury thresholds for repetitive blast exposure that can guide the development of head protection. Refined physical performance thresholds for potential improvements to the Occupational Physical Assessment Test (OPAT) which will improve how well recruits are screened to do Department of Defense (DoD) relevant physically demanding tasks. Developed countermeasures to reduce the risk of overuse injury within the training and operational environment. Identified cognitive and sensory performance metrics associated with optimal manned unmanned teaming (MUM-T) and identified physiological and behavioral fitness for duty metrics to operate in MUM-T paradigms. Developed medical standards and health hazard assessment algorithms for exposure to directed energy threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health and Resilience"
                                    },
                                    "Description": {
                                        "val": "This effort refines and evaluates early interventions to prevent and reduce combat-related behavioral health problems, including symptoms of Post-traumatic stress disorder (PTSD), depression, anger problems, anxiety, substance abuse, suicide, and other health risk behaviors. This effort assesses and refines tools and interventions to enhance and sustain psychological resilience throughout Soldiers' careers. Efforts also address the health and well-being of families."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.35"
                                            },
                                            "Text": {
                                                "val": "Assessed risk and resilience markers (e.g., moral injury) for male and female Soldiers' psychological and behavioral health; determined the optimal dosing of Attention Bias Modification Training, a computerized treatment that reduces anxiety. Evaluated evidence-based individual (e.g., self-distancing education, emotion regulation leadership training) and team-level (e.g., regulation of small-team dynamics) interventions that positively influence behavioral health, resilience, and unit readiness. Assessed key high-risk emotional and behavioral transition points, develop a non-contact screening tool and other interventions to decrease suicide behaviors. Developed the Behavioral Health Readiness and Suicide Risk Reduction Review (R4) tool to assist commanders and first line leaders in preventing suicide and improving behavioral health outcomes and launched a pilot study to evaluate the R4 tool. Adapted and evaluated a diet formulated with a balanced omega-3\/6 fatty acid ratio, glutamine, and antioxidants in an animal model for pilot study in humans in order to provide neuroprotection against military stressors. Developed molecular pharmacological approaches and novel compounds to mitigate the adverse behavioral effects of traumatic stress. Continued studies focused upon identification of PTSD subtypes, stage of disease progression, and development of associated biomarkers in order to develop a precision medicine approach to PTSD treatment. Initiated studies for enhancing behavioral health treatment engagement, improving provider clinical support tools for return-to-duty decisions and identifying dissemination models for optimal behavioral health provider education."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "870"
                    },
                    "ProjectTitle": {
                        "val": "Dod Med Def Ag Inf Dis"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.457"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "18.457"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20), this Project is being realigned to:\nProgram Element (PE) 0602787A Medical Technology\n* Project MM8 Infectious Diseases and Applied Rsch Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project conducts applied research for medical countermeasures to naturally occurring infectious diseases that pose a significant threat to the operational effectiveness of forces deployed outside the United States. Effective preventive countermeasures (protective\/therapeutic drugs and vaccines and insect repellents and traps) protect the Force from disease and sustain operations by avoiding the need for evacuations from the theater of operations. Diseases of military importance are malaria, bacterial diarrhea, and viral diseases (e.g., dengue fever and hantavirus). In addition to countermeasures, this project funds refinement of improved diagnostic tools to facilitate early identification of infectious disease threats in an operational environment, informing Commanders of the need to institute preventive actions and improve medical care. Major goals are to integrate genomics (deoxyribonucleic acid (DNA)-based) and proteomics (protein-based) as well as other biotechnologies into the refinement of new concepts for vaccine, drug, and diagnostic candidates.\n\nResearch conducted in this Project focuses on the following four areas:\n\n(1)\tPrevention\/Treatment of Parasitic (organisms living in or on another organisms) Diseases\n(2)\tBacterial Disease Threats (diseases caused by bacteria)\n(3)\tViral Disease Threats (diseases caused by viruses)\n(4)\tDiagnostic Systems and Vector Identification and Control\n\nFor the refinement of drugs and biological products, studies in the laboratory and in animal models provide a proof-of-concept for these candidate products, including safety, toxicity (degree to which a substance can damage an organism), and effectiveness, and are necessary to provide evidence to the Food and Drug Administration (FDA) to justify approval for a product to enter into future human subject testing. Additional non-clinical studies are often needed in applied research even after candidate products enter into human testing during advanced technology development, usually at the direction of the FDA, to assess potential safety issues. Drug and vaccine refinement bears high technical risk. Of those candidates identified as promising in initial screens, the vast majority are eliminated after additional safety, toxicity, and\/ or effectiveness testing. Similarly, vaccine candidates have a high failure rate, because animal testing may not be a good predictor of human response, and therefore candidate technologies\/products are often eliminated after going into human trials. Because of this high failure rate, a continuing effort to identify other potential candidates to sustain a working pipeline of countermeasures is critical for replacing those products that fail in testing.\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy.\n\nWork is managed by the United States Army Medical Research and Development Command (USAMRDC) in coordination with the Naval Medical Research Center (NMRC). The Army is responsible for programming and funding all Department of Defense (DoD) naturally occurring infectious disease research requirements, thereby precluding duplication of effort within the Military Departments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Applied Research on drugs and vaccines against parasitic diseases"
                                    },
                                    "Description": {
                                        "val": "This effort assesses and improves on candidate drugs coming from the Department of Defense (DoD) discovery program and from other collaborations for prevention and treatment of malaria; to counter the continuing spread of drug resistance to current drugs; assesses currently available drugs for use against cutaneous leishmaniasis (a skin-based disease transmitted by sand flies) in animal models; and select the most effective and safe candidates for continued refinement and possible clinical testing. This effort also conducts studies to investigate new candidate vaccines for preventing malaria and selects the best candidate(s) for continued refinement. A highly effective vaccine would reduce or eliminate the use of anti-malarial drugs and would minimize the progression and impact of drug resistance to current\/future drugs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.55"
                                            },
                                            "Text": {
                                                "val": "Completed studies in validated animal models to test reformulated triazine lead compound for safety and the dissemination in blood and tissues. These studies were required by FDA to enable oral dosing studies in humans. Completed testing of pyrimidinyl guanidine (a newly discovered family of similar chemical compounds that are active against malaria parasites in experimental animals) and primaquine-like compounds in primate malarias to enable initial human testing. Completed laboratory based analyses of human immune cells from Plasmodium falciparum malaria vaccine trials to enable down selection of a lead vaccine for transition to advanced development. Conducted initial effectiveness trials of potential lead vaccine formulations in primate models of a relapsing malaria, Plasmodium vivax."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Diagnostic Systems and Vector Identification and Control"
                                    },
                                    "Description": {
                                        "val": "This effort designs and prototypes new medical diagnostic and surveillance tools for the field, focusing on bedside and field-deployable diagnostic systems and refines interventions that protect Warfighters from biting insects such as sand flies (transmitters of leishmaniasis) and mosquitoes (transmitters of dengue, Japanese encephalitis, malaria, etc.)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.414"
                                            },
                                            "Text": {
                                                "val": "Further developed and evaluated the capability for fabrics treated with repellants to protect against or resist biting insects and other arthropod vectors. Continued to evaluate multiplexed pathogen detection systems (capable of detecting multiple pathogens at the same time) to screen for priority emerging or re-emerging pathogens."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Viral Threats Research"
                                    },
                                    "Description": {
                                        "val": "This effort designs and tests new vaccine candidates in the laboratory against hemorrhagic fever viruses (i.e., dengue virus, Hantaviruses, Lassa fever virus and Crimean-Congo hemorrhagic fever virus) and assesses other non-vaccine technologies to protect against hemorrhagic fever viruses. Efforts also include establishing and maintaining of clinical trial sites worldwide."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.049"
                                            },
                                            "Text": {
                                                "val": "Sustained field sites as part of ongoing research partner efforts in testing dengue vaccine immunogenicity (ability to provoke an immune response) and effectiveness. Conducted immune cell and antibody assessments in human subjects exposed to dengue by dengue human infection model. Conducted immune cell and antibody assessments in human subjects immunized with purified inactivated virus and live attenuated virus vaccines. Explored multi-agent (combination of two or more molecules capable of inducing an immune response) vaccine concepts e.g., pan-hantavirus vaccine, Rift Valley fever, and Crimean Congo hemorrhagic fever vaccine. A cost saving of $474.52K related to AFIRM from PE 06027878ET4 was reprogrammed to PE 0602787870."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Bacterial Threats"
                                    },
                                    "Description": {
                                        "val": "This effort conducts studies to refine bacterial countermeasures, including vaccine candidates, to prevent diarrhea (most commonly caused by enterotoxigenic E. coli, Campylobacter and Shigella) and scrub typhus (a debilitating mite-borne disease)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.444"
                                            },
                                            "Text": {
                                                "val": "Continued to develop and advance additional vaccine candidates against Shigella, Campylobacter and enterotoxigenic E. coli (ETEC). Continued to down select vaccine candidates for testing in animal models of diarrhea caused by Shigella, Campylobacter and ETEC. Performed an assessment of multivalent (different types) vaccine candidates for Shigella and ETEC in animal models of diarrhea. Produced vaccine candidates for testing in humans using Good Manufacturing Processes. Continued to evaluate the feasibility of clinical field sites for the assessment of vaccine candidates in humans. Continued to maintain the animal model for scrub typhus infection and continued studies on characterization of host-pathogen interactions in these animal models."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "874"
                    },
                    "ProjectTitle": {
                        "val": "Cbt Casualty Care Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.297"
                        },
                        "CurrentYear": {
                            "val": "0.869"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "12.166"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2021 (FY21) this Project is being realigned to: \nProgram Element (PE) 0602787A Medical Technology\n* Project MM4 Cbt Casualty Care Applied Rsch Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "Applied technology development of burn recovery optimization technologies: applied technologies for acute burn treatment that remove dead tissue, prevent infection, and protect the wound from further damage until definitive burn care is available; diagnostic technologies to predict skin graft success or failure, identify patients at heightened risk for scarring, and monitor effectiveness of treatment.\n\nResearch conducted in this Project focuses on the following five areas:\n\n(1)  Damage Control Resuscitation\n(2)  Combat Trauma Therapies\n(3)  Combat Critical Care Engineering\n(4)  Traumatic Brain Injury (TBI)\n(5)  Prolonged Field Care\n\nAll drugs, biological products, and medical devices are refined in accordance with US Food and Drug Administration (FDA) regulations, which govern testing in animals to assess safety, toxicity, and effectiveness and subsequent human subject clinical trials.\n\nPromising efforts identified in this Project are further matured under PE 0603002A (Medical Advanced Technology) \/ Project 840 (Combat Injury Mgmt).\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) Science and Technology focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the US Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Damage Control Resuscitation"
                                    },
                                    "Description": {
                                        "val": "This effort develops and refines knowledge products (such as clinical practice guidelines, manuals, protocols, studies, and media), materials, and systems for control of internal bleeding; minimizing the effects of traumatic blood loss; preserving, storing, and transporting blood and blood products; and resuscitation following trauma."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.15"
                                            },
                                            "Text": {
                                                "val": "Studied new techniques to control bleeding using catheters or other devices that are introduced into damaged blood vessels. Conducted studies of new hemostatic (stops bleeding) dressings to determine if they may be safely left in place on wounds to control bleeding for extended periods of time. Started a new research focus area on endovascular (refers to device that is directly introduced into a major blood vessel) hemorrhage control and resuscitation. Continued development of new technologies for early assessment of blood clot strength. Continued work to investigate drugs and blood products to optimize treatment of impaired blood clotting and destabilized tissues due to traumatic bleeding."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Trauma Therapies"
                                    },
                                    "Description": {
                                        "val": "This effort conducts research to enhance the ability to diagnose, stabilize, and accelerate wound healing and repair of damaged tissue for casualties with severe wounds to the face, mouth and extremities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.002"
                                            },
                                            "Text": {
                                                "val": "Conducted animal studies to assess adverse effects of inflammation factors released in response to blast injury. Examined potential treatments to mitigate adverse effects of hemorrhage resuscitation on severe extremity wounds. Evaluated stem cell therapy and drugs to promote healing in severe extremity injuries. Continued development and testing of combined agents (containing agents to kill bacteria, prevent bacteria from becoming infective, and to control inflammation) to treat contaminated burn wounds. Evaluated multiple burn wound treatment technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.829"
                                            },
                                            "Text": {
                                                "val": "Will develop preclinical models in which to evaluate biomarkers of burn wound severity and healing, and will develop preclinical models in which to evaluate new anti-microbial burn wound therapies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding realigned to Program Element (PE) 0602787A Medical Technology \/ Project MM4 Cbt Casualty Care Applied Rsch Technology."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Critical Care Engineering"
                                    },
                                    "Description": {
                                        "val": "This effort refines diagnostic and therapeutic medical devices as well as associated algorithms, software, and data-processing systems for resuscitation, stabilization, life support, surgical support and preservation of vital organ function that can be applied across the pre-hospital, operational field setting, and initial definitive care facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.097"
                                            },
                                            "Text": {
                                                "val": "Conducted animal studies to determine whether currently used pain-relieving drugs produce detrimental cardiovascular effects during hemorrhage resuscitation. Developed a small animal model of acute kidney injury caused by cessation of kidney blood flow due to severe, prolonged blood loss in which to assess new agents that protect the blood-deprived kidney. Determined the whole-body effects of tourniquet release after prolonged use. Developed and evaluated new technologies that will enable combat medics to provide basic critical care in out-of-hospital settings when medical evacuation is either delayed or prolonged. Continued work to mitigate risk of blood clot formation within the tubing of external life support devices (devices that oxygenate and purify the blood outside of the body) while at the same time allow normal blood clotting to occur in the patient. Continued work to assess physiological responses to airway compromise and to test new airway management techniques."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Traumatic Brain Injury"
                                    },
                                    "Description": {
                                        "val": "This effort supports refinement of drug (includes mature drug technologies and those that are FDA approved for other indications) and therapeutic (i.e., novel use of stem cells or selective brain cooling) strategies to manage TBI resulting from battlefield trauma."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.511"
                                            },
                                            "Text": {
                                                "val": "Evaluated mild TBI treatment strategies using animal models. Completed development of large animal models of TBI and TBI-polytrauma (TBI in combination with severe bleeding and lung and other vital organ injuries). Performed studies to determine which biomarkers effectively indicate whether a particular therapy works and recovery is occurring."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prolonged Field Care"
                                    },
                                    "Description": {
                                        "val": "This effort performs applied research to study the physiological implications of delayed medical evacuation and limited access to definitive surgical care in severely injured casualties"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.537"
                                            },
                                            "Text": {
                                                "val": "Developed and tested animal models of prolonged care for life-threatening extremity injuries and combat casualty injuries leading to kidney failure."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.04"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BS7"
                    },
                    "ProjectTitle": {
                        "val": "Medical Technology (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "13.8"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "13.800"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional Interest Item funding provided for Medical Technology."
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding provided for Medical Technology.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Military Force Vector Borne Health Protection"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Military Force Vector Borne Health Protection"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Heat Stress on Female Soldiers"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "2"
                                        },
                                        "Text": {
                                            "val": "Heat Stress on Female Soldiers"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Burn Patient Transfer System"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "2"
                                        },
                                        "Text": {
                                            "val": "Burn Patient Transfer System"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Musculoskeletal Injury and Bone and Muscle Adaption for Military Physical Training"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4.8"
                                        },
                                        "Text": {
                                            "val": "Musculoskeletal Injury and Bone and Muscle Adaption for Military Physical Training"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ET4"
                    },
                    "ProjectTitle": {
                        "val": "Appl Resch in Clinical and Rehabilitative Medicine"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.705"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "9.705"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20), this Project is being realigned to:\nPE 0602787A Medical Technology\n* Project MN1 Applied Sensory Systems Trauma Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project identifies and evaluates drugs, biologics (products derived from living organisms), medical devices, treatments and diagnostics for post-evacuation restorative, regenerative and rehabilitative care, as well as systems for use by field medics and surgeons for ocular trauma. Research focuses on identifying more effective technologies and protocols to treat ocular injury and visual system dysfunction, as well as laboratory and animal studies for regenerating skin, muscle, nerves, vascular and bone tissues for the care and treatment of traumatic injury. Research involves extensive collaboration with multiple academic institutions to refine treatments for combat wounds through the Armed Forces Institute of Regenerative Medicine (AFIRM). This Project is coordinated with the Military Departments, Defense Health Agency, and other government organizations to avoid duplication. Research conducted in this Project focuses on Clinical and Rehabilitative Medicine and Battlefield Pain Management.\n\nAll drugs, biological products, and medical devices are refined in accordance with Food and Drug Administration (FDA) regulations, which govern testing in animals to assess safety, toxicity, and effectiveness and subsequent human subject clinical trials.\n\nPromising efforts identified in this project are further matured under PE 0603002A (Medical Advanced Technology) \/ Project ET5 (Adv Tech Dev in Clinical & Rehabilitative Medicine).\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Clinical and Rehabilitative Medicine"
                                    },
                                    "Description": {
                                        "val": "This effort conducts laboratory and animal studies for the purpose of regenerating and restoring traumatically-injured tissues, including skin, muscle, nerve, bone tissue, and the ocular system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.32"
                                            },
                                            "Text": {
                                                "val": "Continued to optimize the preclinical design of a novel ocular medical device designed to deliver therapeutics, protect, and preserve vision post-injury. Advanced evaluations of stem-cell based therapies to regenerate damaged eye tissues into pre-clinical animal testing. Utilized intra-eye large animal drug delivery system to deliver and evaluate effectiveness of nerve therapeutics to preserve and regenerate injured optic nerves. Continued to conduct pre-clinical safety and effectiveness testing of an eye bandage with therapeutics to optimize vision restoration post-injury. Continued to develop and evaluate methods for enhancing skin substitute performance for improvement of skin function following burns and loss from trauma. Continued the examination of pharmacologic (drug) treatments to prevent scarring from deep partial-thickness burns. Examined the effectiveness of treatment methodologies for large volume muscle loss to restore muscle form and function. Continued to develop devices and biologics for regeneration or restoration of genital and urinary tissues lost or damaged due to traumatic injury. Initiated research in support of the discovery and validation of novel biomarkers for pain outcomes, diagnosis and efficacy of treatment. A cost saving of $474.52K related to AFIRM from PE 06027878ET4 was reprogrammed to PE 0602787870."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlefield Pain Management"
                                    },
                                    "Description": {
                                        "val": "This effort performs applied research in laboratory and animal studies to develop novel, non-opioid drugs to treat pain in the austere battlefield environment with minimal side effects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.385"
                                            },
                                            "Text": {
                                                "val": "Conducted animal studies to investigate the role of ion channel receptors and pain signaling; developed peripheral nerve or antagonist analgesics to preserve the fighting force and maximize pain relief from combat wounds in austere and prolonged care environments while minimizing adverse side effects such as tolerance, dependence and chronification (occasional\/intermittent pain that progresses to a chronic state) of acute pain."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MK4"
                    },
                    "ProjectTitle": {
                        "val": "Warfigher Health Applied Rsch Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "38.392"
                        },
                        "BudgetYearOne": {
                            "val": "29.843"
                        },
                        "BudgetYearOneBase": {
                            "val": "29.843"
                        },
                        "BudgetYearTwo": {
                            "val": "30.441"
                        },
                        "BudgetYearThree": {
                            "val": "37.412"
                        },
                        "BudgetYearFour": {
                            "val": "38.179"
                        },
                        "BudgetYearFive": {
                            "val": "39.818"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "214.085"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20), this Project is being realigned from:\nProgram Element (PE) 0602787A Medical Technology\n* Project 869 Warfighter Health Prot & Perf Stnds"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project conducts research to prevent and protect Warfighters from training and operational injuries; refine mechanisms for detection of physiological (human physical and biochemical function) and psychological (mental) health problems; reduce the effects of trauma and promote rapid recovery from acute stress in far forward operational environments; evaluate hazards to head, neck, spine, eyes, and ears; set the standards for rapid return to duty; and determine new methods to sustain and enhance performance and readiness across the operational spectrum. This research provides medical information important to the design and operational use of military systems, and this work forms the basis for behavioral, training, and nutritional interventions.\n\nThe four main areas of study are:\n(1)\tPhysiological Health and Performance\n(2)\tEnvironmental Health and Protection\n(3)\tInjury Prevention and Reduction\n(4)\tPsychological Health and Resilience\n\nThis effort is coordinated with and complimentary to work done in PE 0602143A Soldier Lethality Technology and PE 0603118A Soldier Lethality Advanced Technology.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project is performed by the United States Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Physiological Health and Performance"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates methods for managing and controlling the effects of fatigue on Soldier operational performance and the impact of nutritional strategies to optimize operational performance. Efforts will also contribute to new high-priority medical investments in human biomedical performance enhancement and medical aspects of manned-unmanned machine teaming (MUM-T)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.92"
                                            },
                                            "Text": {
                                                "val": "Will characterize effects of nutritional energy balance on inflammatory response. Will refine understanding of the environmental influences on eating behavior, to include extreme environmental influences such as heat, cold and altitude. Will determine effects of protein source on protein kinetics and muscle growth and strength. Will evaluate scheduling and fatigue management tools for rotary-wing aviation. Will refine models of aviator risks during Degraded Visual Environment (DVE) operations as a function of neurosensory limitations and physiological condition. Will evaluate degraded Army Manned-Unmanned Teaming operator performance through characterization of medical and work requirements, under operational stressors. Will characterize predictors of resilience during United States Army Special Forces training. Will evaluate exogenous testosterone for maintenance of physiological and psychological performance under conditions of medically relevant hypogonadism (a failure of the gonads, testes in men and ovaries in women, to function properly) induced by high operational tempo military activity. Will provide medical and Solider integration criteria for single-joint exoskeleton to enhance Soldier physical performance in military operations. Will evaluate the effectiveness of slow wave sleep (SWS) augmentation via acoustic stimulation (AS) for enhancing tactical performance and reducing sleepiness during a subsequent period of sustained wakefulness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.402"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.402"
                                            },
                                            "Text": {
                                                "val": "Expeditionary Force Nutrition to Improve Performance ($2.012M)\n? Will evaluate the effects of nutritional energy balance on inflammatory response. \n? Will refine understanding of the environmental influences on eating behavior, to include extreme environmental influences such as heat, cold and altitude. \n? Will evaluate the effects of protein source in protein kinetics and muscle growth and strength.\n\nMedical Interventions to Reduce Impact of Fatigue on Performance ($5.356M)\n? Will develop a demonstration of the effectiveness of electrical stimulation of the brain for enhancing learning through the consolidation of emotional memories. \n? Will evaluate the effectiveness of SWS augmentation via AS for enhancing tactical performance and reducing sleepiness during a subsequent period of sustained wakefulness.\n\nBiomedical Performance Enhancement ($6.961M) \n? Will evaluate drug-delivered testosterone for maintenance of physiological and psychological performance under conditions of medically relevant hypogonadism (a failure of the gonads, testes in men and ovaries in women, to function properly) induced by high operational tempo military activity. \n? Will provide medical and Soldier integration criteria for single-joint exoskeleton to enhance Soldier physical performance in military operations. \n? Will evaluate pharmacological strategies for improving Soldier endurance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decrease as a result of project realignment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Health and Protection"
                                    },
                                    "Description": {
                                        "val": "This effort involves applied research addressing the physiological (human physical and biochemical functions) mechanisms of exposure to extreme heat, cold, altitude, and other environmental stressors. This effort establishes scientific evidence for specific and sensitive diagnostics of exertional heat illness to optimize Soldier performance in austere environments. This effort also supports and matures non-invasive technologies, decision-aid tools, and models to enhance Soldier protection and sustainment across the operational spectrum. This effort provides the scientific basis for developing focused heating and cooling solutions to maintain fine motor dexterity, core temperature, and optimize physical and cognitive performance during cold- weather and hot-humid operations. This effort will develop knowledge and materiel solutions that enable Soldier individualized metabolic assessments and optimization during training and operations."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.925"
                                            },
                                            "Text": {
                                                "val": "Will evaluate human performance in heat, cold and altitude studies which provide physiological monitoring data for algorithms for an integrated Soldier sensor system to sustain lethality, optimize performance, and improve health and readiness. Will evaluate strategies to improve Soldier health, readiness and mission performance through interventions designed to prevent injuries which result from multi-environmental stressors. Will evaluate interventions to reduce environmental injuries in the heat and cold weather operations. Will develop physiologically based algorithm to detect organ and system toxicity post chemical exposure. Will develop physiologically based algorithm to monitor Soldier performance after exposure to toxic chemicals or hazardous materials. Will develop tools that sustain lethality, improve health, and optimize performance to reduce injuries following exposures to heat, cold, terrestrial altitude and toxic chemicals and hazardous materials for squad leaders and mission planners."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.529"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.529"
                                            },
                                            "Text": {
                                                "val": "Operational Risk Planning Tools for Battlefield Environmental Threats ($2.773M)  \n? Will predict, protect, and enhance performance of the Soldier operating in dense urban and subterranean environments, with a focus on respiratory threats, mental and physical performance, and survivability. \n? Will develop studies exposing zebrafish to low oxygen conditions, altered temperatures, and psychological stressors (e.g., predator exposure) to evaluate the potential effectiveness of pharmaceutical interventions to optimize performance. \n? Will develop an immersive screening task that, in combination with select measures, will be utilized as screening tool for predicting individuals likely to experience impairment. \n? Will develop tools to assess medical effects for using personal protective equipment in dense urban and subterranean environments to prevent degraded physical and cognitive performance.\n\nPrevention of Soldier Performance Degradation in Extreme Environments (4.687M) \n? Will evaluate human performance in heat, cold and altitude studies which provide physiological monitoring data for algorithms for an integrated Soldier sensor system to sustain lethality, optimize performance, and improve health and readiness. \n? Will evaluate strategies to improve Soldier health, readiness and mission performance through interventions designed to prevent injuries that result from multi-environmental stressors. \n? Will evaluate interventions to reduce environmental injuries in the heat and cold weather operations. \n? Will refine and develop tools that sustain lethality, improve health, and optimize performance to reduce injuries following exposures to heat, cold, terrestrial altitude for squad leaders and mission planners."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase a result of project realignments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the Army's number one priority of readiness by improving musculoskeletal injury prevention efforts as well as contributing to preparing Soldiers for potential threats (e.g., directed energy) in and developing capabilities for the multi domain operations environment. It evaluates and assesses the effects of repetitive motion during military operations and training on the human body; provides mathematical models to predict the likelihood of physical injuries following continuous operations and muscle fatigue; evaluates current standards for return-to-duty; and establishes improved medical test methods with the goal of rapid return to duty of Soldiers following injury. This effort also develops prevention-based strategies and medically-based injury criteria for hearing, vestibular (sensory system supporting movement and sense of balance, located in the inner ear), and ocular\/facial protection devices; develops and evaluates neurosensory operational risk factors; develops medically based guidelines to assess neurosensory performance and models the effects of acoustic and impact trauma as stressors on vision and hearing. Efforts will investigate the medical aspects of manned unmanned teaming (MUM-T) and medical aspects of and protection against directed energy."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.224"
                                            },
                                            "Text": {
                                                "val": "Will continue to develop injury based head supported mass criteria, behind helmet blunt trauma, behind armor blunt trauma, and blast exposure injury criteria in order to inform next generation integrated head protection systems, vital torso protection systems, and the next generation bomb suit (program of record). Will develop military relevant fitness and return to duty standards for combat Military Occupational Specialties (MOSs). Will continue to develop medical standards for directed energy threats and develop computational models that will predict organ injury severity and systemic pathological effects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.17"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.17"
                                            },
                                            "Text": {
                                                "val": "Physical Fitness Standards to Prevent Musculoskeletal Injuries ($1.248M)\n? Will administer field expedient physical performance tests (PPTs) known to be predictive of performance of common Soldier tasks to Soldiers following lower extremity musculoskeletal injuries. \n? Will compare PPT data to known reference values to assess readiness for return to duty (RTD). \n? Will use data to assess the prognostic accuracy of PPTs in determining Soldier progression from initial injury to readiness for RTD.\n\nLeader Tools to Reduce Musculoskeletal Injury in all Settings ($2.552M) \n? Will establish and publish modifiable and non-modifiable factors that impart resilience or contribute to risk for stress fracture and other musculoskeletal injury development during Basic Combat Training (BCT).\n\nLeader Decision Aids to Manage Blast Head Injury in All Settings ($0.286M) \n? Will determine an objective blood-based biomarker of cognitive status from field studies of blast overpressure and head impact exposures in various heavy weapons military training environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decrease a result of project realignment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health and Resilience"
                                    },
                                    "Description": {
                                        "val": "This effort refines and evaluates tools and early interventions to prevent and reduce the impact of military stressors and combat-related exposures on behavioral health problems, including symptoms of post-traumatic stress disorder (PTSD), depression, anger problems, anxiety, substance abuse, suicide, and other health risk behaviors. This effort assesses and refines tools and interventions to enhance and sustain psychological resilience throughout Soldiers' careers. Efforts also address the health and well-being of families."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.506"
                                            },
                                            "Text": {
                                                "val": "Will continue to assess and characterize risk and resilience markers for Soldiers' psychological and behavioral health. Will identify objective molecular markers for PTSD and PTSD subtypes, treatment response, and return to duty status.  Will continue evaluating candidate compounds for treatment of PTSD symptoms through use of a laboratory maintained PTSD animal model. Will develop and test a provider tool kit for standardizing behavioral health provider determinations of Service Members? return to duty status.  Will identify and adapt suitable brief acute stress interventions for use in a far-forward setting.  Will determine optimal dosing of Cognitive Bias Modification Training, a computerized treatment that reduces specific cognitive biases (e.g., anxiety-sensitivity, threat, and anger). Will continue to develop and refine evidence-based individual (e.g., self-distancing education, emotion regulation, leadership training) and team-level (e.g., regulation of small-team dynamics) interventions that positively influence behavioral health, resilience, and unit readiness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.742"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.742"
                                            },
                                            "Text": {
                                                "val": "Optimal Delivery of Far Forward Psychological Health Care ($1.835M) \n? Will develop content and products to deliver behavioral health services oriented to far forward operational settings for the promotion of rapid recovery from acute stress and other behavioral health issues. \n? Will develop readiness tools and recommendations to assist in behavioral health readiness decisions made by unit leaders and medics. \n? Will develop clinical practice guidelines medics will follow to address the core behavioral health problems encountered in far-forward settings. \n? Will develop neurocognitive optimization and enhancement tools to mitigate health and performance decrements during and following stress exposure (i.e., point of psychological injury).\n\nUnit-Level Psychological Interventions to Enhance Performance ($1.823M) \n? Will develop and evaluate next-generation bystander intervention training to increase unit member response to high-risk behaviors. ? Will determine how transition points place Soldiers at risk. \n? Will conduct assessment of Security Forces Assistance Brigades. \n? Will develop a method for assessing military-relevant moral injury concerns. \n? Will establish components for enhancing behavioral health leadership skills and develop new training."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decrease a result of project realignment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.817"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MM4"
                    },
                    "ProjectTitle": {
                        "val": "Cbt Casualty Care Applied Rsch Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "17.909"
                        },
                        "BudgetYearOne": {
                            "val": "19.424"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.424"
                        },
                        "BudgetYearTwo": {
                            "val": "20.549"
                        },
                        "BudgetYearThree": {
                            "val": "21.025"
                        },
                        "BudgetYearFour": {
                            "val": "22.541"
                        },
                        "BudgetYearFive": {
                            "val": "22.547"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "123.995"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned from:\nProgram Element (PE) 0602787A Medical Technology\n* Project 874 Cbt Casualty Care Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project refines and assesses concepts, techniques, and materiel that improve survivability and treatment outcomes for Warfighters wounded during combat operations and treated under austere field conditions, including prolonged field care, and during medical evacuation. Combat casualty care research addresses control of severe bleeding; resuscitation and stabilization; advanced automated life support systems suitable for use in forward areas, treatment of severe orthopedic injuries, treatment of severe burns, and combat-related brain injury.\n\nPromising efforts identified in this Project are further matured under PE 0603002A (Medical Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Unites States Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Damage Control Resuscitation"
                                    },
                                    "Description": {
                                        "val": "This effort develops and refines knowledge products (such as clinical practice guidelines, manuals, protocols, studies, and media), materials, and systems for control of internal bleeding; minimizing the effects of traumatic blood loss; preserving, storing, and transporting blood and blood products; and resuscitation following trauma."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.917"
                                            },
                                            "Text": {
                                                "val": "Will conduct studies to model optimal treatment for acute traumatic coagulopathy (bleeding disorder) using blood products and drugs.  Will conduct studies of new platelet preservative solutions to determine ability to rejuvenate platelets during storage. Will develop assays to characterize stem cell effectiveness for trauma care."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Work continues under this same project under program title \"Blood and Blood Products.\""
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Trauma Therapies"
                                    },
                                    "Description": {
                                        "val": "This effort conducts research to enhance the ability to diagnose, stabilize, and accelerate wound healing and repair of damaged tissue for casualties with severe burn, facial or extremity wounds."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.265"
                                            },
                                            "Text": {
                                                "val": "Will conduct studies to determine the impact of immune response and life-saving interventions on healing of extremity wounds.  Will characterize burn wound fluid proteins to identify potential candidate biomarkers that signal adequacy of wound healing in preclinical animal models. Will evaluate alternative anti-infective\/anti-inflammation drugs in animal wound models. Will study technological approaches for diagnosis and treatment of sepsis (life-threatening organ dysfunction caused by the body?s dysregulated response to infection) in a prolonged field care environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This work continues under program titled \"Severe Burns\" under this same project. Decrease due to realignment of previous Combat Trauma Therapies sub-research areas, with the exception of Severe Burns, to new Prolonged Care research area under this same project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pre-Hospital Tactical Combat Casualty Care"
                                    },
                                    "Description": {
                                        "val": "This effort refines diagnostic and therapeutic medical devices, drugs, and new clinical practices for resuscitation, stabilization, and preservation of vital organ function that can be applied by combat medical personnel in the pre-hospital combat setting."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.866"
                                            },
                                            "Text": {
                                                "val": "Will determine whether current battlefield analgesics (pain relief drugs) produce detrimental cardiovascular effects during hemorrhage.  Will determine the systemic effects of tourniquet release after prolonged use and identify potential therapeutic targets."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This work continues under program titled \"Tactical Combat Casualty Care\" under this same project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Traumatic Brain Injury (TBI)"
                                    },
                                    "Description": {
                                        "val": "This effort supports refinement of drug (includes mature drug technologies and those that are Food and Drug Administration [FDA] approved for other indications) and therapeutic (i.e., novel use of stem cells or selective brain cooling) strategies to manage TBI resulting from battlefield trauma."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.36"
                                            },
                                            "Text": {
                                                "val": "Will complete animal studies examining neurotherapeutic resuscitation strategies for TBI with polytrauma (injuries to multiple body parts and organ systems). Will complete brain imaging studies using positron emission tomography.  Will begin studies evaluating correlative relationships between TBI-induced non-convulsive seizures, TBI-specific biomarkers, and TBI clinical outcomes.  Will complete small animal studies evaluating potential beneficial effects of resuscitative endovascular occlusion of the aorta in TBI with polytrauma (will elevate to large animal TBI model if indicated)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Work continues under program title \"Brain Trauma\" under the same project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prolonged Care"
                                    },
                                    "Description": {
                                        "val": "This effort performs applied research to study the physiological implications of delayed medical evacuation and limited access to definitive surgical care in severely injured casualties."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.279"
                                            },
                                            "Text": {
                                                "val": "Will develop animal models of machine perfusion of vascularly isolated limbs that can be used to evaluate oxygen carrying solutions for limb preservation during extended tourniquet application. Will conduct large animal studies of stem cell products to treat acute respiratory distress syndrome. Will develop and test automated control for partial resuscitative endovascular balloon occlusion of the aorta during application of prolonged cardiovascular support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.186"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.186"
                                            },
                                            "Text": {
                                                "val": "Battlefield sustainment of critical organ function cap set 1 ($3.521M) \n? Will perform large animal studies of stem cell products to treat acute respiratory distress syndrome. \n\nFuture en Route Casualty Care Sustainment System Cap Set ($1.678M)  \n? Will assess biological effects and safety of new extracorporeal life support technologies (medical devices situated external to the body that provide prolonged organ support in casualties whose vital organs are, due to illness or injury, unable to sustain life).  \n\nModular and Automated Battlefield Sustainment of Critical Organ Function Cap Set 2 ($0.880M) \n? Will develop sepsis prediction and prolonged field care decision support system. \n\nLimb Function Repair and Return to Combat Duty ($0.571M) \n? Will evaluate technologies to preserve injured limb tissues and function under prolonged field care conditions. \n\nField Stabilization of Preparation of Evac ($0.493M) \n? Will evaluate drug and biological compounds to improve extremity wound healing. \n? Will begin evaluation of litter carriage performance and post-carry fatigue effects in prolonged field care environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decrease based on level of effort required."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blood and Blood Products"
                                    },
                                    "Description": {
                                        "val": "This effort develops and refines knowledge products (such as clinical practice guidelines, manuals, protocols, studies, and media), materials, and systems for control of internal bleeding and mitigation of shock; minimizing the effects of traumatic blood loss; preserving, storing, and transporting blood and blood products."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.969"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.969"
                                            },
                                            "Text": {
                                                "val": "Synthetic Blood Replacement ($0.987M)\n? Will study use of whole blood as treatment for acute traumatic coagulopathy (blood clotting disorder). \n\nNext Generation Human-Derived Blood Replacement ($3.949M) \n? Will identify new efficacious preservative solutions for platelets and whole blood. \n? Will begin study of cellular therapies for treatment of acute radiation sickness combined with traumatic injury."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This work continues under this same project from previous title \"Damage Control Resuscitation.\" Funding increase a result of level of effort required."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Severe Burns"
                                    },
                                    "Description": {
                                        "val": "This effort conducts research to enhance the ability to treat acute severe burns at or near the point of injury; protect burn wounds from further injury, infection and inflammation, especially when definitive surgical burn wound care is delayed or unavailable; and accelerate wound healing and return to combat duty."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.883"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.883"
                                            },
                                            "Text": {
                                                "val": "Rapid Burn Injury Treatment and Return to Duty Cap Set 1 ($2.272M) \n? Will assess novel technologies to prevent burn progression in casualties treated in far forward environments. \n? Will develop new severe burn animal models in which to assess new burn treatments along with technologies that quantify burn wound healing rate and measure effectiveness of treatment.\n\nNext Generation Rapid Burn Injury Treatment and Return to Duty Cap Set 2 ($0.568M)\n? Will develop new treatment approaches to protect burn wounds, prevent infection and inflammation, accelerate healing and restore function."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to realignment of previous Combat Trauma Therapies sub-research areas, with the exception of Severe Burns, to new Prolonged Care research area."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Combat Casualty Care"
                                    },
                                    "Description": {
                                        "val": "This effort refines diagnostic and therapeutic medical devices, drugs, and new clinical practices for hemorrhage control, resuscitation, stabilization, and preservation of vital organ function that can be immediately applied by combat medical personnel in the pre-hospital combat setting."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.153"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.153"
                                            },
                                            "Text": {
                                                "val": "Advanced Tactical Combat Casualty Stabilization System Cap Set 2 ($0.423M)\n? Will examine therapeutic approaches to preserving kidney function following crush injuries. \n\nTactical Combat Casualty Stabilization System Cap Set 1 ($1.690M)\n? Will evaluate catheter-based techniques to control non-compressible hemorrhage. \n? Will characterize new animal pain models."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY21, this work is a continuation of work done under the previous title, \"Pre-Hospital Tactical Combat Casualty Care\",  under the same project. The funding increase is a result of project realignment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Brain Trauma"
                                    },
                                    "Description": {
                                        "val": "This effort supports refinement of drug (includes mature drug technologies and those that are FDA approved for other indications) and therapeutic strategies to manage brain injury resulting from battlefield trauma."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.233"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.233"
                                            },
                                            "Text": {
                                                "val": "Drugs to Prevent and Treat Brain Injury ($1.751M) \n? Will perform applied research on nanoparticles to evaluate their use as a drug delivery vehicle. \n? Will study therapies that enhance inherent brain healing abilities. \n? Will evaluate nicotine as a potential neuroprotective drug.\n\nAdvanced Medic Brain Injury Diagnostic and Treatment System ($0.438M) \n? Will study correlative relationships between brain injury-induced non-convulsive seizures, brain injury-specific biomarkers, and clinical outcomes."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to allocation of additional funds for study of novel drug delivery platforms."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.222"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MM6"
                    },
                    "ProjectTitle": {
                        "val": "Medical Technologies to Support Dispersed Ops Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "12.109"
                        },
                        "BudgetYearOne": {
                            "val": "14.417"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.417"
                        },
                        "BudgetYearTwo": {
                            "val": "12.94"
                        },
                        "BudgetYearThree": {
                            "val": "14.257"
                        },
                        "BudgetYearFour": {
                            "val": "14.016"
                        },
                        "BudgetYearFive": {
                            "val": "13.001"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "80.740"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned from:\nProgram element (PE) 0602787A Medical Technology\n* Project XV5 Medical Capabilities to Support Dispersed Ops"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project supports two task areas: 1) Medical Robotic and Autonomous Systems (Med-RAS) focused on developing the ability to deliver emergency resupply of Medical material by ground or air, such as blood products, and, utilization of autonomous platforms to perform medical treatment and medical evacuations in dispersed and multi-domain battle environments. Enables teaming to deliver medical care, and establish medical performance criteria to ensure Soldiers have the physiological, cognitive, and psychological capacity to perform man-machine teaming; and, 2) Virtual Health to enable prolonged care and deciding faster by exploiting emerging communications and information technology for remote telemonitoring and telementoring between providers in Roles of Care 3 and 4 to patients in Roles of Care 1 and 2. \n\nPromising work in this Project will be further matured in PE 0603002A (Medical Advanced Technology) \/ Project MM7 (Enabling Med Cap to Support Dispersed OPS Adv Tech).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project is performed by the United States Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Medical Robotic and Autonomous Systems (Med-RAS)"
                                    },
                                    "Description": {
                                        "val": "Research, design, and prototype autonomous and unmanned capabilities to deliver high quality combat casualty care in dispersed operations with limited or absent medical care personnel, and future medical robotic systems capable of providing autonomous combat casualty care while optimizing the medical logistic footprint in far-forward and dispersed geographic environments in support of the Army Multi-Domain Operations concept and the Army Force 2025 and Beyond vision."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.852"
                                            },
                                            "Text": {
                                                "val": "Will research the design of robotic systems, including physical interfaces and hardware configurations, to effectively implement and control resuscitation and critical care procedures driven by artificial intelligence (AI) and machine learning.   Will explore the feasibility of using robotic perception systems to detect and visualize combat casualties for autonomous treatment & extraction.  Will research methods for integrating medical systems with emerging unmanned aerial system (UAS) platforms that address patient transport safety concerns, reliability of medical systems in flight, and low-bandwidth and cyber-secure transmission of medical data. Will design and prototype a medic?s AI assisted decision support system using lightweight ruggedized patient monitoring devices, hands-free input of medic observations, and approved joint tactical combat casualty\/prolonged field care guidelines as inputs to provide first responders at the point of injury with adaptive treatment and patient disposition recommendations in the absence of reach-back capabilities for remote telementoring.  Will research and design autonomy-based countermeasures to signal latency and constrained bandwidth capabilities for conducting tele-robotic surgical tasks and  procedures in low-comms environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.904"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.904"
                                            },
                                            "Text": {
                                                "val": "Medical Robotic and Autonomous Systems (Med-RAS) ($9.828M)\n? Will design medical robotic systems, including physical interfaces and hardware configurations, for procedures driven by AI and Machine Learning (ML) by: 1) refining polytrauma protocols for animals, 2) conducting human stress testing in a Lower Body Negative Pressure (LBNP) chamber, and 3) performing lab testing of ?soft? robotic noninvasive sensing, force feedback control, needle insertion, patient immobilization, and airway access and insertion. \n? Will expand methods for integrating medical systems with unmanned aerial system (UAS) platforms that address patient transport safety concerns, reliability of medical systems in flight, and low-bandwidth and cyber-secure transmission of medical data by 1) testing the patient simulator system on board a unmanned aerial vehicle (UAV) research platform and 2) prototyping and flight testing various communication architectures for closed-loop and tele-operated patient support systems. \n? Will refine and further develop Prolonged Field Care guidelines for a prototype AI assisted Decision Support System (DSS). Based on previous year?s research, develop strategies to implement 1) predictive patient state algorithms, 2) ML capabilities to continually improve recommendations, and 3) automated patient encounter and medic interventions through speech to text technologies. \n? Will expand research and design of autonomy-based countermeasures to signal latency and constrained bandwidth capabilities for conducting tele-robotic tasks by: 1) integrating force\/torque sensing capabilities with the robotic vision system, and 2) designing semi-autonomous surgical protocols.\n? Will design layout of a ?CASEVAC kit? subsystem of the Combat Medical Mission Module (CEMM) based on new en route care technologies to include: 1) remotely operated, or semi-autonomous\/closed-loop intervention and patient management systems, and 2) enabling medical communications systems and telehealth\/Virtual Health and 3) creating computer-aided design (CAD) models and constructing mock-up models."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase due to additional MedRAS investments in autonomous casualty management, robotic perception for combat casualty care, and telesurgical robotic networks."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Virtual Health"
                                    },
                                    "Description": {
                                        "val": "Develop future Virtual Health enterprise process architectures and integrated physical solutions capable of supporting prolonged field care in conditions with limited or lacking traditional field communications."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.894"
                                            },
                                            "Text": {
                                                "val": "Will research and validate models of novel Virtual Health (VH) enterprise process architectures to provide new intersections of health information and knowledge far forward to support the Multi-Domain Operations. Will research and validate models for the Virtual Health support and integration with autonomous (real time) and\/or semi-autonomous patient care capabilities. Will research and validate means to leverage contemporary VH data components to drive future semi-autonomous and autonomous VH system support tools. Will determine strategies for future linkages between the tactical environment and garrison based VH functions. Will determine novel strategies to identify VH consultants based on both availability and proximity to the VH needs. Will explore strategies for VH solutions that align with best practices to counteract threats from electronic warfare (EW). Will explore mechanisms to streamline the engagement with VH solutions by clinical end users in the operational environment. Will research and develop strategies and mechanisms to provide VH solutions when an established synchronous VH consultation is disrupted due to communication failure\/outages to include, but not limited to, closed loop systems and machine learning techniques."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.513"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.513"
                                            },
                                            "Text": {
                                                "val": "Virtual Health Applications For Multi Domain Operational Environments ($4.438M)\n? Will research and validate enterprise architectures for the Virtual Health support and integration with autonomous (real time) and\/or semi-autonomous patient care capabilities. \n? Will expand research and validate means to leverage contemporary VH data components to drive future semi-autonomous and autonomous VH system support tools. \n? Will explore strategies for VH solutions that align with best practices to counteract threats from electronic warfare (EW). \n? Will expand mechanisms to streamline the engagement with VH solutions by clinical end users in the operational environment. \n? Will expand research mechanisms to provide VH solutions when an established synchronous VH consultation is disrupted due to communication failure\/outages to include, but not limited to, closed loop systems and machine learning techniques."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase due to level of effort required."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.363"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MM8"
                    },
                    "ProjectTitle": {
                        "val": "Infectious Diseases and Applied Rsch Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "21.661"
                        },
                        "BudgetYearOne": {
                            "val": "24.851"
                        },
                        "BudgetYearOneBase": {
                            "val": "24.851"
                        },
                        "BudgetYearTwo": {
                            "val": "25.459"
                        },
                        "BudgetYearThree": {
                            "val": "25.021"
                        },
                        "BudgetYearFour": {
                            "val": "24.603"
                        },
                        "BudgetYearFive": {
                            "val": "24.61"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "146.205"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned from:\nProgram Element (PE) 0602787A Medical Technology\n* Project 870 DoD Med Def Ag Inf Dis"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project conducts applied (pre-clinical) research for medical countermeasures to prevent naturally occurring infectious diseases that impact operational readiness. The Project builds on basic research to optimize lead countermeasures and determines their safety and efficacy in animal models of infection. Effective preventive countermeasures protect the Warfighter from disease and sustain readiness and operations. Infectious disease threats from parasitic diseases, bacterial diseases, and viral diseases are high priorities for military operations.\n\nResearch conducted in this project focuses on the following three areas:\n\n(1)\tParasitic Diseases\n(2)\tBacterial Diseases\n(3)\tViral Diseases\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy.\n\nWork is managed by the United States Army Medical Research and Development Command (USAMRDC) in coordination with the Naval Medical Research Center (NMRC). The Army is responsible for programming and funding all Department of Defense (DoD) naturally occurring infectious disease research requirements, thereby precluding duplication of effort within the Military Departments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Applied research on drugs and vaccines against parasitic diseases"
                                    },
                                    "Description": {
                                        "val": "Develop and validate malaria preclinical animal models.  Demonstrate and optimize prophylactic safety and efficacy in validated malaria preclinical animal models.  Down-select lead malaria prophylactic candidates for use in human clinical trials."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.981"
                                            },
                                            "Text": {
                                                "val": "Will complete studies in validated animal models to test reformulated triazine lead compound for safety and the dissemination in blood and tissues. These studies are required by the United States Food and Drug Administration (FDA) to enable oral dosing studies in humans. Will complete testing of pyrimidinylguanidine (a newly discovered family of similar chemical compounds that are active against malaria parasites in experimental animals) and primaquine-like compounds in primate malarias to enable initial human testing. Will complete laboratory based analyses of human immune cells and antibodies from Plasmodium falciparum malaria vaccine trials to enable down selection of a lead vaccine for transition to advanced development. Will conduct initial effectiveness trials of potential lead vaccine formulations in primate models of a relapsing malaria, Plasmodium vivax."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.706"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.706"
                                            },
                                            "Text": {
                                                "val": "Prevention and Treatment of Parasitic Diseases ($13.621M) \n? Will perform test tube and\/or cell-based studies to optimize and select the next lead prophylactic and\/or treatment candidate for prevention and treatment of malaria. \n? Will develop, assess and validate performance parameters of a mouse and\/or non-human primate malaria efficacy models. \n? Will evaluate the safety and efficacy of lead candidates in validated malaria animal models. \n? Will assess technologies for extended release that provides long-term prophylaxis."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Applied Research to Prevent Viral Diseases"
                                    },
                                    "Description": {
                                        "val": "Develop and validate viral disease preclinical animal models.  Demonstrate and optimize prophylactic safety and effectiveness in validated viral disease preclinical animal models.  Down-select lead viral disease prophylactic candidates for use in human clinical trials."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.525"
                                            },
                                            "Text": {
                                                "val": "Will continue to sustain field sites as part of ongoing research partner efforts in testing dengue vaccine immunogenicity (ability to provoke an immune response) and effectiveness. Will continue to conduct immune cell and antibody assessments in human subjects exposed to dengue by dengue human infection model. Will continue to conduct immune cell and antibody assessments in human subjects immunized with purified inactivated virus and live attenuated virus vaccines. Will continue to explore multi-agent (combination of two or more molecules capable of inducing an immune response) vaccine concepts e.g., pan-hantavirus vaccine, Rift Valley fever, and Crimean Congo hemorrhagic fever vaccine."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.072"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.072"
                                            },
                                            "Text": {
                                                "val": "Prevention and Treatment of Viral Diseases ($5.986M) \n? Will perform test tube and\/or cell-based studies to optimize and select the next lead prophylactic and\/or treatment candidate for prevention and treatment of viral diseases. \n? Will develop, assess and validate performance parameters of animal efficacy models of viral diseases. \n? Will evaluate the safety and efficacy of lead candidates in validated viral diseases animal models. \n? Will assess technologies for extended release that provides long-term prophylaxis."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase in funding reflecting level of effort required."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Applied Research to Prevent Bacterial Diseases"
                                    },
                                    "Description": {
                                        "val": "Optimize antigens and platforms for use in animal studies.  Evaluate bacterial diarrheal vaccine candidates for safety, effectveness, and immunogenicity in animal models to advance to human clinical trials (ETEC, Shigella and Campylobacter). Examine host\/pathogen\/vector interactions for scrub typhus and other Rickettsial diseases."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.731"
                                            },
                                            "Text": {
                                                "val": "Will continue to develop and advance existing vaccine candidates against ETEC, Shigella and Campylobacter. Will continue to down select vaccine candidates for testing in animal models of diarrhea caused by ETEC, Shigella and Campylobacter. Will perform an assessment of multivalent (different types) vaccine candidates for ETEC, Shigella and Campylobacter in animal models of diarrhea. Will produce vaccine candidates for testing in humans using Good Manufacturing Processes. Will continue to evaluate the feasibility of clinical field sites for the assessment of vaccine candidates in humans. Will continue to maintain DoD subject matter expertise and laboratory capability in Rickettsiology to effectively detect, diagnose and treat rickettsial disease."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.073"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.073"
                                            },
                                            "Text": {
                                                "val": "Prevention and Treatment of Bacterial Diseases ($4.986M)\n? Will perform test tube and\/or cell-based studies to optimize and select the next lead prophylactic and\/or treatment candidate for prevention and treatment of bacterial diarrheal disease. \n? Will develop, assess and validate performance parameters of animal efficacy models of bacterial diarrheal and rickettsial diseases. \n? Will evaluate the safety and efficacy of lead candidates in validated diarrheal disease animal models. \n? Will assess technologies for extended release that provides long-term prophylaxis."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease in funding reflecting level of effort required."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.424"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MN1"
                    },
                    "ProjectTitle": {
                        "val": "Applied Sensory Systems Trauma Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "7.615"
                        },
                        "BudgetYearOne": {
                            "val": "6.961"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.961"
                        },
                        "BudgetYearTwo": {
                            "val": "6.169"
                        },
                        "BudgetYearThree": {
                            "val": "3.092"
                        },
                        "BudgetYearFour": {
                            "val": "3.144"
                        },
                        "BudgetYearFive": {
                            "val": "3.044"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "30.025"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned from: Program Element (PE) 0602787A Medical Technology\n* Project ET4 Appl Resch in Clinical and Rehabilitative Medicine"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project conducts laboratory and animal studies for the purpose of developing novel, non-opioid drugs to treat pain in the austere battlefield environment with minimal side effects. Research to understand the influence of stress on the effectiveness of pain relief drugs (analgesics). All drugs, biological products, and medical devices are refined in accordance with Food and Drug Administration (FDA) regulations, which govern testing in animals to assess safety, toxicity, and effectiveness and subsequent human subject clinical trials.\n\nPromising efforts identified in this Project are further matured under PE 0603002A (Medical Advanced Technology) \/ Project MN7 (Musculoskeletal Injury Screening Tool Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Applied Sensory Systems Trauma Technology"
                                    },
                                    "Description": {
                                        "val": "This effort performs applied research in laboratory and animal studies to develop novel, non-opioid drugs to treat pain in the austere battlefield environment with minimal side effects."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.269"
                                            },
                                            "Text": {
                                                "val": "Will conduct preclinical testing to identify new targets (including peripheral ion channels) and to explore the potential of novel non-opioid drugs for improved pain management strategies.  Also will investigate medical countermeasures to directed energy exposures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.961"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.961"
                                            },
                                            "Text": {
                                                "val": "Applied Sensory Systems Trauma Technology ($3.967M)\n? Will conduct preclinical evaluation of promising non-opioid, side effect-free analgesics in treating post-traumatic, moderate-to-severe pain. These drugs will act on non-opioid targets in the nervous system that inhibit pain signaling without affecting cognitive capability.\n\nApplied Sensory Systems Trauma Technology ($3.000M)\n? Will identify and assess treatment for unconventionally-acquired brain injury (UBI) threat technologies \n? Will conduct UBI human-like animal assessments\n? Will validate UBI threat source symptomology and assess injury mechanisms  \n? Will transition understanding of injury mechanisms to enable direct medical diagnosis, treatment and clinical management."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decrease based on level of effort required."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.346"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VB3"
                    },
                    "ProjectTitle": {
                        "val": "MEDICAL TECHNOLOGY INITIATIVES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional increase for Peer-Reviewed Neurotoxin Exposure Treatment Parkinson's Research Program"
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Neurotoxin Exposure Treatment."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Peer-Reviewed Neurotoxin Exposure Treatment Parkinson?s Research Program"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "2"
                                        },
                                        "Text": {
                                            "val": "Peer-Reviewed Neurotoxin Exposure Treatment Parkinson?s Research Program"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VB4"
                    },
                    "ProjectTitle": {
                        "val": "System  Biology And Network Science Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.383"
                        },
                        "CurrentYear": {
                            "val": "0.6"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.983"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2021 (FY21) this Project is Eliminated."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project supports biological and clinical applied research using the data analysis and integration grid (Sys Bio Cube) as an overarching means of complex data usage to solve critical health problems. The primary capability of systems biology (field of study that focuses on complex interactions within biological systems, using a holistic approach) is the integration and analysis of complex human and animal study data and development of computational disease models, using global multi-omic methods to identify and discriminate unique combinations of biological molecules corresponding to clinical conditions (physiologic, immunologic, endocrine, etc.), supporting transition of research to clinical applications. This capability applies a systematic integrated approach to trace progression of illnesses and diseases and has already shown that the approach significantly reduces time, funds and effort invested in medical product development and refinement. \n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the United States Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Systems Biology"
                                    },
                                    "Description": {
                                        "val": "The core capability for multidisciplinary applied research in systems biology enables integration and analysis of complex data from human and animal studies and development of computational network models, allowing researchers to differentiate among molecular signatures (unique combinations of biological molecules corresponding to clinical conditions) of disease, and supports transition of research to clinical applications for diseases of military relevance. Applied research is being conducted to identify biological networks that are causative of illness in Post-traumatic stress disorder (PTSD) and co-morbidities (presence of one or more diseases or disorders), coagulopathy (impaired ability to clot blood) of trauma, traumatic brain injury, pain, suicide, infectious disease, and immune responses. In particular, the studies of PTSD are directed to refine biomarkers for screening, early diagnosis and therapeutic target discovery."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.383"
                                            },
                                            "Text": {
                                                "val": "Expanded Systems Biology capabilities through collaborative intramural and extramural partnerships, and accommodated an expected increase in the number of end-users of the Sys Bio Cube. Expanded the data repository capability within the Sys Bio Cube. Continued to oversee data sharing and data integration of large, complex datasets. Continued to increase capabilities to develop novel methods that integrate different systems biology data (e.g., genetics, microbiome, and metabolism data) that, in turn, will lead to new knowledge products. Continued to provide support to the Integrative Systems Biology Program for oversight of research efforts. Continued development of Sys Bio Cube capabilities and functions such as integration and harmonization of additional data types, browse and filtering functions to search for and sort specific assay types and associated data, tracking of assays conducted, and additional tools for longitudinal analysis and visualization of integrated data. Used time-dependent clinical data collections and integrated omics (omics refers to the collective technologies used to explore the roles, relationships, and actions of the various types of molecules that make up the cells of an organism) analyses of treatment efficacies to support a wide range of research efforts that will include additional biomarker development and understanding of the underlying altered molecular mechanisms of a) PTSD (including changes in the microbiome (gut microbes) and in metabolism) that will begin to correlate co-morbid (concurrent) conditions, and b) infectious diseases."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.573"
                                            },
                                            "Text": {
                                                "val": "Will complete all studies under this effort."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.027"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "XV5"
                    },
                    "ProjectTitle": {
                        "val": "Medical Capabilities to Support Dispersed Ops"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.504"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.504"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned to:\nProgram Element (PE) 0602787A Medical Technology\n* Project MM6 Medical Technologies to Support Dispersed Ops Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project will design, develop, and improve medical robotic and autonomous systems (Med-RAS), Virtual Health for telemedicine and remotely delivered patient care, and unmanned capabilities of providing or supporting combat casualty care in far-forward and dispersed geographic environments. This research includes the design of semi-autonomous and closed-loop combat casualty triage, diagnosis, physiological monitoring, therapeutic intervention, casualty evacuation, telemedicine\/ tele-mentoring and emergency medical resupply technologies for integration with emerging multi-purpose Army Robotics and Autonomous Systems (RAS) and Virtual Health\/Telemedicine delivery platforms while optimizing the medical logistic footprint.  \n \nPromising work in this Project will be further matured in PE 0603002A (Medical Advanced Technology) \/ Project MM7 (Enabling Med Cap to Support Dispersed OPS Adv Tech).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project is performed by the United States Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Medical Robotic and Autonomous Systems (Med-RAS)"
                                    },
                                    "Description": {
                                        "val": "Research, design, and prototype autonomous and unmanned capabilities to deliver high quality combat casualty care in dispersed operations with limited or absent medical care personnel in support of the Army Multi-Domain Operations concept and the Army Force 2025 and Beyond vision."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.648"
                                            },
                                            "Text": {
                                                "val": "Utilized invasive and non-invasive sensor systems to define new models for human physiologic responses to injury. Data from these models was used to define new algorithms that drive resuscitation and critical care procedures in animal models. Defined algorithms for implementation across a full spectrum of automation capabilities. Defined the physiological process associated with injury in trauma simulations that would be amenable to automated therapeutics with autonomous medical systems. Explored feasibility of integrating medical capabilities and information systems with Army unmanned systems (UMS) Programs of Record in order to leverage multipurpose robotic platforms for medical capabilities. Researched standardization of medical device interfaces for use in an autonomous platform. Researched feasibility of Unmanned Aerial Systems (UAS) to support remote patient monitoring research prototypes, closed-loop patient support systems, and prototype automated diagnostic and therapeutic en route care capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Virtual  Health"
                                    },
                                    "Description": {
                                        "val": "To develop future virtual health enterprise process architectures and integrated physical solutions capable of supporting prolonged field care in conditions with limited or lacking traditional field communications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.928"
                                            },
                                            "Text": {
                                                "val": "Researched and modeled virtual health enterprise process architectures to provide new intersections of health information and knowledge far forward to support multi-domain operations. Analyzed mechanisms for virtual health secure data transmission and communications in the tactical environment to facilitate use in very limited communication scenarios. Determined key physiological constructs that are predictive of health status and readiness for development of micro-footprint biosensor-based assessment tools."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medical Aspects of Man-Machine Teamining\/Medical Robotics"
                                    },
                                    "Description": {
                                        "val": "Researched and modeled virtual health enterprise process architectures to provide new intersections of health information and knowledge far forward to support multi-domain operations. Analyzed mechanisms for virtual health secure data transmission and communications in the tactical environment to facilitate use in very limited communication scenarios. Determined key physiological constructs that are predictive of health status and readiness for development of micro-footprint biosensor-based assessment tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.928"
                                            },
                                            "Text": {
                                                "val": "Researched the design of medical robotic systems, to effectively implement and control resuscitation and critical care procedures.  Researched and designed a proof of concept field robotic fold-up litter to show the feasibility of deploying soft robotics sensors and also show the capability to apply pressure using a soft robotics manipulator. Modeled and characterized the problems caused by signal latency and constrained bandwidth on complex tele-robotic surgical tasks. Researched and prioritized procedures amenable to full automation of tele-robotic operations. Researched and explored the feasibility of using robotic perception systems to detect casualties from a standoff distance and at closer ranges using both conventional computer vision approaches and recent advancements in deep learning techniques."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}