{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-9035d21372bc28631c31031b85da2fbd962d290bf8d6ca6eecbc49021508de49-24",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603680D8Z"
        },
        "ProgramElementTitle": {
            "val": "Defense Wide Manufacturing Science and Technology Program"
        },
        "R1LineNumber": {
            "val": "49"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "782.364"
            },
            "PriorYear": {
                "val": "171.749"
            },
            "CurrentYear": {
                "val": "197.397"
            },
            "BudgetYearOne": {
                "val": "93.817"
            },
            "BudgetYearOneBase": {
                "val": "93.817"
            },
            "BudgetYearTwo": {
                "val": "96.042"
            },
            "BudgetYearThree": {
                "val": "95.490"
            },
            "BudgetYearFour": {
                "val": "98.331"
            },
            "BudgetYearFive": {
                "val": "99.924"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense-wide Manufacturing Science and Technology (DMS&T) program is the joint, defense-wide component of the DoD Manufacturing Technology (ManTech) Program directed in Title 10 U.S.C. Section 2521.  DMS&T also supports many of the recommendations in the Executive Order Report “Assessing and Strengthening the Manufacturing and Defense Industrial Base and Supply Chain Resiliency of the United States” September 2018.\n\nThe objective of the DMS&T program is to increase the speed at which innovation, inventions, and scientific discoveries are turned into equipment and capabilities through advances in manufacturing technologies and processes.  The DMS&T program has created and is sustaining a manufacturing innovation ecosystem across the two project codes in this Program Element (PE):  P680 OSD Manufacturing Technology and P350 the DoD Manufacturing USA Institutes.  \n\nProject Code (P) 680 OSD Manufacturing Technology:\nThe OSD Manufacturing Technology (ManTech) program focuses on cross-cutting defense manufacturing advancements and stimulates early development of manufacturing processes and enterprise business practices.\n\nP350 DoD Manufacturing USA Innovation Institutes: \nThis project supports the eight DoD-led manufacturing innovation institutes that are part of the Manufacturing USA network of manufacturing innovation institutes, plus the stand-up of a new Synthetic Biology Manufacturing Innovation Institute, in accordance with current mission requirements.  The technology focus areas  are: (1) additive manufacturing; (2) digital manufacturing, design and manufacturing cybersecurity; (3) lightweight metals; (4) integrated photonics; (5) flexible hybrid electronics; (6) smart fibers and textiles; (7) advanced tissue biofabrication; (8) advanced robots for manufacturing; and (9) synthetic biology.  Each institute is a public\/private partnership that matches DoD funding at a one to one ratio or greater and has a consortium of members from industry and academia to mature manufacturing processes, build out the supporting ecosystems, and provide manufacturing education and workforce development.  The ecosystem includes small and medium manufacturers and state-of-the-art pilot facilities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "174.489"
                },
                "CurrentYear": {
                    "val": "96.397"
                },
                "BudgetYearOne": {
                    "val": "79.543"
                },
                "BudgetYearOneBase": {
                    "val": "79.543"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "171.749"
                },
                "CurrentYear": {
                    "val": "197.397"
                },
                "BudgetYearOne": {
                    "val": "93.817"
                },
                "BudgetYearOneBase": {
                    "val": "93.817"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.740"
                },
                "CurrentYear": {
                    "val": "101.000"
                },
                "BudgetYearOne": {
                    "val": "14.274"
                },
                "BudgetYearOneBase": {
                    "val": "14.274"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "101.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.710"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Increase for Synthetic Biology Manufacturing Innovation Insitute"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "15.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "15.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.077"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.077"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.030"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.649"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.649"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2019 Congressional Add for $60.250 million supports the acceleration of efforts for: manufacturing engineering programs; manufacturing innovation institutes; advanced manufacturing; and National Security Technology Accelerator.  \n\nThe FY 2020 Congressional Add for $101.000 million supports the following:  manufacturing engineers programs; manufacturing innovation institutes; advanced manufacturing; HPC enabled advanced manufacturing, manufacturing cyber security and silicon based lasers.\n\nThe increase in FY 2021- FY 2025, P350 Manufacturing Innovation Institutes, is for a Synthetic Biology Manufacturing Innovation Institute.  The total funding is $92.000 million."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "680"
                    },
                    "ProjectTitle": {
                        "val": "Manufacturing Science and Technology Program"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "174.930"
                        },
                        "PriorYear": {
                            "val": "22.328"
                        },
                        "CurrentYear": {
                            "val": "30.162"
                        },
                        "BudgetYearOne": {
                            "val": "31.840"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.840"
                        },
                        "BudgetYearTwo": {
                            "val": "32.656"
                        },
                        "BudgetYearThree": {
                            "val": "32.867"
                        },
                        "BudgetYearFour": {
                            "val": "33.625"
                        },
                        "BudgetYearFive": {
                            "val": "34.309"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The OSD ManTech program concentrates on cross-cutting defense manufacturing needs that are beyond the ability of a single service to address.  In support of this mission the OSD ManTech program invests in broad technology initiatives in:  Advanced Electronics and Optics, Advanced Materials and Composites, Advanced and Emerging Manufacturing Processes, and Advanced Energetics Manufacturing."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Electronics and Optics"
                                    },
                                    "Description": {
                                        "val": "Description: Advanced Electronics and Optics is a series of efforts addressing advanced manufacturing technologies for a wide range of applications such as sensors, radars, power generation, switches, and optics for defense applications. Focal points are productivity and efficiency gains in the defense manufacturing base to accelerate delivery of technical capabilities to impact current warfighting operations, and manufacturing technologies to reduce the cost, acquisition time and risk of our major defense acquisition programs. Future efforts will focus on advances in fuel cells, lasers, enhanced acuity micro-displays, and transparent ceramics for opto-mechanical and armor applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.720"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.352"
                                            },
                                            "Text": {
                                                "val": "FY 2020 Plans: Continue projects that are addressing manufacturing needs for electronic and optics related technologies. Light-weight Gradient Index Lenses (GRIN Lenses) and Circular Polarizers for Color Day Cameras will each be executing Year 2 of 3 for their efforts, while Portable X-Ray Detectors for Dismounted Soldier, Low-SWaP Spectral Beam Combiners and MEMS Navigation Grade Inertial Sensors will receive their final year of funding to carry them through the remainder of their efforts. Program will solicit proposals from Department of Defense workforce to help address manufacturing constraints in several technology fields."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.010"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.010"
                                            },
                                            "Text": {
                                                "val": "Utilize the annual project call to select and initiate projects that support the National Defense Strategy and DoD modernization priorities. Additionally, GRIN Lenses and Circular Polarizers for Color Day Camera projects will be in their final year of funding."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The level of effort is consistent between FY 2020 and FY 2021.  Small changes reflect minor budget fluctuations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Materials and Composites"
                                    },
                                    "Description": {
                                        "val": "Advanced Materials and Composites is a series of efforts addressing advanced manufacturing technologies for a wide range of materials such as composites, metals, ceramics, nanomaterials, and metamaterials. Through productivity and efficiency gains, these manufacturing technologies will accelerate delivery of technical capabilities to impact current warfighting operations, while reducing the cost, acquisition time and risk of our major defense acquisition programs. Advanced materials manufacturing technologies undergoing development include materials for ballistic survivability and ballistic protection, survivability and rapid fabrication of structural components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.724"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.490"
                                            },
                                            "Text": {
                                                "val": "Program will fund the final year of the Fabrication of Non-Eroding Metallic Throat and Oxide-Oxide Ceramic Matrix Composite projects. The Oxide-Oxide Ceramic Matrix Composite project will be transitioning from the DMS&T ManTech program to the Army ManTech program to help further address Army-specific needs. The Manufacturing of Carbon-Carbon Composites for Hypersonic Applications (MOC3HA) initiative will be entering Year 3 of 5 and focus on tackling the domestic manufacturing base for carbon-carbon materials. Hypersonic Radio-Frequency (RF) Seeker Window project will be kicked off and funded for Year 1 of 3. Program will solicit proposals from Department of Defense workforce to help address manufacturing constraints in several technology fields."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.110"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.110"
                                            },
                                            "Text": {
                                                "val": "Utilize the annual project call to select and initiate projects that support the National Defense Strategy and DoD modernization priorities. The MOC3HA initiative will be funded for Year of 5 and the Hypersonic RF Seeker Window project will enter Year 2 of 3."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase in funding supports the MOC3HA and Hypersonic RF Seeker Window projects to address Hypersonic-related manufacturing constraints in the defense manufacturing industry."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced and Emerging Manufacturing Processes"
                                    },
                                    "Description": {
                                        "val": "Advanced and Emerging Manufacturing addresses advanced manufacturing technologies and business practices for defense applications. Key focus areas include direct digital (or additive) manufacturing, advanced manufacturing enterprise, machining, robotics, assembly, and joining. Projects selected will accelerate delivery of technical capabilities to impact current warfighting operations while reducing cost, acquisition time, and risk of major defense acquisition programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.784"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.010"
                                            },
                                            "Text": {
                                                "val": "The Novel Printed Countermeasures, Fabrication of Non-Eroding Metallic Throat and Magnesium Oxide for Thermal Batteries projects will be entering their final year of funding. The Fabrication of Non-Eroding Metallic Throat project is hoping to execute a hot-fire test of their product in the August\/September 2020 timeframe. Additionally, the Novel Printed Countermeasures project is hoping to perform a flight test of their product at China Lake, CA in the June 2020 timeframe. A new start for FY 2020 is the Lightweight Hydrogen Fuel Cell project that will kick-off Year 1 of 3. Program will solicit proposals from Department of Defense workforce to help address manufacturing constraints in several technology fields."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.260"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.260"
                                            },
                                            "Text": {
                                                "val": "Utilize the annual project call to select and initiate projects that support the National Defense Strategy and DoD modernization priorities. Foamed Celluloid Materials project will be entering the final year of funding and the Lightweight Hydrogen Fuel Cell project will execute Year 2 of 3."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The level of effort is consistent between FY 2020 and FY 2021.  Small changes reflect minor budget fluctuations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Energetics Manufacturing"
                                    },
                                    "Description": {
                                        "val": "Advanced Energetics Manufacturing develops improved manufacturing capabilities for safer, low cost, high quality production of existing and newly developed ingredients and composites used in energetic materials production.  Techniques such as additive manufacturing, microfluidics,  continuous processing, resonant acoustic mixing, robotics, etc. are developed for production of critical energetics and supporting ingredients ensuring Department access to these materials and enabling the development of new, highly advanced energetic systems for improved range and performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.100"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.310"
                                            },
                                            "Text": {
                                                "val": "The Stabilized Alpha Alane project will enter its final year of execution, while the Lead-Free Primary Explosive DBX-1 and High Density Reactive Material projects will be continuing their efforts. Advanced Mixing for Infrared Countermeasures will be initiated in FY 2020 as a 2-year project that is being performed in tandem with Navy ManTech. Program will solicit proposals from Department of Defense workforce to help address manufacturing constraints in several technology fields."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.460"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.460"
                                            },
                                            "Text": {
                                                "val": "Utilize the annual project call to select and initiate projects that support the National Defense Strategy and DoD modernization priorities. The Lead-Free Primary Explosive DBX-1, High Density Reactive Materials and Advanced Mixing for Infrared Countermeasures projects will be in their final year of execution in FY 2021."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding level in FY 2021 is consistent with funding needed to incrementally funded existing projects and begin new advanced energetic manufacturing efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "ManTech projects are awarded competitively through the DoD Service Laboratories.  Approximately 1\/3 of the total active topics are awarded to new initiatives annually."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "350"
                    },
                    "ProjectTitle": {
                        "val": "Manufacturing Innovation Institutes"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "607.434"
                        },
                        "PriorYear": {
                            "val": "134.421"
                        },
                        "CurrentYear": {
                            "val": "167.235"
                        },
                        "BudgetYearOne": {
                            "val": "61.977"
                        },
                        "BudgetYearOneBase": {
                            "val": "61.977"
                        },
                        "BudgetYearTwo": {
                            "val": "63.386"
                        },
                        "BudgetYearThree": {
                            "val": "62.623"
                        },
                        "BudgetYearFour": {
                            "val": "64.706"
                        },
                        "BudgetYearFive": {
                            "val": "65.615"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The increase in Project Code (P) 350 funds are for the new Synthetic Biology Manufacturing Innovation Institute that focused on materials production.  The total funding is $92.000 million (FY 2021 - FY 2025)."
                        },
                        "ProjectMissionDescription": {
                            "val": "DoD supports nine manufacturing innovation institutes that are public\/private partnerships that address both commercial and defense manufacturing needs within specific, defense-relevant technology areas and receive active participation and support from the military departments and defense agencies. The institutes’ flexible business models and strong focus on enabling highly collaborative R&D are catalyzing important new organizational relationships across government, industry and academia. This is bringing together both traditional defense and non-traditional sectors, accelerating key innovation cycles and expanding U.S. industrial capability and assisting in creating resilient supply chains that will support innovative defense products.\n\nDoD’s nine institutes are: (1) America Makes (Additive Manufacturing); (2) MxD – Manufacturing times Digital (Digital Manufacturing, Design and Cybersecurity); (3) LIFT – Lightweight Innovations For Tomorrow (Lightweighting Innovations – materials and processes); (4) American Institute for Manufacturing Integrated Photonics (Device Manufacturing and Packaging); (5) NextFlex Manufacturing Innovation Institute (Flexible Hybrid Electronics Manufacturing);  (6) Advanced Functional Fabrics of America (Smart Fibers and Textiles); (7) BioFabUSA Manufacturing Innovation Institute (regenerative tissue manufacturing); (8) Advanced Robotics Manufacturing (Smart Collaborative Robotics for Manufacturing); and (9) Synthetic Biology Manufacturing Innovation Institute, which is new and being stood up in accordance with current mission requirements.\n\nThe funding provided for the manufacturing innovation institutes is focused in the following areas:\n\n• Conducting (or funding) pre-competitive applied research and development projects to reduce the cost, time, and technical uncertainty related to new manufacturing technologies and to improve existing technologies, processes, and products.\n• Developing and implementing education, training, and workforce recruitment courses, materials, and programs.\n• Developing innovative methodologies and practices for supply chain integration and introduction of new technologies into supply chains.\n• Engaging with small and mid-sized manufacturers, including women and minority-owned manufacturing enterprises, and larger-sized manufacturing firms.\n\nWhile each institute has a different model there are similar in the following ways:\n\n• Each institute is a public-private partnership with representatives from industry, academia, state and local governments, and the DoD that co-invest in world-leading technologies and capabilities.\n• Each institute provides facilities needed to allow collaborative, precompetitive development of promising technologies and to promote the creation of stable and sustainable innovation ecosystems for advanced manufacturing. \n• The partnerships forming the institutes must commit non-federal resources that equal or exceed the federal \n\nThe funding provided for the manufacturing innovation institutes is focused in the following areas:\n\n• Conducting (or funding) pre-competitive applied research and development projects to reduce the cost, time, and technical uncertainty related to new manufacturing technologies and to improve existing technologies, processes, and products.\n• Developing and implementing education, training, and workforce recruitment courses, materials, and programs.\n• Developing innovative methodologies and practices for supply chain integration and introduction of new technologies into supply chains.\n• Engaging with small and mid-sized manufacturers, including women and minority-owned manufacturing enterprises, and larger-sized manufacturing firms.\n\nWhile each institute has a different model there are similar in the following ways;\n\n• Each is a public-private partnership with representatives from industry, academia, state and local governments, and the DoD that co-invest in world-leading technologies and capabilities.\n• Each institute provides facilities needed to allow collaborative, precompetitive development of promising technologies and to promote the creation of stable and sustainable innovation ecosystems for advanced manufacturing. \n• The partnerships forming the institutes must commit non-federal resources that equal or exceed the federal contribution during a five- to seven-year establishment period. \n• Each institute is part of the Manufacturing USA network.\ncontribution during a five- to seven-year establishment period. \n• Each institute is part of the Manufacturing USA Network."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Manufacturing Engineering Programs"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "This program increase entitled \"Manufacturing Engineering Programs\" supports Department efforts to engage in manufacturing related efforts to assist in maintaining a technically trained workforce to meet the defense industrial base requirements of the Department of Defense. Competitive grants and awards are planned that will engage community colleges, technical schools and the DoD institutes to accomplish this effort."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Support competitive grants and awards with community colleges, technical schools and the DoD institutes that support education and workforce development activities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Manufacturing Institutes"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "7.512"
                                        },
                                        "Text": {
                                            "val": "This program increase will be used to support activities at the Digital Manufacturing and Design Innovation Institute in the following areas:  (1) digital design, product development and systems engineering; (2) the digital factory of the future; (3) creating agile, resilient supply chains; and (4) cybersecurity for manufacturing."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "59.000"
                                        },
                                        "Text": {
                                            "val": "1. Manufacturing Innovation Institutes ($10M) - Continue technology development, technology transition, and support education\/workforce development in manufacturing innovation institutes supporting DoD modernization priorities. \n\n2. Advanced Manufacturing ($10.000 million):  Identify and invest in advanced manufacturing technologies that are high priority to the DoD.\n\n3. Manufacturing Cybersecurity ($14.000 million): Support and collaborate with other Federal agencies on cybersecurity for manufacturing.  Focus will be on small and medium sized businesses and in support of the cybersecurity maturity model certification activities.\n\n4. Silicon Based Lasers ($25.000 million):  Mature the manufacturing processes for high volume integrated silicon-based lasers on a 300mm semiconductor foundry process line for use in critical national security applications."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Manufacturing"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "30.000"
                                        },
                                        "Text": {
                                            "val": "Coordinating with Service Matter Experts (SMEs) in Cold Spray Technology to expand usage of Cold Spray technology to DoD organic repair and maintenance facilities, develop part families for land, air, and sea applications, and expand the Cold Spray supply chain to meet additional DoD applications."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "20.000"
                                        },
                                        "Text": {
                                            "val": "Support DoD modernization priorities manufacturing challenges and gaps.  Accelerate ongoing efforts to provide earlier transition of technologies to the warfighter. Maintain DoD’s strategic relationships with the established eight manufacturing innovation institutes and support associated supply chains."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HPC enabled advanced manufacturing"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "17.000"
                                        },
                                        "Text": {
                                            "val": "Work with The U.S. Army Engineer Research and Development Center’s (ERDC), the Oak Ridge National Labs, and the University of Maine’s Advanced Structures and Composites Center to productionize large scale 3-D manufacturing process utilizing biobased feedstocks to fabricate prototypes and manufactures shelters, vehicles and other large systems for the Army and other military customers."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "America Makes (Additive Manufacturing)"
                                    },
                                    "Description": {
                                        "val": "America Makes’ mission is to accelerate the adoption of Additive Manufacturing in the United States industrial base.  Additive manufacturing (i.e., “3D printing”) is a process of joining materials to make objects from 3D model data, usually layer upon layer, as opposed to subtractive manufacturing methodologies such as traditional machining.  Additive manufacturing is benefitting the DoD by enabling lifecycle cost savings and enhanced capabilities including: distributing supply chains to get the right part in the right place at the right time, improving mission readiness by producing work aids in sustainment depots and replacing long-lead time and out of production spares, and by enhancing lethality through production of lighter weight and higher performing parts than could be achieved with traditional manufacturing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "The major areas of emphasis for the eight DoD led manufacturing innovation institutes are:\n1. Qualification and certification of additive manufacturing (AM) materials, processes, and parts, together with rigorous training and workforce development that enables DoD to further integrate AM technologies into their depots, arsenals, and shipyards to modernize their supply chains and strengthen their position.\n2. Mature technology to institutionalize the digital thread across DoD manufacturing enterprises by enabling the modernization of DoD assets, lowering barriers to virtual prototyping and validation; accelerating the innovation cycle; generating dynamic responses to material needs; and lowering total system lifecycle costs form design thorough disposal.  Develop tools to assist small and medium size companies for manufacturing cybersecurity.\n3. Mature innovative metal lightweighting technologies across all platforms and services that save fuel and increase combat payload. Investments would address both targeted application spaces and cross-cutting enabling technologies.  This includes activity in linear friction welding; design and manufacturing methods for promising high strength alloys; develop lightweight engineered structures; optimize ultra-fast heat treatment and quenching and extend the use of thin-walled casting technology to cast components for military vehicles.\n4. Utilize the existing world-class 300mm integrated silicon photonics foundry in Albany, NY, the indium phosphide photonics foundry in Silicon Valley, and the world’s first photonic integrated circuit test, assembly, and packaging facility in Rochester, NY to accelerate low cost, volume manufacturing of devices for LIDAR, 5G telecom, and quantum dot lasers and the integration of advanced assembly and packaging techniques for optical elements. \n5. Mature flexible hybrid technology to support a supply chain that can produce electronics on flexible, stretchable, and 3-dimensional structures. This will create new innovative products that can be used for warfighter wearable health sensors, portable x-ray imagers, precision navigation timing packages and phased array antennas for electronic warfare and radar systems.\n6. Mature the manufacturing processes that will enable industry to produce and use smart fibers and textiles and incorporated them into innovative products using conventional weaving and knitting equipment. Advanced fabric technology offers unique solutions to critical national security challenges, including soldier communication systems; functional composite materials for ground and air vehicles; and distinctive undersea and space capabilities.  Through the recently created Defense Fabric Discovery Center continue to develop a fabric-based solutions in Free Space Optical Communications (Identification Friend\/Foe (IFF)) that eliminates issues of detection and jamming and is affordable and easily deployable.\n7. Mature the technology for large scale, cost-effective, reproducible manufacturing of high-quality tissues that can be used to treat severely wounded warfighters, which contributes to force readiness and saves lives on the battlefield.  This includes (1) cell selection, culture and scale-up, (2) biomaterial selection and scale-up, (3) tissue process automation and monitoring, (4) tissue maturing technologies, and (5) tissue preservation and transport.\n8. Accelerate research, development, and implementation of collaborative robotic technologies for use in manufacturing. Early use include smart companion robots for vehicle assembly, perception-aided collaborative robotic wire harness assembly, robot assistance for composites manufacturing, and robotic sanding and finishing. The focus is on (1) Versatility — robots that can perform a variety of tasks; (2) Flexibility — robots that can be deployed and re-deployed rapidly and easily; (3) Lower cost — reducing the overall cost of robot systems; and (4) Collaboration — robots that safely work alongside and with people.\n\nAs institutes come off their initial agreement, new assistance agreements will be established.  In FY19 new agreements for LIFT and DMDII will be established."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.956"
                                            },
                                            "Text": {
                                                "val": "Complete technical performance of all projects awarded in FY 2018 and make results available in the knowledge management system.  Continue leading initiatives to define and document industry additive manufacturing standards.  Continue implementing new processes for transitioning technologies developed by the institute.  Continue education and workforce training initiatives and move toward industry recognized labor certifications.  Award and begin execution of technical projects addressing affordability of additive manufacturing. Continue to host events across the US to convene industry, academia, and public partners in AM."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.280"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.280"
                                            },
                                            "Text": {
                                                "val": "Initiate a new long-term agreement between America Makes and the DoD to accelerate adoption of Additive Manufacturing within industry and government, resulting in revamped staffing and increased stakeholder engagement.  Enhance the model of technical excellence through projects by synthesizing those project outcomes and deliverables with industry trends and other outside information sources to become a strategic leader in the Additive Manufacturing community."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent between FY 2020 and FY 2021.  Small changes reflect budget fluctuation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MxD – Manufacturing times Digital (Digital Manufacturing, Design and Cybersecurity)"
                                    },
                                    "Description": {
                                        "val": "MxD focuses on the implementation of the Digital Thread, the unencumbered flow of data across the lifecycle of a manufactured product encompassing data from design, production, supply, sourcing, inventory, assembly, quality, maintenance and sustainment. It includes the analysis of this data to reduce the time and cost of bringing new products to market, the elimination of barriers between design, manufacturing and sustainment by using both product data and process data in a way that is seamless and transparent.  MxD’s focus areas are: (1) Future Factory, 2) Agile and Resilient Supply Chain, 3) Cyber Security for Manufacturing, and 4) Design, Product Development and System Engineering."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.750"
                                            },
                                            "Text": {
                                                "val": "• Mature ManTech tools, technology and talent capabilities and capacity into projects across Electronics, Composites, Energetics, and Manufacturing processes.  \n• Incorporate JDMTP, S&T, DARPA, IARPA, Service strategies, Manufacturing USA Institutes, and IPL inputs into evolving portfolio structure.\n• Develop best practices and relationships with industry, academia, and Service components.  \n• New Project Starts (NDS Alignment; USD R&E Alignment) – Magnesium Oxide Binder for Thermal Batteries (Joint Lethality, Hypersonics; Hypersonics, Space Offense and Defense, Missile Defense), Foamed Celluloid Materials (Joint Lethality), Light Weight Gradient Index Lenses (Joint Lethality), Circular Polarizers for Color Day Cameras (Joint Lethality), Monolithic Spectral Beam Combiners (Directed Energy; Directed Energy, Electronic Warfare, Space Offense and Defense), High Density Reactive Materials (Joint Lethality).\n• Continuing Projects (NDS Alignment; USD R&E Alignment) – Fabrication of Non-Eroding Metallic Throat (Hypersonics; Hypersonics, Missile Defense, Space Offense and Defense), MEMS Navigation Grade Inertial Sensors (Joint Lethality; Command, Control and Communications, Microelectonics), Oxide-Oxide (Hypersonics, Joint Lethality; Hypersonics), Stabilized Alpha Alane (Hypersonic, Joint Lethality; Hypersonics, Missile Defense), DBX-1 (Joint Lethality), MOC3HA (Hypersonics; Hypersonics, Missile Defense, Space Offense and Defense).\n•\tCompleting Projects – Advanced Technology Capability (Classified), Cold Spray Additive Manufacturing and Structural Repair (Joint Lethality), High Yield Infrared Focal Plane Arrays (Joint Lethality, Hypersonics; Hypersonics, Space Offense and Defense), Manufacturability of Vertical Cavity Surface Emitting Lasers (Joint Lethality; Command, Control and Communications), Nanocomposite Optical Ceramic Dome (Joint Lethality, Hypersonics; Hypersonics, Missile Defense), Novel Printed Countermeasures (Joint Lethality), HighTEC (Joint Lethality), Portable X-Ray Detectors for the Dismounted Soldier (Joint Lethality), pWave (Joint Lethality; Electronic Warfare, Command, Control and Communications), Critical Energetic Materials Working Group Formulations (Joint Lethality)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.954"
                                            },
                                            "Text": {
                                                "val": "Initiate projects identified in the 2020 Strategic Investment Plan.  Develop a set of workshops & hands-on training programs through the National Center for Cybersecurity in Manufacturing focused on cybersecurity theory & practice for the DoD Organic Industrial Base.  Increase DoD Organic Industrial Base utilization of Discrete\/Assembly\/Cybersecurity testbeds for rapid technology development and assessment of scalability into the DoD materiel enterprise.  Significantly scale up commercialization, skill development and workforce development efforts from research projects and relationships with other government agencies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.280"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.280"
                                            },
                                            "Text": {
                                                "val": "Continue to assist the DoD to achieve the digital engineering and advanced manufacturing goals of the DoD Modernization Strategy, lead efforts in preparing the digital workforce within government, industry, and academia, advance the cybersecurity of the manufacturing supply chain, and drive new digital manufacturing technologies and the digital capabilities of the U.S. manufacturing base.  MxD will also advance new deployable technology development that can support the U.S. warfighter while helping equip U.S. small- and medium-sized manufacturers with the tools and skills they need to innovate, compete globally, and win."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent between FY 2020 and FY 2021.  Small changes reflect budget fluctuation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "LIFT – Lightweight Innovations for Tomorrow (Lightweighting Innovations – materials and processes)"
                                    },
                                    "Description": {
                                        "val": "Advanced lightweight metals retain properties comparable to heavier, traditional materials, and can enable weight reduction in a variety of components and products with significant energy savings and increased payloads. Scale-up research across multiple areas to accelerate market expansion by applying an integrated materials and manufacturing approach, addressing a lack of design guides and certifications as well as affordability and scale-up challenges.  The goal is to catalyze the development of an advanced lightweight metal U.S. supplier base and to enable DoD to realize greater speed and agility of manned, unmanned, and Warfighter systems as well as benefits for commercial applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.500"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.954"
                                            },
                                            "Text": {
                                                "val": "Continue ongoing efforts with a focus on (1) completion of the lightweight armor development effort, along with initiation of transition to Army vehicle protection system, (2) development of ICME models for cold spray, which will enable more efficient qualification\/certification of cold spray for Navy and Army repair applications, (3)development and implementation of next generation joining technology to decrease distortion and cost during ship construction, (4) development of agile forming techniques suitable for part production in forward deployed locations, and (5) expansion of education and workforce programs will continue along with growth of the Learning Lab activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.280"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.280"
                                            },
                                            "Text": {
                                                "val": "Plans include the funding of projects to support DOD and the commercial industrial base to benefit the warfighter, to expand Smart Manufacturing Capabilities, and to develop and advance Hypersonic capabilities and other DoD modernization priorities, and continuing to develop education and workforce programs that will benefit the DoD and defense industrial base workforce. Accelerate deployment of advanced manufacturing technologies such as linear friction welding; design and manufacturing methods for promising high strength alloys; optimized ultra-fast heat treatment and quenching techniques for thin-walled casting applied to components for military vehicles."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent between FY 2020 and FY 2021.  Small changes reflect budget fluctuation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "American Institute for Manufacturing"
                                    },
                                    "Description": {
                                        "val": "Integrated Photonics (Device Manufacturing and Packaging)\nDescription:  Integrated photonics manufacturing advances the promise of unprecedented interconnection between electronics and photonics that will deliver previously unattainable performance in speed, density and power consumption, quickly providing differentiating benefits for defense applications such as high-speed signal processing, electronic warfare, position, navigation, and timing, information transport and computation, sensing, imaging and targeting. This institute is establishing an end-to-end ‘ecosystem’ in the U.S. for advancing domestic integrated photonics manufacturing. This institute has developed access to a responsive integrated photonics fabrication foundry, including the world’s only 300 mm silicon photonics multi-project wafer service, photonics-electronics integrated design tools, and a highly advanced packaging, assembly and testing user facility."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.954"
                                            },
                                            "Text": {
                                                "val": "Complete technical performance of all projects awarded in FY 2018 and make results available in the knowledge management system to the membership, including DoD stakeholders. Continue bringing together uniquely qualified teams to accelerate technical responses to major sustainment challenges like the Maturation of Additive Manufacturing for Low-Cost Sustainment (MAMLS) program.  Continue leading impactful international initiatives to define and document industry additive manufacturing standards, by facilitating the Additive Manufacturing Standards Collaborative (AMSC).  Continue implementing new processes for transitioning technologies developed by the institute, strengthening the growing US-based additive manufacturing (AM) ecosystem.  Continue education and workforce training initiatives with targeted Design for Additive Manufacturing (DfAM) workshops and train-the-trainer initiatives, and move toward industry recognized labor certifications and stackable credentials.  Award and begin execution of industry-led and jointly-developed technical projects addressing affordability of additive manufacturing.  Continue to host events across the U.S. to convene industry, academia, and public partners in AM on AM topics that will accelerate the deployment of AM to defense and commercial users.  Continue to develop and align AM roadmaps from each of the Services and across the DoD with the support of the Joint Additive Manufacturing Working Group (JAMWG) and the Joint Additive Manufacturing Steering Group (JAMSG)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.280"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.280"
                                            },
                                            "Text": {
                                                "val": "Initiate a new long-term strategic partnership agreement between America Makes and the DoD to accelerate the adoption of Additive Manufacturing within industry and government, resulting in revamped staffing and increased stakeholder engagement, and enhance the coordination of AM investments across the Department with the support of the JAMWG and JAMSG.  Continue to support efforts that accelerate the certification and qualification of additive manufactured parts.  Leverage industry partnerships to accelerate the growth of the collaborative ecosystem by highlighting the strengths of the membership base.  Organize and host attractive and timely events bringing AM leaders together on a regular basis to foster better AM collaboration.  Enhance the proven model of technical excellence through industry-led research projects by synthesizing those project outcomes and deliverables with industry trends and other outside information sources to continue to play a strategic leadership role in the Additive Manufacturing community at home and abroad."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent between FY 2020 and FY 2021.  Small changes reflect budget fluctuation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NextFlex Manufacturing Innovation Institute (Flexible Hybrid Electronics Manufacturing)"
                                    },
                                    "Description": {
                                        "val": "Flexible hybrid electronics manufacturing involves highly tailorable devices on non-traditional, compliant substrates that combine thinned components manufactured from traditional processes with components that are added via “printing” processes. This institute will invest in prototyping and scale-up of manufacturing processes for high speed pick-and-place, printed circuits, and hybrid fabrication that will enable defense and commercial applications in wearable electronics, unattended sensors and integrated array antennas, medical devices and soft robotics devices, and the continuous improvement in SWAPC (Size, Weight And Power plus Cost) for electronic systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.500"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.954"
                                            },
                                            "Text": {
                                                "val": "Accelerate the strategic engagement from DoD with a focus on prototyping products for DoD customers, increased utilization of the Pilot Line through an updated Process Design Kit, increased yields, design and integrated modeling tools, and funding for manufacturing R&D projects accelerating DoD adoption of FHE.  Workforce development efforts will match the Learn and Earn participants with key EMS members to promote a qualified manufacturing industrial base."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.280"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.280"
                                            },
                                            "Text": {
                                                "val": "NextFlex will continue to mature flexible, stretchable hybrid electronics including advanced packaging and additive manufacturing technologies within their world class pilot manufacturing line. FY 2021 NextFlex goals include transition of at least two prototypes into defense systems in partnership with industry member teams and continue to deploy and transition its FlexFactor manufacturing education program."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent between FY 2020 and FY 2021.  Small changes reflect budget fluctuation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Functional Fabrics of America (Smart Fibers and Textiles)"
                                    },
                                    "Description": {
                                        "val": "Accelerate the transformation of the manufacturing of traditional fibers, yarns and textiles into highly sophisticated, integrated and networked devices and systems and help convert the domestic textile industry into one that is differentiated by Intellectual Property (IP) and value-added technology. The outcome will lead to highly functional fabrics that provide valuable services: fabrics that see, hear, sense, communicate, store and convert energy, regulate temperature, monitor health, and change color while developing new and improved textiles to benefit the commercial consumer and warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.154"
                                            },
                                            "Text": {
                                                "val": "AFFOA plans to continue to pursue industry-sponsored projects, through the “Made in America” policy, to commercialize the technology.  Extend the Micro-awards project strategy to continue to further the technology roadmap and engage more members.  Continue to solicit agency-directed project through the Defense Fabric Discovery Centers.  Refine Education Workforce Development activities to ensure sufficient pipeline expertise and recruitment and assist in future technology transition\/commercialization opportunities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.280"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.280"
                                            },
                                            "Text": {
                                                "val": "AFFOA plans to scale LED and energy fibers, at low-rate production lengths, and incorporate them into full garment\/product prototypes for physiological, performance, stress\/strain, etc. monitoring while working with DoD PEOs\/Program Managers (Ex. PEO Soldier) to build insertion paths into programs of record. Additionally, there is a planned demonstration of secure communications in an Identification Friend or Foe (IFF) application for PM Soldier Clothing Individual Equipment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding in FY 2020 completes the DoD funding commitment of $75.00-million to AFFOA and the FY 2021 funding provides initial funding for a new agreement to continue the public\/private partnership with AFFOA."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "BioFabUSA Manufacturing Innovation Institute (regenerative tissue manufacturing)"
                                    },
                                    "Description": {
                                        "val": "This institute is intended to advance state-of-the-art human tissue manufacturing innovations in cell and biomaterial processing, bioprinting, automation and non-destructive testing technologies. The goal is to establish a collaboration that will mature tissue-related technology across a range of manufacturing readiness levels (MRL) 4-7, enabling post-delivery assurance of tissue identity, viability, function, and efficacy. This Institute will bring together the diverse and currently fragmented collection of industry practices and institutional knowledge across many disciplines (cell biology, bioengineering, materials science, analytical chemistry, robotics, and quality assurance).  Technical focus at a minimum will be comprised of five thrust areas: (1) Cell Selection, Culture and Scale-up, (2) Biomaterial Selection and Scale-up; (3) Tissue Process Automation and Monitoring; (4) Tissue Maturing Technologies and (5) Tissue Preservation and Transport."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.159"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.154"
                                            },
                                            "Text": {
                                                "val": "Continue to expand the membership and refine core investment areas and demonstrate the self-sustainment of the innovation ecosystem.  Full functional capability of the Tissue Foundry established as the core platform for manufacturing workforce development and to align manufacturing R&D efforts and validate new measurement technologies.  Full functional capability of the BioFabUSA Incubator with unique opportunities for regenerative medicine companies that can expedite time to commercialization at scale."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.688"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.688"
                                            },
                                            "Text": {
                                                "val": "In FY 2021 BioFabUSA will continue to improve the tissue foundry prototype line. As BiofabUSA develops supported tools and enabling technologies through institute projects, they will begin to replace off-the-shelf tools used to develop the initial prototype line."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease is based on the funding profile for the BioFabUSA agreement that provides $80.000 million to the agreement through the current period of performance."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Robotics Manufacturing (Smart Collaborative Robotics for Manufacturing)"
                                    },
                                    "Description": {
                                        "val": "Improve U.S. competitiveness in manufacturing through advancements in the smart collaborative robotic field.  The technologies developed in this institute will be primarily focused in making advanced manufacturing more competitive, addressing DoD needs, and contribute to improving prosperity in the United States. The Institute will focus on technology areas such as human robot interaction, adaption, learning, manipulation, autonomy, mobility and perception."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.155"
                                            },
                                            "Text": {
                                                "val": "Accelerate research, development, and implementation of collaborative robotic technologies for use in manufacturing. Early use include smart companion robots for vehicle assembly, perception-aided collaborative robotic wire harness assembly, robot assistance for composites manufacturing, and robotic sanding and finishing. The focus is on (1) Versatility — robots that can perform a variety of tasks; (2) Flexibility — robots that can be deployed and re-deployed rapidly and easily; (3) Lower cost — reducing the overall cost of robot systems; and (4) Collaboration — robots that safely work alongside and with people."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.609"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.609"
                                            },
                                            "Text": {
                                                "val": "ARM will continue to accelerate technology in these areas: (1) Risk Reduction for Transition to the Factory Floor (methods and tools for adoption, integration, and readiness to include virtual modeling and simulation and testing); (2) Human-Robot Interaction (user-friendly interfaces; natural language communication; human-robot trust\/safety); (3) Interoperability (Plug-and-play hardware\/ software; open source\/open architectures); (4) Reconfigurable, Agile, and Flexible Robotic Systems (modular designs; smart, flexible end-effectors; smart, flexible sensors; automated path planning\/mobility); and, (5) Intelligent Robotic Systems (collaborative; self-aware; Machine Learning\/Artificial Intelligence techniques; advanced computing)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease is based on the funding profile for the Advanced Robotics Manufacturing agreement that provides $80.000 million to the agreement through the current period of performance."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Synthetic Biology (SynBio) Manufacturing Innovation Institute"
                                    },
                                    "Description": {
                                        "val": "Synthetic biology (SynBio) promises to deliver a new class of manufacturing to provide the United States with domestic capabilities to manufacture critical resources with increased supply chain security. SynBio manufacturing also has the potential to create entirely new classes of products with primary defense applications, such as chemicals and materials with advanced properties for use in austere environments. SynBio manufacturing addresses defense priorities and offers commercial potential for innovations in food, agriculture, fuel, pharmaceuticals, and other consumer products that will create new opportunities for U.S. manufacturers."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "Establish SynBio manufacturing innovation institute (MII) to foster an end-to-end U.S. 'ecosystem' for synthetic biology including cohesive scale-up manufacturing and downstream processing capabilities, integrated test & evaluation capacity, and data operationalized for design for manufacturing, all coupled with workforce development and a focus on ethics and biosecurity. The MII will be structured to address DoD and commercial applications. \n\nDoD will partner with the MII leadership to refine the strategic investment plan, establish initial membership in the SynBio ecosystem, initiate a SynBio technology road mapping process for all technical focus areas, and launch projects. The MII will take steps to bring together government, industry and academia SynBio capabilities to better position the U.S. relative to global competition. The SynBio MII will also enable universities and small to medium enterprises to participate in and benefit from the MII’s manufacturing advances."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding provided in FY 2021 to stand-up new SynBio Manufacturing Innovation Institute."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Each Manufacturing USA institute is established through a competitive selection process. The executing military department or agency, in close and continuous coordination with OSD ManTech, publishes a formal solicitation (funding opportunity announcement) for proposals describing the scope of required activities and extensive proposal evaluation criteria. Non-Profit Organizations (including universities) are eligible to bid, and each bidder forms a broad consortium of industry and academic partners. The executing military department or agency, in close coordination with OSD, uses a team of government experts to evaluate each proposal against the evaluation criteria and selects a winning consortium. The final terms of the cooperative agreement\/technology investment agreement between the selectee and the federal government are then negotiated and the CA or TIA is signed. Throughout and after completion of this process, the federal government makes clear that members of non-selected teams are encouraged to join the selected consortium as conditions permit."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "607"
                    },
                    "ProjectTitle": {
                        "val": "National Security Technology Accelerator Program"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Previous Years funding was provided as a congressional add transferred from Defense Logistics Agency's Generic Logistics R&D Technology Demonstrations Program,\nPE 0603712S."
                        },
                        "ProjectMissionDescription": {
                            "val": "The MD5 National Security Technology Accelerator (MD5) is a program office within the Office of the Undersecretary of Defense for Research and Engineering (OUSD(R&E)) that seeks to develop deep partnerships between the Department of Defense (DoD) and non-traditional thought partners, including colleges and universities, the entrepreneurial community and disruptive innovators within DoD itself. The speed and reactivity of the modern technology-threat environment challenge the traditional top-down model of defense problem-solving and capability development. Mitigating this deficiency requires developing internal workforce and organizational competencies and associated resources related to problem framing, knowledge and resource sharing, and non-traditional partnerships. Consistent with guidance from the Secretary of Defense and new Defense Innovation Initiative (DII), MD5 is a portfolio of innovation programs that (1) accelerates capability development leveraging non-traditional collaborators and “bottom-up” approaches, (2) augments the defense industry through the creation of startup businesses, and (3) enhances the DOD workforce through critical innovation skills development.\n\nThis program seeks to maintain the long-term competitive advantage for the US military over adversaries by tapping into high-potential uniformed and civilian employees of the DoD (i.e. intrapreneurs) and increasing their interactions with high-speed innovators and entrepreneurs outside of the DoD. This is accomplished by providing training and tools to these DoD intrapreneurs that empower them to find new ways to identify, frame, and solve problems as well as opening avenues to broadly implement the solutions they create. Additionally, the programs executed create opportunities for external innovators and entrepreneurs to be exposed to DoD problems and allow them to demonstrate possible solutions they can bring to bear on problems.\n\nMD5\/NSTA carries out its mission via three portfolios of effort: Education, Collaboration, and Acceleration. MD5 education and training programs develop DOD and industry personnel educated to continuously test and improve legacy processes and systems. MD5 collaboration programs like crowdsourcing develop human-centered networks that address DOD capability needs in an agile, cost-effective manner. MD5 acceleration programs develop ventures inside and outside of DOD that develop, commercialize, or apply technology relevant to warfighter problem sets.\n\nMD5 is a Congressional interest program that has received funding in FY 2016 ($5M), FY 2017 ($25M), FY 2018 ($25.5M), and FY 2019 ($15M)."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "National Security Technology Accelerator Program"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "15.000"
                                        },
                                        "Text": {
                                            "val": "The FY 2019 Congressional Add supports continuation of activities initiated in FY 2018."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "National Security Technology Accelerator Program"
                                    },
                                    "Description": {
                                        "val": "The MD5 mission is to develop “bottom-up” innovation as a core Department of Defense (DoD) competence\nthat complements the traditional defense industrial base and Research, Development, Technology and Engineering (RDT&E) enterprise.\n\nEducation Portfolio\nThe Education Portfolio programs contribute to workforce development by cultivating innovators and entrepreneurs inside DoD who are adept at creative problem solving, the development of innovative approaches and technologies, and venture formation that will improve national security, as well as deliver economic and social value.\n• “Boot Camps” are 4-day short courses that provide military organizations the opportunity to address some of their most pressing challenges in new ways. In the course, participants are instructed on topics related to innovation and intrapreneurship (including human centered design, lean methodology, technology literacy, and psychology of innovation) and taught to apply these skills to a set of command-sponsored problem topics. By the end, participants will have developed initial concepts to address these problem topics.\n• “Startup Innovation Fellowship (SIF)” is a 6-week fellowship opportunity for service members and civilians to be embedded in private companies to learn best practices in critical areas such as data science, artificial intelligence and machine learning, cyber security, logistics, rapid prototyping, etc. that can be brought back into the DoD.\n\nCollaboration Portfolio \nThe Collaboration Portfolio programs connect communities of innovators around problems and technologies relevant to national security to enable formation of new ventures.\n• “Hacks” exposes college students and local ventures to DoD customer problems over a 48 hour period and aims to provide MVP or low-TRL solutions through one of two channels: formation of a venture and\/or direct solution adoption by the problem sponsor.\n• “Hacking for Defense (H4D)” exposes college students to DoD customer problems over an academic semester and aims to provide MVP solutions through one of three channels: formation of a venture; direct solution adoption by the problem sponsor; or reframing the original problem.\n• “Source” invites bottom-up, ‘deckplate’ innovation from inside a military formation by providing either new solutions and novel applications directly to leadership from a sponsoring command.\n• “Catalyst” exposes local ventures to DoD customer problems over a 6-18month period and aims to provide high-TRL solutions for immediate adoption by the problem sponsor or a DoD contracting entity (e.g., DIUx).\n\nAcceleration Portfolio\nThe Acceleration Portfolio programs grow and mature civil-military technology ventures by ensuring that innovators can access critical resources, including design and engineering support, mentorship services, and commercial and DoD research and development infrastructure to build, test, and enhance venture concepts.\n• “Maker” provides facilities, access, materials, and training to entrepreneurs to fabricate, develop, and facilitate rapid prototyping of their technology. These more refined prototypes can further help DoD in deciding whether to commit more resources to a product. Primary capability located at Eagle Maker Hub at USM and Lincoln Lab at MIT. Also planning pilot with Idea Forge at CU Boulder.\n• “Fed Tech” pairs cutting edge inventor teams and technologies from the United States federal government laboratory system with highly qualified entrepreneurs to conduct customer discovery and build business models. The program leverages lean startup techniques, while also focusing on the unique aspects of turning a federally funded technology into a startup company. The program is split into two phases: Phase 1 – Startup Studio focuses on technology selection and team formation; Phase 2 – Pre-Accelerator is a deeper dive with the best teams from Phase 1 to focus on building a company around the technology.\n• “MD5 Starts” is a format for showcasing early stage startups who are working on technologies and products that are pursuing a dual-use market strategy. MD5 acts as a facilitator and convener amongst the ecosystem actors in a local geography, from incubator and accelerator programs, to research universities, startups and local or regional economic development organizations. \nThe goal of the event is to showcase the great economic opportunity that exists in building companies that have both great market potential and which address important and urgent needs of national security and defense.\n• “Hatch” helps entrepreneurs\/teams with an idea (i.e., from H4D) learn how to form and build a venture using industry best practices. The initial pilot is with the Founder Institute incubator program where MD5 candidates will participate.\n• “Propel” provides companies that have prototypes or initial customers with world-class education, mentorship, and relevant business connections to prepare the venture for scale while elevating their visibility in the venture community. The initial pilots of this program are with TechStars and MassChallenge. This program envisions feeding from Hacks and H4D.\n• “Gauge” provides facilities, access, materials, and training to entrepreneurs to develop, iterate, and refine their technology up to TRL 6\/7. Also provide access to test and development ranges.\n• “Launch” identifies existing government technology that can be applied to a stated customer problem or problem set and to then work with a team on a path to commercialize that technology.\n• “Boost” provides opportunities for companies to secure early, non-dilutive government funding in the form of grants or contracts.  This program will rely on the use of Small Business Innovation Research grants\/contracts.\n• “Bridge” provides founding teams with mentors and advisors who can help them in business, customer, and product\ndevelopment by providing the right advice and insights at the right time.\n\nPlatform\n• “Defense Innovation Network” is the online platform (currently www.md5.net) that MD5 is developing to facilitate gathering ideas and building a network of DoD innovators both inside and outside of the DoD. This platform is used for both the Hacks and Source.\n\nAccomplishments to-date:\n1. Delivery of eight (8) Hacks; nine (9) Boot Camps; two (2) JPME Elective Courses; four (4) semesters of Hacking for Defense; five (5) technology demonstrations w\/private and public capital.\n2. One USMC Program of Record \n3. Delivery of seven (7) prototypes; each in various states of Service-based testing and evaluation\n4. Launch of nine (9) dual-use ventures with DoD contracts valued at more than $45M\n5. More than 300 Service Members trained with bleeding edge, commercial innovation skill sets\n6. Expansion of H4D into 12 top-tier, university partners\n7. Expansion of MD5 into five (5) regional hubs throughout the United States (Denver; Los Angeles; Raleigh; NYC; and Boston)\n8. Graduation of more than 30 venture innovation fellows with direct exposure to start-up culture, best practices and lean design\n9. Transfer of 12 DoD lab technologies into commercial, early stage ventures for dual-use commercialization"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}