{
    "id": "2021-Army-PB-2040-JBOOK-24fcf105afc7c7d31f1382e71fbd0800d20c4793885e75717bfd3bc5bfb4138f-0",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA7-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603778A"
        },
        "ProgramElementTitle": {
            "val": "MLRS Product Improvement Program"
        },
        "R1LineNumber": {
            "val": "214"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "6.574"
            },
            "CurrentYear": {
                "val": "14.615"
            },
            "BudgetYearOne": {
                "val": "10.157"
            },
            "BudgetYearOneBase": {
                "val": "10.157"
            },
            "BudgetYearTwo": {
                "val": "12.467"
            },
            "BudgetYearThree": {
                "val": "35.514"
            },
            "BudgetYearFour": {
                "val": "33.997"
            },
            "BudgetYearFive": {
                "val": "35.685"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "149.009"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Program element (PE) 0603778A MLRS Product Improvement Program supports development and testing of the Army's rocket launcher fleet, including the Multiple Launch Rocket System (MLRS) launcher and the High Mobility Artillery Rocket System (HIMARS) launcher. MLRS and HIMARS launchers support the Army's number one priority modernization effort, Long Range Precision Fires.  Updated launchers are required to fire current and future munitions such as the Precision Strike Missile (PrSM) and Extended Range (ER) Guided Multiple Launch Rocket System (GMLRS).  Funding from both Projects 093 and DX8 contributes to common efforts between both launcher platforms such as Assured Positioning, Navigation and Timing (APNT) integration and rocket launcher software development effort by Combat Capabilities Development Command Aviation and Missile Center (CCDC AvMC). The goal is to develop common solutions applicable to both MLRS and HIMARS launchers. \n\nProject 093 M270A1 MLRS launcher is a full-spectrum, combat-proven, all-weather, 24\/7 lethal and responsive, precision strike weapon system. MLRS provides critical missile precision strike, operational shaping fires, counterfire, and close support destructive and suppressive fires. MLRS is a tracked, indirect fire, rocket\/missile launcher capable of firing two pods of precision rockets\/missiles from the current MLRS Family of Munitions (MFOM) to include the Guided Multiple Launch Rocket System-Unitary (GMLRS-U), GMLRS-Alternative Warhead, the Army Tactical Missile System (ATACMS) and future MFOM to include the ER GMLRS, and the Precision Strike Missile (PrSM).  Funds software development, training updates, Assured Positioning, Navigation and Timing (APNT) technology implementation, integration of satellite communications, and nonrecurring engineering for the MLRS launcher. Funds development related to maintaining capability associated with the current and evolving threat. Funding in FY 2023-2025 also funds non-recurring engineering for system hardware and software modernization to the MLRS chassis, Launcher Loader Module, and Fire Control System.  Funding from both Projects 093 and DX8 contributes to common efforts between both launcher platforms such as APNT integration and rocket launcher software development effort by CCDC AvMC. The goal is to develop common solutions applicable to both MLRS and HIMARS launchers. \n\nJustification:\nFiscal Year (FY) 2021 Base funding in the amount of $5.036 million for Project 093 continues tactical launcher software development, qualification, and materiel release to support the Fire Control System (FCS) electronic obsolescence mitigation hardware upgrade required to operate a MLRS launcher.  The tactical software is a critical developmental item required to field additional launchers, maintain backward compatibility for current fleet sustainment, and is the first release of government developed software common to both the MLRS and HIMARS launcher.  The FY 2021 funds also allow additional integration of Assured Positioning, Navigation and Timing (APNT) capabilities, and integration of satellite communications, allowing the MLRS to continue to effectively operate in near peer and peer threat environments. \n\nProject DX8 M142 High Mobility Artillery Rocket System (HIMARS) launcher is a full-spectrum, combat-proven, all-weather, 24\/7 lethal and responsive, precision strike weapon system. HIMARS provides critical missile precision strike, operational shaping fires, counterfire, and close support destructive and suppressive fires. HIMARS is a C-130 or C-17 transportable, wheeled, indirect fire, rocket\/missile launcher capable of firing one pod of precision rockets\/missiles from the current and emerging MLRS MFOM, to include the GMLRS-U, GMLRS-Alternative Warhead, the ATACMS and future MFOM to include the ER GMLRS, and the PrSM.  Funds software development, training updates, APNT technology implementation, integration of satellite communications, and nonrecurring engineering for the HIMARS launcher. Funds development related to maintaining capability associated with the current and evolving threat.  Funding from both Projects 093 and DX8 contributes to common efforts between both launcher platforms such as APN integration and rocket launcher software development effort by CCDC AvMC. The goal is to develop common solutions applicable to both MLRS and HIMARS launchers. \n\nFY 2021 Base funding in the amount of $5.121 million for Project DX8 supports tactical launcher software development and qualification to support the Fire Control System (FCS) electronic obsolescence mitigation hardware upgrade required to operate a HIMARS launcher. The tactical software is a critical developmental item required to field additional launchers, maintain backward compatibility for current fleet sustainment, and is the first release of government developed software common to both the MLRS and HIMARS launcher. This effort funds research integration of Assured Positioning, Navigation and Timing (APNT) capabilities, and integration of satellite communications, allowing the HIMARS to continue to effectively operate in near peer threat environments."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "6.877"
                },
                "CurrentYear": {
                    "val": "22.877"
                },
                "BudgetYearOne": {
                    "val": "10.167"
                },
                "BudgetYearOneBase": {
                    "val": "10.167"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.574"
                },
                "CurrentYear": {
                    "val": "14.615"
                },
                "BudgetYearOne": {
                    "val": "10.157"
                },
                "BudgetYearOneBase": {
                    "val": "10.157"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.303"
                },
                "CurrentYear": {
                    "val": "-8.262"
                },
                "BudgetYearOne": {
                    "val": "-0.01"
                },
                "BudgetYearOneBase": {
                    "val": "-0.01"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-8.262"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.303"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.01"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.01"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2021:  The $12.720 million decrease in base funding is a result of Army realignment of funds to higher priority programs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "093"
                    },
                    "ProjectTitle": {
                        "val": "Multi-Launch Rocket System (MLRS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.784"
                        },
                        "CurrentYear": {
                            "val": "6.563"
                        },
                        "BudgetYearOne": {
                            "val": "5.036"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.036"
                        },
                        "BudgetYearTwo": {
                            "val": "5.035"
                        },
                        "BudgetYearThree": {
                            "val": "31.476"
                        },
                        "BudgetYearFour": {
                            "val": "29.791"
                        },
                        "BudgetYearFive": {
                            "val": "31.479"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "113.164"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project 093 M270A1 MLRS launcher is a full-spectrum, combat-proven, all-weather, 24\/7 lethal and responsive, precision strike weapon system. MLRS provides critical missile precision strike, operational shaping fires, counterfire, and close support destructive and suppressive fires. MLRS is a tracked, indirect fire, rocket\/missile launcher capable of firing two pods of precision rockets\/missiles from the current MLRS Family of Munitions (MFOM) to include the Guided Multiple Launch Rocket System-Unitary (GMLRS-U), GMLRS-Alternative Warhead, the Army Tactical Missile System (ATACMS) and future MFOM to include the ER GMLRS, and the Precision Strike Missile (PrSM).  Funds software development, training updates, Assured Positioning, Navigation and Timing (APNT) technology implementation, integration of satellite communications, and nonrecurring engineering for the MLRS launcher. Funds development related to maintaining capability associated with the current and evolving threat. Funding in FY 2023-2025 also funds non-recurring engineering for system hardware and software modernization to the MLRS chassis, Launcher Loader Module, and Fire Control System.  Funding from both Projects 093 and DX8 contributes to common efforts between both launcher platforms such as APNT integration and rocket launcher software development effort by CCDC AvMC. The goal is to develop common solutions applicable to both MLRS and HIMARS launchers. \n\nJustification:\nFY 2021 Base funding in the amount of $5.036 million for Project 093 continues tactical launcher software development, qualification, and materiel release to support the Fire Control System (FCS) electronic obsolescence mitigation hardware upgrade required to operate a MLRS launcher. The tactical software is a critical developmental item required to field additional launchers, maintain backward compatibility for current fleet sustainment, and is the first release of government developed software common to both the MLRS and HIMARS launcher. The FY2021 funds also allow additional integration of Assured Positioning, Navigation and Timing (APNT) capabilities, and integration of satellite communications, allowing the MLRS to continue to effectively operate in near peer and peer threat environments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MLRS Product Improvement Program"
                                    },
                                    "Description": {
                                        "val": "The M270A1 MLRS Product Improvement Program provides the preservation of platform viability and readiness to accept technology insertion as capability enhancements are developed and to mitigate obsolescence.  Support efforts include: electronic obsolescence mitigation and enhancements for the M993A1 carrier, Fire Control System, Launcher Loader Module and Enhanced Command and Control; development and updating the Fire Control System software to keep pace with changes to the munitions; and performing Command, Control, Communications, Computers and Intelligence (C4I)\/interoperability and Information Assurance compliance certification and network interoperability testing. Perform technical assessments and concept studies for the following: obsolescence mitigation, APNT, crew protection, automotive and hardware\/software enhancements, improving operational timelines and risk reduction."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.625"
                                            },
                                            "Text": {
                                                "val": "Continued tactical launcher software development to support the Fire Control System obsolescence mitigation hardware upgrade required to operate a MLRS launcher and support upgrade and improvements to munitions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.265"
                                            },
                                            "Text": {
                                                "val": "Continued tactical launcher software development and qualification to support the FCS electronic obsolescence mitigation hardware upgrade required to operate a MLRS launcher. Conducted research and development of APNT capabilities, and integration of satellite communications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.036"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.036"
                                            },
                                            "Text": {
                                                "val": "Will continue updates to currently fielded tactical launcher software.  Continue tactical launcher software development to incorporate updates post Functional Qualification and Post System Integration Qualification to support the FCS electronic obsolescence mitigation hardware upgrade required to operate a MLRS launcher.  Conduct a demonstration for APNT capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decreased funding of $1.527 million delays the integration of GPS Anti-Jam and Anti-Spoofing capabilities, and integration of satellite communications by one year.  This limits the MLRS Launcher's ability to continue effective operations in near-peer threat environment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SIBR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Account for the FY 2019 SBIR \/ STTR Adjustment"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.159"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Adjustment"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.298"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "C67500"
                                    },
                                    "Title": {
                                        "val": "MLRS Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "478.998"
                                        },
                                        "CurrentYear": {
                                            "val": "372.55"
                                        },
                                        "BudgetYearOne": {
                                            "val": "330.419"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "310.419"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "20"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "277.623"
                                        },
                                        "BudgetYearThree": {
                                            "val": "207.159"
                                        },
                                        "BudgetYearFour": {
                                            "val": "165.712"
                                        },
                                        "BudgetYearFive": {
                                            "val": "165.062"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "C67500 is Budget Line Item Number (BLIN) 22 funded in the Missiles Procurement Army appropriation."
                        },
                        "AcquisitionStrategy": {
                            "val": "The M270A1 MLRS Product Improvement Program performs development efforts required to address emerging requirements. Emerging requirements include, but are not limited to, updates to address emerging threats to the launcher organic version 8.x software, reacting to system changes driven by policy and emerging requirements, and maintaining architectural compatibility with other Army ground based systems reducing sustainability costs. Update software and hardware for fire contol system, communications, and munitions to maintain compatibility and operational viability against near-peer adversaries."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Acronyms:\nAvMC: Aviation and Missile Center;\nCCDC: Combat Capabilities Development Command;\nAMRDEC - Aviation and Missile Research Development and Engineering Center; \nPFRMS - Precision Fires Rocket and Missile Systems (former name for PM STORM); \nSTORM - Strategic and Operational Rocket and Missile Systems (new name for PM PFRMS);\nCTSF - Central Technical Support Facility; \nATEC - US Army Test and Evaluation Command; \nAPG MD - Aberdeen Proving Ground, Maryland; \nWSMR - White Sands Missile Range; \nRTC RSA - Redstone Test Center, Redstone Arsenal, Alabama"
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Government Program Management funding was transferred to the Operations and Maintenance, Army (OMA) appropriation."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PFRMS Project Office"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.955"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.955"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2019 SBIR \/ STTR"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.159"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.084"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.243"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.298"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.298"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Organic (government developed, maintained, and owned) software development includes additional research and development related to Fire Control System electronic obsolescence, Assured Position, Navigation and Timing (APNT) activities such as Global Positioning System (GPS) Anti-Jam, Anti-Spoofing capabilities, and integration of satellite communications."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Other Government Agencies OGA"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "FT SILL OK, CECOM-NJ AMRDEC-RSA AL,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.108"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "17.108"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "MLRS IAC"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Grand Prairie, TX"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "30.498"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "30.498"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "MLRS FCS Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Grand Prairie, TX"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "70.2"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "70.200"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Organic Software Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CCDC AvMC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.76"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.625"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.831"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.036"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.036"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Risk Reduction Effort: Common Fire Control System"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Grand Prairie, TX"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "21.9"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "21.900"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Risk Reduction Effort: Hulls"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Red River Army Depot"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Red River Army Depot, TX"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.2"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.200"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Assured Position, Navigation and Timing (APNT)  Demonstration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CCDC AvMC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.176"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.176"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Support Contract"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.834"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.834"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test Support, Joint Interoperability Test Certificate"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CTSF, Ft. Hood"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Texas"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.712"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "10.712"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Ft Hood, TX, ATEC, APG, MD, WSMR, RTC,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "RSA: Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.174"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "7_093_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Software Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Software Qualification"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Post System Integration Qualification"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Functional Configuration Audit"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Delta Live Fire Testing for Improved Armored Cab (IAC)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GPS Anti-Jam\/Anti-Spoofing Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GPS Anti-Jam\/Anti-Spoof Demonstration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Launcher Modernization"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "System Requirements Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "System Functional Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Preliminary Design Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Critical Design Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DX8"
                    },
                    "ProjectTitle": {
                        "val": "HIMARS Product Improvement Program"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.79"
                        },
                        "CurrentYear": {
                            "val": "8.052"
                        },
                        "BudgetYearOne": {
                            "val": "5.121"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.121"
                        },
                        "BudgetYearTwo": {
                            "val": "7.432"
                        },
                        "BudgetYearThree": {
                            "val": "4.038"
                        },
                        "BudgetYearFour": {
                            "val": "4.206"
                        },
                        "BudgetYearFive": {
                            "val": "4.206"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "35.845"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project DX8 M142 High Mobility Artillery Rocket System (HIMARS) launcher is a full-spectrum, combat-proven, all-weather, 24\/7 lethal and responsive, precision strike weapon system. HIMARS provides critical missile precision strike, operational shaping fires, counterfire, and close support destructive and suppressive fires. HIMARS is a C-130 or C-17 transportable, wheeled, indirect fire, rocket\/missile launcher capable of firing one pod of precision rockets\/missiles from the current and emerging MLRS MFOM, to include the GMLRS-U, GMLRS-Alternative Warhead, the ATACMS and future MFOM to include the ER GMLRS, and the PrSM.  Funds software development, training updates, APNT technology implementation, integration of satellite communications, and nonrecurring engineering for the HIMARS launcher. Funds development related to maintaining capability associated with the current and evolving threat.  Funding from both Projects 093 and DX8 contributes to common efforts between both launcher platforms such as Assured Positioning, Navigation and Timing (APNT) integration and rocket launcher software development effort by CCDC AvMC. The goal is to develop common solutions applicable to both MLRS and HIMARS launchers. \n\nJustification:\nFY 2021 Base funding in the amount of $5.121 million for Project DX8 supports tactical launcher software development and qualification to support the Fire Control System (FCS) electronic obsolescence mitigation hardware upgrade required to operate a HIMARS launcher. The tactical software is a critical developmental item required to field additional launchers, maintain backward compatibility for current fleet sustainment, and is the first release of government developed software common to both the MLRS and HIMARS launcher. This effort funds research integration of Assured Positioning, Navigation and Timing (APNT) capabilities, and integration of satellite communications, allowing the HIMARS to continue to effectively operate in near peer threat environments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MLRS Production Improvement Program (PIP)-HIMARS PIP"
                                    },
                                    "Description": {
                                        "val": "The HIMARS Product Improvement Program provides the preservation of platform viability and readiness to accept technology insertion.  As capability enhancements are developed, technology is inserted in order to mitigate obsolescence.  Support efforts include: obsolescence mitigation and enhancements for the truck, Fire Control System, Launcher Loader Module and Enhanced Command and Control; development and updating the Fire Control System software to keep pace with changes to the munitions; and performing Command, Control, Communications, Computers and Intelligence (C4I)\/interoperability and Information Assurance compliance certification and network interoperability testing. Perform technical assessments and concept studies for the following: electronic obsolescence mitigation and redesign to keep pace with the evolving threat, APNT, crew protection, automotive and hardware\/software enhancements, improving operational timelines, and risk reduction."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.79"
                                            },
                                            "Text": {
                                                "val": "Continued tactical launcher software development to support the Fire Control System obsolescence mitigation hardware upgrade required to operate a HIMARS launcher and support upgrade and improvements to munitions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.686"
                                            },
                                            "Text": {
                                                "val": "Continued tactical launcher software development and qualification to support the FCS electronic obsolescence mitigation hardware upgrade required to operate a HIMARS launcher. Conducted research and development of APNT capabilities, and integration of satellite communications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.121"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.121"
                                            },
                                            "Text": {
                                                "val": "Continue tactical launcher software development, risk reduction, and qualification to support the FCS electronic obsolescence mitigation hardware upgrade required to operate a HIMARS launcher. Integrate APNT capabilities, and integrate satellite communications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decreased funding of $1.931million delays integration of APNT capabilities, and integration of satellite communications.  This integration allows the HIMARS Launcher to continue effective operations in near-peer threat environments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.366"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "C67501"
                                    },
                                    "Title": {
                                        "val": "HIMARS Modifications"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.196"
                                        },
                                        "CurrentYear": {
                                            "val": "12.483"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.081"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.081"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.292"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.7"
                                        },
                                        "BudgetYearFour": {
                                            "val": "17.402"
                                        },
                                        "BudgetYearFive": {
                                            "val": "29.968"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "C02901"
                                    },
                                    "Title": {
                                        "val": "High Mobility Artillery Rocket System (HIMARS)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "171.138"
                                        },
                                        "BudgetYearOne": {
                                            "val": "41.226"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "41.226"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "88.979"
                                        },
                                        "BudgetYearThree": {
                                            "val": "41.228"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "342.571"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "C67501 (Budget Line Item Number 23) and C02091 (Budget Line Item Number 13) are funded in the Missiles Procurement Army appropriation."
                        },
                        "AcquisitionStrategy": {
                            "val": "The M142 HIMARS Product Improvement Program performs development efforts required to address emerging requirements. Emerging requirements include, but are not limited to, updates to address emerging threats to the launcher organic version 8.x software, reacting to system changes driven by policy and emerging requirements, and maintaining architectural compatibility with other Army ground based systems reducing sustainability costs. Update software and hardware for fire control system, communications, and munitions to maintain compatibility and operational viability against near-peer adversaries."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "AvMC: Aviation and Missile Center;\nCCDC: Combat Capabilities Development Command;\nAMRDEC - Aviation and Missile Research Development and Engineering Center; \nPFRMS - Precision Fires Rocket and Missile Systems (former name for PM STORM); \nSTORM - Strategic and Operational Rocket and Missile Systems (new name for PM PFRMS);\nCTSF - Central Technical Support Facility; \nATEC - US Army Test and Evaluation Command; \nAPG MD - Aberdeen Proving Ground, Maryland; \nWSMR - White Sands Missile Range; \nRTC RSA - Redstone Test Center, Redstone Arsenal, Alabama"
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Government Program Management funding was transferred to the Operations and Maintenance, Army (OMA) appropriation."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PFRMS Project Office"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.817"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.1"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.1"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.917"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2019 SBIR \/ STTR"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.144"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.144"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.366"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.366"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Organic (government developed, maintained, and owned) software development includes additional research and development related to Fire Control System electronic obsolescence, Assured Position, Navigation and Timing (APNT) activities such as Global Positioning System (GPS) Anti-Jam, Anti-Spoofing capabilities, and integration of satellite communications."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Other Government Agencies (OGA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AMCOM, GSA, RSA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.318"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.318"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Organic Software Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CCDC AvMC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.389"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.546"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.431"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.021"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.021"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "APNT Demonstration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CCDC AvMC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.128"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.128"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Ft Hood, TX, ATEC, APG, MD, WSMR, RTC, RSA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.459"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.1"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.127"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "7_DX8_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Software Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Software Qualification"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Post System Integration Qualification"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Improved Crew Protection (ICP) Cab Live Fire Testing (Coupon Testing)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "APNT Demonstration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}