{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-855515f7cbe1443b1cc76e32ff869263061a887974718017fcc8f688288c6578-67",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604875D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Systems Architecture Development"
        },
        "R1LineNumber": {
            "val": "147"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "23.797"
            },
            "PriorYear": {
                "val": "3.929"
            },
            "CurrentYear": {
                "val": "9.593"
            },
            "BudgetYearOne": {
                "val": "8.497"
            },
            "BudgetYearOneBase": {
                "val": "8.497"
            },
            "BudgetYearTwo": {
                "val": "8.436"
            },
            "BudgetYearThree": {
                "val": "8.147"
            },
            "BudgetYearFour": {
                "val": "8.407"
            },
            "BudgetYearFive": {
                "val": "8.582"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2020, the increase of approximately $4.000 million in Joint Systems Architecture Development account is due to new and expanded mission areas and requirements in the Assistant Secretary of Defense for Acquisition (ASD(A)) portfolio as a result of the USD (A&S) re-organization.  In addition, these funds will support the Electromagnetic Warfare Executive Committee (EW EXCOMM) pursue solutions to issues such as Electronic Battle Management (EMBM), and the development of a comprehensive electronic warfare strategy to identify gaps and requirements across the Department. The funds will include support to the mission engineering analyses and integration to incorporate soft kill and Electronic Warfare effects, and weapon systems in critical mission thread areas in order to meet evolving threats."
        },
        "ProgramElementMissionDescription": {
            "val": "Department and acquisition reform initiatives call for top down, national security strategy-driven capabilities-based planning. Department of Defense (DoD) Instruction 5000.02 and Chairman of the Joint Chiefs of Staff Instruction 3170.01 promulgate capabilities-based requirements and acquisition processes. The JSAD program enables collaborative efforts to achieve these goals with a focus on Major Defense Acquisition Programs (MDAPs). These efforts include warfighting capability-based analyses; assessments of joint capability areas and joint integrating concepts; development of system-related data; integrated roadmaps to support acquisition investment decisions; and assessments of MDAPs in a capability area context.  Activities in the JSAD project are divided into three areas:  (1) capability-based analysis; (2) roadmaps; and (3) support tools and guidance. Capability-based analysis provides analysis of the different technology, functionality, and integration impacts of systems on warfighting capability.  Acquisition roadmaps guide systems development and associated investment plans.  JSAD support tools and guidance initiatives develop systems data, and tools, exploit modeling and simulation and architecture efforts to improve DoD’s overall assessment capability.  These efforts guide the development and improve the testing and fielding of integrated systems of systems in order to achieve Joint mission capabilities.  The Department has also undergone an institutional reorientation or shift in emphasis from organization-specific to enterprise-wide approaches, which includes:  (1) horizontal integration within the Department and unity of effort through greater interagency collaboration; (2) engaging in a coordinated and portfolio-based approach to planning, programming, budgeting and execution; and (3) significant reforms at the governance, management and execution levels.  To accomplish this intent, there needs to be a focused goal and concerted emphasis on shifting from systems acquisition to capabilities-based portfolio management (or portfolio systems acquisition).  This program enables collaborative efforts to implement the Quadrennial Defense Review (QDR) direction outlined above in order to achieve portfolio systems acquisition goals.  The program is broken up into two focus areas (Portfolio Management and Reform Initiatives)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.079"
                },
                "CurrentYear": {
                    "val": "9.593"
                },
                "BudgetYearOne": {
                    "val": "9.778"
                },
                "BudgetYearOneBase": {
                    "val": "9.778"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.929"
                },
                "CurrentYear": {
                    "val": "9.593"
                },
                "BudgetYearOne": {
                    "val": "8.497"
                },
                "BudgetYearOneBase": {
                    "val": "8.497"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.150"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-1.281"
                },
                "BudgetYearOneBase": {
                    "val": "-1.281"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.149"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "A&S realignment to priority efforts for Industrial Policy\/Special Programs\/GSA"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.767"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.767"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Cancelled Accounts"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.001"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.009"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.009"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Defense Wide Review Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.505"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.505"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY 2020, the increase of approximately $4.000 million in Joint Systems Architecture Development (JSAD) funds is due to new and expanded mission areas and requirements in the Assistant Secretary of Defense for Acquisition (ASD(A)) portfolio as a result of the USD Acquisition and Sustainment (A&S) re-organization.  In addition, these funds will support the Electronic Warfare Executive Committee (EW EXCOMM) pursuit of solutions to issues such as Electromagnetic Battle Management (EMBM), and the development of a comprehensive electronic warfare strategy to identify gaps and requirements across the Department. The funds will include support to the mission engineering analyses and integration to incorporate soft kill and Electronic Warfare effects, and weapon systems in critical mission thread areas in order to meet evolving threats."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "875"
                    },
                    "ProjectTitle": {
                        "val": "Portfolio Systems Acquisition (PSA)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "PriorYearsDelta": {
                        "val": "0.004"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "18.808"
                        },
                        "PriorYear": {
                            "val": "2.934"
                        },
                        "CurrentYear": {
                            "val": "4.092"
                        },
                        "BudgetYearOne": {
                            "val": "4.413"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.413"
                        },
                        "BudgetYearTwo": {
                            "val": "4.672"
                        },
                        "BudgetYearThree": {
                            "val": "4.257"
                        },
                        "BudgetYearFour": {
                            "val": "4.398"
                        },
                        "BudgetYearFive": {
                            "val": "4.486"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2020, the funding increase of approximately $4.000 million in Joint Systems Architecture Development (JSAD) funds is due to new and expanded mission areas and requirements in the Assistant Secretary of Defense for Acquisition (ASD(A)) portfolio as a result of the USD Acquisition and Sustainment (A&S) re-organization.  In addition, these funds will enable Electronic Warfare Executive Committee (EW EXCOMM) pursuit of solutions to issues such as Electromagnetic Battle Management (EMBM), and the development of a comprehensive electronic warfare strategy to identify gaps and requirements across the Department. The funds will include support to the mission engineering analyses and integration to incorporate soft kill and Electronic Warfare effects, and weapon systems in critical mission thread areas in order to meet evolving threats."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Department's 2005 Quadrennial Defense Review (QDR) laid out the need for an institutional reorientation or shift in emphasis from organization-specific to enterprise-wide approaches which meant:  (1) horizontal integration within the Department and unity of effort through greater interagency collaboration; (2) engaging in a coordinated and portfolio-based approach to planning, programming, budgeting and execution; and (3) significant reforms at the governance, management and execution levels.  The Department’s 2010 QDR report further addressed reforming how we buy, noting that the conventional acquisition process is too long and too cumbersome to fit the needs of the many systems that require continuous changes and upgrades - a challenge that will become only more pressing over time. Better Buying Power (BBP) is the implementation of best practices to strengthen the Defense Department's buying power, improve industry productivity, and provide an affordable, value-added military capability to the Warfighter.  Launched in 2010, BBP encompasses a set of fundamental acquisition principles to achieve greater efficiencies through affordability, cost control, elimination of unproductive processes and bureaucracy, and promotion of competition. BBP initiatives also incentivize productivity and innovation in industry and Government, and improve tradecraft in the acquisition of services. The Department will improve how it matches requirements with mature technologies, maintains disciplined systems engineering approaches.  To accomplish this direction, there needed to be a focused goal and concerted emphasis on shifting from acquisition of individual systems to portfolio management (or portfolio systems acquisition).  This program enables collaborative efforts to implement the QDR direction outlined above and advance BBP initiatives to achieve portfolio systems acquisition goals and to develop and implement acquisition reform initiatives."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Portfolio Systems Acquisition (PSA)"
                                    },
                                    "Description": {
                                        "val": "The program is broken up into two focus areas (Portfolio Management and Reform Initiatives) and consolidates work previously performed under various other Program Elements.\n\nFY 2019 Accomplishments:\n- Continued A&S staff re-organization efforts resulting from the dissolution of OUSD(AT&L).\n- Began applying Mission Engineering analysis on warfare areas to identify portfolio and program synergies, reduce duplication, and identify opportunities for cost savings.\n- Conducted analyses and supported implementation of updated Better Buying Power (BBP) initiatives.\n- Provided technical expertise in management of warfare area portfolios.\n- Assessed progress of program management initiatives and continued support to a variety of certification and qualification standards activities.\n- Continued \"reliability by design\", capability, capacity, and lethality analyses and support to programs.\n- Updated roadmaps to guide investments in critical areas (for example:Future Vertical Lift, unmanned systems, ground vehicles, weapons\/munitions and Integrated Air and Missile Defense (IAMD)).\n- Provided analytical support for the IAMD portfolio.\n- Performed analytical support for the munitions acquitisiom process, from requirements generation to demilitarization.\n- Piloted Mission Engineering practice within A&S to evaluate warfighter priority mission areas with a rigorous, data-driven analytic process to determine how systems work together in an operationally relevant environment and identify ways to integrate technology and systems to provide affordable capability solutions for our warfighters.\n- Advised senior Department leaders on strategies to produce, develop, and sustain the F-35 Lightning II program and worldwide fleet of aircraft.  \n- Developed and implemented a comprehensive acquisition strategy to identify capability gaps and requirements across the F-35 enterprise.\n- Provided technical expertise to identify F-35 portfolio synergies to reduce program duplication, improve aircraft production, improve fleet health, and identify cost savings.\n- Responded to Government Accountability Office (GAO) inquiries.\n- Responded to DOD Inspector General (DODIG) inquiries.\n- Coordinated and participated in senior level leadership meetings for the F-35 program to include Executive Steering Groups (ESGs) and Acquisition Small Groups (ASGs).\n- Provided expert acquisition\/program support to enable Programming and Budget Review (PBR) activities for the F-35 Program Objective Memorandum (POM).  \n- Provided support to the Deputy's Management Action Group (DMAG).\n- Provided technical expertise to integrate strategic communications and develop analytical products for decision by DoD officials, U.S. Congress, and the White House.\n- Prepared strategic communications and developed analytical products for engagements with the media, interagency, industry, and international partners.\n- Coordinated strategic forums to promote dialogue to include the F-35 CEO Roundtable and F-35 Senior Executive Review meetings.  \n- Assessed progress of program management initiatives to support the F-35 program’s shift from development & initial production to full rate production and modernization.\n- Supported Air Warfare Major Defense Acquisition Programs (Primarily VC-25B; KC-46B; F-35; and the National Airborne Operations Center (NAOC), Executive Airlift, Airborne National Command Post (ABNCP), Take Charge and Move Out (TACAMO) (NEAT) Analysis of Alternatives (AoA))\n- Supported Acquisition Staff Specialists with drafting, reviewing, and coordination of programmatic, policy, and congressional issues and related documentation.  Examples include Action\/Information Memos; read-aheads; correspondence; budget documents; Reports to Congress; congressional legislation; legislative proposals; FOIA requests and congressional, GAO and DoD IG RFIs.\n- Supported OUSD(A&S) and CAPE meetings.  Examples include NEAT AoA WIPTs, Executive SAGs, and SAGs \n- Coordinated with OSD Joint Service Provider to provide NEAT AoA Study Team computer and software support to enable effective semi-monthly working group meetings in the National Capitol Region (NCR).\n- Supported drafting, review, tracking, and staffing of Commercial Off The Shelf (COTS) UAS exemption waivers in accordance with  Deputy Secretary of Defense (DSD) UAS Cyber Vulnerabilities Memo, May 23, 2018, and associated DSD Guidance for submission of waiver requests.\n- Supported Chair, DoD Policy Board on Federal Aviation Working Group and UAS Subgroup\n- Reviewed Committee on Foreign Investment in the United States (CFIUS) Cases and Draft DoD Directives and Instructions\n- Conducted Security Reviews.\n- Completed independent assessment of October 2016 Red Sea Events - performed by Massachusetts Institute of Technology Lincoln Laboratory."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.934"
                                            },
                                            "Text": {
                                                "val": "-Continue and expand support Mission Area Portfolio Assessments and warfare areas to identify portfolio and program synergies, reduce duplication, and identify opportunities for cost savings.\n-Conduct additional analyses and support implementation of updated Better Buying Power (BBP) initiatives.\n-Provide technical expertise in support of warfare area portfolios.\n-Assess progress of program management initiatives and continue support to a variety of certification and qualification standards activities.\n-Continue \"reliability by design\", capability, capacity, and lethality analyses and support to programs.\n-Update roadmaps and where appropriate generate new roadmaps to guide investments in critical areas (e.g., future vertical lift, unmanned systems, ground vehicles, weapons\/munitions and Integrated Air and Missile Defense (IAMD)).\n-Continue analytical support for the IAMD portfolio.\n-Continue analytical support for the munitions process, from requirements generation to demilitarization.\n- Continue A&S staff re-organization efforts resulting from the dissolution of OUSD(AT&L).\n- Pilot and establish Mission Engineering practice within A&S to evaluate warfighter priority mission areas with a rigorous, data-driven analytic process to determine how systems work together in an operationally relevant environment and identify ways to integrate technology and systems to provide affordable capability solutions for our warfighters"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.092"
                                            },
                                            "Text": {
                                                "val": "- Continue to perform portfolio management of programs falling within the Air, Ground, Maritime and Electronic Warfare mission areas, to include application of mission engineering analysis of kill chains.\n- Identify portfolio and program synergies, reduce duplication, and identify opportunities for cost savings.\n- Conduct analyses and support implementation of updated Better Buying Power (BBP) initiatives.\n- Provide technical expertise in support of warfare area portfolios.\n- Assess progress of program management initiatives and continue support to a variety of certification and qualification standards activities.\n- Continue \"reliability by design\", capability, capacity, and lethality analyses and support to programs.\n- Update roadmaps and, where appropriate, generate new roadmaps to guide investments in critical areas (for example: future vertical lift, unmanned systems, ground vehicles, weapons\/munitions, and Integrated Air and Missile Defense (IAMD)).\n- Continue analytical support for the IAMD portfolio.\n- Continue analytical support for the munitions acquisition process, from requirements generation to demilitarization.\n- Continue A&S staff re-organization efforts resulting from the dissolution of OUSD(AT&L).\n- Pilot and establish Mission Engineering practice within A&S to evaluate warfighter priority mission areas with a rigorous, data-driven analytic process to determine how systems work together in an operationally relevant environment and identify ways to integrate technology and systems to provide affordable capability solutions for our warfighters.\n- Provide leadership and support to the EW EXCOMM.\n- Provide leadership and support to the stand-up and institution of the EW Cross Functional Team.\n- Provide leadership and support to the Close Combat Lethality Task Force (CCLTF).\n- Provide support to Deputy Assistant Secretary of Defense (DASD) for the stand up and initiation of the Homeland Defense Cruise Missile Defense Cross Functional Team.\n- Respond to Government Accountability Office (GAO) inquiries.\n- Respond to DOD Inspector General (DODIG) inquiries.\n- Review Council on Foreign Investment in the United States (CFIUS) cases.\n- Participate in and support senior level leadership meetings for the F-35 program to include Executive Steering Groups (ESGs).\n- Participate in Programming and Budget Review (PBR) activities such as Strategic Portfolio Reviews (SPRs), Issue Teams, and Competitive Area Studies.\n- Provide support and participate, as needed, in the Joint Capabilities Integration and Development process, to include functional warfare working groups, Functional Capabilities Boards (FCBs), Joint Capabilities Boards (JCBs) and Joint Requirements Oversight Councils (JROCs).\n- Lead, participate in, and provide support to the Strategic Portfolio Reviews (SPRs) and assigned issue paper teams.\n- Provide support to the Deputy's Management Action Group (DMAG).\n- Provide support to the 3 Star Programmer's meetings."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.413"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.413"
                                            },
                                            "Text": {
                                                "val": "- Further develop portfolio management of programs falling within the Air, Ground, Maritime and Electronic Warfare mission areas, to include application of mission engineering analysis of kill chains.\n- Identify portfolio and program synergies, reduce duplication, and identify opportunities for cost savings.\n- Conduct analyses and support implementation of updated Better Buying Power (BBP) initiatives.\n- Provide technical expertise in support of warfare area portfolios.\n- Assess progress of program management initiatives and continue support to a variety of certification and qualification standards activities.\n- Continue \"reliability by design\", capability, capacity, and lethality analyses and support to programs.\n- Update roadmaps and, where appropriate, generate new roadmaps to guide investments in critical areas (e.g., future vertical lift, unmanned systems, ground vehicles, weapons\/munitions, and Integrated Air and Missile Defense (IAMD)).\n- Continue analytical support for the IAMD portfolio.\n- Continue analytical support for the munitions process, from requirements generation to demilitarization.\n- Further implement Mission Engineering practices within A&S to evaluate warfighter priority mission areas with a rigorous, data-driven analytic process to determine how systems work together in an operationally relevant environment and identify ways to integrate technology and systems to provide affordable capability solutions for our warfighters.\n- Provide leadership and support to the stand-up and institution of the EW Cross Functional Team.\n- Provide leadership and support to the Close Combat Lethality Task Force (CCLTF).\n- Provide support to Deputy Assistant Secretary of Defense (DASD) for the stand up and initiation of the Homeland Defense Cruise Missile Defense Cross Functional Team.\n- Respond to Government Accountability Office (GAO) inquiries.\n- Respond to DOD Inspector General (DODIG) inquiries.\n- Review Council on Foreign Investment in the United States (CFIUS) cases.\n- Participate in and support senior level leadership meetings for the F-35 program to include Executive Steering Groups (ESGs).\n- Participate in Programming and Budget Review (PBR) activities such as Strategic Portfolio Reviews (SPRs), Issue Teams, Competitive Area Studies.\n- Provide support and participate, as needed, in the Joint Capabilities Integration and Development process, to include functional warfare working groups, Functional Capabilities Boards (FCBs), Joint Capabilities Boards (JCBs) and Joint Requirements Oversight Council (JROCs).\n- Lead, participate in, and provide support to the Strategic Portfolio Reviews (SPRs) and assigned issue paper teams.\n- Provide support to the Deputy's Management Action Group (DMAG).\n- Provide support to the 3 Star Programmer's meetings."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not applicable"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increase will result in greater focus on establishing program management from a portfolio management perspective and application of mission engineering analyses of programs falling within assigned portfolios.  Specifically, personnel will continue to develop outcomes based evaluation metrics and experimental designs to provide evaluation of mission effects\/kill chains."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "220"
                    },
                    "ProjectTitle": {
                        "val": "Electronic Warfare Executive Committee"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "4.989"
                        },
                        "PriorYear": {
                            "val": "0.995"
                        },
                        "CurrentYear": {
                            "val": "5.501"
                        },
                        "BudgetYearOne": {
                            "val": "4.084"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.084"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.764"
                        },
                        "BudgetYearThree": {
                            "val": "3.890"
                        },
                        "BudgetYearFour": {
                            "val": "4.009"
                        },
                        "BudgetYearFive": {
                            "val": "4.096"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Electronic Warfare (EW) Executive Committee (EXCOM) - co-chaired by the Under Secretary of Defense for Acquisition & Sustainment (USD(A&S)), and the Vice Chairman of the Joint Chiefs of Staff (VCJCS) - is tasked to provide senior oversight, coordination, budget\/capability harmonization, and advice on EW matters to the Secretary of Defense, Deputy Secretary of Defense (DSD), and the Deputy's Management Action Group (DMAG). This program develops, maintains, and implements the overarching DoD EW Strategy and Implementation Plan to achieve Electromagnetic Spectrum (EMS) superiority. This program provides technical analyses, technology assessments, capability and capability gap identification, intelligence and threat evaluations to inform DoD EW requirements, acquisition programs, and investment decisions. This program also advances EW needs in modeling, simulation, test, exercises, experimentation, and training.  This budget exhibit also provides support to the EW Cross Functional Team (EW CFT) which was established and instituted in FY 2019."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Electronic Warfare Executive Committee"
                                    },
                                    "Description": {
                                        "val": "Funds will be used to conduct analytic assessments of fielded and planned U.S. EW capabilities, threat analysis, and physics-based modeling and simulation of electronic warfare capabilities to support the Deputy Secretary of Defense-directed Electronic Warfare (EW) Executive Committee (EXCOMM) and provide support to the Electronic Warfare Cross Functional Team (EW CFT).\n\nFY 2019 Accomplishments:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.995"
                                            },
                                            "Text": {
                                                "val": "- Develop plans and conduct Doctrine, Organization, Training, Material, Leadership and Education, Personnel, Facilities and Policy (DOTMLPF-P) initiatives to implement the Department's EW strategy.\n- Continue to perform the necessary analytic underpinning to develop and field advanced EW capabilities, including EW manning, training, exercises, modeling and simulation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.501"
                                            },
                                            "Text": {
                                                "val": "- Develop a comprehensive electronic warfare strategy to identify EW capability gaps and requirements across the Department.\n- Develop a mission engineering analyses and integration to incorporate soft kill and Electronic Warfare effects, and weapon systems in critical mission thread areas in order to meet evolving threats.\n-Develop plans and conduct Doctrine, Organization, Training, Material, Leadership and Education, Personnel, Facilities and Policy (DOTMLPF-P) initiatives to implement the Department's EW strategy.\n- Continue to perform the necessary analytic underpinning to develop and field advanced EW capabilities, including EW manning, training, exercises, modeling and simulation.\n- Add support Electromagnetic Battle Management (EMBM) activities to include: electromagnetic spectrum consumption modeling, force composability, data sharing policy standardization, distributed kill-chains using heterogeneous (joint \/ partner \/ different industry partners) capabilities, and Joint airborne electronic attack mission optimization (simulation analysis)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.084"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.084"
                                            },
                                            "Text": {
                                                "val": "- Develop a comprehensive electronic warfare strategy to identify EW capability gaps and requirements across the Department.\n- Develop a mission engineering analyses and integration to incorporate soft kill and Electronic Warfare effects and weapon systems in critical mission thread areas in order to meet evolving threats.\n-Develop plans and conduct Doctrine, Organization, Training, Material, Leadership and Education, Personnel, Facilities and Policy (DOTMLPF-P) initiatives to implement the Department's EW strategy.\n- Continue to perform the necessary analytic underpinning to develop and field advanced EW capabilities, including EW manning, training, exercises, modeling and simulation.\n- Continue support to Electromagnetic Battle Management (EMBM) activities to include: electromagnetic spectrum consumption modeling, force composability, data sharing policy standardization, distributed kill-chains using heterogeneous (joint \/ partner \/ different industry partners) capabilities, and Joint airborne electronic attack mission optimization (simulation analysis)."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not Applicable"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decrease is the result of the Defense Wide Review."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        }
                    }
                }
            ]
        }
    }
}