{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-855515f7cbe1443b1cc76e32ff869263061a887974718017fcc8f688288c6578-27",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603727D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Warfighting Program (JWP)"
        },
        "R1LineNumber": {
            "val": "55"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "43.713"
            },
            "PriorYear": {
                "val": "5.161"
            },
            "CurrentYear": {
                "val": "4.846"
            },
            "BudgetYearOne": {
                "val": "3.871"
            },
            "BudgetYearOneBase": {
                "val": "3.871"
            },
            "BudgetYearTwo": {
                "val": "3.994"
            },
            "BudgetYearThree": {
                "val": "4.082"
            },
            "BudgetYearFour": {
                "val": "4.156"
            },
            "BudgetYearFive": {
                "val": "4.252"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Warfighting Program (JWP) supports the Assistant Secretary of Defense for Acquisition (ASD(A))'s responsibilities for acquisition and portfolio management.  JWP underwrites analyses, studies, limited scope experiments, wargaming, and partnerships that define joint capability gaps and develops credible requirements for follow-on acquisition efforts.  These analyses and assessments deliver independent perspectives on potential remedies to align acquisition investments and solutions for joint capability gaps created by future warfighting environments and emerging threats.  JWP supports two main lines of effort, mission integration management and cyber resiliency wargames. Mission integration management will access specific critical mission threads, determine defense investments to fix lethality deficiencies, and to develop kill chain data modeling.  Cyber resiliency wargames will be conducted in support of Combatant Commands mission areas to develop strategies for mitigation of cyber vulnerabilities focusing on ballistic missile defense, nuclear command and control and other key mission areas relevant to national security challenges."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.978"
                },
                "CurrentYear": {
                    "val": "4.846"
                },
                "BudgetYearOne": {
                    "val": "4.977"
                },
                "BudgetYearOneBase": {
                    "val": "4.977"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.161"
                },
                "CurrentYear": {
                    "val": "4.846"
                },
                "BudgetYearOne": {
                    "val": "3.871"
                },
                "BudgetYearOneBase": {
                    "val": "3.871"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.817"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-1.106"
                },
                "BudgetYearOneBase": {
                    "val": "-1.106"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.598"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.218"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "A&S realignment to priority efforts for Industrial Policy\/Special Programs\/GSA"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.872"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.872"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Cancelled Acct"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.001"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.004"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.004"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Defense Wide Review Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.230"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.230"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Joint Warfighting Program decreased by $3.500 million across FY 2021-2025 due to realignment of mission areas and priorities to support enduring Agile Pilot requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "727"
                    },
                    "ProjectTitle": {
                        "val": "Joint Warfighting"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "43.713"
                        },
                        "PriorYear": {
                            "val": "5.161"
                        },
                        "CurrentYear": {
                            "val": "4.846"
                        },
                        "BudgetYearOne": {
                            "val": "3.871"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.871"
                        },
                        "BudgetYearTwo": {
                            "val": "3.994"
                        },
                        "BudgetYearThree": {
                            "val": "4.082"
                        },
                        "BudgetYearFour": {
                            "val": "4.156"
                        },
                        "BudgetYearFive": {
                            "val": "4.252"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Warfighting Program (JWP) supports the Assistant Secretary of Defense for Acquisition (ASD(A))'s responsibilities for acquisition and portfolio management.  JWP underwrites analyses, studies, limited scope experiments, wargaming, and partnerships that define joint capability gaps and develops credible requirements for follow-on acquisition efforts.  These analyses and assessments deliver independent perspectives on potential remedies to align acquisition investments and solutions for joint capability gaps created by future warfighting environments and emerging threats.  JWP supports two main lines of effort, mission integration management and cyber resiliency wargames. Mission integration management will access specific critical mission threads, determine defense investments to fix lethality deficiencies, and to develop kill chain data modeling.  Cyber resiliency wargames will be conducted in support of Combatant Commands mission areas to develop strategies for mitigation of cyber vulnerabilities focusing on ballistic missile defense, nuclear command and control and other key mission areas relevant to national security challenges.\n\nAnticipated Impact:\nProvides analytical support for acquisition efforts for ASD(A) staff elements and joint customers.  It promotes analyses and assessments for acquisition insights and decisions focused on capability development serving the needs of joint forces and the warfighter."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Acquisition Analysis for Joint Capability Requirements"
                                    },
                                    "Description": {
                                        "val": "FY 2019 Accomplishments:\n\n-F35 Sustainment Study. The study summarized the current F35 sustainment strategy, impediments to achieving the future state sustainment strategy with its corresponding readiness and affordability goals, and a plan of action to achieve goals.\n \n-Mobile User Objective System (MUOS) Cyber Study. Narrow-Band Satellite Communications (SATCOM) and MUOS Enterprise Cyber Situational Awareness. Study leveraged best of breed technologies and best practice cyber situational awareness strategies for prevention and detection of cyber threat activity. Results intended to increase the cybersecurity posture of Internet Protocol based Military Satellite Communications systems.\n\n-Open Architecture Space Systems. Analysis\/study evaluated the feasibility and cost effectiveness to create open systems and software architectures for space situational awareness, management, and command and control of space systems.\n\n-Constellation Management for Proliferated Low-Earth-Orbit (PLEO) Missions. Analyzed the long term acquisition and sustainment implications of PLEO constellations, analyzed Command and Control (C2) concepts\/architectures for acquisition trade-offs and long term sustainability, and assessed survivability approaches to PLEO constellations.\n\n-Supply Chain Risk Mitigation. Analysis conducted for technical\/engineering efforts to support software provenance and supply chain risk management to mitigate cybersecurity threats in Department of Defense (DoD) National Security systems and critical infrastructure from Information Technology (IT) products produced by potential adversaries.\n\n- Agile Community of Practice. Study supported piloting the implementation of best practices for Agile software development. It contributed efforts to complete agile pilots and develop policy, procedures, and best practices to facilitate DoD adaptation of Agile Software Piloting methodology.\n\nAnticipated Impact:  \nProvides analytical support for acquisition efforts for ASD(A) staff elements and joint customers.  It promotes analyses and assessments for acquisition insights and decisions focused on capability development serving the needs of joint forces and the warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.961"
                                            },
                                            "Text": {
                                                "val": "Synchronize the Acquisition processes with corresponding acquisition requirement needs to enable acquisition portfolio management and mission thread analysis; define joint capability gaps and develop credible requirements for follow-on acquisition efforts; deliver independent perspectives on ways to align investments and potential solutions for capability gaps created by evolving threats not aligned to single Component missions; seize opportunities to partner with joint customers on projects that inform technology and acquisition decisions; and implement analytic projects on key joint warfighting mission areas and challenges.\n\nSpecific Objectives: \n-F35 Sustainment Wargame. Define the future state F-35 sustainment strategy that will enable DoD to realize readiness and sustainment goals. Deliverables: Report to summarize the current F35 sustainment strategy, impediments to achieving the future state sustainment strategy with its corresponding readiness and affordability goals, and a plan of action to achieve goals.\n \n-Cyber Wargame. Conduct a joint wargame on cyber resiliency to identify gaps and remedies. Methodology will integrate systems engineering, and cyber vulnerability analysis with modeling and simulation. It includes a detailed analysis and assessment of vulnerabilities in a system of system architecture.\n\n-MOUS Cyber Study:Narrow-Band SATCOM and MOUS Enterprise Cyber Situational Awareness. Objective is to increase the cybersecurity posture of Internet Protocol based Military Satellite Communications systems. Study will leverage best of breed technologies and best practice cyber situational awareness strategies for prevention and detection of cyber threat activity.\n\n-Open Architecture Space Systems. Analysis\/study will evaluate the feasibility and cost effectiveness to create open systems and software architectures for space situational awareness, management, and command and control of space systems.\n\n-Constellation Management for Proliferated Low-Earth-Orbit (PLEO) Missions. The objective is to analyze the long term acquisition and sustainment implications of proliferated low-earth orbit constellations, analyze C2 concepts\/architectures for acquisition trade-offs and long term sustainability and assess survivability approaches to PLEO constellations.\n\n-Supply Chain Risk Mitigation. Support analysis for technical\/engineering efforts to support software provenance and supply chain risk management to mitigate cybersecurity threats in DoD National Security systems and critical infrastructure from IT products produced by potential adversaries.\n- Agile Community of Practice. Study supports acquisition reform area of preparing for, and piloting the implementation of best practices for Agile software development. It will support efforts to complete agile pilots, develop policy, procedures, and best practices to facilitate DoD adaptation of Agile Software Piloting methodology.\n\nAnticipated Impact:  \nProvides analytical support for acquisition efforts for ASD(A) staff elements and joint customers.  It promotes analyses and assessments for acquisition insights and decisions focused on capability development serving the needs of joint forces and the warfighter."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.846"
                                            },
                                            "Text": {
                                                "val": "Synchronize the Acquisition processes with corresponding acquisition requirement needs to enable acquisition portfolio management and mission thread analysis; define joint capability gaps and develop credible requirements for follow-on acquisition efforts; deliver independent perspectives on ways to align investments and potential solutions for capability gaps created by evolving threats not aligned to single Component missions; seize opportunities to partner with joint customers on projects that inform technology and acquisition decisions; and implement analytic projects on key joint warfighting mission areas and challenges. Invest in projects that support emerging Congressionally directed acquisition mission areas.\n\nSpecific Objectives: \n\n-Cyber Resilience Wargames. FY 2016 NDAA Section 1647 directed the development of a strategy for the mitigation of cyber vulnerabilities. Cyber Resilience Wargames assess cyber risk at the Combatant Commands at the mission level as the basis for identifying and prioritizing mitigations.\n\n-Mission Integration Management. FY 2017 NDAA Section 855 directed the establishment of a mission integrated management capability to assess specific critical mission threads and determine defense investments to fix broken effects\/kill chains. This effort focuses on the management of mission threads to build more lethal forces.\n\n-Agile Pilot. FY 2018 NDAA Sections 873\/874 direct piloting Agile Software acquisition methodology for warfighting and business systems to identify best practices and lessons learned to develop a new software acquisition pathway and policy. This effort is helping to drive the Department to a modern software acquisition practice thus reforming DoD's business practices for greater performance and affordability. \n\nAnticipated Impact:  \nProvides analytical support for acquisition efforts for ASD(A) staff elements and joint customers.  It promotes analyses and assessments for acquisition insights and decisions focused on capability development serving the needs of joint forces and the warfighter."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.871"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.871"
                                            },
                                            "Text": {
                                                "val": "Conduct acquisition analysis through a portfolio management lens to address the critical joint warfighting mission areas critical to national Defense. Major focus areas will support the following projects:\n\n-Cyber wargaming on cyber security challenges, threats and resiliency of systems and infrastructure to identify gaps and remedies in support of USCENTCOM and USEUCOM. The methodology in the wargame will integrate systems engineering and cyber vulnerability analysis with modeling and simulation. It will include a detailed analysis and assessment of vulnerabilities in system architecture.\n \n-Mission Engineering Effects\/Kill Chain Development to build effects\/kill chains as part of foundational framework for the Mission Engineering and Integration Approach.\n\n-Mission Engineering Data Modeling in partnership with Cost Assessment and Program Evaluation (CAPE) and Joint Staff to pilot authoritative data modeling that is repeatable and scalable for capability portfolio management.\n\n-Mission Engineering analysis to develop a methodology to transition from static architectures to executable dynamic models for time-dependent assessments of complex operations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "ASD(A) adjusted funding and focus to address mission priority areas and realigned funding for enduring requirements for independent analyses in support of Agile software development and software provenance mission areas.  In FY 2020 and beyond, this segment is combined with Acquisition Analytic Development of Joint Military Requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Analytic Development of Joint Military Requirements"
                                    },
                                    "Description": {
                                        "val": "This segment provides independent analysis of joint issues and capability gaps.  It provides responsive and timely capability development pathways and recommendations for rapid acquisition through wargames and analyses conducted by joint military staffs and units.  It provides an independent source for analysis and enables capability development suitable for joint experimentation undertaken by joint authorities.\n\nFY 2019 Accomplishments:\n\n-Cyber Resiliency Wargame. Conducted a joint wargame on cyber resiliency to identify gaps and remedies in support of USEUCOM’s ballistic missile defense (BMD) mission area.  Methodology integrated systems engineering, and cyber vulnerability analysis with modeling and simulation.  Results included a classified detailed analysis and assessment of vulnerabilities in a system of system architecture."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Text": {
                                                "val": "This segment will provide independent analysis of joint issues and capability gaps.  It will provide responsive and timely capability development pathways and recommendations for rapid acquisition, through wargames and analyses conducted by joint military staffs and units.  It will provide an independent source for analysis and enable capability development suitable for joint experimentation undertaken by joint authorities.\n\nSpecific Objectives: \n-F35 Sustainment Wargame. Define the future state F-35 sustainment strategy that will enable DoD to realize readiness and sustainment goals. Deliverables: Report to summarize the current F35 sustainment strategy, impediments to achieving the future state sustainment strategy with its corresponding readiness and affordability goals, and a plan of action to achieve goals.\n \n-Cyber Wargame. Conduct a joint wargame on cyber resiliency to identify gaps and remedies. Methodology will integrate systems engineering, and cyber vulnerability analysis with modeling and simulation. It includes a detailed analysis and assessment of vulnerabilities in a system of system architecture."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}