{
    "id": "2021-ChemicalandBiologicalDefenseProgram-PB-0400-MJBOOK-0-0-c06c5dff01eec388252b6d85fa923808be003e967ade11a4a0ea201fa85229d4-2",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-CBDP-U_RDTE_MasterJustificationBook_Chemical_and_Biological_Defense_Program_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Chemical_and_Biological_Defense_Program_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Chemical and Biological Defense Program",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603384BP"
        },
        "ProgramElementTitle": {
            "val": "CHEMICAL\/BIOLOGICAL DEFENSE (ATD)"
        },
        "R1LineNumber": {
            "val": "44"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Chemical and Biological Defense Program"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "140.740"
            },
            "CurrentYear": {
                "val": "175.486"
            },
            "BudgetYearOne": {
                "val": "188.001"
            },
            "BudgetYearOneBase": {
                "val": "188.001"
            },
            "BudgetYearTwo": {
                "val": "188.479"
            },
            "BudgetYearThree": {
                "val": "182.473"
            },
            "BudgetYearFour": {
                "val": "181.557"
            },
            "BudgetYearFive": {
                "val": "192.902"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The projects in this program element (PE) demonstrate technologies supporting transition to advanced component development for physical capabilities which cover biological and chemical detection, situational awareness and effects modeling, and protection and hazard mitigation.  Other major efforts support enhanced chemical detection capabilities for aerosols and non-traditional agents, expanded capabilities for early warning in pathogen detection and diagnosis, and pretreatments and therapeutics against a broader set of chemical and biological agents.  Medical capabilities (pretreatments, therapeutics, diagnostics capabilities, and drug manufacturing and regulatory science technologies), include capabilities against non-traditional agents.\n\nIndividual projects include:\n- Chemical Biological Defense (CB3): demonstrations of CB physical science defense technologies, including biological detection, chemical detection, digital battlespace management, and protection, and decontamination. This project continues to pursue solutions against traditional agents.\n\n- Non-Traditional Agents (NTA) Defense (NT3): supports all efforts (both medical and non-medical) including chemical diagnostics, medical pretreatments, therapeutics, detection, and protection and hazard mitigation.  Starting in FY21, an administrative change pertaining to efforts of improving S&T budget agility and transition efficiency was applied by merging a portion of the NTA lines to RDT&E Projects CB3, Chemical Biological Defense and TM3, Techbase Medical Defense.\n\n- Techbase Medical Defense (TM3): aims to produce biological diagnostic assays and reagents, diagnostic device platforms, pretreatments and therapeutics for bacterial, viral, and toxin threats as well as for chemical threats, and medical devices, as countermeasures for CBR threat agents. Specific areas of medical investigation include: prophylaxis, pretreatment, antidotes and therapeutics, personnel and patient decontamination, and medical management of casualties.\n\n- Technology Transition (TT3): pursues federal R&D or commercially available products to enhance military operational capability, concepts of operation, WMD elimination, and hazard mitigation following a biological warfare or chemical warfare attack.\n\nThe CBDP S&T Advanced Technology Development stakeholders: The U.S. Army Combat Capabilities Development Command Chemical Biological Center (CCDC CBC), United States Army Medical Research Institute of Infectious Diseases (USAMRIID), United States Army Medical Research Institute of Chemical Defense (USAMRICD), United States Army Natick Soldier Systems Center, Naval Research Lab (NRL), Air Force Research Lab (AFRL), among others. The intent is to maintain strategic partnerships with the DoD Service communities for mission success across the enterprise through collaborative planning and programming maintaining budget assurance.\n\nWork conducted under this PE will transition to and will provide risk reduction for Advanced Component Development and Prototypes (PE 0603884BP) and System Development and Demonstration (PE 0604384BP) activities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "142.826"
                },
                "CurrentYear": {
                    "val": "172.486"
                },
                "BudgetYearOne": {
                    "val": "191.380"
                },
                "BudgetYearOneBase": {
                    "val": "191.380"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "140.740"
                },
                "CurrentYear": {
                    "val": "175.486"
                },
                "BudgetYearOne": {
                    "val": "188.001"
                },
                "BudgetYearOneBase": {
                    "val": "188.001"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.086"
                },
                "CurrentYear": {
                    "val": "3.000"
                },
                "BudgetYearOne": {
                    "val": "-3.379"
                },
                "BudgetYearOneBase": {
                    "val": "-3.379"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "3.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.183"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.902"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.001"
                                },
                                "BudgetYearOne": {
                                    "val": "-3.379"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.379"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: FY19 (-$0.183 Million): Reprogramming adjustments to balance overall portfolio efforts.\nFY19 (-$1.902 Million): Transfer of funding to support Small Business Innovative Research\/Small Business Technology Transfer efforts.\n\nFY20 (+3.000 Million): Congressional Add for Improved Gas Particulate Filter Unit.\n\nFY21 (-$3.379 Million): Program adjustments to align chem bio incident preparedness and response efforts and techbase technology transition efforts to advanced development (-$3.078 Million), as well as Departmental economic adjustments (-$0.301 Million).\n\nSchedule: N\/A\n\nTechnical: N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CB3"
                    },
                    "ProjectTitle": {
                        "val": "Chemical Biological Defense (ATD)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "22.956"
                        },
                        "CurrentYear": {
                            "val": "19.798"
                        },
                        "BudgetYearOne": {
                            "val": "24.448"
                        },
                        "BudgetYearOneBase": {
                            "val": "24.448"
                        },
                        "BudgetYearTwo": {
                            "val": "24.946"
                        },
                        "BudgetYearThree": {
                            "val": "25.239"
                        },
                        "BudgetYearFour": {
                            "val": "24.090"
                        },
                        "BudgetYearFive": {
                            "val": "24.293"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project CB3 develops technology advancements for joint service application in the areas of digital battlespace management technologies, protection\/ hazard mitigation and detection. These activities will speed maturing of advanced technologies to reduce risk in system-oriented integration\/demonstration efforts. A portion of Project NT3, Techbase Non-Traditional Agents Defense, will merge into this Project starting in FY21.\n\nIndividual efforts in this project include:\n- Digital battlespace management focuses on situational awareness and threat agent applications, analytic applications platform for operational situational awareness, non-traditional detection sciences, tactical decision aids, and advanced computational methods. \n- Protection\/hazard mitigation works to provide technologies that protect from and reduce the impact of both chemical and biological threats and hazards to the Warfighter, weapons platforms, and structures. \n- Detection strives to develop technologies for point and standoff detection and identification of both chemical and biological agents.\n- Non-Traditional Agent (NTA) Defense includes chemical diagnostics, medical pretreatments, therapeutics, detection, and protection and hazard mitigation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Expeditionary Collective Protection"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies for soldiers to determine the remaining chemical vapor service life of their chemical warfare agent (CWA) filters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.803"
                                            },
                                            "Text": {
                                                "val": "- Continued filter bed research to investigate how and if various formulation constituents affect coating chemistry and morphology in filter bed. \n- Completed integration and surveillance of Guard Bed and continued Residual Life Indicator (RLI) studies on land-based ColPro facilities.\n- Applied congressional funding increases to RLI program for accelerated manufacturing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.639"
                                            },
                                            "Text": {
                                                "val": "- Continue Expeditionary Collective Protection integration and surveillance Residual Life Indicator (RLI). \n- Continue to pull satellite cartridges and the primary ColPro filter (M98) filters for surveillance testing and assessment. \n- Continue discovery, development and testing of materials capable of sorption and reaction of NTAs for next generation filter materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.814"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.814"
                                            },
                                            "Text": {
                                                "val": "- Continue testing of Residual Life Indicator (RLI) systems and evaluating data obtained at fixed site locations and provide final report.\n- Continue scale up materials successfully tested and integrate into filters for testing against threat agents of interest."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Material Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Develop highly effective non-traditional or novel decontamination technologies that integrate with current procedures and support non-material improvements of the overall decontamination effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.840"
                                            },
                                            "Text": {
                                                "val": "- Accelerated transition efforts on sprayable slurry immediate\/operational decontamination system to meet operational need. \n- Continued to optimize the decontamination parameters for the hot air biological decontamination effort to address sensitive equipment, platform interior, and aircraft decontamination needs and demonstrated significantly reduced process times.\n- Continued and developed the laboratory scale test to optimize decontamination parameters for the chemical hot air decontamination effort to address sensitive equipment, platform interior, personal effects, and aircraft chemical warfare agent decontaminant needs. Continued to optimize parameters for coatings efforts to enhance decontaminability as part of the systems approach to achieving efficacy goals.  \n- Continued Wide Area Decontamination of Bacillus anthracis projects, which focus on maturing the biological spore decontamination in a broadened set of outdoor terrains and materials, and prepared for FY20 demonstration.\n- Continued effort to determine the most predictive surrogate virus for Ebola virus disinfection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.952"
                                            },
                                            "Text": {
                                                "val": "- Continue sprayable slurry decontaminant formulation effort to advance development for tactical decontamination, complete vapor and complex surface efficacy performance evaluations and technical demonstration. \n- Continue coatings optimization utilizing new chemical agent resistance method to reduce chemical absorption.\n- Continue Wide Area Decontamination of Bacillus anthracis projects, focusing on varied subscale testing environments, and conduct demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.238"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.238"
                                            },
                                            "Text": {
                                                "val": "- Continue responsive coatings optimization against emerging threats under relevant environmental conditions and identifying potential battlefield interferants. \n- Continue development and optimization of the full range of NTAs, including other emerging threats into the material contamination mitigation portfolio under relevant environmental conditions. \n- Continue to integrate NTA testing into chemical hot air decontamination effort to address sensitive equipment, platform interior, and aircraft NTA decontaminant needs in a relevant environment and identifying potential battlefield interferants. \n- Continue optimization efforts to develop\/enhance NTA mapping (disclosure\/assurance) technologies in simulated relevant environments. \n- Continue discovery, development and testing of materials capable of sorption and reaction of NTAs for next generation decontamination materials.\n- Complete sprayable slurry decontaminant formulation effort to advanced development for tactical decontamination, complete vapor and complex surface efficacy performance evaluations and technical demonstration to support relevant data development to transition at Technical Readiness Level (TRL)8. \n- Complete development of Wide Area Decontamination of Anthrax agricultural spray technology focusing on testing in outdoor environments and related data analysis from demonstrations.  \n- Continue evaluation of disclosure spray in low light and other relevant environments. \n- Continue evaluation and testing of hot air decontamination of equipment and personal effects. \n- Complete optimization of chemical hot air decontamination process and transition to Joint Program Manager for Protection (JPM P). \n- Continue to scale up materials successfully tested and integrate into filters for testing against threat agents of interest.  \n- Initiate demonstration of temporary coatings to improve vehicle decontaminatability."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments.  RDT&E Project NT3, Techbase Non-Traditional Agents Defense (Material Contamination Mitigation), will merge into this program starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Percutaneous Protection"
                                    },
                                    "Description": {
                                        "val": "Develop advanced ensemble prototypes with state-of-the art materials that address the full spectrum of threats and provide a range of solutions optimized for protection, thermal comfort, and mission performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.596"
                                            },
                                            "Text": {
                                                "val": "- Completed verification and validation testing phase for the aerosol and vapor testing in support of the Uniform Integrated Protection Ensemble Family of Systems (FoS). \n- Continued the process to mount compounded materials onto fabrics for protection. \n- Continued to conduct fiber and yarn analysis.\n- Continued refining developmental efforts in order to fully demonstrate the individual component and system capabilities in time to meet technical swatch and system evaluations scheduled for FY 2020.\n- Accelerated the development of the integrated system and select prototype fabrication efforts of all sub-components in order to deliver concept prototype systems for inclusion in a Chemical and Biological Operational Assessment (CBOA) demonstration.  \n- Continued to evaluate and investigate nano-structured porous materials for protective garments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.285"
                                            },
                                            "Text": {
                                                "val": "- Begin next phase of aerosol system testing using newly validated methodology in support of the Uniform Integrated Protection Ensemble Family of Systems (FoS). \n- Continue investigation of materials and integration of successfully tested materials into fibers, fabrics, yarns and elastomeric materials.  \n- Continue data evaluation from Chemical and Biological Operational Assessment reporting and technical assessments to inform system design and final technical and user assessments against chemical and biological threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.297"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.297"
                                            },
                                            "Text": {
                                                "val": "- Continue integration, engineering, and scaling of CB relevant multifunctional materials and systems. \n- Continue final technical and user assessments against NTAs and emerging threats on the tactical all hazards suits.\n- Continue next phase of aerosol system testing to identify mapping gaps and gender-specific factors that impact test results in support of the Uniform Integrated Protection Ensemble Family of Systems (UIPE FoS).\n- Continue investigation of new\/novel sorptive materials for percutaneous protection and integrate into fabrics, yarns, fibers for testing against chemical and biological agents.  \n- Complete development of Level A\/B All Hazards ensembles and transition the UIPE FoS program of record through the Joint Program Manager for Protection (JPM P). \n- Continue to scale up materials successfully tested and integrate into filters for testing against threat agents of interest."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred from another funding line.  RDT&E Project NT3, Techbase Non-Traditional Agents Defense (Percutaneous Protection), will merge into this program starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Respiratory and Ocular Protection"
                                    },
                                    "Description": {
                                        "val": "Develop novel filtration media that are lighter weight and lower burden while capable of protecting against a broader range of challenges that includes toxic industrial chemicals (TICs)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.712"
                                            },
                                            "Text": {
                                                "val": "- Acquired and assembled  Closed Circuit Self Contained Breathing Apparatus (CC-SCBA) subsystems into a hybrid technology Full-Spectrum Respiratory Protection System (FSRPS) prototypes system. \n- Tested FSRPS prototypes that with thermal burden sensors in an operational assessment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.962"
                                            },
                                            "Text": {
                                                "val": "- Continue refining technologies and performance standards that enhance facepiece seals performance, lens fogging resistance, and comfort and demonstrate refined Full-Spectrum Respiratory Protection System (FSRPS) prototype.  \n- Continue to scale up nano-structured porous materials for air purification. \n- Continue to conduct performance evaluation and demonstration of FSRPS prototypes. \n- Continue to assess novel filtration materials against new emerging threats.\n- Continue refining technologies and performance standards that enhance face piece seals performance, lens fogging resistance, and comfort and demonstrate refined FSRPS prototype.  \n- Continue to scale up nano-structured porous materials for air purification.\n- Continue to conduct performance evaluation and demonstration of FSRPS prototypes. \n- Continue to assess novel filtration materials against new emerging threats. \n- Build prototypes of improved gas particulate filter units."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.701"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.701"
                                            },
                                            "Text": {
                                                "val": "- Continue to scale up nano-structured porous materials for air purification. \n- Continue scale up materials successfully tested and integrate into filters for testing against threat agents of interest.  \n- Complete development and transition systems that provide chemical biological (CB) respiratory protection technologies in support of tactical all hazard, Full-Spectrum Respiratory Protection System (FSRPS).\n- Continue to assess novel filtration materials against new emerging threats. \n- Continue integration of successfully tested multifunctional materials capable of sorption and reaction of NTAs for next generation filter applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to change in program\/project technical parameters."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Detection"
                                    },
                                    "Description": {
                                        "val": "Advance and mature technologies and capabilities to detect and identify chemical and biological threats to the point of transitioning to customers for advanced development. This activity includes development of point, remote, or standoff sensors as appropriate, to address both chemical and biological threats. These efforts develop transitionable detection capabilities for early warning of contamination exposure to the warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.223"
                                            },
                                            "Text": {
                                                "val": "- Completed the development of sample preparation techniques to enhance environmental detection platforms. \n- Continued the development of proteomic detection capabilities, to include expansion into the methodologies to detect novel threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.156"
                                            },
                                            "Text": {
                                                "val": "- Continue the development of proteomic detection capabilities, to include expansion into the methodologies to detect novel threats. \n- Continue development of CB sensors for mobile applications to enhance early warning and situational awareness of CB threats. \n- Initiate development of CB sensors for distributed reconnaissance purposes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.140"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.140"
                                            },
                                            "Text": {
                                                "val": "- Complete the development of end-to-end genomic sequencing protocols and transition to Targeted Acquisition of Reference of Materials Augmenting Capabilities (TARMAC) initiative.\n- Complete the HoloLens Joint Handheld Biological Identifier (JHBI) Training aid and transition to SOF Rapid Capability Development & Deployment (RCDD). \n- Continue development of CB sensors for mobile applications to enhance early warning and situational awareness of CB threats. \n- Continue development of CB sensors for distributed reconnaissance purposes.  \n- Initiate development of integrated environmental biological sensors for the unattended monitoring of perimeters to provide advanced warning of CB threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to change in program\/project technical parameters.  Increase due to higher priority of emerging bio in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Hazard Prediction"
                                    },
                                    "Description": {
                                        "val": "Improve battlespace awareness by accurately predicting hazardous material releases, atmospheric transport and dispersion, and resulting human effects.  Develop predictive capability for the source term of releases of chemical, biological, and toxic industrial materials.  This program merged to RDT&E Project CB3, Chemical Biological Defense (Decision Management) in FY20."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.981"
                                            },
                                            "Text": {
                                                "val": "- Continued performance optimization and high fidelity enhancements for transport and dispersion models, particularly for urban environments.\n- Continued configuration management of science and technology prototype for transition of upgraded capabilities to Joint Effects Model (JEM).  \n- Continued upgrading science and technology prototype to Common CBRN Modeling Interface (CCMI) architecture. \n- Completed validation and verification (V&V) studies for high fidelity source term algorithms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Data Analysis"
                                    },
                                    "Description": {
                                        "val": "Develop CBRN data-sharing capabilities.  Develop chapters of the Chemical and Biological Warfare Agent Effects Manual Number 1 (CB-1), an authoritative source capturing analytical methods for evaluating the effects of CB warfare agents on equipment, personnel, and operations.  Create a framework for implementing CB-1 and provide CBRN defense community access to CB-1.  This program merged to RDT&E Project CB3, Chemical Biological Defense (Decision Analysis and Management) in FY20."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.103"
                                            },
                                            "Text": {
                                                "val": "- Completed the digitization effort at the United Stated Army Heritage and Education Center and make the digitized documents accessible through CB-1s online portal."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Operational Effects"
                                    },
                                    "Description": {
                                        "val": "Develop decision support tools and information management capabilities for planning and real-time analysis to determine and assess operational effects, risks, and overall impacts of Chemical Biological Radiological and Nuclear (CBRN) incidents on decision-making.  Focus areas include consequence management, population modeling, and knowledge management.  This program merged to RDT&E Project CB3, Chemical Biological Defense (Decision Analysis and Management) in FY20."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.027"
                                            },
                                            "Text": {
                                                "val": "- Continued Decontamination and Individual Protection SPM integration and advanced development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Decision Analysis and Management"
                                    },
                                    "Description": {
                                        "val": "Enable the prediction of chemical and biological hazards, exposures, casualties, and infections along with providing timely and accurate warnings and recommended courses of action. Develop methods to utilize non-traditional detection methods to provide indications of Chemical and Biological exposure risk.  RDT&E Project CB3, Chemical Biological Defense (Hazard Prediction, Operational Effects and Planning, Data Analysis) merged to this program in FY20."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.783"
                                            },
                                            "Text": {
                                                "val": "- Mature comprehensive infectious disease epidemiological modeling applications for disease prediction, forecasting, medical planning and treatment, and burden estimates from contagious infectious disease outbreaks. Incorporate uncertainty estimates into disease forecasting and prediction models. \n- Mature data visualization displays of disease model outputs. Incorporate newly characterized threat agent properties into hazard prediction models. \n- Continue performance optimization and high fidelity enhancements for transport and dispersion models, particularly for urban environments. \n- Continue development of coupled indoor and outdoor dispersion models for enhanced hazard prediction in urban environments to include advanced methods for interior to exterior transport, uncertainty estimation, and upgrades to user interface. \n- Implement a high fidelity, building-aware urban dispersion model on an Android End-User Device for improved situational awareness at the tactical edge.\n- Port previously developed decision support tools to the Tactical Assault Kit (TAK) for use on mobile devices and leverage other plug-ins in TAK for app capability improvement.\n- Continue configuration management of science and technology prototype for transition of upgraded capabilities. \n- Complete upgrades to science and technology prototype modules to meet Common CBRN Modeling Interface (CCMI) architecture requirements. \n- Develop automated decision aids and reference guides to assist tactical users in properly responding to chemical and biological threats.  \n- Develop a tool to support the DoD in responding to a CBRN incident, a toxic industrial chemical (TIC) release, or a contagious epidemic by providing a means of calculating the medical resource requirements necessary to successfully manage the civilian and military consequences.\n- Complete development of CB-1."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.852"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.852"
                                            },
                                            "Text": {
                                                "val": "- Continue development and porting of decision support plug-ins for integration with Nett Warrior, TSOA, CBRN IS, and the different iterations of the TAK, including the Android, web, Windows OS, and virtual and augmented reality versions to further leverage the TAK infrastructure and cross-community tools.\n- Initiate integration of Graphics Processing Units methodologies into hazard prediction software and initiate user testing.\n- Continue configuration management of science and technology prototype for transition of upgraded capabilities.\n- Continue performance enhancements for transport and dispersion models, particularly for urban environments.\n- Continue developing comprehensive infectious disease epidemiological modeling applications for disease prediction, forecasting, medical planning and treatment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to change in program\/project technical parameters.  RDT&E Project NT3, Techbase Non-Traditional Agents Defense (Modeling & Simulation), will merge into this program starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Threat Surveillance"
                                    },
                                    "Description": {
                                        "val": "Integrate disparate military and civilian datasets, investigate methodologies to appropriately integrate open source data into advanced chemical and biological threat warning systems, tactical decision aids, and leverage and enhance advanced epidemiological models and algorithms for disease prediction, forecasting, impact and biological threat assessment.  This program merged to RDT&E Project CB3, Chemical Biological Defense (Warning and Reporting) in FY20."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.671"
                                            },
                                            "Text": {
                                                "val": "- Identified sources for pathogen data and develop tools to mine data sources (PubMed, Google Books, online journals) to create a comprehensive human, animal, and plant pathogen database.  Linked pathogen database to disease ontologies and developed the capability for automatic pathogen updates from newly published data.  \n- Enhanced the Biosurveillance Ecosystem (BSVE) framework to support the rapid integration of multiple data sources, tools, algorithms, and services that support chemical and biological defense."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "11) Warning and Reporting"
                                    },
                                    "Description": {
                                        "val": "Develop a framework for integrating and correlating timely, relevant information sources. Investigate new approaches and methodologies such as machine learning, artificial intelligence, and advanced data analysis to accelerate analytical processes and provide early warning of chemical and biological threats."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.021"
                                            },
                                            "Text": {
                                                "val": "- Develop and implement data standards for the transmission and storage of information sources relevant to the earlier warning of chemical and biological threat agents. Broaden the utility of a previously developed framework to include both tactical and non-specialized users. \n- Continue research and analysis efforts to provide objective, quantitative analysis in support of science and technology initiatives, material developments, operational guidance, and requirements settings. \n- Initiate transition of the Individual Protection System Performance Model to Service users. \n- Complete the advanced development of the Decontamination System Performance Model.\n- Complete digitization of historic data and information pertaining to Chemical and Biological warfare at other sites with relevant archival holdings. \n- Initiate integration of Graphics Processing Units methodologies into hazard prediction software and initiate user testing.\n\nPrograms ending in FY20:\n- Research and analysis efforts to provide objective, quantitative analysis in support of science and technology initiatives, material developments, operational guidance, and requirements settings.\n- Advanced development of Decontamination System Performance Model.\n- Development of Individual Protection System Performance Model.\n- Digitization of historic data and information pertaining to Chemical and Biological warfare at other sites with relevant archival holdings."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.406"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.406"
                                            },
                                            "Text": {
                                                "val": "- Continue development of approaches to translate raw sensor data and publish to a common standard.\n- Improve algorithms development that leverage non-invasive physiological monitoring devices to provide earlier warning of chemical and biological threats and\/or exposure."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to change in program\/project technical parameters."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CA4"
                                    },
                                    "Title": {
                                        "val": "Contamination Avoidance (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "30.879"
                                        },
                                        "CurrentYear": {
                                            "val": "19.074"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.326"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.326"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.853"
                                        },
                                        "BudgetYearThree": {
                                            "val": "17.868"
                                        },
                                        "BudgetYearFour": {
                                            "val": "14.727"
                                        },
                                        "BudgetYearFive": {
                                            "val": "14.294"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DE4"
                                    },
                                    "Title": {
                                        "val": "Decontamination (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.819"
                                        },
                                        "CurrentYear": {
                                            "val": "7.235"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.286"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.286"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.984"
                                        },
                                        "BudgetYearThree": {
                                            "val": "12.865"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.034"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.487"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "IS4"
                                    },
                                    "Title": {
                                        "val": "Information Systems (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.821"
                                        },
                                        "CurrentYear": {
                                            "val": "0.528"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.661"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.661"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.257"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.052"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.048"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.852"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TE4"
                                    },
                                    "Title": {
                                        "val": "Test & Evaluation (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.293"
                                        },
                                        "CurrentYear": {
                                            "val": "5.162"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.107"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.107"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.822"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.823"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.824"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.601"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TT4"
                                    },
                                    "Title": {
                                        "val": "Technology Transition (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.577"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.577"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.866"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.143"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.443"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.443"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NT3"
                    },
                    "ProjectTitle": {
                        "val": "Non-Traditional Agents Defense (ATD)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "21.494"
                        },
                        "CurrentYear": {
                            "val": "24.180"
                        },
                        "BudgetYearOne": {
                            "val": "15.308"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.308"
                        },
                        "BudgetYearTwo": {
                            "val": "18.396"
                        },
                        "BudgetYearThree": {
                            "val": "18.388"
                        },
                        "BudgetYearFour": {
                            "val": "18.384"
                        },
                        "BudgetYearFive": {
                            "val": "18.384"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project NT3 develops future capabilities against emerging and novel threats and verifies current capabilities against Non-Traditional Agents (NTAs).  This project focuses on demonstrating fast and agile scientific responses to enhance or develop capabilities that address emerging threats.  This project is a comprehensive and focused effort for developing NTA defense capabilities, coordinated with specific interagency partners for doctrine, equipment, and training for the Warfighter and civilian population for defense against NTAs.  This project supports advanced technology development of NTA defense science and technology initiatives and transitioning to advance development.  \n\nIndividual efforts in this project include:\n- Support an integrated approach to develop new or enhanced countermeasures against novel and emerging threats through innovative science and technology (S&T) solutions for detection, protection, decontamination and medical countermeasures (MCMs).  \n- Efforts supply test methodologies and supporting science to verify capabilities, develop protection and hazard mitigation options, expand hazard assessment tools, and develop MCMs against NTAs.  \n\nStarting in FY21, an administrative change improving S&T budget agility and transition efficiency will merge a portion of the NTA lines to RDT&E Projects Chemical Biological Defense (CB3) and Techbase Medical Defense (TM3)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Material Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Develop highly effective non-traditional or novel decontamination technologies that integrate with current procedures and support non-material improvements of the overall decontamination effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.517"
                                            },
                                            "Text": {
                                                "val": "- Continued development and optimization of the full range of NTAs into the material contamination mitigation portfolio. \n- Continued NTA testing into chemical hot air decontamination effort to address sensitive equipment, platform interior, and aircraft NTA decontaminant needs. \n- Continued coatings development and optimization to enhance NTA decontaminability as part of the systems approach to achieving efficacy goals. \n- Continued optimization efforts to develop\/enhance NTA mapping (disclosure\/assurance) technologies. \n- Continued discovery, development and testing of materials capable of sorption and reaction of NTAs for next generation decontamination materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.520"
                                            },
                                            "Text": {
                                                "val": "- Continue responsive coatings optimization against emerging threats under relevant environmental conditions and identifying potential battlefield interferants. \n- Continue development and optimization of the full range of NTAs, including other emerging threats into the material contamination mitigation portfolio under relevant environmental conditions. \n- Continue to integrate NTA testing into chemical hot air decontamination effort to address sensitive equipment, platform interior, and aircraft NTA decontaminant needs in a relevant environment and identifying potential battlefield interferants. \n- Continue optimization efforts to develop\/enhance NTA mapping (disclosure\/assurance) technologies in simulated relevant environments. \n- Continue discovery, development and testing of materials capable of sorption and reaction of NTAs for next generation decontamination materials."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line.  This program will merge to RDT&E Project CB3, Chemical Biological Defense starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Personnel Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies to mitigate the risk associated with contaminated human remains and personnel effects (materials) exposed to and contaminated by chemical agents by neutralizing and\/or physically removing the residual chemical agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.448"
                                            },
                                            "Text": {
                                                "val": "- Continued personnel decontamination efforts to enhance current processes including efficacy data against representative NTAs and emerging threats in relevant environments and identifying battlefield interferants."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.408"
                                            },
                                            "Text": {
                                                "val": "- Continue personnel decontamination efforts to enhance current processes including efficacy data against representative NTAs and emerging threats in relevant environments and identifying battlefield interferants."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line.  This program will merge to RDT&E Project CB3, Chemical Biological Defense starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Respiratory and Ocular Protection"
                                    },
                                    "Description": {
                                        "val": "Development and analysis of design alternatives for chemical and biological air-purifying respirators that provide enhanced protection with lower physiological burden and improved interface with mission equipment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.688"
                                            },
                                            "Text": {
                                                "val": "- Continue to scale up nano-structured porous materials for air purification. \n- Continue to conduct performance evaluation and demonstration of FSRPS prototypes. \n- Continue to assess novel filtration materials against new emerging threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line.  This program will merge to RDT&E Project CB3, Chemical Biological Defense starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Therapeutics - Medical"
                                    },
                                    "Description": {
                                        "val": "Efforts in this area advance the understanding of mechanisms of action for NTAs and emerging chemical threats by probable routes of field exposure and seek to refine effectiveness of therapeutics to advance therapeutic development.  Physiological parameters and pathological assessments will be used to establish the general mode and mechanisms of toxicity required for therapeutic development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.097"
                                            },
                                            "Text": {
                                                "val": "- Continued investigating technologies to deliver therapeutics to the brain. \n- Continued evaluating novel therapeutics using high-throughput in vitro screens. \n- Continued optimization on novel therapeutic compounds. \n- Continued validating animal models for use in NTA exposure studies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.436"
                                            },
                                            "Text": {
                                                "val": "- Continue investigating technologies for delivering therapeutics to the brain.\n- Continue optimizing and evaluating novel therapeutic in animal models and initiate preclinical studies in support of investigative new drug (IND) submission. \n- Initiate drug repurposing effort to identify therapeutics for selected NTAs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line.  This program will merge to RDT&E Project TM3, Techbase Med Defense (Chemical Therapeutics) starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Detection"
                                    },
                                    "Description": {
                                        "val": "Focuses on technologies to provide NTA detection capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.391"
                                            },
                                            "Text": {
                                                "val": "- Completed prototype of chemical sensors for persistent sensing and chemical reconnaissance applications.  \n- Completed the development of a wearable environmental sensor for detecting exposure to chemical hazards. Transitioned to Wearable Chemical Agent Detector (WCAD)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.434"
                                            },
                                            "Text": {
                                                "val": "- Initiate the development of detection technologies to provide a handheld chemical survey tool to detect and locate deposited liquid and solid threats on surfaces. \n- Initiate the development of sensor technologies against non-traditional threats of concern."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.308"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.308"
                                            },
                                            "Text": {
                                                "val": "- Complete the Man-Worn Chemical Hazard Sensor program as the technologies will be transitioned to the CVCAD program for advanced testing\/development.\n- Complete the development of technologies to reduce false alarms in highly complex environments and transition to the Aerosol Vapor Chemical Agent Detector (AVCAD).\n- Continue the development of sensor technologies against non-traditional threats of concern. \n- Continue the development of hyperspectral imaging technologies for remote chemical detection. \n- Initiate the development of chemical collect and detect packages for unmanned platforms to feed into the CBRN Sensors on Robotic Platforms (C-SIRP). \n- Initiate the development of chemical sensor platforms for unmanned systems to also feed into the C-SIRP program.\n- Continue rapid prototyping and evaluation of chemical detection platforms addressing standoff chemical detection and distributed CB reconnaissance capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred from another funding line.  RDT&E Project NT3, Techbase Non-Traditional Agents Defense (Test & Evaluation), will merge into this program starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Modeling & Simulation"
                                    },
                                    "Description": {
                                        "val": "This effort develops NTA technology advancements for joint service application in the area of information systems and modeling and simulation technologies.  These activities will speed maturation of advanced technologies to reduce risk in system-oriented integration\/demonstration efforts.  Information systems advanced technology focuses on areas of advanced warning and reporting, hazard prediction and assessment, simulation analysis and planning, and systems performance modeling."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.201"
                                            },
                                            "Text": {
                                                "val": "- Completed system performance model integration and development for program-wide exploitation for decontamination."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.236"
                                            },
                                            "Text": {
                                                "val": "- Perform research studies to provide objective, quantitative analyses in support of science and technology initiatives, material developments, and operational guidance for the Chemical and Biological Defense Program."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments.  This program will merge to RDT&E Project CB3, Chemical Biological Defense (Decision Analysis and Management) starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Percutaneous Protection"
                                    },
                                    "Description": {
                                        "val": "Develop advanced ensemble prototypes with state-of-the art materials that address the full spectrum of threats and provide a range of solutions optimized for protection, thermal comfort, and mission performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.991"
                                            },
                                            "Text": {
                                                "val": "- Continued evaluation of multifunctional systems for protection in relevant configurations at scale. \n- Continued integration, engineering, and scaling of CB relevant multifunctional materials and garment configurations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.588"
                                            },
                                            "Text": {
                                                "val": "- Continue integration, engineering, and scaling of CB relevant multifunctional materials and systems. \n- Continue final technical and user assessments against NTAs and emerging threats on the tactical all hazards suits."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line.  This program will merge to RDT&E Project CB3, Chemical Biological Defense starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Test & Evaluation"
                                    },
                                    "Description": {
                                        "val": "Develop test and evaluation technologies and processes in support of NTA activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.963"
                                            },
                                            "Text": {
                                                "val": "- Completed the rapid prototyping and evaluation of chemical detection platforms, specifically addressing vapor passive sensing, identification of liquid chemical threats, and the detection of solids."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.785"
                                            },
                                            "Text": {
                                                "val": "- Complete the rapid prototyping and evaluation of chemical detection platforms addressing wearable vapor detection technologies. \n- Continue rapid prototyping and evaluation of chemical detection platforms addressing standoff chemical detection capabilities. \n- Initiate rapid prototyping and evaluation of chemical detection platforms addressing distributed CB reconnaissance capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line.  This program will merge to RDT&E Project NT3, Non-Traditional Agent (NTA) Defense (Detection) starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Pretreatments and Prophylactics - Medical"
                                    },
                                    "Description": {
                                        "val": "Develop pretreatments and prophylactics that provide protection against NTAs and emerging chemical threats. Prophylactic scavengers should rapidly detoxify a broad spectrum of compounds of interest (COIs)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.886"
                                            },
                                            "Text": {
                                                "val": "- Initiated studies to support clinical development of prophylaxis for selected NTAs where warranted based upon data from FY18 proof-of-concept studies. \n- Continued efforts to develop two organophosphorus nerve agents (OPNA) scavenger enzymes to meet requirements of a prophylactic medical countermeasure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.085"
                                            },
                                            "Text": {
                                                "val": "- Continue efforts to develop OPNA catalytic scavenger enzymes in support of investigational new drug (IND) submission to the FDA.\n- Initiate prophylactic studies of Medical Countermeasures (MCMs) against additional selected NTAs and continue efforts as needed."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line.  This program will merge to RDT&E Project TM3, Techbase Med Defense (Chemical Therapeutics) starting in FY21."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CA4"
                                    },
                                    "Title": {
                                        "val": "Contamination Avoidance (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "30.879"
                                        },
                                        "CurrentYear": {
                                            "val": "19.074"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.326"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.326"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.853"
                                        },
                                        "BudgetYearThree": {
                                            "val": "17.868"
                                        },
                                        "BudgetYearFour": {
                                            "val": "14.727"
                                        },
                                        "BudgetYearFive": {
                                            "val": "14.294"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DE4"
                                    },
                                    "Title": {
                                        "val": "Decontamination (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.819"
                                        },
                                        "CurrentYear": {
                                            "val": "7.235"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.286"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.286"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.984"
                                        },
                                        "BudgetYearThree": {
                                            "val": "12.865"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.034"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.487"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "IP4"
                                    },
                                    "Title": {
                                        "val": "Individual Protection (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.172"
                                        },
                                        "CurrentYear": {
                                            "val": "1.997"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.483"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.483"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.487"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.682"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.946"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC4"
                                    },
                                    "Title": {
                                        "val": "Medical Chemical Defense (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.685"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "3.685"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TE4"
                                    },
                                    "Title": {
                                        "val": "Test & Evaluation (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.293"
                                        },
                                        "CurrentYear": {
                                            "val": "5.162"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.107"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.107"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.822"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.823"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.824"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.601"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TM3"
                    },
                    "ProjectTitle": {
                        "val": "Techbase Medical Defense (ATD)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "86.713"
                        },
                        "CurrentYear": {
                            "val": "120.526"
                        },
                        "BudgetYearOne": {
                            "val": "137.829"
                        },
                        "BudgetYearOneBase": {
                            "val": "137.829"
                        },
                        "BudgetYearTwo": {
                            "val": "135.016"
                        },
                        "BudgetYearThree": {
                            "val": "129.004"
                        },
                        "BudgetYearFour": {
                            "val": "129.543"
                        },
                        "BudgetYearFive": {
                            "val": "140.685"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project TM3 supports preclinical and early phase clinical development of vaccines, therapeutic drugs, and diagnostic capabilities to provide safe and effective medical defense against validated biological threat agents or emerging infectious disease biothreats including bacteria, toxins, and viruses.  A portion of Project NT3, Techbase Non-Traditional Agents Defense, will merge into this Project starting in FY21.\n\nIndividual efforts in this project include: \n- Innovative biotechnology approaches to advance medical systems designed to rapidly identify, diagnose, prevent, and treat disease due to exposure to biological threat agents will be evaluated.  \n- In addition this project supports the advanced development of medical countermeasures to include prophylaxes, pretreatments, antidotes, skin decontaminants and therapeutic drugs against identified and emerging chemical warfare threat agents.  Entry of candidate vaccines, therapeutics, and diagnostic technologies into advanced development is facilitated by the development of technical data packages that support the Food and Drug Administration (FDA) Investigational New Drug (IND) processes, DoD acquisition regulations, and the oversight of early phase clinical trials in accordance with FDA guidelines.\n- Non-Traditional Agent (NTA) Defense includes chemical diagnostics, medical pretreatments, therapeutics, detection, and protection and hazard mitigation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Bacterial Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate potential therapeutic compounds effective against bacterial threat agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.479"
                                            },
                                            "Text": {
                                                "val": "- Continued multiple efforts to advance candidate therapeutics, with a focus on non-traditional candidates, through preclinical evaluation toward  investigative new drug (IND) and phase I clinical studies.  Completed optimization of dosing regimen and formulation of a novel orally-delivered therapeutic in models of B.  pseudomallei infection.\n- Continued strategy to engage industry in the development of therapeutics for Biowarfare agent indications through the evaluation of late development and\/or FDA approved compounds for efficacy in pivotal Good Laboratory Practices Non-Human Primate (GLP NHP) models against aerosolized challenge of Yersinia pestis, Bacillus anthracis, or Francisella tularensis in support of submission of a supplemental New Drug Application (sNDA) under the Animal Rule."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.058"
                                            },
                                            "Text": {
                                                "val": "- Continue multiple efforts to advance candidate therapeutics, with a focus on non-traditional candidates, through preclinical evaluation toward IND and phase I clinical studies. File IND for a novel orally-delivered therapeutic for treatment of B. pseudomallei infection. \n- Continue strategy to engage industry in the development of therapeutics for Biowarfare agent indications through the evaluation of late development and\/or FDA approved compounds for efficacy in pivotal GLP NHP models against aerosolized challenge of Yersinia pestis, Bacillus anthracis, or Francisella tularensis in support of submission of a sNDA under the Animal Rule."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.067"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.067"
                                            },
                                            "Text": {
                                                "val": "- Continue multiple efforts to identify and advance candidate therapeutics, with a focus on non-traditional candidates, through preclinical evaluation toward IND and phase I clinical studies. \n- Expand layered defense against bacterial threats that evaluates the combination of vaccination with antibiotic therapy, as well as promising monoclonal antibodies and nontraditional therapeutics.  Utilizing flexible and agile acquisition vehicles, partner with interagency and industry to develop nonclinical biodefense efficacy packages for therapeutic assets in advanced development."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Bacterial\/Toxin Vaccines"
                                    },
                                    "Description": {
                                        "val": "Evaluate the best single agent bacterial and toxin vaccines and pretreatments for effectiveness against aerosol challenge in large animal models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.382"
                                            },
                                            "Text": {
                                                "val": "- Completed validation of T cell and B cell epitopes and antigens for Q Fever vaccine design and testing.  \n- Completed down-selection of live attenuated Tularemia vaccine candidates for advancement into manufacturing and clinical development. \n- Continued manufacturing development and IND enabling studies of Outer Membrane Vesicle (OMV) and other lead Burkholderia candidates based on results in animal models. \n- Continued development of human monoclonal antibodies to ricin toxin selected from vaccinated volunteers. \n- Continued evaluation of efficacy and conjugate production and formulation of capsule conjugate anthrax vaccine in combination with Protective-antigen (PA)-based vaccine.  Define correlate of immunity of next generation CPS conjugate anthrax vaccine.\n- Continued evaluation and manufacturing development of Burkholderia OMV vaccine.  \n- Continued animal-rule efficacy studies of multivalent monoclonal antibody cocktail for protection against A and B serotypes of botulinum neurotoxin in relevant animal models. \n- Completed botulinum toxin mAb manufacturing and formulation development and release assay qualification and validation including reference standards. \n- Completed botulinum toxin mAb manufacture and prepare IND. \n- Initiated formulation development and efficacy studies of pentavalent mAb product against botulinum intoxication targeting serotypes ABCDE."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.518"
                                            },
                                            "Text": {
                                                "val": "- Complete nonclinical efficacy and toxicology of Burkholderia OMV vaccine and subunit vaccine for advancement to clinical phase I. \n- Continue to complete IND enabling efforts and filings in support of human clinical trials for animal-rule licensure of the multivalent monoclonal antibody cocktail for protection against A and B serotypes of botulinum neurotoxin. \n- Continue IND enabling development of live-attenuated tularemia vaccine. \n- Continue evaluation of efficacy and capsule conjugate manufacturing process development and formulation for next generation anthrax vaccine in combination with Protective-antigen (PA)-based vaccine.\n- Continue to refine correlates of immunity of next generation CPS conjugate anthrax vaccine. \n- Continue Burkholderia and Q fever seroprevalence studies in support of potential clinical trials, reagent generation and biomarker discovery.\n- Initiate Phase 1 clinical trial for multivalent monoclonal antibody cocktail."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.342"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.342"
                                            },
                                            "Text": {
                                                "val": "- Complete manufacturing and release of Burkholderia OMV vaccine and subunit vaccine for initiation of a phase I clinical.\n- Complete IND enabling efforts and filings in support of human clinical trials for animal-rule licensure of the multivalent monoclonal antibody cocktail for protection against A and B serotypes of botulinum neurotoxin.\n- Continue IND enabling development of live-attenuated tularemia vaccine.\n- Initiate manufacturing of capsule conjugate manufacturing process development and formulation for next generation anthrax vaccine in combination with Protective-antigen (PA)-based vaccine.\n- Complete correlates of immunity and down selection of next generation CPS conjugate anthrax vaccine.\n- Continue seroprevalence studies in support of potential clinical trials, reagent generation and biomarker discovery.\n- Complete phase 1 clinical trial for multivalent monoclonal antibody cocktail for transition."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to change in program\/project technical parameters."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Medical Countermeasures Initiative"
                                    },
                                    "Description": {
                                        "val": "The MCMI will integrate the regulatory science and manufacturing technologies and processes developed into the Advanced Development and Manufacturing Facility (MCM-ADM) to support establishment of platform capabilities as enablers of the advanced development of CBDP medical countermeasure products. These initiatives will lead to the development of multi-use platforms that have the potential to accelerate medical product development and\/or regulatory approval as well as reduce overall development costs."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.900"
                                            },
                                            "Text": {
                                                "val": "- Fund monoclonal antibodies technologies to counter threat agents both prophylactically and therapeutically.\n- Fund novel expression systems, including outer membrane vesicle based bacterial expression platforms for bacterial vaccine candidates.\n- Fund novel platform technologies to support medical countermeasure candidate development, including the conjugate polysaccharide based vaccine platform, live attenuated bacteria, subunit vaccines and the DNA vaccine platform."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.281"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.281"
                                            },
                                            "Text": {
                                                "val": "- Continue to fund monoclonal antibodies technologies to counter threat agents both prophylactically and therapeutically.\n- Continue to fund novel expression systems, including rapid manufacturing systems.\n- Continue expansion of outer membrane vesicle based bacterial expression platforms for bacterial vaccine candidates.\n- Continue to fund novel platform technologies to support rapid medical countermeasure candidate development, including prospective candidate DNA banking, additional cell line development.\n- Continue the advancement of the conjugate polysaccharide based vaccine platform, live attenuated bacteria, subunit vaccines and the DNA vaccine platform.\n- Fund technologies that support regulatory science.\n- Continue to fund animal model development to support, test, and evaluate MCMs and the capability to respond to emerging threats.\n- Support manufacturing advancements for biologics."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Vaccine Platforms and Research Tools"
                                    },
                                    "Description": {
                                        "val": "Use novel technology and methods to support development of vaccine candidates. Conduct studies to determine potential immune interference between lead vaccine candidates, the effect of alternative vaccine delivery methods, and thermo-stabilization technologies on the efficacy of lead vaccine candidates. Identify correlates of protection in humans, and predict the success of lead vaccine candidates in humans."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.280"
                                            },
                                            "Text": {
                                                "val": "- Continued development of methods for evaluation of non-lethal symptomology and biomarkers of alphavirus infection in nonhuman primates  (NHPs). \n- Continued development of outer membrane vesicles (OMV) and nanoparticle vaccine platforms targeting Burkholderia, Francisella and Yersinia.\n- Continued development of native conformation membrane protein expression and presentation system.  \n- Continued advancement of manufacturing and formulation for Venezuelan equine encephalitis virus (VEEV) and Eastern equine encephalitis virus (EEEV) for entry to clinical studies.  \n- Continue IND enabling studies with new formulation and delivery method for VEEV, EEV and WEEV vaccine."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.358"
                                            },
                                            "Text": {
                                                "val": "- Down select and qualify biomarkers of nonlethal alphavirus disease in NHPs. \n- Continue assay development to qualification\/validation for advanced studies. \n- Continue manufacturing development of OMV and nanoparticle vaccine platforms targeting Burkholderia, Francisella and Yersinia.\n- Initiate assay qualification for OMV vaccine in advance of clinical studies.\n- Continue development of native conformation membrane protein expression and presentation system. \n- Initiate manufacturing and development of next generation plague monoclonal antibody cocktail."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.620"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.620"
                                            },
                                            "Text": {
                                                "val": "- Initiate nonclinical and manufacturing development VSV-based MARV and multivalent filovirus vaccine.\n- Identify biomarkers of nonlethal alphavirus disease in NHPs.\n- Continue assay development to qualification\/validation for advanced studies.\n- Continue manufacturing development of OMV and nanoparticle vaccine platforms targeting Francisella, Yersinia and Q Fever.\n- Complete assay qualification for OMV vaccine in advance of clinical studies.\n- Continue development of native conformation membrane protein expression and presentation system.\n- Continue manufacturing and nonclinical development of next generation plague and tularemia monoclonal antibody cocktail."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to change in program\/project technical parameters."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Viral Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate potential therapeutic candidates effective against designated viral threat agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.508"
                                            },
                                            "Text": {
                                                "val": "- Continued small molecule and monoclonal antibody selection and evaluation in NHP models for pan-ebola\/pan-filovirus and alphaviral therapeutic applications.  \n- Continued monoclonal antibody development for broad spectrum capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.375"
                                            },
                                            "Text": {
                                                "val": "- Continue small molecule and monoclonal antibody selection and evaluation in NHP models for pan-ebola\/pan-filovirus and alphaviral therapeutic applications.\n- Continue joint development of pan-marburg monoclonal antibody development with interagency partners. \n- Continue monoclonal antibody development for broad spectrum capabilities. \n- Continue developing core capabilities for NHP studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.393"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.393"
                                            },
                                            "Text": {
                                                "val": "- File an IND for the small molecule ribonucleoside viral replication inhibitor directed against alphaviruses (VEEV). \n- Continue small molecule and monoclonal antibody selection and evaluation in NHP models for pan-ebola\/pan-filovirus and alphaviral therapeutic applications. \n- Continue joint development of pan-Marburg monoclonal antibody with interagency partners. \n- Continue monoclonal antibody cocktail development for broad spectrum capabilities. \n- Begin studies on reducing neuro-inflammation by repurposing existing therapeutics."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Viral Vaccines"
                                    },
                                    "Description": {
                                        "val": "Evaluate the best vaccine candidates for Alphaviruses and Filoviruses for effectiveness and duration of protective immune response against aerosol challenge in large animal models. Animal models will be developed to support FDA licensure of mature vaccine candidates."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.592"
                                            },
                                            "Text": {
                                                "val": "- Completed licensure development of Zaire ebolavirus vaccine.\n- Continued development of an rVSV vaccine for Marburgvirus.  Advanced correlate of immunity validation for filovirus vaccines. \n- Continued manufacturing and formulation development and initiated efficacy and safety studies for advanced Alphavirus (WEVEE) vaccines. \n- Continued manufacturing and assay development for vesicular stomatitis virus (VSV) trivalent Filovirus vaccine with new manufacturer.  \n- Evaluated ability of candidates to elicit sterilizing immunity in the mucosa.\n- Evaluated candidate vaccines against arenavirus infection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.401"
                                            },
                                            "Text": {
                                                "val": "- Continue assay qualification and validation for Ebola virus, Marburg virus, and alphavirus vaccines.\n- Continue formulation development of adjuvanted DNA Alphavirus vaccine and initiate efficacy studies in animal models. \n- Continue development of rVSV and DNA Marburg virus vaccines.\n- Continue evaluation of arenavirus vaccines in animal models. \n- Continue evaluation of rVSV Ebola vaccine duration of protection assessment. \n- Initiate stability and in vitro delivery studies of alphavirus DNA vaccine formulations.\n- Initiate evaluation of Filovirus aerosol pathology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.267"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.267"
                                            },
                                            "Text": {
                                                "val": "- Continue assay qualification and validation for Ebola virus, Marburg virus, and alphavirus vaccines.\n- Continue formulation and manufacturing development of adjuvanted DNA Alphavirus vaccine\n- Continue evaluation of immunogenicity and protection studies DNA alphavirus vaccines in animal models.\n- Continue development of rVSV and DNA Marburg virus vaccines.\n- Continue evaluation of arenavirus vaccines in animal models.\n- Continue evaluation of rVSV Ebola vaccine duration of protection assessment.\n- Continue in vitro delivery studies of alphavirus DNA vaccine formulations.\n- Continue evaluation of Filovirus aerosol pathology."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to change in program\/project technical parameters."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Medical Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Investigate medical diagnostics that are agnostic against chemical and biological threats (including NTAs, pharmaceutical-based agents, and toxins) by advancing diagnostic innovations; investigating emerging technologies; ensuring medical diagnostics rapid adaptation to emerging threats; develop prototypes and tools that advance medical diagnostics towards FDA approval."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "36.842"
                                            },
                                            "Text": {
                                                "val": "- Completed high sensitivity immunoassay and protein detection platforms for clinical samples. \n- Continued the development of assays and technologies for biological and chemical agent biomarker identification and characterization. \n- Continued the development of a chemical diagnostic platform to diagnose exposure to chemical agents for use in forward field settings or at the point-of-need.\n- Continued verification and testing performance of biomarker assays and reagents for point-of-need diagnostic platforms. \n- Continued to optimize agnostic pathogen discovery and\/or detection in clinical samples. \n- Completed development of a platform to distinguish between bacterial and viral infection. \n- Continued incorporation of stability and pre-clinical studies for diagnostic assays in development to further support FDA pre-Emergency Use Authorization submissions. \n- Continued multi-echelon diagnostic testing and assessments of novel point of need medical diagnostics in low resource settings and austere environments. \n- Initiated and completed independent verification of sequencing protocols. \n- Initiated the development of the In-vitro Affinity Diagnostic System (IADS) platform that will complement the currently fielded molecular-based diagnostics system. \n- Initiated development of computational tools to include artificial intelligence tools for biological assay development.  \n- Initiated prototype development for integrated platforms that identify antimicrobial resistance and perform antimicrobial susceptibility testing. \n- Initiated development of computational tools to include artificial intelligence tools for biological assay development. \n- Continued lateral flow immunoassay prototype development for Burkholderia and Plague."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "29.056"
                                            },
                                            "Text": {
                                                "val": "Biological:\n- Complete development of rapid quantitative in-situ protein and gene expression platform technologies for host response.\n- Continue effort to develop and validate a lateral flow immunoassay prototype for Burkholderia and Plague. \n- Complete optimization and enhancement of updated bioinformatics platform to support genomic and clinical (biomedical) informatics modularity. \n- Continue development of computational tools to include artificial intelligence tools for biological assay development.\n- Continue multi-echelon diagnostic testing and assessments of novel point of need medical diagnostics in low resource settings and austere environments. \n- Continue to optimize agnostic pathogen discovery and\/or detection in clinical samples. \n- Continue incorporation of stability and pre-clinical studies for diagnostic assays in development to further support FDA pre-Emergency Use Authorization (pre-EUA) submissions. \n- Continue developing point-of-need diagnostic platforms with host biomarker diagnostic assays and testing performance. \n- Continue effort with Republic of Korea (RoK) on new Project Agreement to develop diagnostic platforms against biological threat agents of interest on the Korean peninsula. \n- Continue the development of the In-vitro Affinity Diagnostic System (IADS) platform that will complement the currently fielded molecular-based diagnostics system. \n- Continue prototype development for integrated platforms that identify antimicrobial resistance and perform antimicrobial susceptibility testing. \n- Continue developing and validating diagnostics for host-based biomarkers to guide therapeutic intervention at the earliest possible stage after infection; thus preventing the onset of serious systemic complications, and\/or aiding in appropriate antimicrobial stewardship to prevent further multi-drug resistance infections.  \n\nChemical: \n-  Transition diagnostic platform prototype to diagnose chemical exposure to nerve agents."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.824"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.824"
                                            },
                                            "Text": {
                                                "val": "Biological: \n- Obtain FDA approval for lateral flow immunoassay for Burkholderia and Plague.\n- Continue development of computational tools to include artificial intelligence tools for biological assay development. \n- Continue multi-echelon diagnostic testing and assessments of novel point of need medical diagnostics in low resource settings and austere environments. \n- Continue to optimize agnostic pathogen discovery and\/or detection in clinical samples. \n- Continue incorporation of stability and pre-clinical studies for diagnostic assays in development to further support FDA pre-Emergency Use Authorization (pre-EUA) submissions. \n- Continue developing point-of-need diagnostic platforms with host biomarker diagnostic assays and testing performance. \n- Continue effort with RoK on new Project Agreement to develop diagnostic platforms against biological threat agents of interest on the Korean peninsula. \n- Continue the development of the IADS platform that will complement the currently fielded molecular-based diagnostics system. \n- Continue prototype development for integrated platforms that identify antimicrobial resistance and perform antimicrobial susceptibility testing.\n- Continue developing and validating diagnostics for host-based biomarkers to guide therapeutic intervention at the earliest possible stage after infection; thus preventing the onset of serious systemic complications, and\/or aiding in appropriate antimicrobial stewardship to prevent further multi-drug resistance infections. \n\nChemical: \n- Continue effort of transition diagnostic platform prototype to diagnose chemical exposure to nerve agents."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Chemical Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Focuses on pretreatment and post treatment strategies to effectively minimize injuries resulting from exposure to CWAs. This effort involves the development of neuroprotectants, anticonvulsants, and improved therapies for brain enzyme reactivation. Supports eventual FDA licensure of new compounds or to identify licensed products for use in the treatment of chemical warfare casualties."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.630"
                                            },
                                            "Text": {
                                                "val": "- Employed optimized real-time microdialysis system to support therapeutic candidate analysis and development. \n- Continued using proof-of-concept in vivo experiments to measure neuroprotective effects of known and novel compounds. \n- Continued maintaining the ADMET CoE to ensure capability for development and supporting regulatory science to facilitate FDA licensure of chemical therapeutics.  \n- Initiated advanced development of lead therapeutic candidates."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.360"
                                            },
                                            "Text": {
                                                "val": "- Complete proof-of-concept in vivo experiments to measure neuroprotective effects of known and novel compounds.\n- Continue using real-time microdialysis system to support therapeutic candidate analysis and development.\n- Continue advanced pre-clinical development of lead therapeutic candidates."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.841"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.841"
                                            },
                                            "Text": {
                                                "val": "- Continue using real-time microdialysis system to support therapeutic candidate analysis and development.\n- Continue advanced pre-clinical development of lead therapeutic candidates.\n- Continue efforts to develop OPNA catalytic scavenger enzymes in support of investigational new drug (IND) submission to the FDA.\n- Continue prophylactic studies of Medical Countermeasures (MCMs) against additional selected NTAs and continue efforts as needed.\n- Continue investigating technologies for delivering therapeutics to the brain.\n- Continue optimizing and evaluating novel therapeutic in animal models and initiate preclinical studies in support of investigative new drug (IND) submission.\n- Continue drug repurposing effort to identify therapeutics for selected NTAs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred from another funding line.  RDT&E Project NT3, Techbase Non-Traditional Agents Defense, will merge into this program starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Medical Diagnostics Response Capability Development"
                                    },
                                    "Description": {
                                        "val": "Investigate medical diagnostics ubiquitous and comprehensive against chemical and biological threats (including] NTAs, pharmaceutical-based agents, and toxins) by advancing diagnostic innovations Support diagnostics capability and prototype development to allow for rapid response to emerging threats by investing into DoD core lab capabilities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.500"
                                            },
                                            "Text": {
                                                "val": "Biological: \n- Continue efforts to integrate or converge platform technologies to detect antimicrobial resistance\/multidrug resistance (AMR\/ MDR) and pathogen identification into one platform. \n- Initiate the advancement of next-generation sequencing for use as a medical diagnostic capability with the goal of developing the first FDA pre-Emergency Use Authorization (pre-EUA) diagnostic assay utilizing this approach.\n- Initiate additional prototypes and accelerate assessment of In Vitro Affinity Diagnostic System (IADS) platforms addressing gaps in intracellular biological pathogens and toxins.\n\nChemical: \n- Initiate diagnostics capability to support Defense Laboratory Network (DLN) efforts against chemical warfare agent exposure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.194"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.194"
                                            },
                                            "Text": {
                                                "val": "Biological: \n- Continue efforts to integrate or converge platform technologies to detect antimicrobial resistance\/multidrug resistance (AMR\/ MDR) and pathogen identification into one platform. \n- Continue the advancement of next-generation sequencing for use as a medical diagnostic capability. \n- Continue the development and assessment of In-vitro Affinity Diagnostic System (IADS) prototypes for future application within a rapid response capability addressing gaps in intracellular biological pathogens and toxins.\n\nChemical: \n- Continue diagnostics capability to support Defense Laboratory Network (DLN) efforts against chemical warfare agent exposure."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "MB4"
                                    },
                                    "Title": {
                                        "val": "Medical Biological Defense (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "63.783"
                                        },
                                        "CurrentYear": {
                                            "val": "46.166"
                                        },
                                        "BudgetYearOne": {
                                            "val": "47.727"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "47.727"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "37.689"
                                        },
                                        "BudgetYearThree": {
                                            "val": "42.517"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.436"
                                        },
                                        "BudgetYearFive": {
                                            "val": "35.462"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC4"
                                    },
                                    "Title": {
                                        "val": "Medical Chemical Defense (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.685"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "3.685"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB5"
                                    },
                                    "Title": {
                                        "val": "Medical Biological Defense (SDD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "127.933"
                                        },
                                        "CurrentYear": {
                                            "val": "130.074"
                                        },
                                        "BudgetYearOne": {
                                            "val": "86.460"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "86.460"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "56.868"
                                        },
                                        "BudgetYearThree": {
                                            "val": "45.226"
                                        },
                                        "BudgetYearFour": {
                                            "val": "68.593"
                                        },
                                        "BudgetYearFive": {
                                            "val": "83.282"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC5"
                                    },
                                    "Title": {
                                        "val": "Medical Chemical Defense (SDD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "43.648"
                                        },
                                        "CurrentYear": {
                                            "val": "60.220"
                                        },
                                        "BudgetYearOne": {
                                            "val": "54.392"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "54.392"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "52.813"
                                        },
                                        "BudgetYearThree": {
                                            "val": "31.441"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.215"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.019"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB7"
                                    },
                                    "Title": {
                                        "val": "Medical Biological Defense (Op Sys Dev)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.602"
                                        },
                                        "CurrentYear": {
                                            "val": "3.231"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.308"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.308"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.012"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.305"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.975"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.188"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT3"
                    },
                    "ProjectTitle": {
                        "val": "Technology Transition (ATD)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.577"
                        },
                        "CurrentYear": {
                            "val": "10.982"
                        },
                        "BudgetYearOne": {
                            "val": "10.416"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.416"
                        },
                        "BudgetYearTwo": {
                            "val": "10.121"
                        },
                        "BudgetYearThree": {
                            "val": "9.842"
                        },
                        "BudgetYearFour": {
                            "val": "9.540"
                        },
                        "BudgetYearFive": {
                            "val": "9.540"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project TT3 validates high-risk\/high-payoff technologies, concepts-of-operations, and a Joint Combat Developer concept development and experimentation process to significantly improve Warfighter capabilities in preparation for transition of mature chemical and biological (CB) defense technologies to advanced development programs. This project addresses the three primary chemical and biological defense thrust areas of Assess, Protect, and Mitigate with an emphasis on Integrated Early Warning (IEW) and Integrated Layered Defense (ILD).  IEW is conducted through a coordinated program approach focused on layering chemical and biological detection technologies and integrating CB threat indicators, providing a combination of awareness and understanding that facilitates effective decision making so the force can continue military operations and achieve mission success in a CBRN environment.  The ILD achieves solutions for capability gaps across medical and non-medical commodity areas to enable warfighter survival and rapid recovery in a CBRN environment.\n\nIndividual efforts in this project include:\n-\tPrograms that offer the opportunity to identify and efficiently mature emerging technologies, reduce risks, and finalize engineering and integration efforts.\n-\tPrograms that seek to demonstrate the potential for enhanced military operational capability and\/or cost effectiveness. Upon conclusion of the technical and operational demonstrations, the user or sponsor provides a determination of the military utility and operational impact of the technology and capability demonstrated. Successfully demonstrated technologies with proven military utility can remain in place for future extended user evaluations, accepted into the advanced stages of the formal acquisition process, proceed directly into limited or full- scale production or be returned to the technical base for further development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Experiment & Technology Demonstrations"
                                    },
                                    "Description": {
                                        "val": "Utilize Technology Concepts, Early User Assessments, and Advanced Technology Demonstrations (ATDs) to demonstrate the maturity and potential of advanced technologies across the Assess, Protect, and Mitigate spectrum for enhanced military operational capability and technology transition effectiveness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.577"
                                            },
                                            "Text": {
                                                "val": "- Continued situational understanding at the tactical level and initiated situational understanding at the operational level for the comprehensive Integrated Early Warning - Advanced Technology Demonstrations  (IEW ATD).\n- Continued S&T integration activities for CB sensor technologies onto mobile platforms as part of the second phase of the comprehensive early warning ATD.  \n- Demonstrated integration of wearable sensors as part of the comprehensive early warning ATD, to be integrated on CBRN Sensor Integration on Robotic Platforms (CSIRP).  \n- Continued to demonstrate prototype end-to-end early warning capability at CONUS area of responsibility.  \n- Continued transition activities with advanced development and associated JPM program efforts supporting the CBDP IEW focus area. \n- Continued to conduct Rapid Military Utility Assessments (RMUAs) and field experiments to assess early technology capability contributions, in collaboration with the CBDP Joint Combat Developer.  \n- Continued Demonstration Concept Development and Experimentation activities in support of Early Warning and Integrated & Layered Defense."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.982"
                                            },
                                            "Text": {
                                                "val": "- Continue situational understanding at the tactical level and initiate situational understanding at the operational level for the comprehensive IEW ATD.\n- Continue S&T integration activities for CB sensor technologies onto mobile platforms and transition to advanced development as part of the second phase of the comprehensive early warning ATD, to be integrated into CBRN Sensor Integration on Robotic Platforms (CSIRP) efforts. \n- Demonstrate integration of wearable sensors as part of the comprehensive early warning ATD. \n- Demonstrate service specific prototype end-to-end early warning capability.\n- Continue transition activities with advanced development and associated JPM program efforts supporting the CBDP IEW focus area.\n- Continue to conduct Early User Assessments with Warfighters to assess early technology capability contributions to operational missions, in collaboration with the CBDP Joint Combat Developer.\n- Continue Technology Concept activities in support of Integrated Early Warning and Integrated & Layered Defense."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.416"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.416"
                                            },
                                            "Text": {
                                                "val": "- Continue situational understanding at the tactical level and initiate situational understanding at the operational level for the comprehensive IEW ATD.\n- Continue S&T integration activities for CB sensor technologies onto mobile platforms and transition to CBRN Sensor as part of the second phase of the comprehensive early warning ATD, to be integrated into CSIRP efforts. \n- Continue to demonstrate integration of wearable sensors as part of the comprehensive early warning ATD. \n- Continue to demonstrate service specific prototype end-to-end early warning capability.\n- Continue transition activities with advanced development and associated JPM program efforts supporting the CBDP IEW focus area.\n- Continue to conduct Early User Assessments with Warfighters to assess early technology capability contributions to operational missions, in collaboration with the CBDP Joint Combat Developer.\n- Continue Technology Concept activities in support of IEW and ILD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "TT4"
                                    },
                                    "Title": {
                                        "val": "Technology Transition (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.577"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.577"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.866"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.143"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.443"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.443"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}