{
    "id": "2021-Army-PB-2040-JBOOK-2ce7b76ca8f41dbc06183380f90728d4a8e40b9122c9effab5b4a02fdffb364e-18",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605805A"
        },
        "ProgramElementTitle": {
            "val": "Munitions Standardization, Effectiveness and Safety"
        },
        "R1LineNumber": {
            "val": "204"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "66.678"
            },
            "CurrentYear": {
                "val": "54.458"
            },
            "BudgetYearOne": {
                "val": "40.133"
            },
            "BudgetYearOneBase": {
                "val": "40.133"
            },
            "BudgetYearTwo": {
                "val": "41.518"
            },
            "BudgetYearThree": {
                "val": "41.425"
            },
            "BudgetYearFour": {
                "val": "42.420"
            },
            "BudgetYearFive": {
                "val": "42.692"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "329.324"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) supports continuing technology investigations by providing a coordinated Tri-Service mechanism for the collection and free exchange of technical data on the performance and effectiveness of all non-nuclear conventional munitions and weapons systems in a realistic operational environment.  \n\nProject 296 - This Project will support research, development and testing to identify, characterize and resolve reliability, safety, storage and manufacturing issues that impact production availability and field use of demolitions, grenades, shoulder launched munitions, mines and mine clearing charges and pyrotechnics, including training realism.  Project will result in the development and demonstration of new, safe, reliable and environmentally acceptable munitions.\n\nProject 297 - Munitions Survivability & Logistics: This Project supports the future force by making Army units more survivable through the investigation, testing and demonstration of munitions logistics system improvements that prevent or minimize catastrophic explosive events and accelerate ammunition resupply. Key thrusts are munitions storage area survivability, Insensitive Munitions (IM) technology integration and compliance, ammunition management and asset visibility, weapon system rearm, munitions configured load enablers and advanced packaging and distribution system enhancements. Within each thrust, a broad array of solutions will be identified, tested, and evaluated against developed system measures of effectiveness. Optimum, cost effective and efficient solutions that enable the rapid projection of lethal and survivable forces will be demonstrated. The early stages of force deployment are especially critical. Theater ammunition storage areas are vulnerable and present the enemy with lucrative targets. These areas and distribution nodes contain the only available munitions stocks in theater. Loss of these munition stocks could cripple the force, jeopardize the mission, and result in high loss of life. This Project mitigates vulnerabilities and ensures a survivable fighting force.\n\nProject 857 - DoD Explosives Safety Standards: This Project supports the Research, Development, Test, and Evaluation efforts of the Department of Defense (DoD) Explosive Safety Standards Board. It supports explosive safety effects research and testing to quantify hazards and to develop techniques to mitigate those hazards in all DoD manufacturing, testing, transportation, maintenance, storage, disposal of ammunition and explosives operations, and also to develop risk based explosives safety standards. Results are essential to the development and improvement of quantity-distance standards, hazard classification procedures, cost effective explosion-resistant facility design procedures, and personnel hazard\/protection criteria.\n\nProject 858 - Army Explosives Safety Management Program: This Project establishes, validates or modifies explosives technical safety requirements per Department of Defense Manual 6055.09 and Department of the Army Pamphlet 385-64, Ammunition and Explosives Safety Standards. Project activities promote Research, Development, Test, and Evaluation (RDTE) of new and innovative explosives safety technologies that improve the survivability of Army personnel, facilities, and equipment as well as improve the health, safety and welfare of the general public (with highest priority directed to combat theater of operations).\n\nProject 859 - Life Cycle Pilot Process: This Project supports the implementation of the Single Manager for Conventional Ammunition (SMCA) Industrial Base Strategic Plan through technology investigations, model based process controls, pilot prototyping, and industrial assessments. It will assess life cycle production capabilities required for all ammunition families, address design for manufacturability to facilitate economical production, identify industrial and technology requirements, and address the ability of the production base to rapidly and cost effectively produce quality products. Cost reduction is an important part of the Life Cycle Pilot Process (LCPP). LCPP provides the resources to prototype critical technologies and develop the knowledge base to establish cost effective, environmentally safe and modern production processes in support of the munitions Industrial Base transformation. In addition, the LCPP program addresses Single Point Failures (SPFs) \/ No Source of supply within the National Technology Industrial Base (NTIB). LCPP provides support to reduce supply chain risk by investigating, developing and evaluating additional sources of supply for a known SPF.\n\nProject F21: The North Atlantic Treaty Organization (NATO) Ammunition Evaluation program funding ensures interchangeability of direct fire ammunition and weapons among all the NATO countries with all of the associated logistic, strategic and tactical advantages of the alliance. The Project involves development and testing compliance of NATO standardization agreements (STANAGS) and staffing of the North American Regional Test Center (NARTC). In addition, this Project supports small caliber ammunition, 40mm grenade munitions, medium caliber cannon ammunition, and large caliber ammunition enhancements to lethality, effectiveness, survivability, accuracy, and general product improvements. This Project also supports the standardization and interchangeability of legacy and new production U.S. weapons and ammunition with Allied Nations to maximize battlefield interchangeability\/compatibility under the auspices of international agreements to include NATO working groups, the Joint Ballistics Memorandum Of Understanding (JBMOU), and information\/ data exchange agreements. Maximizing standardization, interchangeability, and exportability will also potentially increase Foreign Military Sales (FMS) of U.S. indirect fire Weapon and Munition products to support United States industrial base production and affordable Department of Defense pricing through increased economies of scale. FY 2021 funding will support NATO and JBMOU artillery and small arms ammunition interchangeability group meetings, documentation, and test operations.  \n\nProject F24: Conventional Munitions Demilitarization (Demil): The Conventional Munitions Demilitarization technology Project supports the Single Manager for Conventional Ammunition (SMCA) responsibility per Department of Defense Instruction (DoDI) 5160.68 to plan, program, budget and fund a Joint Service Research and Development (R&D) program that develops capability and capacity as well as technology and facilities to support the SMCA mission to demil and dispose of conventional ammunition stored in the SMCA Resource, Recovery and Disposition Account (B5A).  The program goals include SMCA efforts to increase efficiencies and effectiveness to reduce the demil stockpile; reduce processing costs including packaging, handling and crating; and increase capacity through improved demilitarization capabilities and processes. Project F24 includes activities: (1) to establish requirements and develop processes to focus investments, assess capabilities, analyze alternatives, and recommend and implement R&D projects; (2) to improve products and processes that support existing capabilities; (3) to develop or improve demil methods and processes related to advance the primary demilitarization core thrust areas of destruction, disassembly, removal, resource recovery and recycling, and waste stream treatment; (4) to ensure safe and environmentally acceptable demil operations; (5) to transition R&D products to United States Army depots or plants as well as commercial facilities performing demil; and (6) to mitigate risk and close-out project activities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "72.279"
                },
                "CurrentYear": {
                    "val": "44.458"
                },
                "BudgetYearOne": {
                    "val": "42.064"
                },
                "BudgetYearOneBase": {
                    "val": "42.064"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "66.678"
                },
                "CurrentYear": {
                    "val": "54.458"
                },
                "BudgetYearOne": {
                    "val": "40.133"
                },
                "BudgetYearOneBase": {
                    "val": "40.133"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.601"
                },
                "CurrentYear": {
                    "val": "10"
                },
                "BudgetYearOne": {
                    "val": "-1.931"
                },
                "BudgetYearOneBase": {
                    "val": "-1.931"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "10"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-4.091"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.51"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.931"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.931"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "297"
                    },
                    "ProjectTitle": {
                        "val": "Mun Survivability & Log"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.027"
                        },
                        "CurrentYear": {
                            "val": "15.595"
                        },
                        "BudgetYearOne": {
                            "val": "16.346"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.346"
                        },
                        "BudgetYearTwo": {
                            "val": "17.046"
                        },
                        "BudgetYearThree": {
                            "val": "17.023"
                        },
                        "BudgetYearFour": {
                            "val": "17.231"
                        },
                        "BudgetYearFive": {
                            "val": "17.286"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "116.554"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports the future force by making Army units more survivable through the investigation, testing and demonstration of munitions logistics system improvements that prevent or minimize catastrophic explosive events and accelerate ammunition resupply. Key thrust areas are munitions storage area survivability, Insensitive Munitions (IM) technology integration and compliance, ammunition management and asset visibility, weapon system rearm, munitions configured load enablers, advanced packaging and distribution system enhancements, improved estimation and future prediction of munitions reliability.  Within each thrust area, a broad array of solutions will be identified, tested, and evaluated against developed system measures of effectiveness. Optimum, cost effective and efficient solutions that enable the rapid projection of lethal and survivable forces will be demonstrated. The early stages of force deployment are especially critical. Theater ammunition storage areas are vulnerable and present the enemy with lucrative targets. These areas and distribution nodes contain the only available munitions stocks in theater. Loss of these munition stocks could cripple the force, jeopardize the mission, and result in high loss of life. This Project mitigates vulnerabilities and ensures a survivable fighting force.  All research and development initiatives will be supporting the cross functional teams and the multi domain operations modernization objectives."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Munitions Predictive Life"
                                    },
                                    "Description": {
                                        "val": "This activity will demonstrate technologies and algorithms that can help assess munitions serviceability based upon aggregate environmental exposures, system cycling and munition degradation models. The activity will provide life cycle management tools for risk mitigation strategies, while reducing testing, inspection & surveillance required as well as improving weapon system reliability and warfighter effectiveness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.378"
                                            },
                                            "Text": {
                                                "val": "Conducted testing of an integrated second generation prototype temperature\/humidity exposure sensor.  Conducted testing of a Multi Frequency Sensor Suite that will monitor munitions exposure to ambient radiation over their lifecycle for improved reliability knowledge. Conducted correlation testing on the passive time\/temperature exposure sensor with legacy ammunition items. Conducted market survey of passive Radio Frequency Identification and low cost active environmental sensors for legacy munitions, selected and tested viable candidates.  Integrated passive propellant temperature sensor with fire control systems and processes.  Incorporated automation friendly health monitors into automated supply point - scalable and continued integration testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.083"
                                            },
                                            "Text": {
                                                "val": "Demonstrate concept of operations of an integrated second generation ammunition container based temperature\/humidity exposure reliability sensor.  Demonstrate Multi Frequency Sensor Suite in a training environment that will monitor exposure to ambient radiation over their lifecycle with legacy ammunition items.  Support qualification testing and required modifications of passive time\/temperature exposure sensor.  Conduct additional correlation testing on legacy ammunition items to prepare for broader stockpile integration.  Conduct market survey of passive Radio Frequency Identification and low cost active environmental sensors for legacy munitions, select and test viable candidates.  Conduct sensitivity analysis of near-real time propellant temperature on ballistic solutions.  Incorporate munition monitoring technologies into demonstrations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.352"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.352"
                                            },
                                            "Text": {
                                                "val": "Demonstrate improved performance of an integrated reduced footprint temperature\/humidity exposure reliability sensor.  Demonstrate lower cost alternative accelerometer design for Remote Readiness Asset Prognostic\/Diagnostic System (RRAPDS).   Conduct recurring market surveys of emerging passive Radio Frequency Identification technologies and active and passive environmental sensors for legacy munitions, select and test viable candidates.  Evaluate potential for propellant temperature sensors on additional munitions.  Incorporate munition monitoring technologies into an operational demonstration.  Evaluate lead free solder based circuit card assembly alternatives."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The slight increase from FY 2020 to FY 2021 is due to labor rate increases."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Insensitive Munitions (IM) Integration Program"
                                    },
                                    "Description": {
                                        "val": "Demonstrate multiple IM technologies and integrate into end item(s) to improve munitions survivability and warfighter safety. IM Technologies, using State-of-the-Art materials, will be developed in the areas of warhead, propulsion and propellants, explosives, packaging, and barriers. In addition, modeling and simulation will be used to reduce development and testing costs. Efforts will increase the number of IM compliant ammunition items fielded to mitigate munitions reaction to unplanned stimuli such as fire, fragments, enclosed heat build-up (cook-off), bullets, adjacent munitions reaction (sympathetic detonation), and shape charge jet attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.321"
                                            },
                                            "Text": {
                                                "val": "Completed PVAT testing of eutectic case venting design across temperature range. Dinitropyrazole (DNP) explosive lab scale testing has shown performance levels greater than Comp B. Granulated Melt-Pour Explosive (GMPX) energetics were optimized to reduce mass-detonation hazards during thermal events of tightly-packed medium caliber munitions, while maintaining high-energy output. GMPX-07 was demonstrated to have performance similar to Comp A-5 in the 40mm M433 grenade. Tested non-deforming packaging configurations that indicates that mass detonation events may be eliminated in tightly-packed medium caliber munitions. Early tests indicated that Deflection Plate will successfully and completely disarm warhead from detonating due to unintended initiation. Demonstrated novel packaging heat management materials in mortars systems to delay catastrophic responses in Slow Cook Off (SCO) conditions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.568"
                                            },
                                            "Text": {
                                                "val": "Conduct end item testing of a high energy pressed explosives to replace Composition A5 to reduce the reaction violence from shock and slow heating.  Continue development of medium caliber, foamed celluloid cartridge cases to create a novel venting solution for shock and thermal events.  Conduct fragment impact testing on new igniter formulations to replace Benite in 120mm tank munitions.  Perform Insensitive Munitions (IM) testing on the M433E1 40MM Cartridge to integrate technologies for warhead and packaging venting along with impact mitigation technologies.  Continue optimization of plastic packaging containers for large caliber munitions to mitigate both fast and slow cook-off events."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.851"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.851"
                                            },
                                            "Text": {
                                                "val": "Complete end item testing of high energy pressed explosives to replace Comp A5 for improved reaction violence to shock and slow heating. Demonstrate medium caliber, foamed celluloid cartridge cases for improved response to shock and thermal threats in support of Next Generation Combat Vehicle (NGCV), Future Vertical Lift (FVL) and Soldier Lethality (SL) modernization priorities.  Complete fragment impact testing on new igniter formulations to replace Benite in 120mm tank munitions.  Perform Insensitive Munitions (IM) testing on the M433E1 40MM Cartridge to integrate explosive technology along with warhead, packaging venting and impact mitigation technologies. Continue development of Dinitropyrazole (DNP) based formulation in 120mm mortar for improved IM and lethality to support of Long Range Precision Fires (LRPF) modernization priority. Optimize DNP formulation with added nitramines, for an improved Insensative Munitions (IM) formulation that matched Polymer Based Explosive (PBXN-110) performance. Continue to develop Lab Resonance Acoustic Mixing (RAM) technology to coat nanonitramine formulations for improved shock sensitivity at reduced cost to support Long Range Precision Fires (LRPF) and Air and Missile Defense (AMD) priorities. Demonstrate optimized plastic containers for large caliber munitions to mitigate both fast and slow cook-off events. Conduct final testing of the non-deforming packaging configurations to prevent mass detonation events in tightly-packed medium caliber munitions. Complete development of deflection plate technology for an integrated packaged design."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Slight increase from FY 2020 to FY 2021 is due to labor rate increases."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved Munitions Packaging"
                                    },
                                    "Description": {
                                        "val": "This activity will demonstrate upgrades to existing packaging components and materials to improve legacy ammunition survivability. These upgrades will enhance ammunition survivability and reliability, improve field ammunition operations, and improve packaging."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.076"
                                            },
                                            "Text": {
                                                "val": "Conducted engineering testing on injection molded cylindrical container that prepares it for use with the M829A4 120mm tank and 120mm mortar munitions. Conducted engineering testing for the plastic rectangular container to prepare it for use with legacy 5.56mm small caliber ammunition. Developed concepts and produced parts for the M2A2 container to reduce weight.  Performed final hazard classification testing on M6 and M7 blasting cap container design with Mycofoam.  Conducted engineering testing for a linked 7.62mm ammunition bulk packaging container for improved distribution efficiency. Explored the implementation of a new bulk pack container at Lake City Army Ammunition Plant (LCAAP) and identified other potential small caliber ammunition bulk container candidates.  Finalized design and ordered a mold for the plastic mortar container prototype for use with all families of mortars.  Developed engineering prototype design for the Rapid Access Container Consolidator (RACC) that can be manufactured in-house, and created a Design of Experiments (DoE) for further optimization.  Developed concepts and ordered tooling to incorporate an embossed rub rail into the sides of traditional ammunition containers.  Validated a wood preservative and mold inhibitor solution that will delay mold growth on wood packaging material.  Created and routed a Request for Variance (RFV) for immediate implementation of these mold inhibitors into the current preservative systems.  Completed pathway analysis for the European Union, Korea, and Japan for the Hardwood Derogation program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.956"
                                            },
                                            "Text": {
                                                "val": "Develop prototypes and perform engineering testing for the Rapid Access Container Consolidator (RACC) program for the transportation of M2A2 containers.  Perform engineering and verification testing on the Bulk Pack Container program for 7.62MM linked ammunition and continue to facilitate implementation of new design with Lake City Army Ammunition Plant (LCAAP).  Continue to conduct verification testing on injection molded cylindrical container for integration with the M829A4 120mm tank ammunition. Conduct qualification testing for the plastic rectangular container to integrate it for use with legacy 5.56mm small caliber ammunition. Conduct engineering and prototype testing on injection molded plastic mortar container for integration with 120mm mortar munitions.  Conduct engineering testing on the lightweight M2A2 container as part of the Lighten the Load program for use on small caliber ammunition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.68"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.68"
                                            },
                                            "Text": {
                                                "val": "Conduct verification testing for the Rapid Access Container Consolidator (RACC) program for the transportation of M2A2 containers. Conduct engineering and verification testing for the plastic rectangular container to integrate it for use with the next generation weapon systems. Conduct verification testing on injection molded plastic mortar container for the family of 120mm mortars.  Conduct verification testing on the lightweight steel M2A2 container as part of the Lighten the Load program for use with the next generation weapon system.  Conduct verification testing on the M548 Tracked Cargo Carrier container with embossed rub-rail for small and medium caliber ammunition.  Conduct pallet testing as part of the undervalued hardwood program.  Conduct testing and initial user assessment of a standardized wall breaching kit, sled for movement of 2.75? rockets and linked ammunition container enhancements designed for Special Forces operations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to amount of verification testing required on families of items."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ammo Provider"
                                    },
                                    "Description": {
                                        "val": "This activity demonstrates technologies that will assure a survivable munitions logistics system by increasing distribution velocity and protecting ammo storage areas. Technology areas to be investigated include ammunition asset visibility, including environmental sensors, marking technologies, and supply chain modeling; ammunition management, including improvements in stockpile surveillance and condition based management; sustainment, including pre-configured loads (soldier to unit size); field ammo reconfiguration capability, robotic handling, and improved load building capability; and force protection, including site planning software and field storage protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.252"
                                            },
                                            "Text": {
                                                "val": "Developed and integrated multiple enablers including the Configured Load Building Tool (CLBT), Materiel Handling Equipment autonomous applique kit, Cognitive Automated Supply Point Enhanced Robotics (CASPER) supervisory control and Class V Adaptive Demand Estimation System (CADES), and demonstrated these Ammunition Supply Point ? Scalable (ASP-S) components as part of a multi-National experiment. Developed the design concept and assessed sensor \/ scanning hardware technology options for an automated scanning capability that will support conveyance level accountability and enable inspections of transported cargo in the ASP-S. Developed concepts for and assessed COTS platform, sensor and scanning hardware for a ?yard mule? to provide an organic autonomous transportation capability within the ASP-S.  Continued development of the Distribution and Retrograde Adaptive planning and execution Management (DRAM) capability and conducted multiple operational demonstrations of the prototype in USEUCOM.  Developed additional end user driven capabilities for the CADES prototype and supported a series of operational demonstrations sponsored by USCENTCOM. Performed an engineering evaluation and validation \/ verification testing of a battery operated integrated round counting sensor device that enables automatic capturing of fired ammunition data from weapon systems to facilitate future anticipatory resupply.  Conducted operational assessments of expeditionary Munitions Survivability Software (eMSS) enhancements and implemented transition of the prototype to a Common Access Card enabled government server. Completed an evaluation of UV-Vis technology that established this is not a viable candidate for use as a propellant surveillance tool. Worked with multiple agencies to secure access to a wide array of performance data source files and began creating the data analysis algorithms that will establish a link between failure and environmental exposure for the Ammunition Quality Decision Tool project. Provided support to year 1 of the Unmanned Logistics System ? Air (ULS-A) JCTD."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.28"
                                            },
                                            "Text": {
                                                "val": "Demonstrate multiple improved ammunition logistics enablers including Ammunition Quality Decision Tool, Configured Load Building Tool, Material Handling Equipment (MHE) interface kit and Class V Adaptive Demand Estimation System (CADES), integrated through Cognitive Automated Supply Point Enhanced Robotics (CASPER), within Automated Supply Point-Scalable (ASP-S).  Perform testing and initial user assessment for continued development of integrated round counting sensor device.  Facilitates anticipatory resupply by enabling automatic reporting of quantity and type of fired ammunition through signature analysis from small and medium caliber weapon systems.  Support continued development and field trials of Distribution and Retrograde Adaptive planning and execution Management (DRAM) and Class V Adaptive Demand Estimation System (CADES) prototypes through operational demonstrations.  Develop artificial intelligence and mechanical systems to facilitate the turn in, inspection, and retrograde of small to medium caliber ammunition in forward tactical environments. Continue development and conduct incremental operational assessment of expeditionary Munitions Survivability Software enhance Mobile Satellite Services (eMSS) enhancements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.463"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.463"
                                            },
                                            "Text": {
                                                "val": "Continue incremental development and user evaluations of the Class V Adaptive Demand Estimation System (CADES) prototype to demonstrate increasingly complex capabilities to include support of multi-vessel ammunition call forward planning and establishing theater wide stock objectives. Develop expeditionary Munitions Survivability Software (eMSS) capabilities to support disconnected operations, continue executing extended user evaluations and compile documentation to support transition to a Product Manager. Support continued validation of the Distribution and Retrograde Adaptive planning and execution Management (DRAM) prototype to prepare for transition.  Perform initial user evaluations of the Configured Load Building Tool (CLBT) capability supplemented with augmented reality technology to enable more efficient load building. Receive prototype Loose Ammo Turn In capability and conduct tactical testing in representative environments.  Complete development and initiate testing of a capability for rapidly capturing the interior layout of an ammunition storage magazine in three dimensions to enable more efficient management of the ammunition stockpile.  Complete testing and demonstration of the Ammunition Quality Decision Tool in preparation for transition to the Army Ammunition Enterprise. Improve logistics performance by exploiting man-machine teaming to provide supervisory control capabilities for workload tasking in an ammunition storage node.  Develop technologies to facilitate the turn in, inspection, and retrograde of small to medium caliber ammunition in forward tactical environments. Provide support to year 3 of the Unmanned Logistics System ? Air (ULS-A) JCTD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC  638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.708"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC  638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC  638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "857"
                    },
                    "ProjectTitle": {
                        "val": "DoD Explosives Safety Standards"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.781"
                        },
                        "CurrentYear": {
                            "val": "1.858"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0.003"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "3.642"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2021 (FY21) this Project is Eliminated."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Program Element (PE) supports continuing technology investigations. It provides a coordinated tri-Service mechanism for the collection and free exchange of technical data on the performance and effectiveness of all non-nuclear conventional munitions and weapons systems in a realistic operational environment.\n\nProject 857 - DoD Explosives Safety Standards: This Project supports the Research, Development, Test, and Evaluation efforts of the Department of Defense (DoD) Explosive Safety Standards Board. It supports explosive safety effects research and testing to quantify hazards and to develop techniques to mitigate those hazards in all DoD manufacturing, testing, transportation, maintenance, storage, disposal of ammunition and explosives operations, and also to develop risk based explosives safety standards. Results are essential to the development and improvement of quantity-distance standards, hazard classification procedures, cost effective explosion resistant facility design procedures, and personnel hazard\/protection criteria.\n\nThis Project supports the Research, Development, Test, & Evaluation (RDTE) efforts of the Department of Defense (DoD) Explosive Safety Standards Board. It supports explosive safety effects research and testing to quantify hazards and to develop techniques to mitigate those hazards in all DoD manufacturing, testing, transportation, maintenance, storage, disposal of ammunition and explosives operations, and also to develop risk based explosives safety standards. Results are essential to the development and improvement of quantity-distance standards, hazard classification procedures, cost effective explosion resistant facility design procedures, and personnel hazard\/protection criteria."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Explosive and Munitions Tests"
                                    },
                                    "Description": {
                                        "val": "Testing aimed at solving practical problems and increasing predictability of the effects of explosions and impacts on people, materials and structures. Additionally, testing provides data on the interaction of explosives in various configurations. Testing results are used to improve predictability of effects from explosive incidents and improve criteria to protect people, structures and the environment from the damaging effects of DoD munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.056"
                                            },
                                            "Text": {
                                                "val": "1. Testing in support of criteria development for small\/lab quantities nearly complete.  Initial results indicate significant reduction in required footprint for laboratories\n2. Initial testing completed on internal blast determinations.  Project is focused on developing and validating an improved internal gas pressure prediction model to replace the current  models which tend to be overly conservative (resulting in increased construction costs).  Testing is on track and providing useful data.\n3. HD 1.3 testing initiated.  Follow on testing delayed due to earthquakes in California.  Alternate test sites are being pursued."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.089"
                                            },
                                            "Text": {
                                                "val": "Conduct scaled and full-scale testing of earth-covered magazines, and continue test program to characterize thermal\/combustion hazards in explosives storage and operating facilities and develop models to predict these hazards."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There was no FY 2021 funding requested for this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Explosive Safety Standards (ESS) Implementation Methodologies & Tools"
                                    },
                                    "Description": {
                                        "val": "Provide tools to support site planning and risk assessment in the garrison and contingency environments. Provide tools and improvements for United Facilities Criteria, Structures to Resist the Effects of Accidental Explosions (UFC 3-340-02) and substantial dividing wall criteria. Provide methodologies and tools to perform site-specific analyses, databases for critical explosives safety information, and standardized designs to reduce design costs. Develop models to predict response for large scale explosion effects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.375"
                                            },
                                            "Text": {
                                                "val": "1. TP-16 tool on calculating trajectories revised and fielded improving ability to predict fragment throw\n2. External blast computer methodology produced and fielded enabling improved calculation of blast effects\n3. Continued development of ESS tool, updated with risk assessment tools and near ready for web deployment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.361"
                                            },
                                            "Text": {
                                                "val": "Finalize transition of Explosive Safety Standards (ESS) to web hosting, with full capability for quantity-distance and risk-based siting of explosives facilities Department of Defense (DoD) wide. Develop expanded suite of tools to meet diverse needs of the DoD explosives safety community."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No FY 2021 funding requested for this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Standard Development & Improvement"
                                    },
                                    "Description": {
                                        "val": "Improve and revise all DoD Explosives Safety Standards (for hazard classification, quantity distance, and protective construction) to keep them current with changing technology and incorporate knowledge gained from the testing program. Shape and leverage with international community (NATO & UN). Develop Advanced (e.g. risk-based) siting criteria."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.35"
                                            },
                                            "Text": {
                                                "val": "1. Research on criteria in support of DESR-2, the replacement for DoDM 6055.09. DESR-2 will provide extensive background and improved flow to determine adverse exposures\n2. Earth covered magazine research and criteria revision\n3. Debris quantity distance criteria research\n4. Situation specific hazard classification protocol development leading to improved criteria"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.324"
                                            },
                                            "Text": {
                                                "val": "Pursue update of North Atlantic Treaty Organization (NATO) criteria to better address debris and thermal hazards from explosives, as indicated by results of multi-year US test and modeling programs. Incorporate test results of earth-covered magazine blast load testing into Department of Defense Manual (DoDM 6055.09), DoD Ammunition and Explosives Safety Standards and United Facilities Criteria, Structures to Resist the Effects of Accidental Explosions (UFC 3-340-02)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No FY 2021 funding requested for this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC  638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.084"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC  638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC  638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "858"
                    },
                    "ProjectTitle": {
                        "val": "Army Explosives Safety Management Program"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.959"
                        },
                        "CurrentYear": {
                            "val": "1.011"
                        },
                        "BudgetYearOne": {
                            "val": "1.029"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.029"
                        },
                        "BudgetYearTwo": {
                            "val": "1.046"
                        },
                        "BudgetYearThree": {
                            "val": "1.078"
                        },
                        "BudgetYearFour": {
                            "val": "1.075"
                        },
                        "BudgetYearFive": {
                            "val": "1.086"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "7.284"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project establishes, validates or modifies explosives technical safety requirements per Department of Defense Pamphlet 385-64, Ammunition and Explosives Safety Standards. Project activities promote Research, Development, Test, & Evaluation (RDTE) of new and innovative explosives safety technologies that improve the survivability of Army personnel, facilities, and equipment as well as improve the health, safety and welfare of the general public. FY 2021 funding will support continued testing, validation, and regulatory integration for permanent, temporary and  mobile ammunition & explosives (A&E) facilities as well as operations. The Defense Ammunition Center\/US Army Technical Center for Explosives Safety (DAC\/USATCES) will team with and sponsor agencies (Joint Service, Academia, and Contractor) to improve the effectiveness of identifying, analyzing, and apply risk acceptance to ammunition and explosive environments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Risk based explosives safety criteria"
                                    },
                                    "Description": {
                                        "val": "Development of risk based explosives safety criteria that will aid commanders and safety personnel in the transition from regulation to risk management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.1"
                                            },
                                            "Text": {
                                                "val": "Continued explosives testing and support of hazard research and exposure consequences."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.135"
                                            },
                                            "Text": {
                                                "val": "Will continue explosives testing and support of hazard research and exposure consequences."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.15"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.15"
                                            },
                                            "Text": {
                                                "val": "Will continue explosives testing and support of hazard research and exposure consequences."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding numbers are the same as FY2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Development of enhanced protective structure designs"
                                    },
                                    "Description": {
                                        "val": "Develop enhanced protective structure designs that improve the survivability of Army personnel, facilities and equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.559"
                                            },
                                            "Text": {
                                                "val": "Continued explosives testing and support for improving protective construction designs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.595"
                                            },
                                            "Text": {
                                                "val": "Will continue explosives testing and support for improving protective construction designs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.629"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.629"
                                            },
                                            "Text": {
                                                "val": "Will continue explosives testing and support for improving protective construction designs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase due to within-Project re-prioritization and adjustment for inflation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Development of explosive safety tools"
                                    },
                                    "Description": {
                                        "val": "Develop explosive safety tools for use by Army personnel. Explosive safety tools allow commanders and safety personnel to make explosive safety decisions using risk management methodologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.3"
                                            },
                                            "Text": {
                                                "val": "Continued development of new methods and tools for risk assessment to improve explosive safety risk management decisions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.235"
                                            },
                                            "Text": {
                                                "val": "Will continue development of new methods and tools for risk assessment to improve explosive safety risk management decisions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.25"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.25"
                                            },
                                            "Text": {
                                                "val": "Will continue development of new methods and tools for risk assessment to improve explosive safety risk management decisions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding numbers are the same as FY2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC  638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.046"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC  638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC  638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "859"
                    },
                    "ProjectTitle": {
                        "val": "Life Cycle Pilot Process"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "31.235"
                        },
                        "CurrentYear": {
                            "val": "10.6"
                        },
                        "BudgetYearOne": {
                            "val": "5.695"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.695"
                        },
                        "BudgetYearTwo": {
                            "val": "5.795"
                        },
                        "BudgetYearThree": {
                            "val": "5.895"
                        },
                        "BudgetYearFour": {
                            "val": "5.894"
                        },
                        "BudgetYearFive": {
                            "val": "5.92"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "71.034"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "To execute the Single Manager for Conventional Ammunition (SMCA) Industrial Base Strategic Plan, this project supports: material and manufacturing technology investigations and assessments; pilot prototype processes; technology and process assessment for industrial base safety, security and environmental concerns; mitigate supply chain risks by assessing alternative processes and materials for Army's legacy products. Projects support overall research, development and modernization efforts towards rapid technological advancements and the changing character of war. Specifically, this project assesses life cycle production capabilities required for all ammunition families; address design for manufacturability to facilitate economical production; identify industrial and technology requirements; address production base concerns that may impact availability for cost effective quality products and assess security capability gaps to ensure a robust manufacturing supply chain processes. In addition, the Life Cycle Pilot Process (LCPP) program addresses Single Point Failures (SPFs) and no source of supply within the National Technology Industrial Base (NTIB). LCPP provides support to reduce supply chain risk by investigating, developing and evaluating additional sources of supply for a known SPF. (LCPP) provides the resources to prototype critical technologies, improve security processes and requirements; develop a knowledge base to establish cost effective, environmentally safe and modern production processes in support of transforming the Industrial Base.\n\nFY 2021 funding will support various efforts to reduce manufacturing and production costs; bridge technology transition between research and production; and assess security vulnerabilities within the NTIB. Program will continue to investigate and evaluate manufacturing technology; assess improved security processes; alternative materials and processes to address supply chain risks and resiliency concerns."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Congressional Add"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "26"
                                        },
                                        "Text": {
                                            "val": "Congressional Add"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Congressional Add"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Product Cost Thrust Area"
                                    },
                                    "Description": {
                                        "val": "This thrust area seeks out new opportunities to reduce overall cost of armaments and ammunition components. Efforts will review and analyze legacy manufacturing processing for opportunities to integrate improved technology and materials to lean manufacturing processes to reduce overall unit cost."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.261"
                                            },
                                            "Text": {
                                                "val": "Continue to evaluate and investigate mature manufacturing process and technologies.  Assess alternative materials to reduce end item and production costs for transition to the Army?s Industrial Base.  Efforts include but not limited to: configuration analysis to reduce amount of energetics to affect overall legacy end item grenade costs; assess alternative materials for fielded propulsion end items to cost avoid potential shutdowns and failure analyses, assess in-line process inspection technology to reduce producibility costs and increase product yields for GOCO facilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.033"
                                            },
                                            "Text": {
                                                "val": "Continue to evaluate new materials, processes and technology to reduce overall production and end item costs for the Army.  Complete and transfer Insensitive Munition Explosive (IMX) riser reclamation project to Iowa Army Ammunition Plant.  Complete ultrasonic inspection of slurry coated explosives effort.  Effort seeks to monitor critical parameters of explosive manufacturing and increase production yield and reduce rework costs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.814"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.814"
                                            },
                                            "Text": {
                                                "val": "Continue to evaluate and investigate mature manufacturing process and technologies.  Assess alternative materials to reduce end item and production costs for transition to the Army's Industrial Base.  Efforts include but not limited to: configuration analysis to reduce amount of energetics to affect overall legacy end items grenade costs; assess alternative materials for fielded propulsion end items to cost avoid potential shutdowns and failure analyses, assess in-line process inspection technology to reduce producibility  costs an increase product yields for GOCO facilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to reduction of Product Cost thrust area requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Single Point Failures (SPFs)"
                                    },
                                    "Description": {
                                        "val": "This thrust area seeks to mitigate single source and no source of supply to armaments and ammunition manufacturing operations. Thrust area tests or evaluates alternative materials and processes to mitigate SPFs. These efforts are part of the overall strategy to reduce the number of SPFs in the NTIB. Additionally, thrust area efforts will address ammunition manufacturing capability shortfalls. This area leverages RDTE accomplishments and product knowledge to satisfy manufacturing requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.925"
                                            },
                                            "Text": {
                                                "val": "Investigated bis(dinitropropyl) acetaldehyde \/ formaldehyde (BDNA\/F) SPF to support PAX-3 loaded munitions for use in M213 grenade and 120mm Tank.  BDNA\/F is a plasticizer in the PAX-3 formulation.  Evaluated BDNA\/F process scale-up; current supply is stockpiled with no known qualified manufacturing source.  Completed SPF densified basic magnesium carbonate (DBMC) assessment.  DBMC single qualified source used in formulation smoke grenade mixes.  Effort evaluated additional source from foreign allies for the form\/fit test.  Established a transition plan for the ECP TDP to include more than one DBMC source.  Completed tank primer sealant SPF evaluation.  Effort included assessing alternative primer sealants. Evaluated plastic sheath to protect tank primer (benite) from moisture."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.32"
                                            },
                                            "Text": {
                                                "val": "Continue to mitigate single source and\/or no source of supply for armaments and ammunition manufacturing operations.  Transition mitigation plan to Program Manager for their use in risk mitigation implementation supply strategies and assessing procurement strategies for affected end items.  Continue BDNPA\/F nitro plasticizer Single Point of Failure mitigation.  Complete liquid reserve Single Point of Failure and alternative anti-seize materials for artillery efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.47"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.47"
                                            },
                                            "Text": {
                                                "val": "Continue to assess technology and material alternatives to mitigate single source and no source of supply for in production end items and end item components. Efforts include but not limited to: scale-up and optimizing manufacturing process for an energetic constituent to mitigate no source of supply risk, evaluate lubricant alternatives for artillery end items to mitigate no source of supply risk. Investigative findings will be transition to product PM via engineering change proposal to existing Technical Data Package (TDP) or include into procurement strategies for affected end items."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase in program priorities to reduce or mitigate SPF within the Army's OCONUS supply chain risk."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Manufacturing Technology for Industrial Base Transformation"
                                    },
                                    "Description": {
                                        "val": "This thrust area matures ammunition manufacturing technologies, processes to enhance manufacturing, security capabilities of legacy armaments and ammunition manufacturing operations. Thrust area will pilot and transition processes to affected industrial base for armaments and ammunition manufacturing operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.049"
                                            },
                                            "Text": {
                                                "val": "Completed effort to automate primer manufacturing process for lead free formulation mix; completed fabrication and controls integration.  Continued technology evaluation and assessment for treatment and disposal of ammonium nitrate solution (ANSol) waste generated at Government-owned, Contractor-operated (GOCOs) Army ammunition plants.  Completed investigation of ANsol and coal fly-ash mixture as a potential fuel for plant steam generation.  Continued development of ultrasonic inspection for slurry coated explosives.  Effort utilizes in-line inspection techniques to improve product quality and reduce rework."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.993"
                                            },
                                            "Text": {
                                                "val": "Continue manufacturing technology assessments \/ investigations and develop technology transfer strategies for implementation to Army?s industrial base.  Complete ultrasonic inspection of slurry coated explosives effort.  Effort seeks to monitor critical parameters of explosive manufacturing and increase production yield and reduce rework costs.  Complete pre-cursor celluloid for foamed celluloid applications to mitigate OCONUS celluloid source.  Effort will develop improved method to support foam celluloid applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.411"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.411"
                                            },
                                            "Text": {
                                                "val": "Continue investigation and pilot mature manufacturing technologies and processes towards transforming the Army's Industrial Base. Efforts include but not limited to: assessment of reuse and recycle technology for industrial waste applications (insensitive munition waste constituent recovery and RDX waste stream mitigation), pilot manufacturing technology to improve aging manufacturing process methods and improve manufacturing efficiencies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase in program priorities to enhance capabilities of aging legacy manufacturing and reduce cost of waste treatment and disposal."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC  638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.254"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC  638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC  638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "F21"
                    },
                    "ProjectTitle": {
                        "val": "NATO Ammo Evaluation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.65"
                        },
                        "CurrentYear": {
                            "val": "0.75"
                        },
                        "BudgetYearOne": {
                            "val": "0.749"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.749"
                        },
                        "BudgetYearTwo": {
                            "val": "0.749"
                        },
                        "BudgetYearThree": {
                            "val": "0.749"
                        },
                        "BudgetYearFour": {
                            "val": "0.749"
                        },
                        "BudgetYearFive": {
                            "val": "0.749"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.145"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "North Atlantic Treaty Organization (NATO) Ammunition Evaluation program funding ensures interchangeability of ammunition and weapons among all the NATO countries with all of the associated logistic, strategic and tactical advantages of the alliance. This Project involves development and testing compliance of NATO standardization agreements (STANAGS) and staffing of the North American Regional Test Center (NARTC). In addition, this Project supports small caliber ammunition, 50mm ammunition, 40mm grenade munitions, medium caliber cannon ammunition, and large caliber ammunition enhancements to lethality, effectiveness, survivability, accuracy, and general product improvements. This Project also supports the standardization and interchangeability of legacy and new production U.S. weapons and ammunition with Allied Nations to maximize battlefield interchangeability\/ compatibility under the auspices of international agreements to include NATO working groups, the Joint Ballistics Memorandum of Understanding (JBMOU), and information\/ data exchange agreements.  Maximizing standardization, interchangeability, and exportability will also potentially increase Foreign Military Sales (FMS) of U.S. indirect fire weapon and munition products to support United States industrial base production and affordable Department of Defense pricing through increased economies of scale.  FY 2021 funding will support NATO and JBMOU artillery and small arms ammunition interchangeability group meetings, documentation, and test operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "New Ammo Design Qualification & NATO Mission Support"
                                    },
                                    "Description": {
                                        "val": "This activity ensures complete interchangeability of small caliber, automated cannon-caliber, 40mm grenade ammunition, air burst capable 30mm\/40mm ammunition, 50mm ammunition, large caliber ammunition and weapons among NATO countries to achieve the associated logistic, strategic and tactical advantages."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.145"
                                            },
                                            "Text": {
                                                "val": "Continuing work to support NATO small arms ammunition, direct fire grenade, and large caliber interchangeability group meetings, documentation and test operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.283"
                                            },
                                            "Text": {
                                                "val": "Will continue work to support NATO small arms ammunition, direct fire grenade, and large caliber interchangeability group meetings, documentation and test operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.3"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.3"
                                            },
                                            "Text": {
                                                "val": "Will continue work to support NATO small arms ammunition, direct fire grenade, and large caliber interchangeability group meetings, documentation and test operations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Ballistics Program Support"
                                    },
                                    "Description": {
                                        "val": "The activity supports the maturation, validation, and risk reduction of battlefield interchangeability\/ compatibility and associated enabling technologies between domestic U.S. and the North Atlantic Treaty Organization (NATO)\/ Allied Nations indirect fires weapons and munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.505"
                                            },
                                            "Text": {
                                                "val": "FY 2019 continues ballistic testing including firing tables, safety, reliability, and performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.433"
                                            },
                                            "Text": {
                                                "val": "FY 2020 will continue interoperability testing and interchangeability group meetings."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.449"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.449"
                                            },
                                            "Text": {
                                                "val": "FY 2021 will continue interoperability testing and interchangeability group meetings."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decrease to Joint Ballistics Program support."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC  638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.034"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC  638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC  638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "F24"
                    },
                    "ProjectTitle": {
                        "val": "Conventional Munitions Demil"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.026"
                        },
                        "CurrentYear": {
                            "val": "24.644"
                        },
                        "BudgetYearOne": {
                            "val": "16.314"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.314"
                        },
                        "BudgetYearTwo": {
                            "val": "16.882"
                        },
                        "BudgetYearThree": {
                            "val": "16.68"
                        },
                        "BudgetYearFour": {
                            "val": "17.471"
                        },
                        "BudgetYearFive": {
                            "val": "17.648"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "125.665"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Conventional Munitions Demilitarization Technology Project supports the Single Manager for Conventional Ammunition (SMCA) responsibility per Department of Defense Instruction (DoDI) 5160.68 to plan, program, budget and fund a Joint Service research and development program that develops capability and capacity as well as technology and facilities to support the SMCA mission to demilitarize and dispose of conventional ammunition stored in the SMCA Resource, Recovery and Disposition Account (B5A). Project goals include SMCA efforts to increase efficiencies and effectiveness to reduce the demil stockpile; reduce processing costs including packaging, handling and crating; and increase capacity through improved demil capabilities and processes. Project F24 includes several activities: (1) to establish requirements and develop processes to focus investments, assess capabilities, analyze alternatives, and recommend and implement RDT&E projects; (2) to improve products and processes that support existing capabilities; (3) to develop or improve demil methods and processes related to advance the primary demilitarization core thrust areas of destruction, disassembly, removal, resource recovery and recycling, and waste stream treatment; (4) to ensure safe and environmentally acceptable demil operations; (5) to transition RDT&E products to United States Army depots or plants as well as commercial facilities performing demil; and (6) to mitigate risk and close-out Project activities.   \n\nDuring Fiscal Year (FY) 2021 Project F24 will focus efforts on fielding alternative capabilities to open burn and open detonation. In FY21 Project F24 will also conduct conventional ammunition demilitarization operational testing on a Castalia system."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Destruction"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on developing capabilities and capacities for the destruction of munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.001"
                                            },
                                            "Text": {
                                                "val": "Verified functionality of LEMC ARMD under FOC conditions. Completed MCDF FOC Transition. Conducted an operational demonstration of the Rockeye Download Equipment at CAAA. Completed Operational Demonstration of Rockeye download equipment. Completed testing on ARMD Multi Motor and Build fixturing to install at ARMD. Conducted safety and assessment effort on the obsolete Nike Herc Missile. Conducted Analysis of Alternatives and Talos Demil process."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.084"
                                            },
                                            "Text": {
                                                "val": "Will conduct operational testing of a static detonation chamber. Will conduct conventional ammunition operational testing on a Castalia System. Will conduct an operational test at MCAAP for Engine Starter Cartridges. Will conduct a static fire test of Nike Herc Missiles. Will conduct a safety and condition assessment on additional obsolete rocket motors"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.039"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.039"
                                            },
                                            "Text": {
                                                "val": "Conduct an operational test of a reactive armor tile demil oven.  Conduct operational testing of a capability to demil plastic walled shotgun cartridges.  Initiate a design for a capability to demilitarize Honest John Warheads."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease from FY 2020 to FY 2021 resulting from McAlester Cryofracture Demilitarization Facility (MCDF) transition occurring in FY 2020 and addressing new requirements in FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resource Recovery and Recycling (R3)"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on enhancing existing methods of munitions R3."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.212"
                                            },
                                            "Text": {
                                                "val": "Conducted testing to determine cleanliness of ammunition scrap on the Automated Scrap Inspection System at an organic depot location. Initiated a project for Improved Donor Recovery and conducted an operation test at MCAAAP.  Initiated a project on WDU25\/B Tomahawk Warheads to recover explosive for use a donor material."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.53"
                                            },
                                            "Text": {
                                                "val": "Will initiate fabrication of components for Automated Scrap Inspection System.  Will conduct an operational test on Red Phosphorus (RP) Mortar Demil Capability at Crane Army Ammunition Activity (CAAA)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.78"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.78"
                                            },
                                            "Text": {
                                                "val": "Conduct an operational test for Automated Scrap Inspection System comparing visual inspection to machine based inspection."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from FY 2020 to FY 2021 resulting addressing prove-out of Automated Scrap Inspection in FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Removal"
                                    },
                                    "Description": {
                                        "val": "This effort develops technology to remove propellant and energetics from munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.505"
                                            },
                                            "Text": {
                                                "val": "Conducted operational testing on IR Munitions Demil line at CAAA. Conducting Operational Testing of the 2.75-inch Rocket Demil Line at CAAA. Initiated design modifications and building fixturing to the RP demil line at CAAA to add RP Mortar Demil capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.887"
                                            },
                                            "Text": {
                                                "val": "Will transition an initial operational capability (IOC) for Infrared (IR) munitions at Crane Army Ammunition Activity (CAAA).  Will transition an IOC for 2.75? Rockets at CAAA.  Will initiate an Analysis of Alternative (AoA) for Insensitive Munitions (IM) Large Bombs.  Will conduct an AoA for IM Autoclave Upgrades."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.57"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.57"
                                            },
                                            "Text": {
                                                "val": "Complete installation of Shaped Charge Removal equipment to allow thermal treatment.  Fabricate components for the capability to demil 155mm Illumination Projectiles.  Complete transition of 2.75\" Rocket Motor Capability."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease from FY 2020 to FY 2021 resulting from 2.75? Rocket Static Fire Capability occurring in FY 2020 and addressing new requirements in FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Waste Stream Treatment"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on handling waste streams from munitions items."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.241"
                                            },
                                            "Text": {
                                                "val": "Initiated the building of the upgraded feed system on a rotary kiln incinerator at an organic location. Conducted an Analysis of Alternatives for a Bulk Energetics Confined Burn Capability located at Hawthorne Army Depot (HWAD).  Initiated Feed Recipe Efficiency Evaluation project.  Initiated an evaluation of Recovered Energetic Materials for use as donor material."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.533"
                                            },
                                            "Text": {
                                                "val": "Will initiate installation of upgraded feed system at an organic installation.  Will initiate a project to upgrade a RKI for CS gas treatment.  Will initiate a design for a Bulk Energetic Confined Burn System at an organic location."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.782"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.782"
                                            },
                                            "Text": {
                                                "val": "Initiate installation of the APE 1236 Feed System Upgrade at TEAD.  Complete Bangbox emissions testing of munitions to determine additional emission factors for stockpile munitions.  Conduct analysis of pyrotechnic munitions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease from FY20 to FY21 resulting from completing the Flare Simulator Demil capability and Feed Recipes Evaluation Efficiency transition occurring in FY20 and addressing new requirements in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Munitions Disassembly"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on developing innovative and efficient processes to disassemble munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.067"
                                            },
                                            "Text": {
                                                "val": "Initiated systemization of Family of Scatterable Mines (FASCAM) demil project to integrate the preprocessing Cryofracture capability of FASCAM mines with thermal processing in the rotary kiln at Crane Army Ammunition Activity (CAAA). Conducted operational demonstration of MK46 Torpedo Warhead segmenting capability at HWAD. Completed testing of capability developed to size reduce Reactive Armor Tiles. Completed testing on Thermal Treatment of Reactive Armor Tiles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.867"
                                            },
                                            "Text": {
                                                "val": "Will continue systemization of a Family of Scatterable Mines (FASCAM) demil project to integrate the preprocessing Cryofracture capability of FASCAM mines with thermal processing in the rotary kiln at Crane Army Ammunition Activity (CAAA).  Conduct an operational demonstration on 155mm APICM projectile download capability at HWAD."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.143"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.143"
                                            },
                                            "Text": {
                                                "val": "Complete Transition of a Reactive Armor Tile Size Reduction Capability.  Install and test a delinking and sorting capability for small arms cartridges to be fed into the APE 1236 RKI.  Conduct the Final design review of Smoke Hand Grenade Demil Capability."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease from FY20 to FY21 resulting from MK46 Torpedo Capability and Reactive Armor Tile Thermal Treatment operational testing occurring in FY20 and addressing new requirements in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY20 Congressional"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.851"
                                            },
                                            "Text": {
                                                "val": "Misalignment of Congressional funds. Will be realigned to the 859 program."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY20 Congressional mark was erroneously placed on F24.  The $5M should be on project 859."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC  638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.892"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC  638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC  638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}