{
    "id": "2021-DefenseLogisticsAgency-PB-0400-MJBOOK-0-4-7785e498f08da31904e836881ba7711c1e6b2127a147e20d7386b2865869377d-6",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-VOL5_ALL-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605502S"
        },
        "ProgramElementTitle": {
            "val": "Small Business Innovative Research (SBIR)"
        },
        "R1LineNumber": {
            "val": "166"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "39.228"
            },
            "PriorYear": {
                "val": "10.454"
            },
            "CurrentYear": {
                "val": "10.027"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Defense Logistics Agency’s (DLA's) ability to deliver Americans the right logistics solution in every transaction requires more than successful management of the Agency's wholesale supplies and suppliers.  It requires supply chain excellence.  Our military's ability to generate and sustain combat readiness indefinitely, anywhere on the globe requires that DLA-managed materiel flow seamlessly and as needed from the nation's industrial base to where it is ultimately used.\n\nDLA's Small Business Innovative Research (SBIR) program seeks to solicit innovative research and development proposals from the small business community to address DLA’s strategic and operational requirements.  All selections shall demonstrate and involve some technical risk with yet to be determined technical feasibility.  Phase I proposals should demonstrate the feasibility of the proposed technology and provide a strong business case for Phase II investment for a prototype or at least a proof-of-concept demonstration.  A favorable return on investment and commercialization potential have a strong influence on Phase II selections."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "10.454"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "10.454"
                },
                "CurrentYear": {
                    "val": "10.027"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "10.027"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "CurrentYear": {
                        "val": "10.027"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "FY2020 Small Business Innovation Research (SBIR) and Small Technology Transfer (STTR) taxes for DLA programs establish the baseline for this program element. DLA SBIR\/STTR taxes include $3.787 million.\nFY2020, in addition to the DLA portion, Defense Microelectronics Agency (DMEA) funds $6.241 million."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "SBIR"
                    },
                    "ProjectTitle": {
                        "val": "Small Business Innovative Research"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "39.228"
                        },
                        "PriorYear": {
                            "val": "10.454"
                        },
                        "CurrentYear": {
                            "val": "10.027"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program explores innovative concepts pursuant to Public Law 106-554 (Small Business Reauthorization Act of 2000) and Public Law 107-50 (Small Business Technology Transfer Program Reauthorization Act of 2001), which mandates a two-phase competition for small businesses with innovative technologies with a defense application as well as a commercial value.  The SBIR and Small Business Technology Transfer (STTR) programs will develop new dual-use technologies for possible future DLA operational and sustainment requirements.  Dual-use means the technologies will be judged on their potential for future private sector investment both as a vehicle for reducing development time and cost, unit costs of new DLA technologies, and as a route to national economic growth through new commercial products.  DLA will conduct the competition as well as award and manage the contracts.\n\nThe DLA's SBIR\/STTR investments are divided into multiple Research Areas identified from within several DLA Elements:\n\nJ6 R&D\n- Nuclear Enterprise Support Office (NESO) Alternative Sources of Supply\n- Additive Manufacturing Technologies, Process Controls, and Supply Chain\n- Seamless Self Sealing Fuel Bladders and Inflatables \n- Advanced Battery Manufacturing\n- Advanced Aircraft Braking Systems\n- Anti-Counterfeiting Technologies\n- Strategic Materials Rare Earth Element Source Development\n- Warehouse Modernization Technologies\n- Subsistence Supply Chain Solutions\n\nDMEA\n- Advanced microelectronics concepts, technologies, and applications"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SBIR Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.454"
                                            },
                                            "Text": {
                                                "val": "DLA SBIR\/STTR: Continue execution of all active Phase I and Phase II SBIR\/STTR Projects. Work with other R&D Programs and other divisions within DLA to identify requirements that meet DLA’s long and short term Strategic Objectives. Provide adequate guidance and mentorship to Phase II to projects to increase the likelihood of transition into government programs of record or commercial ventures.\n\nDMEA SBIR\/STTR: DMEA will continue to seek innovative technical solutions to DoD microelectronics research and development needs and increase private-sector commercialization of these innovations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.027"
                                            },
                                            "Text": {
                                                "val": "DLA SBIR\/STTR: \nContinue execution of all active Phase I and Phase II SBIR\/STTR Projects. \nWork with other R&D Programs and other divisions with DLA to identify requirements that meet DLA’s long and short term Strategic Objectives.  Provide adequate guidance and mentorship to Phase II to projects to increase the likelihood of transition into government programs of record or commercial ventures.\n\nDMEA SBIR\/STTR: \nDMEA will continue to seek innovative technical solutions to DoD microelectronics research and development needs and increase private-sector commercialization of these innovations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "DLA SBIR\/STTR: \nContinue execution of all active Phase I and Phase II SBIR\/STTR Projects.  Work with other R&D Programs and other divisions with DLA to identify requirements that meet DLA’s long and short term Strategic Objectives. Provide adequate guidance and mentorship to Phase II to projects to increase the likelihood of transition into government programs of record or commercial ventures.\n\nDMEA SBIR\/STTR: \nContinue to seek innovative technical solutions to DoD microelectronics research and development needs and increase private-sector commercialization of these innovations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "SBIR and STTR tax amounts are based on enacted budgets so FY2020 amounts have not been established."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "The SBIR acquisition process seeks to match projects with DLA’s Strategic Focus Areas.  The goal is to align SBIR\/STTR developed technology with current and future DLA requirements.  DLA solicits all new project execution work through the DoD SBIR Broad Agency Announcement (BAA).  There are three separate solicitation periods throughout each year.  (Jan-Feb, May-Jun, and Sep-Oct)"
                        }
                    }
                }
            ]
        }
    }
}