{
    "id": "2021-Navy-PB-1319-MJBOOK-0-0-744c7ee94c2cc798fbfd935e35baade9caa8a86b67e6f22ecedd75220314848f-0",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601103N"
        },
        "ProgramElementTitle": {
            "val": "University Research Initiatives"
        },
        "R1LineNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "155.539"
            },
            "CurrentYear": {
                "val": "167.850"
            },
            "BudgetYearOne": {
                "val": "116.816"
            },
            "BudgetYearOneBase": {
                "val": "116.816"
            },
            "BudgetYearTwo": {
                "val": "119.141"
            },
            "BudgetYearThree": {
                "val": "121.595"
            },
            "BudgetYearFour": {
                "val": "124.040"
            },
            "BudgetYearFive": {
                "val": "126.521"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Office of Naval Research's (ONR) mission is to ensure the technological advantage of U.S. Naval forces. ONR fosters scientific research necessary for the discovery, development and delivery of new technologies. Often this research is done in partnership with academia. Multidisciplinary University Research Initiative (MURI) efforts involve teams of researchers investigating high priority topics and opportunities that intersect more than one traditional technical discipline. This program includes support for multidisciplinary basic research in a wide range of naval relevant scientific and engineering disciplines that enables the U.S. Navy to maintain technological superiority and for the university research infrastructure to acquire the research instrumentation needed to maintain and improve the quality of university research important to the Navy. For many military problems this multidisciplinary approach serves to stimulate innovation, accelerate research progress and expedite transition of results into Naval applications. The Defense University Research Instrumentation Program (DURIP) supports university research infrastructure essential to high quality, Navy-relevant research. The instrumentation program complements other Navy research programs by supporting the purchase of high cost research instrumentation that is necessary to carry out cutting-edge research. The program supports Presidential Early Career Awards for Scientists and Engineers (PECASE), single investigator research efforts performed by outstanding academic scientists and engineers early in their research careers. This program provides the knowledge base, scientific concepts, and technological advances for the maintenance of Naval power and national security. The Minerva Research Initiative is funded in partnership with the Office of the Secretary of Defense to support basic social science and multi-disciplinary research aimed at improving national security and international stability. The goals of this program are to enhance connections between DoD and academia and build cultural and foreign area knowledge on topics ranging from the mechanisms of radicalization to geopolitical power projection strategies in a multi-polar world. \n\nToday's Sailors and Marines are enabled by naval Science and Technology (S&T). Since 1946, the Office of Naval Research (ONR) has fostered scientific research related to the maintenance of maritime superiority and national defense.  ONR manages the Department of the Navy's (DON) portfolio of naval Basic and Applied research, and Advanced Technology Development investments to ensure naval forces can effectively deter conflict, but when called upon, fight, win and come home safe. Current investments hedge against uncertainty, providing solutions to commanders today, and options for the future. The Naval S&T budget supports higher guidance defined by the National Defense Strategy, and responds to requirements identified by the Secretary of the Navy through research priorities set by the Chief of Naval Research, coordinated across the Naval Research Enterprise (NRE), and outlined in the Naval R&D Framework. \n\nThis Program Element (PE) funds Basic Research and systematic study directed toward greater knowledge or understanding of the fundamental aspects of phenomena and of observable facts without specific applications towards processes or products in mind. The work in this PE can be classified between Technology Readiness Level (TRL) 1 (basic principles observed and reported) and TRL 2 (technology concept and\/or application formulation).\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "161.433"
                },
                "CurrentYear": {
                    "val": "116.850"
                },
                "BudgetYearOne": {
                    "val": "116.816"
                },
                "BudgetYearOneBase": {
                    "val": "116.816"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "155.539"
                },
                "CurrentYear": {
                    "val": "167.850"
                },
                "BudgetYearOne": {
                    "val": "116.816"
                },
                "BudgetYearOneBase": {
                    "val": "116.816"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.894"
                },
                "CurrentYear": {
                    "val": "51.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "51.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-5.894"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: No significant change."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "University Research Initiatives"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "114.993"
                        },
                        "CurrentYear": {
                            "val": "116.850"
                        },
                        "BudgetYearOne": {
                            "val": "116.816"
                        },
                        "BudgetYearOneBase": {
                            "val": "116.816"
                        },
                        "BudgetYearTwo": {
                            "val": "119.141"
                        },
                        "BudgetYearThree": {
                            "val": "121.595"
                        },
                        "BudgetYearFour": {
                            "val": "124.040"
                        },
                        "BudgetYearFive": {
                            "val": "126.521"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Office of Naval Research's (ONR) mission is to ensure the technological advantage of U.S. Naval forces. ONR fosters scientific research necessary for the discovery, development and delivery of new technologies. Often this research is done in partnership with academia. Multidisciplinary University Research Initiative (MURI) efforts involve teams of researchers investigating high priority topics and opportunities that intersect more than one traditional technical discipline. This program includes support for multidisciplinary basic research in a wide range of naval relevant scientific and engineering disciplines that enables the U.S. Navy to maintain technological superiority and for the university research infrastructure to acquire the research instrumentation needed to maintain and improve the quality of university research important to the Navy. For many military problems, this multidisciplinary approach serves to stimulate innovation, accelerate research progress, and expedite transition of results into Naval applications. The DURIP project supports university research infrastructure essential to high quality, Navy-relevant research. The instrumentation project complements other Navy research programs by supporting the purchase of high cost research\ninstrumentation that is necessary to carry out cutting-edge research. The PECASE project supports single-investigator research efforts performed by outstanding academic scientists and engineers early in their research careers. This project provides the knowledge base, scientific concepts, and technological advances for the maintenance of Naval power and national security."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense University Research Instrumentation Program (DURIP)"
                                    },
                                    "Description": {
                                        "val": "DURIP funds are awarded to universities to purchase relatively high cost research instrumentation that is normally not included in single-investigator research grants. Individual grants range from $50K to $1.5M. Funding for DURIP efforts is awarded after the Office of the Secretary of Defense (OSD) selects and announces the awardees, which typically takes place towards the second half of the fiscal year. In turn, universities need to purchase the instrumentation and take delivery before any billing occurs. It frequently takes several months for delivery and billing to be completed. DURIP is a one-year program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.374"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.266"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide funding for instrumentation to enhance basic research, such as: human-machine interfaces, basic research on communications and networks, basic research on power generation and storage, basic research on high-performance materials, and basic research in the ocean sciences and underwater acoustics. Implement the instrumentation investments made for research efforts, such as: transmission electron microscopy, infrared optoelectronic measurements, an underwater acoustic communication system, basic thermal property measurements, cardiorespiratory physiology phenotyping, and high-speed stereographic imaging for multiphase flows."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.272"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.272"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Research Instrumentation: Funding for instrumentation to enhance basic research through numerous focus areas including photonic diagnostics for the development of advanced materials, high fidelity laser profiling of biologically active sediments for seabed models, instrumentation for studies of high Reynolds Number non-equilibrium flows, a dynamic material testing system for characterizing, investigating and designing artificial muscle, and instrumentation for the development and characterization of solid propulsion, among many others."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2020 to FY 2021"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multidisciplinary University Research Intiiative  (MURI)"
                                    },
                                    "Description": {
                                        "val": "Research efforts include high priority topics that intersect more than one traditional discipline. MURI topics are selected to address Naval Science and Technology (S&T) Framework Priorities as described in the Naval Research and Development Framework. Funding for MURI efforts is awarded after Office of the Secretary of Defense (OSD) announces the awardees, which typically takes place towards the second half of the fiscal year. Since the MURI program funds academic researchers, execution of the efforts typically ramp up during the summer months. MURI projects make significant contributions to Navy and Department of Defense (DOD) objectives by speeding up scientific programs, by cross-fertilization of ideas, by hastening the transition of basic research to practical applications, and by training students in cross-disciplinary approaches to science and engineering research of importance to DoD. MURI projects are five-year programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "83.363"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "84.823"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The MURI program will support multidisciplinary basic research topics, such as: the role of epigenetics in human performance, research on understanding scenes and events through joint parsing, cognitive reasoning and lifelong learning, research on bio-inspired adaptive sonar for classification and guidance in complex environments, research on neural circuits underlying symbolic processing in primate cortex and basal ganglia, and research on chemistry and physics at extreme temperature and pressure: molecules, crystals and microstructures.  These investigations support high\npriority topics and scientific opportunities to address strategically important Department of Defense (DoD) research areas that intersect more than one traditional technical discipline."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "81.827"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "81.827"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Multidisciplinary Research: Initiate multidisciplinary basic research efforts on the fundamental limits on information latency, advanced analytical and computational modeling of arctic sea ice, molecularly programmable graphene, identifying invariances for improved modeling and prediction of oceanographic phenomena, high performance organic electronics, bio-inspired models of distributed information processing, active perception and knowledge exploitation in navigation and spatial awareness, the advanced dynamics of coupled human\/machine systems.  \n\t\n- Fund previous years basic research efforts in other high priority topics for the Navy and DoD."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2020 to FY 2021 is due to funds being realigned from this R2 Activity to the new Minerva Research Initiative R2 Activity. Minerva Research Initiative efforts have been funded since 2010 and were previously included in the MURI R2 Activity of this PE. In an effort to increase visibility and improve tracking, funds have been realgned into the new R2 Activity."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Presidential Early Career Awards (PECASE)"
                                    },
                                    "Description": {
                                        "val": "PECASE awards are made to academic scientists early in their research careers for extremely prestigious, single-investigator research in areas of vital importance to the Navy. Awards provide national recognition and research grants of up to $200K per year for five years. OSD, with policy and oversight responsibility for the PECASE program, awards a minimum of four new awards per year. PECASE is a five year program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.256"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.761"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The program will support early career investigators in research areas within the Navy Research and Development (R&D) framework priority objectives, such as: the design of an end-to-end protocol for dynamic spectrum access networks; the determination of multiscale interactions in tropical cyclone structure and intensity changes; the engineering of nonreciprocal acoustic materials and microwave systems through phonon-assisted directional coupling; and the development of therapeutic hydrogel sensors for the monitoring and treatment of wounds, among others."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.764"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.764"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Fund new basic research projects in Naval priority areas including efficient information processing, layered chalcogenide heterointerfaces, information retrieval by exploiting the unique geometry of sparse arrays, and the prediction, design and control the assembly of hierarchically mesostructured materials. \n\n- Support previous year ongoing basic research projects performed by early career investigators."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2020 to FY 2021"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Minerva Research Initiative (MRI) (Social Science Networking)"
                                    },
                                    "Description": {
                                        "val": "The Minerva Research Initiative is funded in partnership with the Office of the Secretary of Defense to support basic social science and multi-disciplinary research aimed at improving national security and international stability. The goals of this program are to enhance connections between DoD and academia and build cultural and foreign area knowledge on topics ranging from the mechanisms of radicalization to geopolitical power projection strategies in a multi-polar world."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.953"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.953"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Create and implement a theoretical framework to automate cyber vulnerability assessment and remediation for information operations in social contexts, for example, the injection of disinformation into social networks to influence the political attitudes or those exposed to it. Investigate models and methods for understanding online influence."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2020 to FY 2021 is due to funds being moved from the MURI R2 Activity to this new Minerva Research Initiative (MRI) R2 Activity. MRI efforts have been funded in the MURI R2 Activity of this PE since 2010. In an effort to increase visibility and improve tracking, funds have been realigned from the MURI R2 Activity into this new R2 Activity."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "40.546"
                        },
                        "CurrentYear": {
                            "val": "51.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "91.546"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Defense University Research Instrumentation Program"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "9.654"
                                        },
                                        "Text": {
                                            "val": "This increase will provide additional Defense University Research Instrumentation Program (DURIP) awards to enable performers to take advantage of the evolving technological advances in scientific instrumentation to study the physical, chemical, biological, geological and geophysical processes of the oceans. The global ocean environment is the primary Navy-relevant operational environment and ocean research requires specialized sea-going marine equipment."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Provide additional Defense University Research Instrumentation Program (DURIP) awards to enable performers to take advantage of the evolving technological advances in scientific instrumentation to study the physical, chemical, biological, geological and geophysical processes of the oceans."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radar Technology"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5.792"
                                        },
                                        "Text": {
                                            "val": "Conduct efforts for the design, construction and testing of a mobile, ground-based, active aperture array (active electronically scanned antenna - AESA) utilizing cutting-edge science and technology for critical aperture components (receiver and transmitter)."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biocoherent Energy"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5.792"
                                        },
                                        "Text": {
                                            "val": "Basic science research to identify mechanisms to enhance coherent energy transfer between photoactive molecules attached to nucleic acid nanostructures for application to synthetic light harvesting systems, optoelectronic devices, information processing systems, and possibly quantum computing.  \n- AIM 1:  Conduct and develop computational and experimental approaches to identify the best structures of photoactive molecules and their nucleic acid nanostructures that can efficiently transfer energy coherently.  \n- AIM2:  Assemble the superior photoactive molecules into structures using nucleic acid self-assembly and assess performance."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Basic Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "9.654"
                                        },
                                        "Text": {
                                            "val": "This increase furthers the U. S. Navy's efforts to support multidisciplinary basic research in a wide range of scientific and engineering disciplines that enable the U.S. Navy to maintain its technological superiority. This increase will fund additional Multidisciplinary University Research Initiative (MURI) awards and Presidential Early Career Awards for Scientists and Engineers (PECASE). Additional new MURI topics will address the most critical Naval R&D priorities to translate future force attributes into research objectives. Additional outstanding young scientists and engineers will be funded under PECASE to address the continued need for scientists and engineers to address future Naval problems. These research objectives include improving human-machine interfaces, increasing the flexibility and reach of the naval force through the incorporation of autonomous systems, enabling maneuverability, efficiency and resiliency for sustained operations, transforming vast data into timely knowledge; and enabling offensive and defensive actions that are multi-domain, integrated, and cost-effective."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft Fleet Readiness and Sustainment"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "9.654"
                                        },
                                        "Text": {
                                            "val": "Basic research focus on advanced laboratory equipment and capabilities in support of Aviation Structures."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8.000"
                                        },
                                        "Text": {
                                            "val": "Continue basic research for focus on advanced laboratory equipment and capabilities in support of Aviation Structures."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "University research initiatives"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "20.000"
                                        },
                                        "Text": {
                                            "val": "Conduct University basic research initiatives"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced digital radars"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8.000"
                                        },
                                        "Text": {
                                            "val": "Conduct basic research supporting Advanced digital radars."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-disciplinary university research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conduct Multi-disciplinary university research."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}