{
    "id": "2021-AirForce-PB-3600-MJBOOK-3-0-4ccc939241b47239c36ee98d5519ce37a7e18b46d494a025321d2035cb3d38d7-9",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-AIRFORCE_V3B-U_RDTE_MasterJustificationBook_Air_Force_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0304115F"
        },
        "ProgramElementTitle": {
            "val": "Multi Domain Command and Control (MDC2)"
        },
        "R1LineNumber": {
            "val": "245"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "100.880"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "150.880"
                },
                "BudgetYearOne": {
                    "val": "106.400"
                },
                "BudgetYearOneBase": {
                    "val": "106.400"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "100.880"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "-50.000"
                },
                "BudgetYearOne": {
                    "val": "-106.400"
                },
                "BudgetYearOneBase": {
                    "val": "-106.400"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-50.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-106.400"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-106.400"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Effort continues execution under PE 0604003F BA 04 BPAC 640141 beginning in FY21."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "673380"
                    },
                    "ProjectTitle": {
                        "val": "Multi Domain Command and Control (MDC2)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "100.880"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY21, PE 0304115, Multi Domain Command and Control RDT&E funds were transferred to PE 0604003F BA 04, (BPAC 640141) Advanced Battle Management System in order to provide consolidation of multi domain efforts and to provide greater clarity and transparency."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Advanced Battle Management System (ABMS) portfolio develops the digital infrastructure and tools required for the joint force to provide operationally relevant and fieldable capabilities in support of the National Defense Strategy (NDS). ABMS addresses gaps in interoperability and information sharing for air, land, sea, space, and cyberspace domains. The ABMS lines of effort accelerate the development, integration, transition, and fielding of technologies that enable Joint All-Domain Command and Control.\n\nABMS investments are divided into seven categories of activities.\n\nDigital Architectures, Standards, and Concept Development: This includes digital engineering and analysis, model-based systems engineering, and related analyses and exploration in support of potential investments in the other six categories.\n\nSensor Integration: This includes the development, test, and integration of open architecture sensor system. These systems will be based on government-owned standards and provide open and reusable capabilities, initially focused on air and ground moving target indication (AMTI, GMTI).\n\nMulti-Domain Data Management: This includes cloud-based data libraries, data feeds, data wrappers, and data management to improve data discoverability and information sharing across the joint force. \n\nMulti-Domain Secure Processing: This includes hardware and software for multi-level security as well as edge hardware to enable a full range of military operations.\n\nMulti-Domain Connectivity: This includes maturation and integration of open software-defined radios and networks, government-owned waveform libraries, and wideband multi-function RF systems. This category also includes the integration and standards required to leverage advances in commercial technology such as 5G networks and proliferated low-earth orbit satellite communications. \n\nMulti-Domain Applications: This includes cloud-based applications to process sensor data, fuse sensor data from multiple platforms across different domains, combine data into a common multi-domain operating picture, and provide battle management, command, and control (BMC2) functionality.\n\nEffects Integration: This includes development and integration of open smart munitions that enable dynamic kill webs, attritable aircraft that generate combat mass and distributed effects, and real-time updates to mission data files to improve electronic warfare system performance. \n\nThe ABMS approach is not a traditional systems acquisition. Instead of acquisition of platforms, ABMS is moving to acquisition of capabilities that are open, available, deployable, and reconfigurable for installation on or use by multiple systems across multiple domains. These capabilities increase the effectiveness and survivability of Air Force, joint, and coalition partners across permissive and contested environments, in all warfighting domains, and at multiple classification levels. ABMS will leverage existing and emerging technology with emphasis on commercial technology and those at technology readiness levels that will enable rapid transition. The innovations from ABMS will augment new and ongoing initiatives aligned with service multi-domain operational priorities. \n\nABMS funding provides for operational concept development and demonstration, hardware development and integration, and software development and integration. The funding will also enable the limited transition of mature and ready capabilities to appropriate programs of record in synchronization with planned modernization activities. \n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver JADC2 capabilities. The use of such program funds would be in additional to the civilian pay expenses budgeted in program element 0605831F.\n\n\nThis is not a new start.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Battle Management System"
                                    },
                                    "Description": {
                                        "val": "ABMS leverages and complements ongoing efforts and emerging technologies across services, agencies, laboratories, and industry partners. The hardware development approach is based on continuous integration and delivery of incremental capability improvement over time, with emphasis on open and modular systems that can be rapidly transitioned and widely deployed. Software will be deployed using a development\/security\/operations (DevSecOps) approach with multiple partners. Key points of emphasis include open and reusable software, cloud deployments for scaling and data management, and cyber resiliency. The DevSecOps approach directed by DoD facilitates integration efforts by traditional and non-traditional software providers, with or without prime contractor involvement.\n\nABMS executes onramp events with a COCOM sponsor every four months. These events show proposed technical solutions across the ABMS product lines, demonstrate capabilities being developed in an operationally-relevant scenario, and have the potential to generate leave-behind capabilities if requested. The participating platforms and COCOMs will vary from event to event. Capabilities developed in the ABMS portfolio will be presented at onramp events as they become ready for demonstration, with multiple capabilities being demonstrated at each event. Each event informs the next development sprint as well as future events while also reducing technology risk. This approach also facilitates rapid integration by making the technology visible and performing initial operationally-relevant testing for a broad COCOM audience. Specific event costs are contained in the JADC2 PE 3040115F (BPAC 673380), formerly known as MDC2, while development costs are contained in the ABMS PE."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "100.880"
                                            },
                                            "Text": {
                                                "val": "Develop airborne gateway technology for rapid connection and information sharing between existing platforms. The first successful demonstration of communications between F-22 and F-35 using gateways was in December 2019. Test new sensor mesh networks including connection to proliferated low-earth orbit (LEO) commercial satellite communications. The first successful demonstration of this multi-domain mesh network was in December 2019. Additional hardware-related activities in FY 2020 include design of a radar testbed, continued capability improvements to gateways, test of a multi-level secure tablet, continued capability improvements to sensor mesh networks, and initial development of advanced radios and apertures. \n\nDevelop cloud-based tools for processing of sensor data, fusion of data across platforms and domains, combining data into a multi-domain common operating pictures, and battle management, command, and control (BMC2). The first successful demonstration of this software suite was in December 2019. Additional software-related activities in FY 2020 include creation of a radar mode library, waveform upgrades to gateways, and initial tests of software tools and cloud access on a multi-level secure tablet.\n\nThe first on ramp event was held in December 2019 at Eglin AFB and was led by NORAD and USNORTHCOM. This ABMS onramp included Air Force, Army, and Navy system with key first in the areas of connectivity between platforms, mesh networking, and cloud-based battle management. The next FY2020 events will be held in April 2020 and August 2020."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "See PE 0604003F BA 04 BPAC 640141 for FY21 changes."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "See PE 0604003F BA 04 BPAC 640141 for FY21 changes."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE 04 0604003F"
                                    },
                                    "Title": {
                                        "val": "Advanced Battle Management System (ABMS)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "8.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "302.323"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "302.323"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "449.290"
                                        },
                                        "BudgetYearThree": {
                                            "val": "590.878"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1087.601"
                                        },
                                        "BudgetYearFive": {
                                            "val": "832.229"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE 07 0604003F"
                                    },
                                    "Title": {
                                        "val": "Advanced Battle Management System (ABMS)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "30.000"
                                        },
                                        "CurrentYear": {
                                            "val": "35.600"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "65.600"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "ABMS will provide capability through existing program office, program executive officers, service labs, services or agencies, programs of record, and their respective contracts and agreements. ABMS is not a single program of record. Many lines of effort will be horizontally integrated by the USAF Chief Architect and partner organizations. Program execution (cost, schedule, and performance) will be managed by the Chief Architect Integration Office and the appropriate program office."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "ABMS HW, SW, and On Ramps"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "100.880"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "ABMS"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "ABMS HW, SW, On Ramps"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}