{
    "id": "2021-Army-PB-2040-JBOOK-8f7fdbb59cb85b132b0478715b87ff02c7eb359f73f79d73e48c9151ed5a28f2-6",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603007A"
        },
        "ProgramElementTitle": {
            "val": "Manpower, Personnel and Training Advanced Technology"
        },
        "R1LineNumber": {
            "val": "49"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "6.27"
            },
            "CurrentYear": {
                "val": "11.038"
            },
            "BudgetYearOne": {
                "val": "11.659"
            },
            "BudgetYearOneBase": {
                "val": "11.659"
            },
            "BudgetYearTwo": {
                "val": "14.919"
            },
            "BudgetYearThree": {
                "val": "15.908"
            },
            "BudgetYearFour": {
                "val": "17.039"
            },
            "BudgetYearFive": {
                "val": "18.701"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "95.534"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures and validates applied behavioral and social science technologies that enhance the Soldier Lifecycle (e.g., selection, assignment, training, leader development) and human relations (e.g. unit cohesion). These technologies provide advanced personnel measures that more fully assess potential and predict performance, behavior, attitudes, and resilience. These technologies also provide innovative and effective Talent Management methods to optimize individual and team performance to ensure the Army can meet mission requirements in uncertain and complex environments. This PE evaluates new selection measures, assignment methods, and performance metrics for individuals and units, assesses innovative training methods, and conducts scientific assessments to inform Human Capital policy and programs. Work in this PE will result in effective non-materiel solutions to help the Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints.\n\nWork in this PE complements and is fully coordinated with PE 0602785A (Manpower\/Personnel\/Training Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, the Army Vision, the Army's Talent Management Strategy, and the Army Modernization Strategy\n\nWork in this PE is performed by the United States Army Research Institute (ARI) for the Behavioral and Social Sciences in Ft. Belvoir, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "8.038"
                },
                "CurrentYear": {
                    "val": "11.038"
                },
                "BudgetYearOne": {
                    "val": "11.189"
                },
                "BudgetYearOneBase": {
                    "val": "11.189"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.27"
                },
                "CurrentYear": {
                    "val": "11.038"
                },
                "BudgetYearOne": {
                    "val": "11.659"
                },
                "BudgetYearOneBase": {
                    "val": "11.659"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.768"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0.47"
                },
                "BudgetYearOneBase": {
                    "val": "0.47"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.567"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.201"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.47"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.47"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY19 decrease related to funds reprogrammed out for higher priority Army requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "792"
                    },
                    "ProjectTitle": {
                        "val": "Personnel Performance & Training"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.27"
                        },
                        "CurrentYear": {
                            "val": "11.038"
                        },
                        "BudgetYearOne": {
                            "val": "11.659"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.659"
                        },
                        "BudgetYearTwo": {
                            "val": "14.919"
                        },
                        "BudgetYearThree": {
                            "val": "15.908"
                        },
                        "BudgetYearFour": {
                            "val": "17.039"
                        },
                        "BudgetYearFive": {
                            "val": "18.701"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "95.534"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and evaluates applied behavioral and social science technologies that enhance the Soldier Lifecycle (e.g., selection, assignment, training, leader development) and human relations (e.g., unit cohesion). These technologies provide advanced personnel measures that more fully assess potential and predict performance, behavior, attitudes, and resilience. These technologies also provide innovative and effective Talent Management methods to optimize individual and team performance to ensure the Army can meet mission requirements in uncertain and complex environments. This PE evaluates new selection measures, assignment methods, and performance metrics for individuals and units; assesses innovative leader development and learning methods, and conducts scientific assessments to inform Human Capital policy and programs. Research in this PE will result in effective non-materiel solutions to help the Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints.\n\nWork in this Project complements PE 0602785A (Personnel Performance & Training Technology)\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas, the Army Strategy, the Army's Talent Management Strategy, and the Army Modernization Strategy.\n\nWork is performed by the United States Army Research Institute (ARI) for the Behavioral and Social Sciences in Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Talent Assessment and Development"
                                    },
                                    "Description": {
                                        "val": "This effort refines and assesses innovative talent management approaches to provide the Army the flexibility to adapt to changes in force structure and recruiting environments. This effort evaluates Soldier selection measures, techniques, and tools to more fully assess Soldier potential and better predict behavior, attrition, Soldier performance, and team effectiveness. This effort also matures and evaluates methods to develop and model Soldier talents\/competencies longitudinally across a career."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.885"
                                            },
                                            "Text": {
                                                "val": "Demonstrated differential prediction of cognitive and non-cognitive abilities among Military Occupational Specialty clusters for incorporation into the assignment process to support forecasting of future talent management and human performance needs in near-peer operational environments; conducted research to assess validity of integrated personnel models augmented with archival human capital data; conducted research to empirically validate instructional approaches to prepare instructors\/trainers to train complex skills required for emerging high-tempo operational environments that necessitate decisive and timely decision making (e.g., dense urban and distributed units)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.667"
                                            },
                                            "Text": {
                                                "val": "Validating expanded screening tools to more comprehensively identify high-potential and high-risk individuals; validating Leader and advisor competency-assessment methods; conducting research to develop methods to rapidly generate test content for knowledge tests; conducting research to validate assessments to predict effective teamwork behaviors and performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.659"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.659"
                                            },
                                            "Text": {
                                                "val": "Will conduct research to validate personnel assessment measures to improve selection and assignment; will conduct research to mature and validate methods to develop critical leader competencies for Non-Commissioned Officer (NCOs); will conduct research to demonstrate psychometric validity of small unit performance measurement tools."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unit Performance and Cohesion"
                                    },
                                    "Description": {
                                        "val": "This effort will mature and refine measures and methods to ensure cohesive, high performing teams for future operational environments. This effort will also mature and assess to optimize team composition to enhance unit performance; methods to rapidly build and sustain team cohesion; and metrics and assessments of unit performance, command climate, unit resilience, and cohesion."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.385"
                                            },
                                            "Text": {
                                                "val": "Refined measures of collective performance in combat training exercises."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.371"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}