{
    "id": "2021-Army-PB-2040-JBOOK-24fcf105afc7c7d31f1382e71fbd0800d20c4793885e75717bfd3bc5bfb4138f-18",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA7-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0203728A"
        },
        "ProgramElementTitle": {
            "val": "Joint Automated Deep Operation Coordination System (JADOCS)"
        },
        "R1LineNumber": {
            "val": "232"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "29.782"
            },
            "CurrentYear": {
                "val": "47.398"
            },
            "BudgetYearOne": {
                "val": "44.691"
            },
            "BudgetYearOneBase": {
                "val": "44.691"
            },
            "BudgetYearTwo": {
                "val": "26.114"
            },
            "BudgetYearThree": {
                "val": "18.890"
            },
            "BudgetYearFour": {
                "val": "4.800"
            },
            "BudgetYearFive": {
                "val": "4.073"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "175.748"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Fire Support Command & Control (FSC2) funding line supports the Long Range Precision Fires (LRPF) Cross Functional Team (CFT), the #1 priority in the Army Modernization Strategy and the Common Operating Environment (COE). Efforts are aligned to support the Network-CFT capability set approach.  \n\nFSC2 supports the development of Advanced Field Artillery Tactical Data System (AFATDS), LRPF CFT, Extended Range Canon Artillery (ERCA), Extended Range Guided Multiple Launch Rocket System (ER-GMLRS), Precision Strike Missile System (PRSM) initiatives. In order to support these initiatives, AFATDS will serve as the key sensor to shooter link for the Army and USMC providing fully automated support for planning, coordinating, controlling and executing fires and effects. AFATDS also began supporting Long Range Hypersonic Weapons (LRHW) in FY 2020. Fire Support Command and Control (FSC2) systems automate the planning and execution of fire support operations so that a suitable weapon or group of weapons adequately cover targets. Fire support is the effect of lethal and non-lethal weapons (fires) that directly support land, maritime, amphibious and special operation forces to engage enemy forces, combat formations, and facilities in pursuit of tactical and operational objectives. FSC2 family consists of Advanced Field Artillery Tactical Data System (AFATDS), Joint Automated Deep Operations Coordination System (JADOCS), and Precision Fires Dismounted and Mounted (PF-D\/M), formerly known as Pocket-sized Forward Entry Device (PFED).\n\nThe Advanced Field Artillery Tactical Data System (AFATDS) provides the Army, Navy, and Marine Corps automated fire support command, control and communications. AFATDS is used to plan, execute, and deliver lethal and non-lethal effects. AFATDS provides Joint\/Coalition Situational Awareness for fires execution and mission management. The system interoperates and integrates with over 80 different battlefield systems, including Navy and Air Force command and control weapons systems. As a member of the Artillery System Cooperation Agreement (ASCA), AFATDS is interoperable with coalition partner fire support systems. AFATDS automates the planning, coordination, and control of all fire support assets (field artillery, mortars, close air support, naval gunfire, attack helicopters, offensive electronic warfare, fire support meteorological systems, forward observers, and fire support radars). AFATDS 7.0 modernizes the existing AFATDS software currently in the field. AFATDS 7.0 enhances the existing AFATDS baseline by: (1) Providing a modernized web service based backend that will simplify long-term maintenance of the software, (2) Bringing AFATDS into full compliance with the Army's COE, Command Post Computing Environment (CPCE) initiative,  and (3) Enhancing overall usability of the system through the implementation of a role-based capability architecture with embedded training that allows the AFATDS operator to receive on-the-spot training for any aspect of AFATDS via interactive instruction. \n\nPrecision Fires Dismounted and Mounted (PF-D\/M), is a software application that operates on the Nett Warrior End User Device (EUD). It will provide the dismounted Forward Observer (FO) and Fire Support Teams (FISTs) the capability and functionality to accurately and rapidly locate ground targets and digitally process a Call for Fire. PF-D answers the Mobile Handheld Computing Environment requirement that all handheld applications reside on the Nett Warrior EUD. PF-M answers the mounted computing environment requirement and will reside on Mounted Family of Computer Systems (MFoCS) computers."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "30.915"
                },
                "CurrentYear": {
                    "val": "47.398"
                },
                "BudgetYearOne": {
                    "val": "34.289"
                },
                "BudgetYearOneBase": {
                    "val": "34.289"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "29.782"
                },
                "CurrentYear": {
                    "val": "47.398"
                },
                "BudgetYearOne": {
                    "val": "44.691"
                },
                "BudgetYearOneBase": {
                    "val": "44.691"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.133"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "10.402"
                },
                "BudgetYearOneBase": {
                    "val": "10.402"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.133"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "10.402"
                                },
                                "BudgetYearOneBase": {
                                    "val": "10.402"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2021 Base appropriation was increased by $10.4 million to fund AFATDS 7.0 development for Common Operating Environment (COE) compliance."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EF7"
                    },
                    "ProjectTitle": {
                        "val": "Precision Fires Warrior Dismounted & Mounted"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.493"
                        },
                        "CurrentYear": {
                            "val": "3.5"
                        },
                        "BudgetYearOne": {
                            "val": "3.32"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.32"
                        },
                        "BudgetYearTwo": {
                            "val": "3.312"
                        },
                        "BudgetYearThree": {
                            "val": "3.307"
                        },
                        "BudgetYearFour": {
                            "val": "3.305"
                        },
                        "BudgetYearFive": {
                            "val": "2.692"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "22.929"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "PF-D\/M, formerly known as Pocket-sized Forward Entry Device (PFED) Increment II is a software application that operates on the Nett Warrior (NW) End User Device (EUD). It will provide the dismounted Forward Observer (FO) and Fire Support Teams (FISTs) the capability and functionality to accurately and rapidly locate ground targets and digitally process a Call For Fire. PF-D answers the Mobile Handheld Computing Environment requirement that all handheld applications reside on the NW EUD. PF-M answers the mounted computing environment requirement and will reside on Mounted Family of Computer Systems (MFoCS). \n\nFY 2021 funding of $3.320 million is to complete development, testing of Block 2 capabilities and continue hardware\/software integration with NW EUD.  Begin the development of Block 3 capabilities with MFoCS vehicle integration."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Management Support Costs for PF-D\/M"
                                    },
                                    "Description": {
                                        "val": "Program support for PF-D\/M software development efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.39"
                                            },
                                            "Text": {
                                                "val": "- Successful Program Design Review for Block 2 capabilities.  \n- Successful introduction of the reengineered modem (ULTRALINK), a significant cost savings to the TACLINK.  \n- Implementation of embedded manuals as an application on End User Devices.  \n- Updated the SSS to eliminate redundant capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.438"
                                            },
                                            "Text": {
                                                "val": "Will provide Program Management Office (PMO) support ( Matrix, and SETA) for all aspects of the PF-D\/M program including requirements development, software development efforts, logistics, and business management support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.411"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.411"
                                            },
                                            "Text": {
                                                "val": "Will provide Program Management Office (PMO) support ( Matrix, and SETA) for all aspects of the PF-D\/M program including requirements development, software development efforts, logistics, and business management support."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to sharing of PMMC division assets for IA efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PF-D\/M Software Development"
                                    },
                                    "Description": {
                                        "val": "PF-D\/M Software Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.853"
                                            },
                                            "Text": {
                                                "val": "- Successful Program Design Review for Block 2 capabilities.  \n- Successful introduction of the reengineered modem (ULTRALINK), a significant cost savings to the TACLINK.  \n- Implementation of embedded manuals as an application on End User Devices.  \n- Updated the SSS to eliminate redundant capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.895"
                                            },
                                            "Text": {
                                                "val": "Will continue development and testing of Block 2 capabilities. Complete hardware\/software integration with Nett Warrior EUD and MFOCS. Complete software Information Assurance certification."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.742"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.742"
                                            },
                                            "Text": {
                                                "val": "Will complete development and testing of Block 2 capabilities. Complete HW and SW integrating with NW EUD.  Begin the development of block 3 capabilities  with vehicle integration onto MFoCS."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Software development costs reduced."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Testing for PF-D\/M"
                                    },
                                    "Description": {
                                        "val": "Conduct and Support Army Testing Activities for PF-D\/M"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.25"
                                            },
                                            "Text": {
                                                "val": "Prepared and executed Engineering Release Evaluation\/Testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.167"
                                            },
                                            "Text": {
                                                "val": "Continue to prepare and execute Engineering Release Evaluation\/Testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.167"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.167"
                                            },
                                            "Text": {
                                                "val": "DT\/OT and AIC testing."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BZ9851"
                                    },
                                    "Title": {
                                        "val": "POCKET FORWARD ENTRY DEVICE (PFED)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.644"
                                        },
                                        "CurrentYear": {
                                            "val": "8.62"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.896"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.896"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.897"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.098"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.198"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2.297"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "On 18 May 2015, the Milestone Decision Authority (PEO C3T) signed the Acquisition Decision Memorandum (ADM) approving the PFED Increment II Milestone B. The ADM officially approved entry into the Development phase as an Acquisition Category (ACAT) III program. The system received a Limited Deployment Decision in Jan 2017, to enter into operational test and in Jan 2018 received Full Deployment Decision for Block 1 and Full Material Release.\n\nPF-D\/M leverages an Army Science and Technology investment by transitioning a software application that has been developed and used in proponent experimentation events (e.g. Army Expeditionary Warrior Experiment (AEWE) and Bold Quest). Upon a successful Milestone B decision in FY15, this software application transitioned to PM Mission Command (PMMC) to conduct all Army developmental and operational test and evaluation requirements. PF-D\/M will be integrated onto the Nett Warrior (NW) End User Devices (EUDs) and will be fielded by PM Soldier Warrior (PM SWAR). Training on the PF-D\/M software will be conducted by PMMC as units are fielded the capability. PF-M will be developed on the MCE baseline and co-hosted on the Military Family of Computer Systems (MFoCS).\n\nPF-D\/M is developed using a block approach where capability is incrementally added to the overall baseline over the course of four blocks. PF-D\/M Block 2 focuses on transitioning from a standalone Android application to a plugin on the ATAK architecture.  Capabilities include Sensor Interoperability, Digital Precision Strike Suite, and Digitally Aided Close Air Support over the Link 16 network.  PF-D\/M Block 3 focuses on the transition to the mounted environment.  This will move the PF-D Block 2 baseline onto the MFoCS, which is a complete replacement for the LFED\/FOS and offers enhanced interoperability to Fire Support Sensors mounted on the platform and offer capabilities of interacting with Net-Enabled munitions.  PF-D\/M Block IV will be determined by the FCoE Governance Board under the IT Box policy."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support for PF-D\/M (CORE)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Sub Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM Mission Command (MC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.1"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.100"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Support for PF-D\/M (Matrix)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "IA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various Mix Orgs (Govt)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.301"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.19"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.226"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.226"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.226"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.943"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Support for PF-D\/M (SETA)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CRSA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.45"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.2"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.212"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.862"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Support for PF-D\/M (SETA)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CACI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.185"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.185"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.185"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PF-D\/M Software Development efforts"
                                                },
                                                "FundingVehicle": {
                                                    "val": "IA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AMRDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.448"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.853"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.895"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PF-D\/M Software Development efforts"
                                                },
                                                "FundingVehicle": {
                                                    "val": "IA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DOTC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Piccatinny, NJ"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.742"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.742"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.742"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM Mission Command (MC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.517"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test Support (Engineering Release)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Testing"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.156"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.25"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.167"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.167"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.167"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "7_EF7_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Milestone B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Initial Operational Capability (IOC) Block 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Software Development Block 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LDD Block 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Software Development Block 3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OT&E Block 3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FDD Block 3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Limited Deployment Decision (LDD) Block 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OT&E Block 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Deployment Decision (FDD) Block 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Build Decision (BD) Block 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OT&E Block 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FDD Block 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "IOC Block 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "BD Block 3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LDD Block 3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "IOC Block 3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EF8"
                    },
                    "ProjectTitle": {
                        "val": "AFATDS Increment 1"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "26.289"
                        },
                        "CurrentYear": {
                            "val": "43.898"
                        },
                        "BudgetYearOne": {
                            "val": "41.371"
                        },
                        "BudgetYearOneBase": {
                            "val": "41.371"
                        },
                        "BudgetYearTwo": {
                            "val": "22.802"
                        },
                        "BudgetYearThree": {
                            "val": "15.583"
                        },
                        "BudgetYearFour": {
                            "val": "1.495"
                        },
                        "BudgetYearFive": {
                            "val": "1.381"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "152.819"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Advanced Field Artillery Tactical Data System (AFATDS) funding line supports the Army Modernization Strategy Common Operating Environment. Efforts are aligned to support the Network-Cross Functional Team (CFT) capability set approach to achieve the network modernization strategy. AFATDS 7.0 modernizes the existing AFATDS software currently in the field. AFATDS 7.0 enhances the existing AFATDS baseline by: (1) Providing a modernized web service based backend that will simplify long-term maintenance of the software, (2) Bringing AFATDS into full compliance with the Army's Common Operating Environment (COE) Command Post Computing Environment (CPCE) initiative and (3) Enhancing overall usability of the system through the implementation of a role-based capability architecture with embedded training that allows the AFATDS operator to receive on-the-spot training for any aspect of AFATDS via interactive instruction. \n\nFY 2021 funding of $41.371 million will be used to facilitate development and continue to focus on the AFATDS v7.0 effort to include building fire support, fire control and fire direction role-based capabilities, integrating available CPCE common components, and updating the user interface for the Software.\n\nAFATDS supports Long Range Precision Fires (LRPF) CFT, Extended Range Canon Artillery (ERCA), Extended Range Guided Multiple Launch Rocket System (ER-GMLRS), Precision Strike Missile System (PRSM) and emerging sensor to shooter initiatives. To support these initiatives, AFATDS will serve as the key sensor to shooter link for the Army and US Marine Corps providing fully automated support for planning, coordinating, controlling and executing fires and effects. AFATDS began supporting Long Range Hypersonic Weapons in FY 2020."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Management Costs for AFATDS software development"
                                    },
                                    "Description": {
                                        "val": "Provide program support for AFATDS software development efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.193"
                                            },
                                            "Text": {
                                                "val": "Provided Program Management Office (PMO) support (Core, Matrix, and SETA) for all aspect of the AFATDS program including requirements analysis, software development efforts, logistics, and business management support.  PEO taxes are included in this support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.413"
                                            },
                                            "Text": {
                                                "val": "Continue to provide Program Management Office (PMO) support ( Matrix, and SETA) for all aspect of the AFATDS program including requirements analysis, software development efforts, logistics, and business management support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.25"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.25"
                                            },
                                            "Text": {
                                                "val": "Continue to provide Program Management Office (PMO) support (Matrix, and SETA) for all aspect of the AFATDS program including requirements analysis, software development efforts, logistics, and business management support."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Reduction of manpower requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AFATDS software development efforts"
                                    },
                                    "Description": {
                                        "val": "Development of AFATDS 7.0 software"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.096"
                                            },
                                            "Text": {
                                                "val": "Continued to focus on the AFATDS v7.0 effort to  include building fire support, fire control and fire direction role based capabilities, integrating available CP CE  common components, and updating the user interface for the application. Successful PDR and CDR and Gate 2 evaluation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "38.317"
                                            },
                                            "Text": {
                                                "val": "Development will continue to focus on the AFATDS v7.0 effort to  include building fire support, fire control and fire direction role based capabilities, integrating available CP CE v3 common components, and updating the user interface for the application."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "34.081"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "34.081"
                                            },
                                            "Text": {
                                                "val": "Development will continue to focus on the AFATDS v7.0 effort to include building fire support, fire control and fire direction role-based capabilities, integrating available CPCE common components, and updating the user interface for the application."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No Engineering Change Proposals\/surge anticipated in FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AFATDS 7.0  test events"
                                    },
                                    "Description": {
                                        "val": "IV&V and developmental testing."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.168"
                                            },
                                            "Text": {
                                                "val": "IV&V testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.04"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.04"
                                            },
                                            "Text": {
                                                "val": "Development and Independent Validation and verification tests planned for AFATDS 7.0."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Live Fire, PVT and IV&V testing\/support in FY 2021."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "B28620"
                                    },
                                    "Title": {
                                        "val": "MOD OF IN-SVC EQUIP, AFATDS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.401"
                                        },
                                        "CurrentYear": {
                                            "val": "4.083"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.494"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.494"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.292"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.392"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.693"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.9"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "39.255"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The AFATDS v7.0 requirement was validated by the Joint Requirements Oversight Council (JROC) under the AFATDS Increment 2 Capability Definition Document (CDD) in June 2011.  On 13 May 2015, the Army Acquisition Executive (AAE) approved AFATDS as a modification to the existing program baseline, continuing as an Acquisition Category (ACAT) II defense acquisition program (DAP) (non-Automated Information System) with PEO C3T oversight.  The AFATDS 7.0 is a software only modification\/modernization effort that will be hosted on already fielded hardware used for legacy AFATDS software.  \n\nThe overall acquisition approach to delivering AFATDS 7.0 is to modernize and redesign the software to create a single software baseline featuring web services and a suite of Common Operating Environment (COE) applications that meet threshold values of all key performance parameters identified in the AFATDS Increment 2 CDD.  The AFATDS Increment 2 CDD was approved under an IT Box construct, which promotes evolutionary development by facilitating requirement refinement and the incorporation of the latest technology.  While the JROC Memorandum (JROCM) 083-11 validated the AFATDS 7.0 performance parameters, it also delegated authority for identifying and approving future capability requirements that fall within the CDD's scope to the Fires Support Command and Control (FSC2) Tactical Software Requirements Governance Board.  \n\nAFATDS 7.0 will be modernized using an incremental approach where capability is added to the overall baseline over the course of five (5) blocks.  This approach provides the PM opportunity to deliver capabilities to users earlier in the process instead of waiting until AFATDS 7.0 is functionally complete, and also allows for feedback obtained during Product Validation Tests (PVTs) and Limited User Tests (LUTs) to be factored into later builds before the conclusion of the development contract.  The overall concept behind AFATDS 7.0 is to re-build AFATDS legacy software using the latest software development technologies and methodologies to ensure a strong technical foundation is in place for continued expansion of capability (to address Long Range Precision Fires initiatives) and adoption of emerging technology initiatives, such as COE."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support for AFATDS (Core)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Sub Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM Mission Command (MC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.008"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.008"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Support for AFATDS (Matrix)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "IA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various Matrix Orgs (Govt)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen PG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.8"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.969"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.993"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.817"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.817"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.579"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Support for AFATDS (SETA Contr)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CRSA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen PG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.783"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.827"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.634"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.919"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.919"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.163"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Support for AFATDS (FFRDC)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "FFRDC"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.2"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.183"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.761"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.545"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.545"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.689"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Taxes"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO C3T"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.214"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.025"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.969"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.969"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.208"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Development of AFATDS Version 6.8.1.1"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon Systems Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Wayne, IN"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "21.636"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "21.636"
                                                    },
                                                    "TargetValue": {
                                                        "val": "33.188"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Development of AFATDS Version 7.0"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Leidos"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "47.272"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "24.096"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "38.317"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "33.29"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "33.29"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "142.975"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Information Assurance and Engineering Support for AFATDS requirements"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CSC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.06"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.060"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Defensive Cyber Tools (T-PKI)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.1"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.100"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government Confidence Demo for AFATDS V6.8.x requirements."
                                                },
                                                "FundingVehicle": {
                                                    "val": "IA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Test & Evaluation Command (ATEC)\/Fires Test Directorate (FTD)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.626"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.626"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Independent Verification and Validation of AFATDS V7.0 requirements"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Engility"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.538"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.168"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.718"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.718"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.424"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Developmental Testing for AFATDS v7.0"
                                                },
                                                "FundingVehicle": {
                                                    "val": "IA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple Govt Test Agencies (ATEC, ATC, EPG)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.75"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.113"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.113"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.863"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "7_EF8_0.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "7_EF8_1.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "V6.8.1.1 P2 Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "V6.8.1.1 P2 Customer Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "V7.0 Development Block 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Limited Deployment Decision Block 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "V7.0 Development Block 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "V7.0 Product Verification Test  Block 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "V7.0 Independent Verification and Validation Block 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Limited Deployment Decision Block 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "V7.0 Development Block 3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Limited Deployment Decision Block 3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "V7.0 Development Block 4"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Limited Deployment Decision Block 5"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "V7.0 Development Block 5"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "V7.0 Product Verification Test  Block 3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "V7.0 Independent Verification and Validation Block 3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "V7.0 FOTE Block 3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Limited Deployment Decision Block 4"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "V7.0 Independent Verification and Validation Block 4"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "V7.0 Product Verification Test  Block 4"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "V7.0 Limited User Test Block 4"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}