{
    "id": "2021-Navy-PB-1319-MJBOOK-0-0-744c7ee94c2cc798fbfd935e35baade9caa8a86b67e6f22ecedd75220314848f-24",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603782N"
        },
        "ProgramElementTitle": {
            "val": "Mine and Expeditionary Warfare Advanced Technology"
        },
        "R1LineNumber": {
            "val": "25"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "38.541"
            },
            "CurrentYear": {
                "val": "13.335"
            },
            "BudgetYearOne": {
                "val": "1.948"
            },
            "BudgetYearOneBase": {
                "val": "1.948"
            },
            "BudgetYearTwo": {
                "val": "1.987"
            },
            "BudgetYearThree": {
                "val": "2.027"
            },
            "BudgetYearFour": {
                "val": "2.068"
            },
            "BudgetYearFive": {
                "val": "2.109"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Explosive ordnance disposal is a critical naval mission vital to the safety of service members and civilians. Highly trained Sailors and Marines utilize their knowhow and courage combined with state-of-the-art technology to remove unexploded ordnance, land\/sea mines and even chemical, biological and nuclear weapons. The Department of Defense (DoD) Directive 5160.62 \"Single Manager Responsibility for Military Explosive Ordnance Disposal Technology and Training (EODT&T)\" approved by the DoD Explosive Ordnance Disposal (EOD) Program Board (Sep 2012) guides research in this Program Element (PE). Unique needs and capabilities identified by the Joint Requirements Oversight Council (JROC) and the DoD EOD Program Board are also addressed by this PE, and provide the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval and Joint EOD forces in the 21st century. The strategy focuses and aligns Naval S&T with Naval missions, DoD EOD S&T with Joint EOD missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare. \n\nThis PE primarily develops and demonstrates prototype Mine Countermeasures (MCM), Expeditionary Warfare and Joint EOD system components that support capabilities enabling Naval and Joint EOD Forces to influence operations ashore. Adversarial nations have the capability to procure, stockpile and rapidly deploy all types of naval mines, including new generation mines having sophisticated performance characteristics, throughout the littorals. They also have the capability to develop or modify explosive devices such as mines and unexploded ordnance to construct Improvised Explosive Devices (IEDs) for the purpose of targeting Joint Forces. Real world operations have demonstrated the requirement to quickly counter the mine threat. Current operations have also demonstrated the requirement to quickly counter the threat from explosive hazards and IEDs during DoD operations. Advanced technologies must rapidly detect and neutralize all mine types, from deep water to the inland objective. Advanced technologies must enable Joint EOD forces to detect\/locate, gain access, diagnose, render safe, neutralize, recover, exploit and dispose of a broad spectrum of explosive hazards including unexploded ordnance and IEDs. This program supports the advanced development and integration of sensors, processing, warheads, and delivery vehicles to demonstrate improved Naval Warfare capabilities. It supports the advanced development and integration of sensors and tools for standoff capabilities such as detection and location of IEDs (particularly in dismounted operations), dismounted diagnosis of buried munitions and other explosive hazards, precision render safe and neutralization of surface munitions and other explosive hazards, and enhanced access to IEDs. It supports the MCM-related FNC Enabling Capabilities (ECs). \n\nToday's Sailors and Marines are enabled by naval Science and Technology (S&T). Since 1946, the Office of Naval Research (ONR) has fostered scientific research related to the maintenance of maritime superiority and national defense.  ONR manages the Department of the Navy's (DON) portfolio of naval Basic and Applied research, and Advanced Technology Development investments to ensure naval forces can effectively deter conflict, but when called upon, fight, win and come home safe. Current investments hedge against uncertainty, providing solutions to commanders today, and options for the future. The Naval S&T budget supports higher guidance defined by the National Defense Strategy, and responds to requirements identified by the Secretary of the Navy through research priorities set by the Chief of Naval Research, coordinated across the Naval Research Enterprise (NRE), and outlined in the Naval R&D Framework. \n\nThis Program Element (PE) funds Advanced Technology Development (ATD) that includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment. Efforts in this PE generally have Technology Readiness Levels TRL) of 4 (component and\/or breadboard validation in laboratory environment.), 5 (component and\/or breadboard validation in relevant environment.), or 6 (system\/subsystem model or prototype demonstration in a relevant environment).\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "39.672"
                },
                "CurrentYear": {
                    "val": "13.335"
                },
                "BudgetYearOne": {
                    "val": "1.948"
                },
                "BudgetYearOneBase": {
                    "val": "1.948"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "38.541"
                },
                "CurrentYear": {
                    "val": "13.335"
                },
                "BudgetYearOne": {
                    "val": "1.948"
                },
                "BudgetYearOneBase": {
                    "val": "1.948"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.131"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.131"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "funding: No significant change."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2917"
                    },
                    "ProjectTitle": {
                        "val": "Shallow Water MCM Demos"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "12.959"
                        },
                        "CurrentYear": {
                            "val": "13.335"
                        },
                        "BudgetYearOne": {
                            "val": "1.948"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.948"
                        },
                        "BudgetYearTwo": {
                            "val": "1.987"
                        },
                        "BudgetYearThree": {
                            "val": "2.027"
                        },
                        "BudgetYearFour": {
                            "val": "2.068"
                        },
                        "BudgetYearFive": {
                            "val": "2.109"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project develops and demonstrates prototype technology for Mine Countermeasures (MCM), US Naval sea mining, and Expeditionary Warfare and Joint EOD system components that support capabilities enabling Naval and Joint EOD Forces to influence operations ashore. Adversarial nations have the capability to procure, stockpile and rapidly deploy all types of naval mines, throughout the littorals including new generation mines having sophisticated performance characteristics. They also have the capability to develop or modify explosive devices such as mines and unexploded ordnance to construct Improvised Explosive Devices (IEDs) for the purpose of targeting Joint Forces. Real world operations have demonstrated the requirement to quickly counter the mine threat. Current operations have also demonstrated the requirement to quickly counter the threat from explosive hazards and IEDs during DoD operations. Advanced technologies must rapidly detect and neutralize all mine types, from deep water to the inland objective. Advanced technologies must enable Joint EOD forces to detect\/locate, gain access, diagnose, render safe, neutralize, recover, exploit and dispose of a broad spectrum of explosive hazards including unexploded ordnance and IEDs. This program supports the advanced development and integration of sensors, processing, warheads, and delivery vehicles to demonstrate improved Naval Warfare capabilities. \n\nThis Project supports the advanced development and integration of sensors and tools for standoff capabilities such as detection and location of IEDs (particularly in dismounted operations), dismounted diagnosis of buried munitions and other explosive hazards, precision render safe and neutralization of surface munitions and other explosive hazards, and enhanced access to IEDs. It supports advanced development for battlespace shaping weapons including advanced undersea weapons. It supports the MCM related FNC Enabling Capabilities (ECs)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint EOD Demos"
                                    },
                                    "Description": {
                                        "val": "This activity focuses on developing and demonstrating technologies to support a standoff or remote capability for detection and location, diagnosis, render safe, neutralization and enhanced access. Efforts include: electromagnetic, electro-optical, and acoustic sensors and systems for detection of explosive threat components including explosives, device housings\/containers, and triggering mechanisms, standoff identification and confirmation of trace explosives, fusion of multi-sensor input for high confidence detection and diagnosis of buried threats, highly dexterous manipulators and imitative controllers for lightweight, efficient (strength\/weight ratio) dual manipulator systems integrated onto EOD robots for enhanced access, enhanced robotic autonomy to support EOD missions, data compression and visualization techniques to support precise render safe and neutralization, and neutralization devices containing reactive materials to neutralize devices with low collateral damage. This S&T investment supports the Joint Requirements Oversight Council (JROC) and DoD EOD Program Board validated requirements for Joint EOD missions. This S&T investment provides critical S&T transitions to acquisition programs. This investment in Joint EOD S&T is reported annually to the DoD EOD Program Board. This S&T investment is documented in the DoD EOD Applied Research Program Plan which is reviewed and approved annually by the DoD EOD Program Board."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.878"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.946"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct advanced technology development and demonstration in electro-optic& acoustic technologies for buried mine detection, robotic manipulation for ordnance exploitation & neutralization, standoff detection and classification for ordnance, and identification of explosives. Efforts in this thrust include prototype and demonstration of laser interferometric sensor \/ systems for detection of buried objects, highly dexterous dual manipulator systems (manipulators, controllers) for EOD robots for precision render safe and neutralization missions, technologies for low-observable underwater ordnance neutralization and technologies for the inspection of underwater explosive threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.948"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.948"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Joint Explosive Ordnance Disposal (JEOD), Advanced Technology: Conduct advanced technology development and demonstration for JEOD functional areas including detect, access, diagnose, and render safe\/neutralize.  \n\n- Joint Explosive Ordnance Disposal (JEOD), Detection: Further efforts in the detection functional area.  Specific efforts will include development and demonstration of advanced electro-optical and spectroscopic sensors for detection of explosives.  The objective is to remotely detection bulk and trace explosives.  \n\n- Joint Explosive Ordnance Disposal (JEOD), Remote Access: Maintain efforts the access functional area.  Specific efforts will include robotic manipulators, end effectors and haptics.  The objective is to enable remote access to explosive threats and unexploded ordnance.  \n\n- Joint Explosive Ordnance Disposal (JEOD), Acoustic Sensor: Conclude detection of buried explosive threats with seismic-acoustic sensor.  Specific effort includes demonstration of a robot mounted seismic acoustic sensor.  The objective is to enable standoff detection of buried explosive threats with improved detection and classification statistics.\n\n- Joint Explosive Ordnance Disposal (JEOD), Man-Portable Prototypes: Initiate efforts in diagnose and render safe\/neutralize functional areas.  Specific efforts will include the development and demonstration of man-portable prototypes.  The objective is to assess the status of explosive threats and ordnance and render safe\/neutralize at standoff."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and  FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mine Technology"
                                    },
                                    "Description": {
                                        "val": "This activity focuses on developing and demonstrating technology to support on-demand battlespace shaping through advanced undersea weapons.  Efforts include command & control (C2), remote control, advanced sensing technologies, compatibility with unmanned delivery options, detection & classification, and targeting solutions. The program, Modular Undersea Effector System (MUSE), is a limited duration effort for advanced mining and responds to recent request for capability from the fleet."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.081"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.389"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct advanced technology development in advanced mining technologies for clandestine, flexible, and scalable minefield deployment, longevity, and endurance, to include remote control, advanced sensing for detection and classification, command & control (C2), and more discriminative targeting solutions.  Efforts in this thrust include prototyping and demonstration of advanced sensors and sensor configuration technologies for improved discrimination as well as communications, command, and control technologies. Continue prototyping and demonstration for next-generation target detection devices and mine effects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2020 to FY 2021 is due to the conclusion of all research efforts in the Mine Technology Activity in PU 2917."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "25.582"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "25.582"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Sensor for Maritime Capabilities Demonstration"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "22.686"
                                        },
                                        "Text": {
                                            "val": "Development of an airborne, multi-spectral sensor to demonstrate potential for \nlong range detection, increased persistence, and ability to operate on \ndifferent ISR platforms."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Additive Manufacturing"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "2.896"
                                        },
                                        "Text": {
                                            "val": "Development of new advanced manufacturing technologies, such as additive manufacturing, friction stir welding and surface processing, and laser thermal and mechanical surface treatments to improve performance, increase reliability, and reduce costs for small turbojet and turbofans engines."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}