{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-855515f7cbe1443b1cc76e32ff869263061a887974718017fcc8f688288c6578-17",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603338D8Z"
        },
        "ProgramElementTitle": {
            "val": "Defense Modernization and Prototyping"
        },
        "R1LineNumber": {
            "val": "40"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "133.375"
            },
            "BudgetYearOneBase": {
                "val": "133.375"
            },
            "BudgetYearTwo": {
                "val": "133.107"
            },
            "BudgetYearThree": {
                "val": "134.480"
            },
            "BudgetYearFour": {
                "val": "132.992"
            },
            "BudgetYearFive": {
                "val": "135.981"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Program Element (PE) 0603338D8Z Defense Modernization and Prototyping (DM&P) is a new PE in FY 2021.  This PE consolidates all funding and project investment areas previously supported by PE 0603699D8Z Emerging Capabilities Technology Development (ECTD), PE 0603826D8Z Quick Reaction Special Projects (QRSP), and PE 0604132D8Z Missile Defeat Project.  DM&P provides the funding focus and visibility for USD(R&E) to select projects critical for DOD modernization, and initiate them in the year of execution, thereby accelerating the delivery of joint mission capabilities to the warfighter and ensuring technical overmatch in peer engagements."
        },
        "ProgramElementMissionDescription": {
            "val": "In alignment with the National Defense Strategy, the Defense Modernization and Prototyping (DM&P) Program Element (PE) supports the Under Secretary of Defense for Research and Engineering (USD(R&E)) with innovation-focused experimentation and prototyping to deliver joint mission capabilities to the warfighter at the speed of relevance.  DM&P’s mission-focused capabilities cross functional domains and enhance warfighter lethality, technical superiority, adaptability, and resilience.  DM&P funding supports joint prototype development, joint experimentation for concept of operations (CONOPs) development, and red teaming validations that enable disruptive innovation to sustain the United States' operational superiority.  The DM&P PE enables the USD(R&E) vision for next generation platforms, weapons systems, fire control, sensors, logistics, and communications.  The consolidated nature of the DM&P PE increases the Department’s ability to coordinate activities across the Services, Defense Agencies, and international partners; provides the agility to rapidly pivot to new threats; and, supplies the resources necessary to ensure a technological overmatch against future threats.  This realignment directly supports the Department’s modernization plans by streamlining investments, reducing the time from discovery to deployment, and enabling development of disruptive technologies to help realize the National Defense Strategy. \n\nDM&P prototyping projects increase the speed of technology innovation by reducing technology risk for capabilities addressing modernization challenges.  With an emphasis on joint and interagency partnerships, DM&P matures capability options to anticipate and inform new acquisition pathways in addition to formal requirements and acquisition processes.  Project selection is guided by Department-level strategies and priorities, such as the Department of Defense (DoD) modernization priorities, National Defense Strategy, the Chairman’s Capability Gap Assessment, and the Combatant Commands’ Integrated Priority Lists (IPLs).  The DM&P PE supports four major project codes that expedite development and transition of new joint mission capabilities to the warfighter.  These project codes are:  1) Emerging Capability Technology Development (ECTD), 2) Quick Reaction Special Projects (QRSP), 3) Red Teaming, and 4) Time Sensitive Target Defeat (TSTD).  Completed DM&P projects transition to joint programs through fielded operationally relevant prototypes; technology adoption into programs of record; integration into system level, multi-year joint demonstrations; and through advanced research and engineering efforts like the Warfighting Lab Incentive Fund for further development of tactics, techniques, procedures, and concepts of operations.\n\nThe DM&P PE will continue to leverage the year of execution processes that enabled ECTD and QRSP to quickly and effectively respond to emergent innovation opportunities through the rapid development and transition of risk reducing prototypes.  DM&P prototyping activities include initial concept discovery of potentially game-changing capabilities through relatively low cost risk reducing prototypes; and, high-fidelity prototyping of advanced systems in partnership with the Services, Defense Agencies, and allies to inform the acquisition of new joint mission capabilities though experimentation and red teaming."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "133.375"
                },
                "BudgetYearOneBase": {
                    "val": "133.375"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "133.375"
                },
                "BudgetYearOneBase": {
                    "val": "133.375"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Transfer from Legacy RDT&E Program Elements"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "134.009"
                                },
                                "BudgetYearOneBase": {
                                    "val": "134.009"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments and DoD Priorities"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.502"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.502"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.132"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.132"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The adjustment of $134.009 million reflects the transfer of all funding and project investment areas previously supported by PE 0603699D8Z Emerging Capabilities Technology Development (ECTD), PE 0603826D8Z Quick Reaction Special Projects (QRSP), and PE 0604132D8Z Missile Defeat Project.  The transfer of these resources is to provide transparency, alignment and focus supporting development of key technologies and modernization with OUSD(R&E) identified capability thrust priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "720"
                    },
                    "ProjectTitle": {
                        "val": "Quick Reaction Special Projects (QRSP)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "49.023"
                        },
                        "BudgetYearOneBase": {
                            "val": "49.023"
                        },
                        "BudgetYearTwo": {
                            "val": "50.269"
                        },
                        "BudgetYearThree": {
                            "val": "50.755"
                        },
                        "BudgetYearFour": {
                            "val": "47.137"
                        },
                        "BudgetYearFive": {
                            "val": "48.377"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Quick Reaction Special Projects (QRSP) funds the development of risk-reducing prototypes, experiments, and demonstrations to expedite delivery of effective, affordable, and critically needed joint mission capabilities to the warfighter.  These lower-cost prototypes and QRSP’s innovative business processes give the Under Secretary of Defense for Research and Engineering (USD(R&E)) the agility to quickly explore new, higher-risk technology areas that have the potential for immediate, game-changing impacts.  Developed prototypes inform modernization efforts or transition through rapid technology refresh and insertion into joint mission capabilities.  QRSP also enables the DoD to identify innovated solutions from small and non-traditional business not normally engaged by the DoD to address gaps and augment joint mission capabilities. Project selection is guided by department-level strategies and priorities, such as the DoD’s modernization areas and the National Defense Strategy.  Needs are identified and prototype projects are funded within the year of execution to demonstrate the feasibility of new technologies, enable integration into larger systems, and deliver affordable capabilities faster than standard acquisition cycles.  With an emphasis on joint and interagency partnerships, QRSP matures capability options to anticipate and inform new acquisition pathways in addition to formal requirements and acquisition processes.  \n\nQRSP includes thrust areas that complement risk-reducing prototypes, such as Strategic Multi-layer Assessments (SMA) and joint demonstrations and experiments. SMA supports senior leadership in the Combatant Commands (CCMDs) by providing rapid, actionable assessments of complex operational and technical challenges.  Joint demonstrations and DM&P-sponsored venues of defense-wide experiments provide opportunities for emerging technologies to succeed, or fail fast.  Demonstration venues include: Stiletto, a maritime experimentation and demonstration platform; Thunderstorm, a multi-domain venue focused on innovative small and non-traditional businesses; and, other tailored experimentation and demonstration events.  Individual projects generally span 6 to 18 months, typically at a cost of less than $1.000 million."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Autonomy at the Tactical Edge Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area explores joint mission capabilities to enhance the lethality of the joint force, reduce the time to make critical decisions, autonomously distribute tasking and orders, and protect warfighters through increased use of intelligent networks, autonomous sensing platforms, and human-machine collaborative systems. Selected projects target key capabilities that enable leap-ahead improvements and intelligent autonomous systems with cost effective investments. These projects leverage advances in high performance computing, autonomy, and machine learning to transfer cognitive burden closer to the point of collection and action. Examples include agile computer vision systems, enhanced capabilities for multiple autonomous systems to cooperatively interact, tools to fuse and infer information from a wide variety of sensors and datasets, autonomous task discrimination and prioritization, autonomous operation in complex terrain, collaborative systems for efficient distribution of contested logistics, data preprocessing to reduce bandwidth requirements for fully integrated command and control, and human-machine collaborative decision making providing faster-than-human response to threats. These projects will also examine common software platforms and modular open architecture systems to reduce development cost, increase collaboration among manned and unmanned platforms, and inform requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.843"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.843"
                                            },
                                            "Text": {
                                                "val": "QRSP investment decisions are made during the execution years in response to DoD, CCMD, Service, and other government priorities.  QRSP anticipates supporting three to seven projects in FY 2021."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program element 0603338D8Z Defense Modernization and Prototyping is a new funding line for FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Targeted Prototyping for Increased Lethality and Survivability Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area leverages opportunities for collaboration to rapidly mature and demonstrate advanced weapon systems through targeted prototyping of key enabling technologies.  Selected projects extend Service and defense agency investments to demonstrate joint mission capabilities through coordination with U.S. Special Operations Command (USSOCOM), Defense Innovation Unit (DIU), Rapid Capability Offices, Rapid Equipping Force, warfighter laboratories and other organizations that seek to refine future capabilities through near-term operational concepts.  Example projects include dynamic data links for re-tasking and coordination of small munitions; new propellant formulations for extended range fire support; advanced materials to increase weapon system survivability; novel warhead designs to increase lethality; and low cost, extended range, swarming, loitering munitions.  Through co-funding and invested transition partners, developed concepts will be rapidly deployed to assess utility and inform concepts of operation prior to initial operation and informing future acquisition programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.593"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.593"
                                            },
                                            "Text": {
                                                "val": "QRSP investment decisions are made during the execution years in response to DoD, CCMD, Service, and other government priorities.  QRSP anticipates supporting seven to twelve projects in FY 2021."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program element 0603338D8Z Defense Modernization and Prototyping is a new funding line for FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Persistent Intelligence, Surveillance and Reconnaissance (ISR) Focus Area"
                                    },
                                    "Description": {
                                        "val": "ISR sensor networks are critical for providing asymmetric compensation against peer adversaries.  Advances in distributed, interconnected sensors with fully networked command, control, and communications provide opportunities for new solutions to anti-access\/area denial and persistent surveillance challenges. This focus area helps address emerging needs for persistent ISR capabilities, which provide improved ground, air, sea, and space situational awareness.  Projects will address joint mission capability needs through development and experimentation with prototype platforms, sensors and communication architectures that explore new or improved methods for robust, ad hoc sensors networks; reliable communications; and collaboratively networked sensors to persistently operate within denied areas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.847"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.847"
                                            },
                                            "Text": {
                                                "val": "QRSP investment decisions are made during the execution years in response to DoD, CCMD, Service, and other government priorities.  QRSP anticipates supporting three to seven projects in FY 2021."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program element 0603338D8Z Defense Modernization and Prototyping is a new funding line for FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Realizing Disruptive Technologies for DoD Modernization Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area matures key capabilities that augment platforms, weapons, sensors, and other solutions to modernization challenges.  Selected projects leverage investment from traditional and non-traditional industry partners; proven commercial and government off the shelf technologies; rapidly maturing technologies within Service laboratories, academia, and Federally Funded Research and Development Centers (FFRDCs); technologies from allied nations; and direct warfighter feedback to identify and address gaps within current and developing capabilities.  These targeted investments accelerate capability to the warfighter and realize new disruptive technologies through low cost, rapid opportunities to cyclically innovate within the development process for major system prototypes developed through Strategic Capabilities Office and Defense Innovation Unit, Joint Capability Technology Demonstrations, and Service programs of record.  Example projects include novel learning algorithms and next generation computing; adaptation of commercial cyber tools; field demonstrations of quantum sensors; unique applications of active and passive radio frequency architectures; and, early-stage concepts for highly-efficient directed energy subsystems.  Project selection will be informed by a joint review process incorporating representatives from Service and Defense Agencies; major prototype, demonstrations, and acquisition programs; DoD and FFRDC subject matter experts; and, USD(R&E) leadership to avoid duplication of efforts and ensure activities address mission critical modernization challenges."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.873"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.873"
                                            },
                                            "Text": {
                                                "val": "QRSP investment decisions are made during the execution years in response to DoD, CCMD, Service, and other government priorities.  QRSP anticipates supporting seven to twelve projects in FY 2021."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program element 0603338D8Z Defense Modernization and Prototyping is a new funding line for FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Distributed, Collaborative, Multi-Function Devices for Electromagnetic Spectrum Agility"
                                    },
                                    "Description": {
                                        "val": "This focus area explores integrated, multi-function, net-centric electromagnetic spectrum (ES) concepts and technologies to enable a multi-domain, flexible, diverse, and interoperable ES architecture.  In the modern battlespace, the electromagnetic spectrum is both a contested resource and unique terrain requiring advanced maneuver.  Tactics, techniques, and procedures are necessary to maintain access to ES and ensure maneuverability.  Selected projects provide the architecture to ensure allied access, deny enemy use, and enable future capabilities for ES dominance.  Examples include waveform agnostic apertures, amplifiers, and digital signal processing for multi-use systems (radar, communications, electronic warfare, sensing); advanced routing and artificial intelligence task and network routing for increase efficiency; and, ad hoc distributed apertures for collaborative electronic warfare (EW) distributed radar. Activities include refining software and algorithms, novel hardware and electronic components, and advanced timing and networking technologies that directly support emerging common standards for next generation distributed, collaborative, multi-function devices."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.867"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.867"
                                            },
                                            "Text": {
                                                "val": "QRSP investment decisions are made during the execution years in response to DoD, CCMD, Service, and other government priorities.  QRSP anticipates supporting seven to twelve projects in FY 2021."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program element 0603338D8Z Defense Modernization and Prototyping is a new funding line for FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-domain Experimentation and Demonstration Venues"
                                    },
                                    "Description": {
                                        "val": "Agile and flexible experimentation and demonstration capabilities and venues support DoD modernization by increasing the rate of innovation through hands-on warfighter demonstrations of joint mission capabilities.  Demonstration venues enable Joint Program Offices, Service, and Combatant Command user evaluation of emerging novel technologies in relevant environments.  Demonstration venues include the Thunderstorm venue for small and non-traditional businesses; the Stiletto maritime technology platform; and, other tailored multi-domain venues and ad-hoc demonstrations.  These experimentation and demonstration venues support the rapid discovery and transition of emerging technologies across the range of military operations.  The venues provide the DoD and interagency partners with an opportunity to identify and evaluate new and emerging technologies both from commercial and government sectors through a series of technology demonstrations, experiments, vignettes, and related activities.  The venues also offer a streamlined experimentation and demonstration process that encourages system developers to engage directly with the warfighter.  These engagements enable rapid innovation and adoption of new technologies to meet operational needs through the exploration of military utility, and identification of potential risks of emerging technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Multi-domain venues will continue to focus on the most pressing challenges to DoD and provide agile venues to explore new and innovative technological solutions.  Focus areas will be based on needs and priorities identified through engagement with stakeholders in the Services, Combatant Commands, Intelligence Community, and other operational users."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program element 0603338D8Z Defense Modernization and Prototyping is a new funding line for FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Strategic Multi-Layered Assessment (SMA) Reach Back Cell"
                                    },
                                    "Description": {
                                        "val": "In FY 2021, the SMA Reach Back Cell will transition from PE 0603826D8Z Quick Reaction Special Projects (QRSP).  The SMA Cell supports senior leadership in the Combatant Commands (CCMDs) with actionable assessments of complex operational and technical challenges.  SMA efforts leverage multi-agency, multi-disciplinary approaches to answer the Combatant Commanders’ key strategic questions that are not within the DoD’s core competency.  The assessments help maintain our competitive advantage in an increasingly complex global environment.  The SMA Cell was established by the Joint Staff Deputy Director for Global Operations at the request of the Commander, U.S. Central Command (USCENTCOM).  SMA assessments are framed during the year of execution and are in response to specific tasking from senior leadership in the CCMDs.  The SMA Cell identifies options from across the U.S. Government, academia, and the private sector.  SMA efforts are facilitated by the Joint Chiefs of Staff\/J-3 Operations and are executed by the Office of the Under Secretary of Defense, Research and Engineering.  The SMA Cell provides USCENTCOM with population-based and regional expertise in support of ongoing operations in the USCENTCOM area of responsibility."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2021, the SMA Cell will transition from PE 0603826D8Z Quick Reaction Special Projects (QRSP).  The realignment of the SMA Cell will not change the objective of providing support to the CCMDs or influencing acquisition programs resulting from identified needs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program element 0603338D8Z Defense Modernization and Prototyping is a new funding line for FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prototyping Through Non-Traditional Pathways"
                                    },
                                    "Description": {
                                        "val": "Prototyping Through Non-Traditional Pathways leverages technologies and emerging products developed by small, innovative businesses in the commercial sector including information technologies; internet-of-things sensors and adaptive networks; bio-medical advances; emerging quantum applications; and novel microelectronic\/microelectromechanical system innovations.  Ideas from non-traditional emerging technology companies are matched against DoD, CCMD, Service, and other government priorities.  Promising solutions are selected for further test and evaluation and, if successful, rapid prototyping or fielding to transition commercial ideas with military utility.  These efforts support the Department's objectives of leveraging commercial innovation to maintain technology superiority; increasing rate of technology maturation; exploring alternative and faster pathways for acquisition; and fielding affordable and effective joint mission capabilities.  In FY 2019, Prototyping Through Non-Traditional Pathways conducted reviews focused on priorities of USSOCOM, Joint Improvised-Threat Defeat Organization, cyber community of interest, and Office of the Under Secretary of Defense, Research and Engineering."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Prototyping Through Non-Traditional Pathways anticipates three to five reviews in FY 2021, and 15 to 20 resulting evaluations with potential for future prototypes.  Each review focuses on identifying ideas in a specific topic area that can transition to meet joint operational needs through rapid prototyping.  These reviews will be executed with DoD users and interagency partners."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program element 0603338D8Z Defense Modernization and Prototyping is a new funding line for FY 2021."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Quick Reaction Special Projects (QRSP) will support FY 2021 performance metrics to transition projects to the warfighter and enable DoD modernization capabilities.  QRSP is a new project code in 2021 and there is no historic data on transition rates."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "721"
                    },
                    "ProjectTitle": {
                        "val": "Emerging Capabilities Tech Dev (ECTD)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "64.650"
                        },
                        "BudgetYearOneBase": {
                            "val": "64.650"
                        },
                        "BudgetYearTwo": {
                            "val": "66.014"
                        },
                        "BudgetYearThree": {
                            "val": "66.933"
                        },
                        "BudgetYearFour": {
                            "val": "67.856"
                        },
                        "BudgetYearFive": {
                            "val": "69.238"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Emerging Capabilities Technology Development (ECTD) funding supports the USD(R&E) mission to accelerate the development and fielding of overmatch capabilities to the warfighter in coordination with the Services, Combatant Commands (CCMDs), and Joint Staff. Prototyping and experimentation activities focus on key Defense modernization challenges in mission areas identified by the Joint Staff and USD(R&E) leadership.  ECTD leverages rapid prototyping processes to include Broad Agency Announcements (BAA) and Other Transition Authorities (OTA) that seek to demonstrate a novel technology or concept in a relevant environment within a 30-month period then transition it to an operational user. ECTD activities refine future warfighting concepts, inform Service Program of Record (PoR) capability requirements, and provide residual joint mission capability through leave behind test articles.  \n\nAnticipated FY 2021 investments areas target the following key mission areas: Advanced Electronic Warfare (EW); Fully Networked Command, Control, and Communication (FNC3); Joint Fires and Targeting; Contested Logistics Operations; and Intelligence, Surveillance, and Reconnaissance (ISR) to support Time-Critical Targeting.  Projects will be identified through soliciting concepts from Service, CCMDs, industry, academia, Federally Funded Research & Development Centers (FFRDCs), University Affiliated Research Centers (UARCs), and Department of Defense laboratories.  Efforts are designed to encourage teaming between organizations to generate integrated concepts that result in leap-ahead mission capabilities. This process also focuses related Service and Defense Agency projects to a common set of gaps addressing peer engagements.  Individual projects generally span one to three years, typically at a cost of less than $15.000 million.  ECTD prototypes, demonstrations, and experiments enable developers to showcase new and maturing capabilities in realistic environments and against realistic threats with operational user involvement."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Fully Networked Command, Control, and Communications For Distributed Aerial Systems Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area addresses a Secretary of Defense priority for integrated communications and networking across unmanned aerial systems to deliver system diversity and resilience to the joint warfighter. Projects will provide flexibility and interoperability to ensure the warfighter's connectivity across offensive and defensive systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.000"
                                            },
                                            "Text": {
                                                "val": "Fully Networked Command, Control and Communications activities will focus on the following areas of concern: (1) Encourage spectral diversity, allowing for any radio to be used to route any piece of information; (2) Facilitate spatial diversity, enabling networks to use any combination of links to route information; (3) Ensure link resiliency, including nullifying adversarial jamming, and countering an enemy's employment of unmanned aerial systems and other intelligence, surveillance, and reconnaissance platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program element 0603338D8Z Defense Modernization and Prototyping is a new funding line for FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electromagnetic Spectrum Dominance Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area matures advanced Electronic Warfare (EW) and Electromagnetic Spectrum (EMS) sensing concepts and joint mission capabilities through operationally relevant prototyping activities.  Radio frequency (RF) spectrum congestion and emergent peer EW threats erode U.S. capabilities in ways that are difficult to predict and counteract.  This focus area helps develop multi-function, frequency agile EMS dominance prototypes by leveraging advances in distributed and multi-purpose apertures, microelectronics, machine learning, and autonomous systems .  The end result is an application agnostic architecture that enables a variety of EW applications across Joint Service platforms, which increased survivability and lethality against peer threats.  Prototype assessments will occur in realistic venues such as the Silent Hammer Experimentation program to inform new warfighting concepts and requirements for future acquisition programs. Development of advanced prototypes will involve partnerships with industry and academia."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.916"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.916"
                                            },
                                            "Text": {
                                                "val": "This focus area will develop concepts and designs through prototyping that will result in next generation EW, and RF sensing capabilities in one to three years. While project determinations are generally made in the year of execution, projects to be considered will identify and analyze EMS threats and provide capabilities that will enable DoD systems to operate effectively in the congested EMS environments at home and those expected in future contingency operations. One to two prototype efforts are anticipated in FY 2021 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program element 0603338D8Z Defense Modernization and Prototyping is a new funding line for FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Assured Global Command, Control, and Communications Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area prototypes innovative technologies to enable experimentation with new Joint Service command and control concepts.  In future theaters information will need to flow seamlessly between humans, AI agents, vehicles, autonomous systems, and weapon platforms to provide sufficient flexibility and rapid action that assures technological and operational dominance. Assured response requires resilient and robust networks where every aperture is an interoperable node regardless of Service, platform, or transmission methods.  This focus area enables rapid prototyping and transition of key technology components that enable multi-function systems and increases utilization and efficiency across the command, control, and communications architectures.  Component technologies that may be prototyped included miniaturized hardware, novel multi-purpose apertures, flexible and secure waveforms, common interfaces, and modern techniques.  Where possible, identified projects leverage commercial technologies including high bandwidth data links, 5G protocols, advanced software defined radios, and AI enabled network management. Prototype development and demonstration will leverage partnerships with industry, Federally Funded Research and Development Centers, Academia, Service laboratories, and our international partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "FY 2021 projects build on current developments and laboratory breakthroughs within industry, Academia, and Service laboratories.  Selected prototypes will demonstrate key capabilities for fully networked command, control, and communications in one to three years. While project determinations are generally made in the year of execution, projects to be considered will include novel apertures, waveforms, and microelectronic technologies to provide assured response. One to two prototype efforts are anticipated in FY 2021 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program element 0603338D8Z Defense Modernization and Prototyping is a new funding line for FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prototyping Advanced Capabilities Through Innovative Validation Exercises (PROACTIVE) Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area enables rapid adaption and adoption of prototypes to meet mission needs by integrating end-to-end prototypes into existing large-scale demonstrations and exercises.  Selected prototypes will be rapidly integrated into operational demonstrations such as Northern Edge and Valiant Shield to explore tactics, techniques, and procedures, and enhance interoperability among the Services.  By allowing warfighters to train with end-to-end system solutions this effort enables concept of operation and concept of employment experimentation, increases the rate of technology adoption, and eliminates the feedback delay for new capabilities.  These large-scale exercises also provide increased fidelity, opportunities for validating employment and human factors, and real-world challenges to validate system interoperability and military utility.  Featured prototypes will showcase system-of-system solutions to emerging threats.  PROACTIVE projects are designed with direct inputs from the Joint Staff, Service science and technology leadership, and leadership within the Combatant Commands.  After each event, prototypes will transition to the services for refinement or initial operational fielding."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2021, PROACTIVE will integrated one to two prototypes within existing demonstrations or exercises in FY 2021 and FY 2022.  Prototype selection and integration occurs early in the exercise planning with flexible pathways for technology insertion.  Each event targets a specific set of challenges and results in one or more capability assessments by participating warfighters.  Prototype integration activities leverage Joint, Service, interagency partnerships, and allied partner organizations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program element 0603338D8Z Defense Modernization and Prototyping is a new funding line for FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Asymmetric Counters to Unconventional Weapons and Missile Threats Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area addresses time-sensitive threats from weapons of mass destruction (WMD) and missile delivery systems through rapidly deployed, resilient concepts and enabling technologies to reduce the kill chain timeline. Projects will leverage advanced networked sensors, autonomous learning systems, and low-cost strike concepts to asymmetrically defeat time-sensitive threats. The focus area is aimed at developing prototype technologies and demonstrations that reduce the kill chain timeline via: (1) Enhanced capabilities to rapidly find, fix, and track WMD and missile threats; (2) Persistent intelligence and target discrimination in anti-access\/aerial denial (A2\/AD) environments; (3) Adaptable, resilient, strike concepts to promptly engage weapons of mass destruction (WMD) and missile delivery systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.888"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.888"
                                            },
                                            "Text": {
                                                "val": "FY 2021 projects will be selected in the year of execution to accelerate DoD modernization and address challenges identified in the National Defense Strategy.  Selected efforts include cost-effective, mission-focused projects to design, develop, and deliver new concepts and technology prototypes aimed at supporting the Joint Force with critical enablers in distributed networked sensors, unattended intelligence systems, and new joint mission capabilities to address time-sensitive threats. One to three prototype efforts are anticipated in FY 2021 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program element 0603338D8Z Defense Modernization and Prototyping is a new funding line for FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous or Semi-Autonomous systems for Integrated Fires through Human-Machine Combat Teaming Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area addresses the need to develop new operational capabilities, which provide the warfighter and battlefield commander enhanced situational awareness and a common operating picture.  By integrating legacy and next generation autonomous or semi-autonomous systems, projects selected in this focus area enable battlefield commanders to: speed up the observe, orient, decide, and act (OODA) loop; reduce warfighter cognitive load; and, increase timely application of appropriate kinetic or non-kinetic responses.  The focus area is aimed at rapidly developing prototype technologies and demonstrations of systems to: (1) semi-autonomously detect, identify, track, prioritize, and engage targets with operator determination; (2) autonomously detect, classify threats or threat signals, then recommend defensive or offensive actions to the operator. Prototypes developed in this focus area will be delivered to Joint and Service users to evaluate joint mission capabilities under realistic conditions and against current adversaries or anticipated threats. Development of advanced prototypes will involve partnerships with industry and academia and permit operational users to gain insight into future technology-enabled strategies and tactics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.846"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.846"
                                            },
                                            "Text": {
                                                "val": "FY 2021 projects will be selected in the year of execution to accelerate DoD modernization and address challenges identified in the National Defense Strategy.  Projects will focus on cost-effective, mission-focused projects to design, develop, and deliver new concepts and technology prototypes aimed at supporting the Joint Force. One to three prototype efforts are anticipated in FY 2021 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program element 0603338D8Z Defense Modernization and Prototyping is a new funding line for FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Silent Hammer (SH)"
                                    },
                                    "Description": {
                                        "val": "In FY 2021, the SH Demonstration Program will transition from PE 0603699D8Z Emerging Capabilities Technology Development.  SH is a multi-year, multi-agency, series of field experimentation activities.  SH explores and demonstrates new EW and cyber technologies and approaches through the use of large-scale, dynamic field experiments.  SH includes scripted and dynamic scenarios to experiment with the efficacy of both existing and new capabilities to engage emerging electromagnetic spectrum threats.  The EW Community of Interest, Executive Committees, and warfighters are involved in the selection of follow-on experimentation topics, technology demonstrations, and scoping of these efforts to ensure their maximum relevance and value."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Planning and preparation for SH 2 will continue through early FY 2021, with SH 2 scheduled for mid-FY 2021."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program element 0603338D8Z Defense Modernization and Prototyping is a new funding line for FY 2021."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "ECTD leverages the DoD's most efficient and effective acquisition approaches for rapid prototyping.  This includes using Other Transaction Authorities, Broad Area Announcements, and new or existing contract vehicles."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "722"
                    },
                    "ProjectTitle": {
                        "val": "Time Sensitive Targeting Defeat (TSTD)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "9.816"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.816"
                        },
                        "BudgetYearTwo": {
                            "val": "6.897"
                        },
                        "BudgetYearThree": {
                            "val": "6.881"
                        },
                        "BudgetYearFour": {
                            "val": "7.058"
                        },
                        "BudgetYearFive": {
                            "val": "7.202"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Enabling a kill chain against a near peer competitor to maintain persistence on time sensitive targets present challenges.  Time Sensitive Target Defeat (TSTD) leverages the recommendations of Special Program Missile Defeat (SPMD) JUKEBOX 18 by establishing an Integrated Joint Combined Arms Demonstration Campaign to address the challenging mission and national security needs for countering time sensitive targeting.  The Demonstration Campaign is a multi-year initiative to integrating a multi-domain concept to address the critical needs for countering time sensitive targets.  By forging a coalition with external and allied partners (Australia, Canada, New Zealand, the United Kingdom), the Under Secretary of Defense for Research and Engineering (USD(R&E)) will execute a live demonstration of time critical targeting to improve tactics, techniques, and procedures while improving the operational planning and effectiveness of the find, fix, and kill chains of future Joint Warfighting Concepts.  TSTD will establish the foundation for resolving challenges with future weapon systems and command and control, communications, computers, intelligence, surveillance, and reconnaissance (C4ISR)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mission Integration Support for Prototyping and Experimentation with Time Sensitive Target Defeat (TSTD) Concepts"
                                    },
                                    "Description": {
                                        "val": "Activities focus on demonstrating new capabilities and providing integration support for prototyping, experimentation, and mission engineering projects.  These activities will enable the assessment and validation of innovative sensing; command and control (C2); processing, exploitation, and dissemination (PED); and effects-based joint mission capabilities through integrated simulation and experimentation activities.  TSTD's mission engineering expertise enables the evaluation of developmental concepts in realistic scenarios or exercises with warfighter input to validate the expected performance in future warfighting environments prior to transitioning the capability to the field.  Ultimately, TSTD efforts allow for leave behind capabilities and accelerated low rate production decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.816"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.816"
                                            },
                                            "Text": {
                                                "val": "Time Sensitive Target Defeat (TSTD) integrates a multi-domain TSTD initiative to decrease the kill chain execution timeline for mission enduring capability by integrating the Department’s modernization prototype initiatives to enable the find, fix, and kill Joint Warfighting Concepts.  TSTD will establish an Integrated Joint Combined Arms Demonstration Campaign Plan to demonstrate a live multi-domain kill chains across land, air, sea, cyberspace, and space as operationally feasible.  The objectives are to acquire, demonstrate, and deliver prototype capabilities to close existing time sensitive targeting (TST) kill chains by enhancing their ability to degrade, counter, or defeat adversarial intent.  To increase mission success, TSTD will increase technical rigor by imposing a Government Reference Architecture (GRA) standard to devolve technical requirements of the prototypes and identify promising solutions that will enhance the TST kill chains of the Joint Warfighting Concepts.\n\nThe TSTD objectives:\n-\tConduct a live time critical targeting demonstration via the Integrated Joint Combined Arms Demonstration Campaign\n-\tEstablish an allied partnership to enable a participation within the Demonstration Campaigns\n-\tDevelop and demonstrate prototyping capabilities to close existing TST kill webs\n-\tConduct sensor payload integration to increase persistence and enable long range fires\n-\tIntegration of new Command and Control (C2) architectures \n-\tProvide an execution path to transition prototypes as a \"leave-behind capability.\"   \n-\tIncorporate Rapid Integration Strategy for Experimentation\/Prototypes (RISE) to integrate into the doctrine, organization, training, materiel, leadership and education, personnel, and facilities (DOTMLP-F) for transitioning or leave behind capabilities\n-\tDefine the pathways to incorporate cyber and electronic warfare into the multi-domain concept of TSTD"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program element 0603338D8Z Defense Modernization and Prototyping is a new funding line for FY 2021."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The acquisition strategy consists of developing and integrating multi-domain solution to optimize fielded weapon systems, sensors, command & control, communications, computers, intelligence, surveillance, and reconnaissance (C4ISR) and effects.  Provide a venue for leveraging the Integrated Joint Combined Arms Demonstration Campaign to emulate the operational environments and validate the conceptual architectures and leave behind prototype capabilities.  Use mission engineering, Government Reference Architecture (GRA), and analysis to develop technical requirements, identify promising solutions, and inform future investment decisions.  The acquisition strategy consists of partnering with small businesses, industry, Federally Funded Research and Development Centers and University Affiliated Research Centers.  The implementation of Rapid Integration Strategy for Experimentation\/Prototypes (RISE) provides an agile approach to integrating DOTMLP-F for transitioning or leave behind prototyping capabilities.  Time Sensitive Target Defeat (TSTD) leverages the DoD's most efficient and effective acquisition approaches for rapid prototyping to align with the Department modernization priorities."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "723"
                    },
                    "ProjectTitle": {
                        "val": "Red Teaming (RT)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "9.886"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.886"
                        },
                        "BudgetYearTwo": {
                            "val": "9.927"
                        },
                        "BudgetYearThree": {
                            "val": "9.911"
                        },
                        "BudgetYearFour": {
                            "val": "10.941"
                        },
                        "BudgetYearFive": {
                            "val": "11.164"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "In FY 2021, the Red Teaming project code will transition from PE 0603699D8Z Emerging Capabilities Technology Development. The Red Teaming project supports assessments and demonstrations to stress and assess emerging systems with the intent of gaining or maintaining overmatch earlier in the life cycle.  The project helps to assess the susceptibility and vulnerability of emerging technologies and newly developed systems, and helps identify unanticipated disruptive opportunities and technological dead ends.  The project improves systems by reducing vulnerabilities and providing a holistic understanding of employment risks in operationally representative environments and against potential threats prior to full funding commitments.  The Red Teaming project supports three broad types of red teaming: 1) Early stage horizon scanning and assessments of weaknesses and opportunities of pre-development technologies from an adversary perspective; 2) Targeted, low-fidelity prototypes to assess utility and inform design choices prior to funding commitments; and 3) Red teams, war games, and field experiments with maturing technology to understand how to implement new technologies and adapt to adversary responses.  This effort leverages the innovative capabilities of other defense red teaming organizations within the Department, Federally Funded Research and Development Centers (FFRDCs), government laboratories, and academia.  Deliverables will inform requirements, develop new concepts of operations (CONOPS), and help accelerate technology acquisition pathways for joint missions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Red Teaming to Support DoD Modernization Priorities"
                                    },
                                    "Description": {
                                        "val": "Red Teaming to Support DoD Modernization Priorities funds efforts to explore new joint mission capabilities in a competitive environment.  Efforts include: 1.) Early investigations and red teaming to identify and understand potential vulnerabilities and opportunities from emerging and conceptual technologies.  Projects will help define and anticipate impacts from new technologies, including current DoD investments and external technologies, to understand operational utility and identify threats from tangentially related sectors that can have significant negative impacts on current DoD investments.  2.) Maturation of Service and Defense Agency identified prototypes to enable red teaming, demonstrations, experiments, and CONOPS earlier in the development cycle.  These prototypes increase agility and rate of innovation for emerging capabilities, while reducing cost and risk.  3.) Exploring unconventional approaches to counter current DoD and adversary technologies through red teams, war games, simulation exercises, and studies that employ government laboratory scientists; subject matter experts; and, students of science, technology, engineering, and math disciplines.  Red teaming events range from distributed table-top games to simulated and live field exercises with non-traditional and operationally experienced participants.  Deliverables include characterizations of future prototypes, requirement definitions, recommendations on system operational employment, potential vulnerabilities, and likely countermeasures that could be taken by the threat as well as potential counter-countermeasures to increase functionality or operational effectiveness of the system.  The USD(R&E) will leverage these products to inform how technologies and integrated systems can perform in hostile environments and develop new CONOPS."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.886"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.886"
                                            },
                                            "Text": {
                                                "val": "Investment decisions for red teaming are made during the execution year in response to Department, Combatant Command, Service, and other government organization priorities and as new threats emerge or new opportunities are presented.  In FY 2021, this project anticipants funding five to ten efforts to investigate red and blue impacts of technologies associated with DoD modernization priorities.  Potential projects include assessments and demonstrations of electronic warfare capabilities and weaknesses; operations with high-bandwidth over-the-horizon networked communications; emerging near-peer counters in the areas of fully networked, smart devices; quantum sensors; autonomous solutions for contested logistics; and other potential counters to future U.S. technology investments.  Project selection will be guided by DoD modernization priorities, the National Defense Strategy, and priorities and gaps identified by the Department, Combatant Commands, Services, other government organizations, FFRDCs, academia, and industry as new threats emerge or new opportunities are presented."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program element 0603338D8Z Defense Modernization and Prototyping is a new funding line for FY 2021."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}