{
    "id": "2021-OperationalTestandEvaluationDefense-PB-0460-JBOOK-a109403e27ede1e58bf15ba424915305238236ce48fa853e56cfadac04a25afc-2",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OTANDE-U_RDTE_JustificationBook_Operational_Test_and_Evaluation__Defense_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Operational_Test_and_Evaluation__Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Operational Test and Evaluation, Defense",
        "appropriation_code": "0460",
        "appropriation_name": "Operational Test and Evaluation, Defense"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605814OTE"
        },
        "ProgramElementTitle": {
            "val": "Operational Test Activities and Analyses"
        },
        "R1LineNumber": {
            "val": "3"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Operational Test and Evaluation, Defense"
        },
        "AppropriationCode": {
            "val": "0460"
        },
        "AppropriationName": {
            "val": "Operational Test and Evaluation, Defense"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "66.447"
            },
            "PriorYear": {
                "val": "226.984"
            },
            "CurrentYear": {
                "val": "65.237"
            },
            "BudgetYearOne": {
                "val": "39.136"
            },
            "BudgetYearOneBase": {
                "val": "39.136"
            },
            "BudgetYearTwo": {
                "val": "43.526"
            },
            "BudgetYearThree": {
                "val": "31.742"
            },
            "BudgetYearFour": {
                "val": "33.493"
            },
            "BudgetYearFive": {
                "val": "34.800"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Operational Test Activities and Analyses (OTA&A) programs are continuing efforts that provide management and oversight of test and evaluation functions and expertise to the Department of Defense (DoD).  The OTA&A programs consist of three activities:  Joint Test and Evaluation (JT&E); Threat Systems (TS); and Center for Countermeasures (CCM).\n\nJoint Test and Evaluation projects are test and evaluation activities conducted in a joint military environment that develop process improvements.  These multi-Service projects, chartered by the Office of the Secretary of Defense and coordinated with the Joint Staff, appropriate combatant commanders, and the Services, provide non-materiel solutions that improve:  joint interoperability of Service systems, technical and operational concepts, joint operational issues, development and validation of joint test methodologies, and test data for validating models, simulations, and test beds.  New projects are also encouraged to align their efforts to supporting the 2018 National Defense Strategy.  The JT&E projects address relevant joint war fighting issues in a joint test and evaluation environment by developing and providing new tactics, techniques, and procedures to improve joint capabilities and methodologies.\n\nThreat Systems, based on a memorandum of agreement between the Director, Operational Test and Evaluation (DOT&E) and the Defense Intelligence Agency, provides DOT&E support in the areas of threat resource analysis, intelligence support and threat systems investments.  As DOT&E’s agent, Threat Systems provides threat resource analyses on the availability, capabilities and limitations of threat representations (threat simulators, targets, models, U.S. surrogates, and foreign materiel) and analysis of test resources used for operational testing to support DOT&E’s assessment of the adequacy of testing for those programs designated for oversight by DOT&E and the Office of the Under Secretary of Defense Acquisition and Sustainment (OUSD (A&S)).  Threat Systems provides DOT&E action officers and other DOT&E activities with program specific threat intelligence support.  Threat Systems also funds management, oversight, and the actual development of common-use threat specifications for threat simulators, threat representative targets, and digital threat models used for test and evaluation.\n\nThe Center, a Joint Service Countermeasure (CM) Test & Evaluation (T&E) Activity, directs, coordinates, supports, and conducts independent countermeasure\/counter-countermeasure (CCM) T&E activities of U.S. and foreign weapon systems, subsystems, sensors, and related components. The Center accomplishes this work in support of DOT&E, Deputy Assistant Secretary of Defense (DASD) for Developmental Test and Evaluation (DT&E), weapon system developers, and the Services. The Center’s testing and analyses directly supports operational effectiveness and suitability evaluations of CM\/CCM systems, such as missile warning and aircraft survivability equipment (ASE), used on rotary-wing and fixed-wing aircraft. The Center develops unique CM\/CCM test equipment to support testing in operationally realistic environments. The Center determines the effectiveness of precision-guided weapon (PGW) systems and subsystems when operating in an environment degraded by CMs. Analysis and recommendations on CM\/CCM effectiveness are provided to Service Program Offices, DOT&E, DASD (DT&E), and the Services. The Center also supports Service member exercises, training, and pre-deployment activities with expertise on CM\/CCM technology and capabilities.\n\nThis Program Element includes funds to obtain Federally Funded Research and Development support and travel funds."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "66.984"
                },
                "CurrentYear": {
                    "val": "58.737"
                },
                "BudgetYearOne": {
                    "val": "57.896"
                },
                "BudgetYearOneBase": {
                    "val": "57.896"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "226.984"
                },
                "CurrentYear": {
                    "val": "65.237"
                },
                "BudgetYearOne": {
                    "val": "39.136"
                },
                "BudgetYearOneBase": {
                    "val": "39.136"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "160.000"
                },
                "CurrentYear": {
                    "val": "6.500"
                },
                "BudgetYearOne": {
                    "val": "-18.760"
                },
                "BudgetYearOneBase": {
                    "val": "-18.760"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "160.000"
                    },
                    "CurrentYear": {
                        "val": "6.500"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Due to the Defense-wide Review (DWR), the Joint Test and Evaluation Program (JT&E) was divested"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-26.800"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-26.800"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Additional Funding for Test and Evaluation for Directed Energy Weapons"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "8.040"
                                },
                                "BudgetYearOneBase": {
                                    "val": "8.040"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019 Congressional add for Test and Evaluation Infrastructure +150M\nFY 2019 Congressional add for Advanced Satellite Navigation Receiver +$10M\nFY 2020 Congressional add for Advanced Satellite Navigation Receiver +$5M\nFY 2020 Congressional add for Cyber Talent Recruitment Initiative +$1.5M\nFY 2021 Due to the Defense-wide Review (DWR), the Joint Test and Evaluation Program (JT&E) was divested\nFY 2021 Additional Funding for Test and Evaluation for Directed Energy Weapons"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "000920"
                    },
                    "ProjectTitle": {
                        "val": "OTA&A"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "66.447"
                        },
                        "PriorYear": {
                            "val": "226.984"
                        },
                        "CurrentYear": {
                            "val": "65.237"
                        },
                        "BudgetYearOne": {
                            "val": "39.136"
                        },
                        "BudgetYearOneBase": {
                            "val": "39.136"
                        },
                        "BudgetYearTwo": {
                            "val": "43.526"
                        },
                        "BudgetYearThree": {
                            "val": "31.742"
                        },
                        "BudgetYearFour": {
                            "val": "33.493"
                        },
                        "BudgetYearFive": {
                            "val": "34.800"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Operational Test Activities and Analyses (OTA&A) programs are continuing efforts that provide management and oversight of test and evaluation functions and expertise to the Department of Defense (DoD).  The OTA&A programs consist of three activities:  Joint Test and Evaluation (JT&E); Threat Systems (TS); and, the Center for Countermeasures (CCM)."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase for T&E Infrastructure"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "150.000"
                                        },
                                        "Text": {
                                            "val": "DOT&E is developing critical test capabilities needed to test hypersonics, directed energy, advanced computing\/big data analytics, artificial intelligence\/machine learning, and autonomy\/robotics."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Satellite Navigation Receiver"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "DOT&E is developing the preliminary design of 6 Degrees of Freedom Time Space Position Information (TSPI) Advanced Satellite Navigation Receiver (ASNR) for dynamic TSPI collection by DOT&E labs, facilities, ranges, and partners including \"Five Eyes\" (FVEY) and North American Treaty Organization (NATO) partners. In FY 2019, the team initiated development of the advanced Global Navigation Satellite System (GNSS) receiver, developed solver, validation, and estimation models, issued requests for acquisition of multi-axis rate table and GNSS Global Positioning System (GPS) Simulator, issued the tech package to antenna manufacturer, and presented the project to NATO for partner input."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "In FY 2020 DOT&E is developing the Advanced Satellite Navigation Receiver System-level Telemetry Kit with development and prototyping of GNSS\/GPS sensor and Inertial Measurement Unit (IMU) sensor. DOT&E will also design and develop the Ground Control System to include post-processing hardware and software development of post-processing applications and refinement and integration of models. Finally, DOT&E will resolve issues with encryption requirements (desired for NSA implementation on US and NATO ranges)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber talent recruitment initiative"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "1.500"
                                        },
                                        "Text": {
                                            "val": "In FY 2020, DOT&E will implement a pilot program to provide scholarships through qualified institutions of higher education, including community colleges, to students who are enrolled in programs that lead to degrees or specialized program certifications in the cybersecurity field that support Department of Defense requirements."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational Test Activities and Analyses"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "66.984"
                                            },
                                            "Text": {
                                                "val": "Joint Test and Evaluation (JT&E)\nIn FY 2019, JT&E will close one project that started in FY 2016 and two projects that started in FY 2017. The first is the Joint Counterair Integration Joint Test, which closed in November 2018. It developed and tested techniques, tactics, and procedures (TTP) for counterair shooter and command and control operators to effectively integrate joint defensive counterair resources in a contested, degraded, and operationally limited environment to protect defended assets from expected threats. The second project is the Joint Cyber Insider Threat Joint Test, which closed November 2018. It developed and tested procedures to proactively detect and respond to cyber insider threats before they have an adverse impact on military operations. The last project expected to close in FY 2019 is the Joint Interoperability for Medical Transport Missions Joint Test, which is anticipated to close in September 2019.  It is developing, testing, and evaluating TTP that enable access to medical information existing in various systems across the DoD and procedures for using that information in the patient movement coordination and validation process.  Two projects that started in FY 2018 will continue through FY 2019. Four new feasibility studies are expected to be conducted in FY 2019 of which two will be selected to conduct joint tests.\n\nThreat Systems\nIn FY 2019, Threat Systems will continue test planning working group participation and perform technical analyses to identify threat shortfalls; conduct special studies and provide current intelligence support tailored to specific U.S. weapon systems acquisitions based on the availability of funding. Threat Systems will:\n- Continue to support the US warfighter by providing threat intelligence relevant to emerging threats such as artificial intelligence (AI), autonomy, robotics, machine learning (ML), quantum computing, lasers, nanotechnology, chemical and biological, directed energy, hypersonic and biotechnology to ensure operational and developmental testing occurs against realistic threat representations, including (but not limited to) threats from both revisionist powers such as China and Russia, threats from rogue regimes such as North Korea and Iran, and threats from non-state actors.\n- Continue to provide intelligence support to DOT&E staff to address specific questions on threat systems affecting programs on the OSD T&E Oversight list and provide briefings and special intelligence reports when necessary.\n- Continue to conduct threat intelligence investigations that support use of innovative technologies in the areas of AI, autonomy, robotics, ML, quantum computing, lasers, nanotechnology, chemical and biological, directed energy, hypersonic and biotechnology being developed by nation states to improve threat representation in the contested domain of air, land, sea, space and cyberspace.\n- Continue identifying initiatives to improve cyberspace threat representation and prediction, cyber-economic threats to DoD systems, and scalable cyberspace threat test environments that can interface with cyber test networks.\n- Continue identifying initiatives to conduct offensive cyber operations (OCO) and defensive cyber operations (DCO) without significantly impacting critical operational capabilities.\n- Continue initiatives to improve satellite and space threat representations.\n- Continue to sustain and manage threat modelling and simulation (M&S) to support test and evaluation by overseeing and coordinating intelligence community developed threat models, performing threat model anomaly resolution resolving differences from live fire testing, integrating threat models into T&E facilities and distributing performance and signature models to T&E users.\n- Continue to represent DOT&E at foreign material exchanges, inter-agency coordinating groups, and non-proliferation groups to raise awareness of T&E needs for foreign materiel, coordinate service requirements, and de-conflict and prioritize foreign materiel requirements for T&E.\n- Continue providing DOT&E representative support at the Threat Steering Group (TSG) in the transitioning of the System Threat\nAssessment Reports (STARS) to the new Validated Online Lifecycle Threat (VOLT) Report process.\n- Continue to represent DOT&E interests on Acquisition\/Intelligence\/ Requirement Task Force (AIRTF) and Executive Steering\nGroup (AIRESG) and provide access to the Intelligence Mission Data Management Analysis & Reporting System (IMARS).\n- Manage Integrated Technical Evaluation and Analysis of Multiple Sources (ITEAMS) efforts supporting programs on the OSD\nOversight T&E List by conducting intelligence “deep dives” to produce intelligence in sufficient detail to develop new threat test assets.\n- Review validation reports to independently ensure the correct threat data and critical parameters are presented in the report to assess the threat representations’ capabilities to replicate a real world threat system.\n- Represent DOT&E at the Intelligence Mission Data Oversight Board responsible for development, production and sharing issues affecting the intelligence data supporting weapons systems acquisition.\n- Oversee legacy DOT&E investments and continue management and oversight of legacy and new Test Resource Management\nCenter-funded threat system investments.\n- Continue ITEAMS efforts leading to the development of new threat systems for T&E.\n- Continue reviewing Services’ Threat Systems investments to prevent any duplication of effort and encourage cost savings by the sharing or multi-service use of newly developed threat representations to T&E.\n- Continue to foster rapid technological advancements in the areas of threat representation for T&E and threat test resources by incorporating innovative technologies from the intelligence community into threat test assets to provide improved test fidelity and performance at lower cost\nThreat Systems will continue its efforts to maintain a standard set of threat performance models. These activities help DOT&E carry out its Title 10 responsibilities to assess test adequacy and determine whether testing is realistic and suitable, and promotes common solutions to Service threat representation needs.\n\nThe Center\nThe Center’s core mission to support T&E of aircraft survivability equipment (ASE) directly leads to a ‘more lethal force’ by enabling the survivability of aircraft in a threat environment. Survivability enables mission success. The Center expects to conduct, analyze, and report on more than 40 tests, with 31 requests for test support already under consideration or planned. Most testing will focus on aircraft survivability, with a focus on Joint Urgent Operational Needs Statement (JUONS) and Urgent Universal Needs Statement (UUNS), warning and targeting systems, warfighter training events, and precision guided weapons. The Center will provide the programs with an independent assessment of our data\/findings for CM\/CCM evaluations. The Center will continue to emphasize support of the DOT&E enterprise, with a clear focus on Title 10 oversight, aircraft survivability, and warfighter training events. Furthermore, the Center will continue to provide CM expertise in pre-deployment events and training, as well as CM\/CCM-focused training, tactics and procedures (TTP) development. Our support will be distributed across all the Services, as well as intelligence agencies and research and development activities. These activities will help to enhance and support the survivability of equipment, aircraft and personnel.  \n\nThe Center will continue to build upon Improvement and Modernization (I&M) efforts from FY 2018 to improve T&E capabilities. Specifically the emitters for the missile plume simulators will be upgraded to increase threat fidelity. The Center is undertaking the Joint Standard Instrumentation Suite (JSIS) project to collect threat signature and fly out data to improve infrared-guided threat models.  These models form the basis for a significant portion of ASE T&E.  JSIS reached initial operational capability this year to start initial data collection at threat live fire events. The JSIS full operational capability development will begin this fiscal year.\n\nIn addition, the Center supports each Service’s ASE programs with its unique test equipment, which reduces duplicate T&E capabilities.  This benefit, along with the transportability of the Center’s unique test equipment, provides DoD a cost savings that results in ‘greater performance and affordability’. The Center will provide expertise to many organizations, including program offices and other T&E agencies. \n\nInternationally, the Center will continue to \"Strengthen Alliances and attract new partners\" through collaborative international T&E efforts. The Center serves as the Steering Committee chair and actively participates in the Air Electronic Warfare Cooperative Test and Evaluation Project Arrangement with Australia, Canada, Great Britain and the U.S. Also, the Center supports international cooperative efforts through direct country-to-country T&E activities and continued involvement in the following groups:  NATO SUB-GROUP\/2 and NATO’s Aerospace Capabilities Group 3 (Air Survivability)\/Subgroup 2 (EW Self-Protection Measures for Joint Services Airborne Assets). \n\nDomestically, the Center will continue our involvement in the following panels, committees and working groups:  Joint Expendable Countermeasure (JECM) Integrated Product Team, Multi Sensing Symposia (MSS) Joint Infrared Countermeasures (IRCM) Working Group, JASP, Foreign Material Exploitation Working Group, Foreign Material Program T&E Subcommittee, and Joint Countermeasures T&E Working Group (JCMT&E WG)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "58.737"
                                            },
                                            "Text": {
                                                "val": "Joint Test and Evaluation (JT&E)\nAs a result of the Defense-Wide Review (DWR), the JT&E Program will be divested by the end of FY 2020.  JT&E plans to complete test projects scheduled for completion in FY 2020 and conduct early close-down of remaining projects providing interim products to the warfighting customer.  JT&E will completely shut down the program by closing facilities, terminating contracts, transitioning government personnel to new jobs in the DoD, and terminating all service Memorandums of Agreement (MOAs)\/ Memorandums of Understanding (MOUs), and all support contracts.  \n\nJT&E will complete or close down four Joint Test, seven Quick Reaction Tests, and one Special Project.  The four Joint Tests are: Joint Laser Systems Effectiveness, Multi-Domain Unified Situational Awareness, Joint – Hypersonic Strike Planning, Execution, Command and Control, and Joint Interoperability through Data Centricity.  \n\nThe seven Quick Reaction Tests are:  Joint Chemical Biological Radiological Nuclear (CBRN) Tactical Information Management, Joint Enterprise Data Interoperability, Joint Aviation Multi-Ship Integrated Air Defense System (IADS) Survivability Validation, Situational Positioning of LD2 Intelligence, Surveillance and Reconnaissance (ISR) - CONOPS Evolution, Joint Military Application of the Space Environment, Integration of small Unmanned Aircraft Systems into Joint Airspace, and Joint\/Interagency - Ground Air Transponder Operational Risk Reduction.  \n\nThe Special Project is Joint Alerting for Survivability and Endurability. \n\nThreat Systems\nIn FY 2020, Threat Systems will continue test planning working group participation and perform technical analyses to identify threat shortfalls; aligns with the National Defense Strategy (NDS) requirements; conduct special studies and provide current intelligence support tailored to specific U.S. weapon systems acquisitions based on the availability of funding. Threat Systems will:\n- Continue to support the reduction in acquisition and test timelines while increasing test capabilities against near-peer threats.\n- Increase understanding of near-pear threats (to include cyber) via testing with artificial intelligence (AI), machine learning (ML), and neural networks.\n- Continue development of an Advanced Satellite Navigation Receiver (ASNR) for an open service Global Positioning System \/ Inertial Measurement Unit (GPS\/IMU) coupled high-fidelity, high dynamic next generation Time Space Position Information (TSPI) system to support future missile tests and Joint Standard Instrumentation Suite (JSIS) flight testing.  \n- Continue to support the US warfighter by providing threat intelligence relevant to emerging threats such as artificial intelligence autonomy, robotics, directed energy, hypersonic and biotechnology to ensure operational and developmental testing occurs against realistic threat representations, including (but not limited to) threats from both revisionist powers such as China and Russia, threats from rogue regimes such as North Korea and Iran, and threats from non-state actors.\n- Continue to support initiatives for the development of near-pear threat representative jammers, for use in terrain constricted tests as a directional active electronically steered array jammer that will limit Federal Aviation Administration and other common jammer restrictions.\n- Continue initiatives to improve satellite and space threat representations.\n- Continue to sustain and manage threat modelling and simulation (M&S) to support test and evaluation by overseeing and coordinating intelligence community developed threat models, performing threat model anomaly resolution resolving differences from live fire testing, integrating threat models into T&E facilities and distributing performance and signature models to T&E users.\n- Continue to represent DOT&E at foreign material exchanges, inter-agency coordinating groups, and non-proliferation groups to raise awareness of T&E needs for foreign materiel, coordinate service requirements, and de-conflict and prioritize foreign materiel requirements for T&E.\n- Continue to provide intelligence support to DOT&E staff to address specific questions on threat systems affecting programs on the OSD T&E Oversight list and provide briefings and special intelligence reports when necessary.\n- Continue to conduct threat intelligence investigations that support use of innovative technologies in the areas of artificial intelligence (AI), autonomy, robotics, machine learning (ML), quantum computing, lasers, nanotechnology, chemical and biological, directed energy, hypersonic and biotechnology being developed by nation states to improve threat representation in the contested domain of air, land, sea, space and cyberspace.\n- Continue identifying initiatives to improve cyberspace threat representation and prediction, cyber-economic threats to DoD systems, and scalable cyberspace threat test environments that can interface with cyber test networks.\n- Continue identifying initiatives to conduct offensive cyber operations (OCO) and defensive cyber operations (DCO) without significantly impacting critical operational capabilities.\n- Continue providing DOT&E representative support at the Threat Steering Group (TSG) in the transitioning of the System Threat Assessment Reports (STARS) to the new Validated Online Lifecycle Threat (VOLT) Report process.\n- Continue to represent DOT&E interests on Intelligence Acquisition Agility Working Group (IAAWG) and Executive Steering Group (ESG) and provide access to the Intelligence Mission Data Management Analysis & Reporting System (IMARS).\n- Manage Integrated Technical Evaluation and Analysis of Multiple Sources (ITEAMS) efforts supporting programs on the OSD Oversight T&E List by conducting intelligence “deep dives” to produce intelligence in sufficient detail to develop new threat test assets.\n- Review validation reports to independently ensure the correct threat data and critical parameters are presented in the report to assess the threat representations’ capabilities to replicate a real world threat system.\n- Represent DOT&E at the Intelligence Mission Data Oversight Board responsible for development, production and sharing issues affecting the intelligence data supporting weapons systems acquisition.\n- Oversee legacy DOT&E investments and continue management and oversight of legacy and new Test Resource Management Center-funded threat system investments.\n- Continue ITEAMS efforts leading to the development of new threat systems for T&E.\n- Continue reviewing Services’ Threat Systems investments to prevent any duplication of effort and encourage cost savings by the sharing or multi-service use of newly developed threat representations to T&E.\n- Continue to foster rapid technological advancements in the areas of threat representation for T&E and threat test resources by incorporating innovative technologies from the intelligence community into threat test assets to provide improved test fidelity and performance at lower cost.\nThreat Systems will continue its efforts to continually improve the standards set of threat performance models as the global threat environment evolves. With adequate funding, these activities help DOT&E carry out its Title 10 responsibilities to assess test adequacy and determine whether testing is realistic and suitable, promotes common solutions to Service threat representation needs and ultimately supports the warfighter.\n\n\nThe Center\nThe Center will test, analyze, and report on more than 30 systems\/platforms. Testing will focus on directed energy weapon systems, counter-unmanned aerial systems (CUAS), aircraft survivability equipment (with a focus on Joint Urgent Operational Need (JUON) and Urgent Universal Need Statement (UUNS) programs), and pre-deployment warfighter training exercises. High priority programs will receive an independent assessment of our data\/findings for CM\/CCM evaluations. Our support will be distributed across all the Services, as well as intelligence agencies and research and development activities. These activities will help to enhance and support the survivability of equipment, aircraft and personnel. \n\nThe Center will build upon improvement and modernization efforts from FY 2019 to improve T&E capabilities. Specifically, the missile plume simulator smart emitter upgrades are expected to be completed by the end of FY 2020. The implementation of JSIS Full Operational Capability (FOC) will add signature instrumentation focused on emerging programs, additional instrumentation to support data collection for multiple, concurrent events, instrumentation to support static live fire events, and full trajectory coverage for missile attitude related data collection. The Center will continue its involvement in the Directed Energy (DE) community as an active participant in the DE Instrumentation Initiative review panel. The Center will also lead the development of the High Energy Laser Remote Target Scoring (HRTS) project and partner with other T&E investment programs.\nThe Center will continue to support international T&E collaborative efforts. In addition, the Center will continue support of domestic panels, committees and working groups."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "39.136"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "39.136"
                                            },
                                            "Text": {
                                                "val": "Threat Systems\nIn FY 2021, Threat Systems will continue test planning working group participation and perform technical analyses to identify threat shortfalls; aligns with the National Defense Strategy (NDS) requirements; conduct special studies and provide current intelligence support tailored to specific U.S. weapon systems acquisitions based on the availability of funding. Threat Systems will:\n- Continue to support the reduction in acquisition and test timelines while increasing test capabilities against near-peer threats.\n- Continue to understand and address near-pear threats (to include cyber) via testing with artificial intelligence (AI), machine learning (ML), and neural networks.\n- Complete development of an Advanced Satellite Navigation Receiver (ASNR) for an open service Global Positioning System \/ Inertial Measurement Unit (GPS\/IMU) coupled high-fidelity, high dynamic next generation Time Space Position Information (TSPI) system to support future missile tests and Joint Standard Instrumentation Suite (JSIS) flight testing.  \n- Continue to support the US warfighter by providing threat intelligence relevant to emerging threats such as artificial intelligence, autonomy, robotics, directed energy, hypersonic and biotechnology to ensure operational and developmental testing occurs against realistic threat representations, including (but not limited to) threats from both revisionist powers such as China and Russia, threats from rogue regimes such as North Korea and Iran, and threats from non-state actors.\n- Continue to support initiatives for the development of near-pear threat representative jammers, for use in terrain constricted tests as a directional active electronically steered array jammer that will limit Federal Aviation Administration and other common jammer restrictions.\n- Continue initiatives to improve satellite and space threat representations.\n- Continue to sustain and manage threat M&S to support test and evaluation by overseeing and coordinating intelligence community developed threat models, performing threat model anomaly resolution resolving differences from live fire testing, integrating threat models into T&E facilities and distributing performance and signature models to T&E users.\n- Continue to represent DOT&E at foreign material exchanges, inter-agency coordinating groups, and non-proliferation groups to raise awareness of T&E needs for foreign materiel, coordinate service requirements, and de-conflict and prioritize foreign materiel requirements for T&E.\n- Continue to provide intelligence support to DOT&E staff to address specific questions on threat systems affecting programs on the OSD T&E Oversight list and provide briefings and special intelligence reports when necessary.\n- Continue to conduct threat intelligence investigations that support use of innovative technologies in the areas of artificial intelligence (AI), autonomy, robotics, machine learning (ML), quantum computing, lasers, nanotechnology, chemical and biological, directed energy, hypersonic and biotechnology being developed by nation states to improve threat representation in the contested domain of air, land, sea, space and cyberspace.\n- Continue identifying initiatives to improve cyberspace threat representation and prediction, cyber-economic threats to DoD systems, and scalable cyberspace threat test environments that can interface with cyber test networks.\n- Continue identifying initiatives to conduct offensive cyber operations (OCO) and defensive cyber operations (DCO) without significantly impacting critical operational capabilities.\n- Continue providing DOT&E representative support at the Threat Steering Group (TSG) in the transitioning of the System Threat Assessment Reports (STARS) to the new Validated Online Lifecycle Threat (VOLT) Report process.\n- Continue to represent DOT&E interests on the Intelligence Acquisition Agility Working Group (IAAWG) and Executive Steering Group (ESG) and provide access to the Intelligence Mission Data Management Analysis & Reporting System (IMARS).\n- Continue to manage Integrated Technical Evaluation and Analysis of Multiple Sources (ITEAMS) efforts supporting programs on the OSD Oversight T&E List by conducting intelligence “deep dives” to produce intelligence in sufficient detail to develop new threat test assets.\n- Continue to review validation reports to independently ensure the correct threat data and critical parameters are presented in the report to assess the threat representations’ capabilities to replicate a real world threat system.\n- Continue to represent DOT&E at the Intelligence Mission Data Oversight Board responsible for development, production and sharing issues affecting the intelligence data supporting weapons systems acquisition.\n- Oversee legacy DOT&E investments and continue management and oversight of legacy and new Test Resource Management Center-funded threat system investments.\n- Continue ITEAMS efforts leading to the development of new threat systems for T&E.\n- Continue reviewing Services’ Threat Systems investments to prevent any duplication of effort and encourage cost savings by the sharing or multi-service use of newly developed threat representations to T&E.\n- Continue to foster rapid technological advancements in the areas of threat representation for T&E and threat test resources by incorporating innovative technologies from the intelligence community into threat test assets to provide improved test fidelity and performance at lower cost\nThreat Systems will continue its efforts to continually improve the standards set of threat performance models as the global threat environment evolves. With adequate funding, these activities help DOT&E carry out its Title 10 responsibilities to assess test adequacy and determine whether testing is realistic and suitable, promotes common solutions to Service threat representation needs and ultimately supports the warfighter.\n\nThe Center\nThe Center will continue to emphasize support of the DOT&E enterprise, with a clear focus on Title 10 oversight programs, DE, CUAS, aircraft survivability, and warfighter training events. The Center expects to increase focus on Directed Energy Weapons and other critical technology areas, which will contribute to the testing of future weapons and the understanding of emerging threats.  The Center’s ability to provide unique test equipment and expertise will remain a benefit to all Services, and the ongoing Improvement and Modernization plans will ensure test capabilities are provided at a cost savings across the DoD. Additional instrumentation, personnel, and training will be key to ensuring our ongoing test support continues to add significance in emerging technology areas.\n\nIn FY 2021 The Center will build critical test and evaluation capabilities and the workforce necessary to evaluate emerging Directed Energy Weapon (DEW) war fighting technologies. This includes mobile, open-air DEW data collection and analysis capabilities that will support the test & evaluation (T&E) of the rapid prototyping and fielding needs of these systems. The mobile test capability will allow T&E of operational representative test scenarios in an open air environment to support the accelerated development and fielding of DEW within the DoD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2020 to FY 2021 of -$19.601 Million is consistent with the divestment of the JT&E program due to the Defense-Wide review (DWR) and the addition of funds for Test and Evaluation of Directed Energy Weapons"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}