{
    "id": "2021-Navy-PB-1319-JBOOK-7db8e596d0ddeb1f5b53adfad61b01414eb438597126a733951e3c67dba6beab-12",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA6-U_RDTE_JustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605863N"
        },
        "ProgramElementTitle": {
            "val": "RDT&E Ship & Aircraft Support"
        },
        "R1LineNumber": {
            "val": "183"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "100.950"
            },
            "CurrentYear": {
                "val": "93.872"
            },
            "BudgetYearOne": {
                "val": "104.822"
            },
            "BudgetYearOneBase": {
                "val": "104.822"
            },
            "BudgetYearTwo": {
                "val": "105.814"
            },
            "BudgetYearThree": {
                "val": "106.825"
            },
            "BudgetYearFour": {
                "val": "107.347"
            },
            "BudgetYearFive": {
                "val": "109.494"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This continuing program provides support for the ships, Self Defense Test Ship and aircraft required to accommodate Research, Development, Test and Evaluation (RDT&E) of new systems.  The RDT&E ship and aircraft inventory is required to adequately test modifications and improvements to fielded weapon systems and sensors and new weapon systems and sensors and evaluate modifications to address new threat capabilities to increase the warfighting capability of the fleet.  The program provides integrated logistics support for aircraft at selected field activities, provides depot-level maintenance of aircraft, engines and components for the Navy's inventory of RDT&E aircraft; and provides support for DON ships and aircraft in the custody of contractors in support of RDT&E.  Cost covered under this element include test execution for the Air Warfare Ship Self-Defense Enterprise, aircrew training and proficiency, fuel, supplies, equipment, repair and Aviation Depot Level Repairables, as well as organizational, intermediate and depot maintenance of aircraft in the Navy RDTE inventory and the Self Defense Test Ship. \n\nJUSTIFICATION FOR BUDGET ACTIVITY: This program is funded under RESEARCH, DEVELOPMENT, TEST and EVALUATION MANAGEMENT SUPPORT because it supports efforts directed toward sustaining or modernizing installations or operations required for general research, development, test and evaluation."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "97.471"
                },
                "CurrentYear": {
                    "val": "93.872"
                },
                "BudgetYearOne": {
                    "val": "104.982"
                },
                "BudgetYearOneBase": {
                    "val": "104.982"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "100.950"
                },
                "CurrentYear": {
                    "val": "93.872"
                },
                "BudgetYearOne": {
                    "val": "104.822"
                },
                "BudgetYearOneBase": {
                    "val": "104.822"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "3.479"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.160"
                },
                "BudgetYearOneBase": {
                    "val": "-0.160"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "4.058"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.580"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.150"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.150"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.010"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.010"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Project 0568: Budget increase of $4.157M from FY20 to FY21 reflects increased costs associated with Fuel, Consumable Parts and organizational maintenance in support of monthly readiness flight hour requirements for NAVAIR test pilots supporting RDT&E of Navy aviation programs.  Increase is based on assessment of FY21 program workload to ensure assigned test pilots accrue a minimum of 11 hours per month between program funded test flights and the 0568 project unit, in order to meet Fleet directed minimum flight hour requirements to ensure safety, reduce the risk of aviation mishaps and ensure proficient test pilots are available to support test and evaluation of aviation acquisition programs. \n\nProject 0569: Budget increase of $5.915M from FY20 to FY21 reflects increased costs associated with depot maintenance of NAVAIR RDT&E Aircraft. Specifically accounts for increase in costs associated with Planned Depot Maintenance of two KC-130T aircraft and the cost associated with the Planned Depot Maintenance for two E-2D aircraft which were extended in the RDT&E aircraft inventory to support developmental test of planned E-2D upgrades and associated cost increases in Aviation Depot Level Repairable (AVDLR) items which are found deficient during test pilot proficiency\/readiness flights on associated type \/ model \/ series aircraft in the RDT&E aircraft inventory.  \n\nProject 2924: The 2017 Board of Inspection and Survey (INSURV) report identified numerous material issues that has resulted in an increase in the required labor and consumable parts to accomplish routine preventive maintenance to prevent recurrence of identified deficiencies and material degradation of Self Defense Test Ship Hull, Mechanical and Electrical (HM&E) systems.  FY2019 funding increase of $4.100M was to accomplish emergent repairs to the Port and Starboard Shaft Bearings.  Without the increase in funding, the Self Defense Test Ship would be unable to get underway for at sea operations to support CVN 78 and DDG 1000 ship self-defense testing.  \n\nProject 3206 FY21 decrease of $0.150M is due to funding reduction rephased into FY22.\n\nProject 3238: Project was established to support the Acquisition Threat Evaluation Projects (ATEP). Funding was realigned within the PE from project 3206 T&E Enterprise. \n\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0568"
                    },
                    "ProjectTitle": {
                        "val": "RDT&E Acft Flt Hours"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "33.895"
                        },
                        "CurrentYear": {
                            "val": "33.543"
                        },
                        "BudgetYearOne": {
                            "val": "37.700"
                        },
                        "BudgetYearOneBase": {
                            "val": "37.700"
                        },
                        "BudgetYearTwo": {
                            "val": "38.582"
                        },
                        "BudgetYearThree": {
                            "val": "39.012"
                        },
                        "BudgetYearFour": {
                            "val": "38.178"
                        },
                        "BudgetYearFive": {
                            "val": "38.941"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Research, Development, Test and Evaluation (RDT&E) Aircraft Flight Hours.  This non-acquisition project supports direct flight hour costs associated with NAVAIR test pilot proficiency flights, including organizational and intermediate maintenance, associated consumables, including petroleum, oil and lubricants.  Annual test pilot flight hours, as delineated in OPNAVINST 3710.7 are satisfied through a combination of program funded test flights, which vary year to year based on program schedules; and flights funded through this project unit to ensure a baseline level of pilot readiness. These flight hours ensure test pilots remain proficient in assigned type \/ model \/ series aircraft in which they are qualified (approximately 3 hours per month) during lulls in program test schedules to ensure proficient test pilots are available to safely support aviation program testing.  Readiness hours are designed to provide aircrew with a minimum of 11 flight hours per month, for a total of 133 hours annually.  Flight hours support post maintenance acceptance test flights, aircrew training and test pilot proficiency when test program demand is low, in direct support of Research and Development Programs at Naval Air Systems Command, and Office of Naval Research flight activities.   \n\nJUSTIFICATION FOR BUDGET ACTIVITY: This program is funded under RESEARCH, DEVELOPMENT, TEST and EVALUATION MANAGEMENT SUPPORT because it supports efforts directed toward sustaining or modernizing installations or operations required for general research, development, test and evaluation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RDT&E Acft Flt Hours"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "33.895"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "33.543"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to provide planned organizational and intermediate-level maintenance, supply and petroleum, oil and lubricants in support of RDT&E aircraft operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "37.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "37.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to provide organizational and intermediate-level maintenance, supply and petroleum, oil and lubricants in support of test pilot proficiency flights.  Increase in funding, funds readiness to 60% of the requirement.  Increase is based on assessment of FY21 program workload to ensure test pilots remain sufficiently proficient in order to meet  OPNAVINST 3710.7 requirements to ensure flight safety and to reduce the risk of aviation mishaps."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Budget increase of $4.157M from FY20 to FY21 reflects increased costs associated with Fuel and Consumable Parts in support of monthly readiness flight hour requirements for NAVAIR test pilots supporting RDT&E of Navy aviation programs.  Increase is based on assessment of FY21 program workload to ensure test pilots accrue a minimum of 11 hours per month between program funded test flights and the 0568 project unit in accordance with Fleet minimum flight hour requirements to ensure safety, reduce the risk of aviation mishaps and ensure proficient test pilots are available to support test and evaluation of aviation acquisition programs."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0569"
                    },
                    "ProjectTitle": {
                        "val": "RDT&E Acft Supt"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "39.991"
                        },
                        "CurrentYear": {
                            "val": "33.232"
                        },
                        "BudgetYearOne": {
                            "val": "39.142"
                        },
                        "BudgetYearOneBase": {
                            "val": "39.142"
                        },
                        "BudgetYearTwo": {
                            "val": "39.722"
                        },
                        "BudgetYearThree": {
                            "val": "40.308"
                        },
                        "BudgetYearFour": {
                            "val": "41.114"
                        },
                        "BudgetYearFive": {
                            "val": "41.937"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Research, Development, Test and Evaluation (RDT&E) Aircraft Support.  This continuing project funds costs associated with RDT&E of fixed and rotary wing aircraft which accommodate test and evaluation of aircraft and associated weapon systems and sensors.  Testing aboard dedicated RDT&E aircraft reduces the number of fleet units required to support test and evaluation of aviation programs. This project unit funds airframe Standard Depot Level Maintenance (SDLM), the Integrated Maintenance Concept and Planned Depot Maintenance, major in-service repairs, emergent repairs and aircraft engine periodic maintenance and overhauls and aircraft material condition and field inspections.  Also included in this project unit, are the costs of Aviation Depot Level Repairables (AVDLR), which are spare and replacement parts for components that fail during the conduct of readiness flight operations, aircrew training and proficiency flight hours, and must be replaced to support follow-on flight operations.  This project unit also funds Aircraft Structure Periodic Assessments (ASPA), Individual Material Readiness List (IMRL) tools and support equipment, Aviation Climate Assessment Survey System (ACASS) and other projects and peripheral equipment associated with the maintenance of flight readiness for RDT&E aircraft.   \n\nJUSTIFICATION FOR BUDGET ACTIVITY: This program is funded under RESEARCH, DEVELOPMENT, TEST and EVALUATION MANAGEMENT SUPPORT because it supports efforts directed toward sustaining or modernizing installations or operations required for general research, development, test and evaluation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aircraft\/Engine Maintenance and AVDLR\/IMRL Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "39.391"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "32.632"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to support RDT&E aircraft maintenance requirements, while funding the following sustainment costs: AVDLR\/IMRL in support of Pilot Readiness, engine repairs, support of aircraft in the RDT&E inventory.  Continue operation and implementation of maintenance and material management programs at Naval Air Warfare Center activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "38.542"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "38.542"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide support of RDT&E Aircraft planned depot maintenance availabilities while funding annual operating and sustainment costs associated with Aviation Depot Level Repairables (AVDLR) and Individual Material Readiness List (IMRL) items associated with test pilot proficiency flights, engine repairs and overhauls, and emergent repairs to RDT&E aircraft.  Execute Depot Availabilities for two KC-130Ts, newly established Planned Depot Maintenance activity for two E-2D aircraft, Engine Overhauls for the C-20G and Depot availabilities for eight F-18 variant aircraft and three MH-60S helicopters.  Continue operations and implementation of Naval Air Enterprise Naval Sustainment Systems in support of fleet aircraft readiness efforts."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Budget Increase of $5.910M from FY20 to FY21 reflects extensions in Fixed Induction Dates as a direct result of engineering evaluations, which resulted in the planned shift of depot events from FY20 to FY21 to support acquisition program flight test objectives.  The budget increase also addresses cost increases in depot maintenance events for two KC-130T's and accounts for a program of record increase in the RDT&E E-2D inventory from two aircraft to five aircraft, resulting in a Depot Maintenance cost increase in FY21.  Additional funding was added to address cost increases associated with Aviation Depot Level Repairables (AVDLR) which directly supports the monthly readiness flight hour requirements for NAVAIR test pilots on all type \/ model \/ series (T\/M\/S) aircraft in the RDTE aircraft inventory.  Cost increases in AVDLR components are a direct result of an increased failure rate and higher cost of parts due to aging airframes and the lack of sufficient T\/M\/S in the RDT&E inventory to support testing if parts are not replaced.  Funding also addresses \"as found\" conditions when the RDT&E aircraft are opened up for inspection and maintenance."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "In-Service Repairs"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to provide planned In-Service Repair funds for emergent repair requirements to aircraft performing mission critical test and evaluation projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to provide planned In-Service Repair funds for emergent repair requirements to aircraft performing mission critical test and evaluation projects."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2924"
                    },
                    "ProjectTitle": {
                        "val": "SDTS"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "14.563"
                        },
                        "CurrentYear": {
                            "val": "13.386"
                        },
                        "BudgetYearOne": {
                            "val": "12.607"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.607"
                        },
                        "BudgetYearTwo": {
                            "val": "12.400"
                        },
                        "BudgetYearThree": {
                            "val": "12.409"
                        },
                        "BudgetYearFour": {
                            "val": "12.657"
                        },
                        "BudgetYearFive": {
                            "val": "12.910"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides for the Hull Mechanical and Electrical (HM&E) and remote control system maintenance aboard the Self-Defense Test Ship (SDTS) in support of the Navy RDT&E of ship self-defense systems. Testing aboard this ship provides the capability to safely test self-defense weapon systems within their minimum range and reduces the number of fleet units required to support RDT&E efforts. \n\nFunds are used to purchase expendable supplies, routine equipment maintenance, and repairs and supporting services."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SDTS"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.563"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.386"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "NSWC PHD continues to conduct management, operation, maintenance and repair\/upgrade of ship HM&E critical items\nto ensure ongoing safe operation, and performance of the SDTS. Maintain, operate, configure and upgrade the TSRCS and\nassociated infrastructure in support of T&E requirements onboard SDTS to support the AW SSD Enterprise test requirements as well as surface ship combat system developmental test programs. Continue efforts to address issues identified by the INSURV report. Continue to improve the routine maintenance and repair efforts onboard SDTS."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.607"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.607"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "NSWC PHD continues to conduct management, operation, maintenance and repair\/upgrade of critical ship HM&E systems to ensure safe operation of the Self Defense Test Ship (SDTS).  Maintain, operate, configure and upgrade the Test Ship Remote Control System (TSCRS) and associated infrastructure in support of T&E requirements onboard the SDTS to support the Air Warfare Ship Self Defense Enterprise test requirements as well as surface ship combat system developmental test programs.  Continue to work outstanding maintenance and repair efforts and complete necessary repairs to clear any outstanding Departures from Specification (DFS)."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "$0.779M decrease in FY21 was due to a funding adjustment to account for maintenance that was accelerated into FY20.  FY21 effort will cover management, operation and routine and corrective maintenance necessary to keep the Self Defense Test Ship ready for at sea operations."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This line of accounting is for recurring HM&E and ship maintenance."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3206"
                    },
                    "ProjectTitle": {
                        "val": "T&E Enterprise"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "12.501"
                        },
                        "CurrentYear": {
                            "val": "13.511"
                        },
                        "BudgetYearOne": {
                            "val": "15.173"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.173"
                        },
                        "BudgetYearTwo": {
                            "val": "14.910"
                        },
                        "BudgetYearThree": {
                            "val": "14.896"
                        },
                        "BudgetYearFour": {
                            "val": "15.198"
                        },
                        "BudgetYearFive": {
                            "val": "15.502"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The intent of the T&E Enterprise is to consolidate all Air Warfare (AW) Ship Self Defense (SSD) at-sea testing across multiple class ships, beginning with LHD 8, LSD 52, LHA 6, DDG 1000, CVN 78, and Littoral Combat Ship (LCS). This consolidated AW SSD test and evaluation approach meets the Probability of Raid Annihilation (PRA) (PRA is defined as a required surface ship defense against Anti-Ship Cruise Missiles), Self Defense Test Ship (SDTS) testing requirements as outlined in Air Warfare Ship Self Defense Enterprise TEMP 1714, and lead\/operational ship testing requirements for Evolved Sea Sparrow Missile (ESSM) TEMP 1471, Rolling Airframe Missile (RAM) Blk 2 TEMP 286-2, DDG 1000 TEMP 1560, CVN 78 TEMP 1610, Cooperative Engagement Capability (CEC) TEMP 1415, SSDS TEMP 1400, LHA 6 TEMP 1697, AN\/SPQ-9B TEMP 1463, Surface Electronic Warfare Improvement Program (SEWIP) TEMP 1658 (Block 1A), and LCS TEMP 1695.\n\nEnterprise Cost elements:\n\na) SDTS Summary includes installation, check-out and stage testing of the major combat systems elements on the SDTS.\n\nb) SDTS Test includes tracking and firing exercises versus single and dual, subsonic and supersonic Anti-Ship Cruise Missile (ASCM) threat surrogates for ship classes in the Enterprise TEMP from the SDTS including:  LSD 52, DDG 1000, LCS and CVN 78.\n\nc) Lead Ship Test includes tracking and firing exercises versus single and dual, subsonic and supersonic ASCM threat surrogates for ship classes in the Enterprise TEMP from the Lead Ship including:  LSD 50, LCS and CVN 78.\n\nd) Testbed includes all modeling and simulation (M&S) costs required to create OT-quality digital representations of shipboard combat system performance including infrastructure, distributed secure network, common environmental services for Developmental Test (DT) and Operational Test (OT).\n\ne) Enterprise Testing and Planning includes the contractor and government costs to administer the Enterprise, collect and distribute data from live events, maintain Cybersecurity certifications, and financial management.\n\nf) Maintenance of Combat System (CS) includes the costs for the routine preventive maintenance and repairs of the Combat Systems elements on the SDTS.\n\nThe T&E Enterprise merges common ship, element, and system requirements into the least number of test events while leveraging planned Combat System Ship Qualification Trials (CSSQTs) to accomplish Developmental Testing (DT) and Operational Testing (OT) requirements. All tests on the SDTS require the sharing of infrastructure, missile range allocations, execution time and underway time to eliminate duplicative testing.  T&E Enterprise provides end-to-end mission Operational Testing in a realistic operational environment, capitalizing on Probability of Raid Annihilation Modeling and Simulation (M&S) data validated with results of that Operational and Live Fire Testing, and ensuring a consistent approach across ship classes. Applicability of all test events is beneficial across multiple ship classes with the same variation under test.\n\nCurrent funding levels do not provide funding for SDTS installation and check-out, SDTS Test, Lead Ship Test, or Testbed modeling and simulation (M&S) costs.  Current funding levels covers core support requirements only which covers combat system maintenance, cybersecurity of installed combat systems, test ship remote control system maintenance (shared with K2924), hardware and infrastructure to support co-located and geographically distributed Testbed baselines. Testbed virtual range development, and documentation of the Testbed. Verification, Validation & Accreditation (VV&A) Master Plan development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "T&E Enterprise"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.501"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.511"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct test planning which includes: conducting white cell planning meetings, TEMP working group meetings, and other working meetings that support at sea and Testbed tests for CVN 78, LSD 52, and LCS. In order to be postured to execute CVN 78, LSD 52, and LCS events if funding is made available to support it and for future years. Continue test planning efforts for the next generation of Ship classes to be tested utilizing the SDTS (e.g. CVN 79, LHA 8) and assist the pertinent stakeholders in developing test planning documentation and resourcing requirements. \nThe Enterprise will continue routine maintenance, IA\/Cybersecurity Certification and Accreditation on combat systems elements and the remote control system on the SDTS. Continue to facilitate the integration of systems into the PEO IWS M&S framework.\n\nFunding levels funds T&E Enterprise core activities only."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.173"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.173"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct test planning which includes: conducting white cell planning meetings, TEMP working group meetings, and other working meetings that support at sea and Testbed tests for CVN 78, LSD 52, and LCS. In order to be postured to execute CVN 78, LSD 52, and LCS events if funding is made available to support it and for future years. Continue test planning efforts for the next generation of Ship classes to be tested utilizing the SDTS (e.g. CVN 79, LHA 8) and assist the pertinent stakeholders in developing test planning documentation and resourcing requirements. \nThe Enterprise will continue routine maintenance, IA\/Cybersecurity Certification and Accreditation on combat systems elements and the remote control system on the SDTS. Continue to facilitate the integration of systems into the PEO IWS M&S framework.\n\nFunding levels funds T&E Enterprise core activities only."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "$1.662 million increase from FY20 to FY21 represents a return to the minimum amount of $15M required to maintain operational readiness; combat system maintenance and Information Assurance (IA) of the Self Defense Test Ship (SDTS), and T&E Enterprise operating functions."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3238"
                    },
                    "ProjectTitle": {
                        "val": "Threat Engineering"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.200"
                        },
                        "BudgetYearOne": {
                            "val": "0.200"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.200"
                        },
                        "BudgetYearTwo": {
                            "val": "0.200"
                        },
                        "BudgetYearThree": {
                            "val": "0.200"
                        },
                        "BudgetYearFour": {
                            "val": "0.200"
                        },
                        "BudgetYearFive": {
                            "val": "0.204"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Threat Engineering produces Acquisition Threat Evaluation Products (ATEPs) that are inputs to System of System requirements across Program Executive Office (PEO) Integrated Warfare Systems (IWS) platforms, elements, and DoD systems to deliver scalable fleet level performance capability. This program also produces critical, valid T&E assets that satisfy Commander Operational Test & Evaluation Force (COMOPTEVFOR) and Director of Operational Test and Evaluation  (DOT&E) requirements as these same tools will be used to support and supplement test and evaluation and training against the assessed threats in both testbed and at-sea configurations, ensuring consistency between the development and T&E acquisition phases.  \n\nATEP is the surface navy cost effective, affordable, single, common threat modeling architecture that supports its Major Defense Acquisition Program (MDAP), (and other subordinate programs) RDT&E activities throughout the acquisition life cycle and extending through operations and sustainment. ATEP satisfies Life Cycle Mission Planning (LCMP) requirements by providing the threat modeling architecture needs to support systems engineering trade-off analysis, T&E (DT and OT) and operations and sustainment (OA) through testbed evaluation activities.  ATEP is a critical component in ensuring requirements are achievable, affordable and testable.\n\nATEP provides the required threat models to ensure fleet operational readiness against the threat. Specifically, ATEP Satisfies Operational Test (OT) and Operational Assessment (OA) requirements documented in COMOPTEVFOR ltr 3960 Ser 00\/43 of 5 Jun 2018. This requirement specifies ATEP is necessary to provide the surface navy validated Anti-Ship Cruise Missile (ASCM) threat models for use in the M&S infrastructure supporting OT&E.  Moreover, ATEP satisfies COMOPTEVFOR requirement that threat models must be at a fidelity commensurate with the blue-force system representations and contain intel-derived lethality\/vulnerability data, physics-based six degrees-of-freedom models, reactive seekers and guidance, and other engineering data.  ATEP is necessary to evaluate mandatory Key Performance Parameters including operational effectiveness, and suitability to include a systems lethality and survivability, and achieving its performance requirements within operation and sustainment costs.\n\nATEP provides the threat models necessary to ensure the surface navy 1.) Avoids Technological Surprise and 2.) Eliminates Point Solutions. ATEP satisfies necessary Threat model requirements to conduct warfare systems analysis of alternatives including gaps analysis, and threat systems mission and performance analysis and effectiveness studies supporting both material and non-material solutions while supporting the development of Intelligence Community Tasking Threat. \n\nWith Threat Engineering efforts and development of ATEPs the Navy and PEO IWS will produce substantiated risk and cost based Fleet Level Engineering decisions producing predictable and timely fleet capability against stressing threats. Scalable warfighting performance will be evaluated against the appropriate threat environment, using sufficient, verified and validated models applied to produce Fleet Level Engineering requirements and gaps analysis. \n\nWithout Threat Engineering efforts and ATEPs the Navy and the PEO will incur unsubstantiated risk and cost in developing capability for the fleet. Scalable warfighting performance will not be evaluated against the threat environment, sufficient models will not be developed or applied to produce Fleet Level Engineering requirements and gaps analysis."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Threat Engineering"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Acquisition Threat Evaluation Projects (ATEP) Products Support and Sustainment, which includes support of the ATEP products, as well as tracking and troubleshooting issues.  This could result in the production of an upgraded version and\/or a development plan with an updated systems requirements document (dependent upon the magnitude of the changes).  \n-Threat Requirements Development, which includes identifying additional requirements from the program offices and other users to determine what work needs to be accomplished to satisfy those requirements and to develop the appropriate planning to address the requirements based on prioritization from the PEO program offices that will result in the development plan and updated system requirements document."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Acquisition Threat Evaluation Projects (ATEP) Products Support and Sustainment, which includes support of the ATEP products, as well as tracking and troubleshooting issues.  This could result in the production of an upgraded version and\/or a development plan with an updated systems requirements document (dependent upon the magnitude of the changes).  \n-Threat Requirements Development, which includes identifying additional requirements from the program offices and other users to determine what work needs to be accomplished to satisfy those requirements and to develop the appropriate planning to address the requirements based on prioritization from the PEO program offices that will result in the development plan and updated system requirements document."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "New start program required integration into an existing applicable PE to consolidate and bring to bear scalable fleet level warfighting capability to the fleet and is not accounted for within this exhibit."
                        }
                    }
                }
            ]
        }
    }
}