{
    "id": "2021-Navy-PB-1319-JBOOK-29075b3c2af92ab5fcca1096cf65ecac9cc771240d227e79d45bc59626cdea42-17",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603271N"
        },
        "ProgramElementTitle": {
            "val": "Electromagnetic Systems Advanced Technology"
        },
        "R1LineNumber": {
            "val": "18"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "8.639"
            },
            "CurrentYear": {
                "val": "9.499"
            },
            "BudgetYearOne": {
                "val": "8.008"
            },
            "BudgetYearOneBase": {
                "val": "8.008"
            },
            "BudgetYearTwo": {
                "val": "8.169"
            },
            "BudgetYearThree": {
                "val": "8.336"
            },
            "BudgetYearFour": {
                "val": "8.503"
            },
            "BudgetYearFive": {
                "val": "8.673"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Navy and Marine Corps' sophisticated electronics systems place heavy demands on the electromagnetic spectrum to accommodate information flow, defensive and offensive detection, tracking, and weapon system engagement. In distributed maritime operations, each of these platforms provides a set of capabilities that can be further combined for progressively larger and more complex operations. The Electromagnetic Systems Advanced Technology program addresses Radio Frequency (RF) technology for Surface and Aerospace Surveillance sensors and systems, Electronic Warfare (EW) sensors and systems, RF Communication Systems, Multi-Function sensor systems, and Position, Navigation and Timing (PNT) capabilities. Activities and efforts in this Program Element (PE) address technologies critical to enabling the transformation of discrete functions to network centric warfare capabilities, which simultaneously perform Radar, EW, and Communications and Network functions across platforms through multiple, simultaneous and continuous communications\/data links. \n\nToday's Sailors and Marines are enabled by Naval Science and Technology (S&T). Since 1946, the Office of Naval Research (ONR) has fostered scientific research related to the maintenance of maritime superiority and national defense. ONR manages the Department of the Navy's (DON) portfolio of naval Basic and Applied research, and Advanced Technology Development investments to ensure naval forces can effectively deter conflict, but when called upon, fight, win and come home safe. Current investments hedge against uncertainty, providing solutions to commanders today, and options for the future. The Naval S&T budget supports higher guidance defined by the National Defense Strategy, and responds to requirements identified by the Secretary of the Navy through research priorities set by the Chief of Naval Research, coordinated across the Naval Research Enterprise (NRE), and outlined in the Naval R&D Framework. \n\nThis Program Element (PE) funds Advanced Technology Development (ATD) that includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment. Efforts in this PE generally have Technology Readiness Levels TRL) of 4 (component and\/or breadboard validation in laboratory environment.), 5 (component and\/or breadboard validation in relevant environment.), or 6 (system\/subsystem model or prototype demonstration in a relevant environment).\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "8.804"
                },
                "CurrentYear": {
                    "val": "9.499"
                },
                "BudgetYearOne": {
                    "val": "8.008"
                },
                "BudgetYearOneBase": {
                    "val": "8.008"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.639"
                },
                "CurrentYear": {
                    "val": "9.499"
                },
                "BudgetYearOne": {
                    "val": "8.008"
                },
                "BudgetYearOneBase": {
                    "val": "8.008"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.165"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.165"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "funding: No significant change.\n\nTechnical: no significant change\n\nSchedule: no significant change"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2913"
                    },
                    "ProjectTitle": {
                        "val": "Electromagnetic Systems Advanced Technology"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "8.639"
                        },
                        "CurrentYear": {
                            "val": "9.499"
                        },
                        "BudgetYearOne": {
                            "val": "8.008"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.008"
                        },
                        "BudgetYearTwo": {
                            "val": "8.169"
                        },
                        "BudgetYearThree": {
                            "val": "8.336"
                        },
                        "BudgetYearFour": {
                            "val": "8.503"
                        },
                        "BudgetYearFive": {
                            "val": "8.673"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Work in this project addresses cost-effective Radio Frequency (RF) technology for Surface and Aerospace Surveillance sensors and systems, Electronic Warfare (EW) sensors and systems, RF Communication Systems, Multi-Function sensor systems, and Position, Navigation and Timing (PNT) capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Electronic and Electromagnetic Systems"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of the Electronic and Electromagnetic Systems Activity is to develop, test, and demonstrate Communications, Electronic Attack (EA), Electronic Surveillance (ES), EW, and Radar functions. A portion of this Program Element (PE) is devoted to mid-term technology development in close concert with acquisition programs of record. The products of these efforts are planned for transition at the end of their schedule into the associated acquisition program of record. Technology development is focused on Distributed Electronic Warfare in support of Distributed Maritime Operations.\n \nMajor thrust within the Electronics and Electromagnetic Systems program are: a) Advanced EW Enabling Technologies - Develop classified advanced electronic warfare technology in support of current and predicted capability requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.180"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.180"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct research in the areas of improved threat warning systems; electronic warfare support; decoys and countermeasures against weapon tracking and guidance systems; electronic attack against adversary Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR); and Electronic Protection (EP) of our own weapons and C4ISR from intentional and unintentional interference to control the Electromagnetic Spectrum (EMS) by exploiting, deceiving, or denying enemy use of the spectrum while ensuring its use by friendly forces. Refine design of and implement next-generation electronic warfare development and evaluation capability for the Navy (classified details available). Employ the updated capability for real-world assessments of existing electronic warfare and sensor system performance. Conduct analysis of results of FY 2019 test and evaluation activities. Refine and modify designs based on results, and initiate implementation of modified and additional capabilities. Continue close coordination with associated Science and Technology (S&T) and acquisition programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.180"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.180"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Advanced Electronic Warfare Enabling Technologies:\n- Perform focused developments in the areas of Electronic Support (ES); decoys and countermeasures against weapon tracking and guidance systems; Electronic Attack (EA) against adversary Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance and Targeting (C4ISRT).  \n- Develop Electronic Protection (EP) for our own weapons and Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) from intentional and unintentional interference.  \n- Conduct Live, Virtual, and Constructive (LVC) test events of force-level kinetic\/non-kinetic coordination and resource optimization. \n- Conduct analysis and report the results of FY 2020 test & evaluation activities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2020 to FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Global Positioning System (GPS) and Navigation Technology"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop technologies that enable the development of affordable, effective and robust Position, Navigation and Timing (PNT) capabilities using non-Global Positioning System (GPS) navigation devices, or atomic clocks. This activity will increase the operational effectiveness of U.S. Naval units. The focus is on the mitigation of GPS electronic threats, the development of atomic clocks that possess unique long-term stability and precision, and the development of compact, low-cost, Inertial Navigation Systems (INS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.459"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.319"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct advanced research and development in position, navigation and timing. This research aims to develop techniques and technology to provide assured, cost-effective, and mission relevant PNT to the warfighter. Areas of investment included robust GPS, non-GPS navigation aids, and assured timekeeping. Specifically, GPS Anti-Jam Antennas and Receivers for Navy platforms for the purpose of providing precision navigation capabilities in the presence of electronic threats and anti-spoofer\/anti-jam processors for the purpose of providing precision navigation capabilities in the presence of emergent threats; Tactical grade atomic clocks that possess unique long-term stability and precision for the purpose of providing GPS-independent precision time and transferring UTC (USNO) time via alternative electromagnetic links for the purpose of providing GPS-independent precision time; and Inertial navigation systems for the purpose of providing an alternative means of providing precision navigation, a correlation navigation technique using earth maps of high precision, for those Naval platforms which may not have Global Positioning System (GPS) navigation capabilities and\/or loss of GPS signals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.828"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.828"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Position, Navigation and Timing (PNT):\n- Complete research on automated celestial day night navigation for surface ships, transitioning to the Cooperative Engagement Capability program office. \n- Complete research on protected tactical waveforms for time transfer, transitioning to PMW 170's Wideband Anti-Jam Modem (WAM) system.\n- Continue research on miniature fiber optic inertial capability.\n- Continue research on wave forms for precision two way time transfer techniques and modem development.\n- Initiate research into mounted navigation for United States Marine Corps (USMC) specific platforms.\n- Initiate research into Low Earth Orbit constellation receivers for naval platforms."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2020 to FY 2021 is due to the decreased investment in Assured Time Dissemination research in the GPS and Navigation Technology thrust. This decrease is a result of the comprehensive DOD wide assessment of current Science and Technology (S&T) investments in the area of Position, Navigation and Timing ending in FY21."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}