{
    "id": "2021-DefenseAdvancedResearchProjectsAgency-PB-0400-MJBOOK-0-0-2716d21dbc896f45f0ab55d1cbc64884530e2bcd27618d8f0e40b216a43f556d-4",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-DARPA-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0602383E"
        },
        "ProgramElementTitle": {
            "val": "BIOLOGICAL WARFARE DEFENSE"
        },
        "R1LineNumber": {
            "val": "15"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "31.951"
            },
            "CurrentYear": {
                "val": "34.588"
            },
            "BudgetYearOne": {
                "val": "26.950"
            },
            "BudgetYearOneBase": {
                "val": "26.950"
            },
            "BudgetYearTwo": {
                "val": "25.071"
            },
            "BudgetYearThree": {
                "val": "30.536"
            },
            "BudgetYearFour": {
                "val": "38.536"
            },
            "BudgetYearFive": {
                "val": "41.035"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "33.640"
                },
                "CurrentYear": {
                    "val": "34.588"
                },
                "BudgetYearOne": {
                    "val": "29.836"
                },
                "BudgetYearOneBase": {
                    "val": "29.836"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "31.951"
                },
                "CurrentYear": {
                    "val": "34.588"
                },
                "BudgetYearOne": {
                    "val": "26.950"
                },
                "BudgetYearOneBase": {
                    "val": "26.950"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.689"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-2.886"
                },
                "BudgetYearOneBase": {
                    "val": "-2.886"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.558"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.131"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.886"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.886"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019:  Decrease reflects reprogrammings and the SBIR\/STTR transfer.\nFY 2020:  N\/A\nFY 2021:  Decrease reflects repricing of the Defense Against Mass Terror Threats program."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "BW-01"
                    },
                    "ProjectTitle": {
                        "val": "BIOLOGICAL WARFARE DEFENSE"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "31.951"
                        },
                        "CurrentYear": {
                            "val": "34.588"
                        },
                        "BudgetYearOne": {
                            "val": "26.950"
                        },
                        "BudgetYearOneBase": {
                            "val": "26.950"
                        },
                        "BudgetYearTwo": {
                            "val": "25.071"
                        },
                        "BudgetYearThree": {
                            "val": "30.536"
                        },
                        "BudgetYearFour": {
                            "val": "38.536"
                        },
                        "BudgetYearFive": {
                            "val": "41.035"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Biological Warfare Defense project is budgeted in the Applied Research Budget Activity because its focus is on the underlying technologies associated with the detection, prevention, treatment and remediation of biological, chemical, and radionuclide threats.  \n\nEfforts to counter existing and emerging biological, chemical and radiological threats included: countermeasures to stop the pathophysiologic processes that occur as a consequence of an attack; collection of environmental trace constituents to support chemical mapping, tactical and strategic biological, chemical, and radiological sensors; and integrated defense systems.  This project also includes development of a unique set of platform technologies and medical countermeasures synthesis that will dramatically decrease the timeline from military threat detection to countermeasure availability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Against Mass Terror Threats"
                                    },
                                    "Description": {
                                        "val": "The objective of the Defense Against Mass Terror Threats program is to identify and develop technologies that have the potential to significantly improve the United States' ability to reduce the risk of mass casualties in the wake of a Weapons of Mass Terror (WMT) attack.  Challenges in reducing U.S. vulnerability to these attacks include developing new sensors and systems that afford early warning and opportunities to interdict these threats before they can be employed in urban areas and other population centers.  A major goal of this program is to develop new sensors and sensing networks that can economically and reliably provide these wide-area monitoring capabilities for WMT threat signatures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "31.951"
                                            },
                                            "Text": {
                                                "val": "-  Initiated development of an open source, continuous, wide-area WMT sensing platform.\n-  Initiated research and development of advanced chemical and biological sensors for wide-area sensing.\n-  Initiated advanced network algorithms for new WMT sensing modalities and data fusion. \n-  Initiated development of general interfaces to supply advanced WMT monitoring capabilities to existing, operational, and situational awareness systems. \n-  Demonstrated feasibility of continuous sensing network scalability to city-sized areas through simulation for multiple classes of WMT threats, including chemical and biological. \n-  Commenced development of advanced adversary prediction models to improve overall system interdiction capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "34.588"
                                            },
                                            "Text": {
                                                "val": "-  Initiate development of a continuous, wide-area sensing, full spectrum WMT sensing platform that integrates developments in physical sensors, automated intelligence and network algorithms, open source IT platforms, and adversary models. \n-  Test and further develop initial chemical and biological sensor suite based on sensor specificity, sensitivity, and time to detection performance to enable scalable and robust wide-area sensing.\n-  Continue development of an open source, continuous, wide-area sensing IT platform capable of simultaneous ingress and fused analysis of thousands of real-time, multi-modal physical sensor and information feeds.\n-  Continue development of algorithms capable of multi-modal sensor and information fusion, informed by potential adversary behaviors learned from scaled social science models, for threat detection that maximizes sensitivity while minimizing false alarms.\n-  Mature collaborations with law enforcement, Federal and international partners to support testing of sensor and network systems, support access to relevant data sets, and enable future transition activities.\n-  Conduct demonstrations and data collects of chemical and biological sensor systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.950"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.950"
                                            },
                                            "Text": {
                                                "val": "-  Continue spiral development of chemical and biological sensors to include initial independent government testing of performance and suitability.\n-  Conduct initial operational demonstrations of new chemical and biological sensor systems with local, state and Federal stakeholders.\n-  Assess utility of worn physiological sensors to augment a biological sensor network.\n-  Continue spiral development of a network backbone and operating system supporting sensor and transactional data ingestion, including structured and unstructured data via natural language processing and assemblage of world graphs.\n-  Develop initial end-to-end alpha build of the network, including data model, pipeline and analytics engine capable of ingestion and automated analytics of heterogeneous transactional data sets and sensor data.\n-  Develop initial test strategies for sensor and network technologies that support eventual transition strategies, including into a possible Joint Concept Technology Demonstration or Program of Record."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decrease reflects shift from design and development to evaluation and demonstration."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}