{
    "id": "2021-TheJointStaff-PB-0400-MJBOOK-0-0-75241d2752bff8df5115ff60bfbb0868433ad86c59da10f8f574ca082f1c666f-3",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-TJS-U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0204571J"
        },
        "ProgramElementTitle": {
            "val": "Joint Staff Analytical Support"
        },
        "R1LineNumber": {
            "val": "180"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "38.567"
            },
            "PriorYear": {
                "val": "16.658"
            },
            "CurrentYear": {
                "val": "9.216"
            },
            "BudgetYearOne": {
                "val": "3.058"
            },
            "BudgetYearOneBase": {
                "val": "3.058"
            },
            "BudgetYearTwo": {
                "val": "3.082"
            },
            "BudgetYearThree": {
                "val": "3.079"
            },
            "BudgetYearFour": {
                "val": "3.079"
            },
            "BudgetYearFive": {
                "val": "3.080"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Staff Analytical Support (JSAS) family of programs provide defense analytical support capabilities for the Joint Staff and Combatant Commands (CCMDs).  JSAS encompasses tools and infrastructure required to conduct analyses and formulate results that assist the Chairman in fulfilling his statutory responsibilities.  Key deliverables provided by JSAS include development and implementation of Joint Concepts, concepts of operation, concepts of employment, wide-ranging force structure assessments, course of action development for the joint force environment, analyses and studies for joint concept driven, threat-informed capability development approach to joint force development and design.to aid in decision-making, and other analysis efforts to implement timely, low-cost joint force development initiatives."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "16.658"
                },
                "CurrentYear": {
                    "val": "9.216"
                },
                "BudgetYearOne": {
                    "val": "4.165"
                },
                "BudgetYearOneBase": {
                    "val": "4.165"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "16.658"
                },
                "CurrentYear": {
                    "val": "9.216"
                },
                "BudgetYearOne": {
                    "val": "3.058"
                },
                "BudgetYearOneBase": {
                    "val": "3.058"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-1.107"
                },
                "BudgetYearOneBase": {
                    "val": "-1.107"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "SECDEF Defense-Wide Review"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.107"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.107"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "(DWR) The FY 2021 funding request was reduced during the Secretary of Defense’s Defense-Wide Review (DWR) reform effort to account for change in requirements and contract savings resulting in less funds needed."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P001"
                    },
                    "ProjectTitle": {
                        "val": "Future Joint Force Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "19.667"
                        },
                        "PriorYear": {
                            "val": "5.301"
                        },
                        "CurrentYear": {
                            "val": "4.216"
                        },
                        "BudgetYearOne": {
                            "val": "3.058"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.058"
                        },
                        "BudgetYearTwo": {
                            "val": "3.082"
                        },
                        "BudgetYearThree": {
                            "val": "3.079"
                        },
                        "BudgetYearFour": {
                            "val": "3.079"
                        },
                        "BudgetYearFive": {
                            "val": "3.080"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Staff Analytical Support (JSAS) program supports the Chairman’s Title 10 responsibility for the analytical support, management and development of future-based joint concepts. These concepts include concepts of operations and employment that advance Joint Force operational effectiveness and enable the introduction and incorporation of new capabilities. The Joint Concepts program supports the Chairman's responsibility to express a vision for the future joint force; addressing operational problems on a 20-year horizon; identifying joint force development and design implications; and identifying capabilities required to mitigate and solve future joint warfighting gaps. The goal is to enable investment decisions balancing near and long term risk. Threat-informed joint concepts drive capability development and promote horizontal integration for force development and design across the Services, Combatant Commands, Defense agencies, OSD and Joint Staff. Key deliverables include:  \n\nFamily of Joint Concepts (FOJC): Based on the National Military Strategy (NMS) and providing operational and joint functional approaches to future adversary based challenges or opportunities. These concepts prioritize Russia, China, Iran, North Korea, and Countering Violent Extremist Organizations (hereafter referred to as the 2+3).  The FOJC drives capability development and alternative approaches to operating in support of a globally integrated force benchmarked against current and long-term pacing threats.  The FOJC includes the Capstone Concept for Joint Operations, Joint Warfighting Concept, Joint Operating Concepts for the 2+3 challenges, Joint Supporting Concepts that address joint warfighting functions, Concepts of Operation and Concepts of Employment.\n\nCapstone Concept for Joint Operations (CCJO): Provides the Chairman's vision for future joint operations and establishes aim points for the development of the future Joint Force. The key theme is globally integrated operations and directs joint concept driven, threat-informed capability to regain competitive advantage.\n\nJoint Warfighting Concept (JWC): Identifies innovative and alternative approaches and design options for the employment of the Joint Force out to 2030.  \n\nJoint Operating Concepts: Describe new ways of operating and associated capability requirements to address the 2+3 threat out fifteen years into the future.  \n\nConcepts of Operations (CONOPS): Describe how the actions of the joint force components and supporting organizations are integrated, synchronized, and phased to accomplish a specific mission or function within the construct of a future scenario.  CONOPS support evaluation of new ways of operating, future force posture mix, advanced capabilities, and authorities in exercises, wargames, and experiments.\n\t\nConcepts of Employment (CONEMPS): Describe, in broad terms, the application of specific technology, process, weapon system, or unit to perform a particular task or procedure.  They are the most specific of all military concepts and contain a level of guidance sufficient to inform the establishment of programmatic requirements. CONEMPS’ focus on the cross-domain employment of capabilities and techniques in areas like space, cyberspace, and the electro-magnetic spectrum (EMS) to enable joint information advantage.\n\nJoint Operating Environment (JOE) and the Gamechangers report: Developed in partnership with DIA, this report describes the future security environment and projects the implications of change for the Joint Force. The documents describe the circumstances that may alter the security environment and explores how the intersection and interaction of these changes might impact the character of war in the future. They provide a framework to think about the full range of Joint Force missions and how they may evolve over time in order to support development of threat-based future Joint concepts and concepts of operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Future Joint Force Development"
                                    },
                                    "Description": {
                                        "val": "Future joint force development provides analytic support required to develop future-based joint concepts. The goal is to enable investment decisions balancing near and long term risk. Threat-informed joint concepts drive capability development and promote horizontal integration for force development and design across the Services, Combatant Commands, Defense agencies, OSD and Joint Staff."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.301"
                                            },
                                            "Text": {
                                                "val": "Execute the Chairman's Joint Concept program.  Complete the Capstone Concept for Joint Operations: Joint Force 2030 approved by the CJCS.  Support development of the Joint Military Net Assessment in terms of how the joint force is achieving Joint Force 2030 as input to the Chairman’s Program Recommendation to the Secretary of Defense.  In partnership with CCMDs, the Services and other Joint Staff directorates, complete development and obtain Vice CJCS approval of the Joint Operating Concepts for China and Iran.  Provide support to U.S. Special Operations Command to develop JOC – Counter Violent Extremist Organizations and the associated transition plan.  Provide support for concept sponsors developing Supporting Joint Concepts in the areas of space, intelligence, deterrence, and operating in a CBRN environment. Continue futures study to inform our understanding of the challenges of the future operating environment.  Continue implementing approved Joint Concepts as described in CJCS Instruction 3010.  Maintain and enhance multinational partnerships in concept development.  Integrate Joint Concepts across the Joint Staff to inform DOTMLPF capability development decisions and explore new joint force adaptations and innovations posited by Joint Concepts in exercises, wargames, and experimentation.  \n\nMajor events and projects in 2019 will include the International Concept Development and Experimentation Conference, a U.S. \/ NATO co-led event that is the annual forum of Supreme Allied Command Transformation and Joint Staff to provide a unique opportunity for the international concept development and experimentation community and stakeholders to discuss the most current issues of concept development and experimentation in the capability development process. Additional projects and events include travel to the MCDC Executive Steering Group (ESG) and National Directors’ meetings to provide governance for the MCDC program as well as travel in support of U.S. led projects in the areas of logistics, personnel recovery, cyber, command and control and information sharing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.216"
                                            },
                                            "Text": {
                                                "val": "Execute the Chairman's Joint Concept program.  Continue CONOP and CONEMP development to support the FY21 Globally Integrated War Game and related experimentation with a focus on the Joint Warfighting Concept and Joint Supporting Concepts for global C2, logistics, global fires, and information advantage. Publish the Joint Operating Environment 2040 and Gamechangers report in partnership with DIA.  Support assessment of concepts in terms of how well the Joint force is achieving the CJCS’s Capstone Concept for Joint Operations: Joint Force 2030 as input to the Joint Military Net Assessment.  In partnership with the concept sponsors, CCMDs, the Services and other Joint Staff Directorates, complete development and obtain CJCS approval of supporting Joint Concepts. In partnership with selected Combatant Commands and Services, complete final drafts of the Joint Supporting Concepts in the areas of Global C2 (including an allied Five Eyes (FVEY) version), space, intelligence operations, logistics, operating in a CBRN environment, global fires, homeland defense, and information advantage. Support development of the NATO Warfighting Concept with Allied Command Transformation \/NATO.  Continue futures study to inform our understanding of the challenges of the future operating environment.  Maintain and enhance multi-national partnerships in concept development.  Support integration of Joint Concepts across the Joint Staff to inform concept driven, threat informed capability development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.058"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.058"
                                            },
                                            "Text": {
                                                "val": "Execute the Chairman's Joint Concepts Program.  Support the execution of the FY 2021 Globally Integrated War Game. Complete Joint Warfighting Concept and Joint Supporting Concepts. Continue global CONOP and CONEMP development to support evaluation of joint concepts in exercises, war games, and experimentation. In partnership with DIA, begin development of the next Gamechangers report and continue to lead the futures community of interest."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "(DWR) The FY 2021 funding request was reduced during the Secretary of Defense’s Defense-Wide Review (DWR) reform effort to account for change in requirements and contract savings resulting in less funds needed."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P003"
                    },
                    "ProjectTitle": {
                        "val": "GFM DI Enterprise Force Structure (EFS) Integration"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "18.900"
                        },
                        "PriorYear": {
                            "val": "11.357"
                        },
                        "CurrentYear": {
                            "val": "5.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "35.257"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Global Force Management (GFM) data initiative Enterprise Force Structure (EFS) effort provides the next steps for GFM mission application enhancements required to balance global force demand against available military force. This complex task requires technologies that provide integrated information obtained by linking force structure quantitative data (derived from the GFM organizational servers) to qualitative data of Capability, Readiness, Availability and Employment\/Location data (C.R.A.E.) resident in GFM mission applications and associated data bases. The Joint Staff is responsible for GFM allocation and will employ a strategy for efficiently providing Enterprise Force Structure (EFS) data utility.\n\nDoD must meet national military objectives that range from large force scenarios to small-scale activities. Our adversaries demonstrate the ability to readily transition from non-kinetic to kinetic effects. Consequently, Information Technology (IT) superiority, capabilities, and recognition of associated vulnerabilities are an operational imperative. Yet, warfighters, strategic planners and GFM decision makers are unable to exchange information in a manner that rapidly and accurately enables force sourcing activities to support SecDef decisions. The Joint Staff is mandated to utilize the Service’s organizational server EFS data to enhance managing, assessing, and displaying the health and worldwide disposition of U.S. Forces. Key deliverables include incrementally developed, operationally realistic capability enhancements focused on resource-informed planning and GFM sourcing functionality required by numerous Joint Staff requirements documents.\n\nThe Joint Staff Analytical Support (JSAS) enterprise force structure data integration efforts enables Project ORION: a Global Laydown Server and a Joint Force Capabilities Catalog along with functional applications that support a global visibility capability. This capability enhances resource-informed planning, global force management and joint deployment. Global visibility capability also supports future force integration and concept implementation needed to support timely and dynamic response to Combatant Commanders’ contingency requirements. Project ORION creates a technical environment that enables rapid integration of the JOPES replacement with remaining GFM data that supports planning and execution of U.S. Military Operations. Project Orion provides operational force structure and the means to allocate and attach units. This capability is the cornerstone for fulfilling the CJCS-directed requirement to integrate force planning, support planning, and deployment planning and execution of military operations. The ORION environment supports all variants of planning and execution processes by providing portal access to authoritative data aggregated in the Global Laydown Servers and associated display of force capabilities, readiness, employment, and availability of the force. This is a cost-effective yet full spectrum approach to support and assist the Chairman in fulfilling his statutory responsibilities while improving current and future joint force management."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "GFM Data Initiative (GFM DI) Enterprise Force Structure Integration (EFS)"
                                    },
                                    "Description": {
                                        "val": "The GFM DI EFS integration effort requires RDT&E funds to operationalize force structure data from the service's Organizational Servers to actual forces for employment within the purview of allocation and Joint command and control. This GFM DI effort within the Joint Staff Analytical Support (JSAS) family of programs will immediately streamline the SECDEFs \"Forces for Unified Commands\" memorandum Assignment Tables. RDT&E efforts for assignment and apportionment functions ended in FY 2015 with the declaration of Full Operation Capability (FOC) for the Automated Global Force Management Tool. GFM DI planned milestones must be met to enable a global visibility capability. GFM applications managed by the Joint Staff are used by the JSAS family of programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.357"
                                            },
                                            "Text": {
                                                "val": "Specific RDT&E work will focus on efforts to implement timely, low-cost initiatives and Global Force Management (GFM) focused tools delivering a global visibility of the disposition of DoD forces on an operational enterprise. This supports the preferred munitions and engineering and cross-servicing arrangements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Developing and fielding functional capability applications resident in the ORION environment, and riding on the Global Laydown Server, to meet the CJCS decision support requirements for full operating capability. These include: Force Element Inventory – Predictive Analysis Tool, Preferred Munitions Synchronization Tool, Readiness Synchronization Tool, Constellation Tool, and the TPFDD Visualization Tool."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Migrate program to sustainment which will be funded by the Operation and Maintenance appropriation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Net funding decrease from FY 2019 to FY 2020 reflects project nearing full operational capability. Project moves to sustainment in FY 2021 and is funded by the Operation and Maintenance appropriation."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}