{
    "id": "2021-AirForce-PB-3600-MJBOOK-0-0-4ccc939241b47239c36ee98d5519ce37a7e18b46d494a025321d2035cb3d38d7-29",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-AIRFORCE_V3B-U_RDTE_MasterJustificationBook_Air_Force_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603456F"
        },
        "ProgramElementTitle": {
            "val": "Human Effectiveness Advanced Technology Development"
        },
        "R1LineNumber": {
            "val": "30"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "32.624"
            },
            "CurrentYear": {
                "val": "37.542"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops and demonstrates technologies to enhance Airman performance and effectiveness in the aerospace force. State-of-the-science advances are made in warfighter training, warfighter system interfaces, directed energy bioeffects, deployment and sustainment of warfighters in extreme environments, and understanding and shaping adversarial behavior. The Directed Energy Bioeffects Parameters project develops, demonstrates, and transitions technologies to predict, evaluate, and mitigate the effects of directed energy on personnel and mission performance, and exploits the offensive capabilities of directed energy systems. The Human Dynamics and Terrain Demonstration develops, demonstrates, and transitions technologies to sustain airman performance in adverse operational and\/or training environments, monitor and mitigate in-flight unexplained physiological events, and prevent human performance related mishaps through real-time monitoring and mitigation—particularly through highly automated or autonomous systems. The Mission Effective Performance project develops, demonstrates, and transitions advanced training, simulation, mission rehearsal, and other performance-aiding methods and technologies to enhance warfighter readiness. The Warfighter Interfaces project develops, demonstrates, and transitions technologies to revolutionize the way airmen synergistically use Air Force systems, including autonomous machines and adaptive teams of airmen and machines. Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.\n\nIn the FY 2021, the Air Force is consolidating its existing thirteen Advanced Technology Development (ATD), Research Development Test and Evaluation (RDT&E), Budget Activity 03 (BA 03) PEs into five new capability focused RDT&E BA 03 PEs to better align with the Air Force Science and Technology (S&T) Strategy signed by the SECAF in April 2019. This consolidation will improve and accelerate delivery of integrated transformational, multidisciplinary, collaborative technology solutions necessary to enable new Air Force warfighting capabilities that support the National Defense Strategy. This new structure will provide the Air Force and Congress with a clearer understanding and increased transparency of integrated technology solutions and demonstrations key to enabling the Air Force future force design.\n\nIn FY 2021, the entirety of Project 635323, Directed Energy Bioeffects Parameters, and Project 635324, Human Dynamics and Terrain Demonstration, will be transferred from PE 0603456F, Human Effectiveness Advanced Technology Development, to PE 0603030F, AF Foundational Development\/Demos.\n\nIn FY 2021, the entirety of Project 635325, Mission Effective Performance, will be transferred from PE 0603456F, Human Effectiveness Advanced Technology Development, to PE 0603034F, Persistent Knowledge, Awareness & C2 Tech.\n\nIn FY 2021, Project 635327, Warfighter Interfaces, non-Vanguard efforts and activities will be transferred from PE 0603456F, Human Effectiveness Advanced Technology Development, to PE 0603034F, Persistent Knowledge, Awareness and C2 Tech.  Skyborg Vanguard activities under this Project will be consolidated and transferred in FY 2021 from PE 0603456F, Human Effectiveness Advanced Technology Development, to PE 0603032F, Future AF Integrated Technology Demos, Project 630320, Air Force Vanguards.\n\nAll these transfers detailed above are part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and Air Force S&T Strategy, April 2019. This is an administrative realignment and not a new start.  This work will continue to be executed by the Air Force Research Laboratory Airman Systems Technology Directorate located in Wright-Patterson Air Force Base, Ohio, and Joint Base San Antonio - Fort Sam Houston, Texas.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver science and technology capabilities.  The use of program funds in this PE would be in addition to the civilian pay expenses budgeted in program elements 0601102F, 0602102F, 0602201F, 0602202F, 0602203F, 0602204F, 0602602F, 0602605F, 0602788F, 1206601SF, and 0602298F.\n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "36.420"
                },
                "CurrentYear": {
                    "val": "37.542"
                },
                "BudgetYearOne": {
                    "val": "36.237"
                },
                "BudgetYearOneBase": {
                    "val": "36.237"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "32.624"
                },
                "CurrentYear": {
                    "val": "37.542"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.796"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-36.237"
                },
                "BudgetYearOneBase": {
                    "val": "-36.237"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.041"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.755"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-36.237"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-36.237"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2019 in Other Adjustments of $2.755 million is due to realignment of funds to PE 0602212F to support Research and Development Projects, 10 U.S.C. Section 2363, an amendment to PL 110-417, 10 U.S.C. Section 2358 and 10 U.S.C. 2805(d)(1)(B).\n\nDecrease in FY 2021 is due to the following:\n\n1) Entirety of Project 635323, Directed Energy Bioeffects Parameters, and Project 635324, Human Dynamics and Terrain Demonstration, transferring to PE 0603030F, AF Foundational Development\/Demos.\n\n2) Project 635327, Warfighter Interfaces, non-Vanguard efforts and activities transferring to PE 0603034F, Persistent Knowledge, Awareness and C2 Tech.\n\n3) Skyborg Vanguard activities under Project 635327, Warfighter Interfaces, transferring to PE 0603032F, Future AF Integrated Technology Demos, Project 630320, Air Force Vanguards.\n\nThese transfers in FY 2021 are part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and Air Force S&T Strategy, April 2019."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "635323"
                    },
                    "ProjectTitle": {
                        "val": "Directed Energy Bioeffects Parameters"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.720"
                        },
                        "CurrentYear": {
                            "val": "5.154"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions technologies to predict, evaluate, and mitigate the effects of directed energy on personnel and mission performance, and exploits the offensive capabilities of directed energy systems. This project develops the human components of the guidelines for testing, deployment, and protection from high-power microwave and high-energy laser systems and uses this information to enhance the effectiveness of these weapon systems in air, space, and cyber operations. This project develops tools and plug-ins that enhance mission and engagement models, provide predictive risk analysis for deployment of Directed Energy systems, and analyzes systems for use in the Department of Defense.  This project develops tools and analysis techniques to model and demonstrate the use of fielded protection on Airman performance, and informs developers of design specifications to optimize design of novel weapon systems.\n\nIn FY 2021, the entirety of Project 635323, Directed Energy Bioeffects Parameters, will be transferred to PE 0603030F, AF Foundational Development\/Demos, Project 635323, Directed Energy Bioeffects Parameters, as part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and Air Force Science and Technology Strategy, April 2019.  The Project and associated efforts will continue to be executed by the Air Force Research Laboratory Airman Systems Technology Directorate located in Joint Base San Antonio - Fort Sam Houston, Texas. This is an administrative realignment for consolidation, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Optical Radiation Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate optical protective technologies for aircrew and ground personnel to provide protection against directed energy threats. Develop modeling capabilities to assess collateral hazards from high-power directed energy laser systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.716"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.169"
                                            },
                                            "Text": {
                                                "val": "Provide hazard analysis for Self Protect High Energy Laser Demonstrator (SHiELD) ATD flight safety reports. Complete safety analysis for advancing Department of Defense directed energy concepts for safety review and technical review boards. Continue updates to glare models that predict mission impact from bright light exposures with real-world background illumination using validation and verification experimental results. Continue evaluation of next generation nuclear flash-blindness technologies and the impact on mission performance. Continue integration of optical radiation hazard and vision analysis and tools into Advanced Framework for Simulation, Integration and Modeling (AFSIM) architecture."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2021, this work is performed under the Directed Energy Bioeffects effort in PE 0603030F, AF Foundational Development\/Demos, Project 635323, Directed Energy Bioeffects Parameters."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $4.169 million. Funding decreased due to the transfer and realignment of this work to the Directed Energy Bioeffects effort in PE 0603030F, AF Foundational Development\/Demos, Project 635323, Directed Energy Bioeffects Parameters, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radio Frequency Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate technologies to assess radio frequency (RF) bioeffects and collateral hazards from high-power RF directed energy systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.004"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.985"
                                            },
                                            "Text": {
                                                "val": "Continue development and refinement of fast thermal gradient effects dosimetry validation models and continue effect model validation strategy. Continue development of high peak power assessment models and tools to address real world concerns. Investigate probability of injury from RF exposures through use of modeling and empirical comparisons. Continue integration of RF hazard analysis and tools into Advanced Framework for Simulation, Integration and Modeling (AFSIM) architecture."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2021, this work is performed under the Directed Energy Bioeffects effort in PE 0603030F, AF Foundational Development\/Demos, Project 635323, Directed Energy Bioeffects Parameters."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $0.985 million. Funding decreased due to the transfer and realignment of this work to the Directed Energy Bioeffects effort in PE 0603030F, AF Foundational Development\/Demos, Project 635323, Directed Energy Bioeffects Parameters, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635324"
                    },
                    "ProjectTitle": {
                        "val": "Human Dynamics and Terrain Demonstration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.086"
                        },
                        "CurrentYear": {
                            "val": "5.886"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program develops, demonstrates, and transitions technologies to sustain airman performance in adverse operational and\/or training environments (e.g., heat, altitude, high G), monitor and mitigate in-flight unexplained physiological events (e.g., hypoxia, hyperoxia), and prevent human performance related mishaps through real-time monitoring and mitigation—particularly through highly automated or autonomous systems.\n\nIn FY 2021, the entirety of Project 635324, Human Dynamics and Terrain Demonstration, will be transferred to PE 0603030F, AF Foundational Development\/Demos, Project 635324, Human Dynamics and Terrain Demonstration, as part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and Air Force Science and Technology Strategy, April 2019.  The Project and associated efforts will continue to be executed by the Air Force Research Laboratory Airman Systems Technology Directorate located in Wright-Patterson Air Force Base, Ohio. This is an administrative realignment for consolidation, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Analyst Augmentation"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate human-centered design processes and operational tools that optimize Intelligence, Surveillance and Reconnaissance information exploitation and analysis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.771"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.104"
                                            },
                                            "Text": {
                                                "val": "Develop and transition multi-intelligence analysis tools and airman-machine collaboration technologies to Air Force Distributed Common Ground System (AF-DCGS) via enhanced research Content Management System (ICMS) and DCGS Open- Architecture. Prepare to transition global situation-awareness and decision-making capabilities to Air and Space Operations Center (AOC) and multi-domain operations centers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2021, this work is performed under the Sensing and Assessment effort in PE 0603030F, AF Foundational Development\/Demos, Project 635324, Human Dynamics and Terrain Demonstration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $4.104 million. Funding decreased due to the transfer and realignment of this work to the Sensing and Assessment effort in PE 0603030F, AF Foundational Development\/Demos, Project 635324, Human Dynamics and Terrain Demonstration, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Trust and Interaction"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate machine translation and speech-to-text tools to support the span of Air Force mission areas including intelligence, surveillance, and reconnaissance and cyber operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.315"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.782"
                                            },
                                            "Text": {
                                                "val": "Continue to advance and mature deep neural networks to improve automatic speech recognition, machine translation, and natural language processing technologies as applied to multimedia information."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2021, this work is performed under the Sensing and Assessment effort in PE 0603030F, AF Foundational Development\/Demos, Project 635324, Human Dynamics and Terrain Demonstration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $1.782 million. Funding decreased due to the transfer and realignment of this work to the Sensing and Assessment effort in PE 0603030F, AF Foundational Development\/Demos, Project 635324, Human Dynamics and Terrain Demonstration, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635325"
                    },
                    "ProjectTitle": {
                        "val": "Mission Effective Performance"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.222"
                        },
                        "CurrentYear": {
                            "val": "6.930"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions advanced training, simulation, mission rehearsal, and other performance-aiding methods and technologies to enhance warfighter readiness.  This project also develops advanced methods and technologies to enable interactive live, virtual, and constructive (LVC) environments for performance-aiding methods and technologies. Focus areas include integrated high-fidelity weapon systems training technologies for air, space, and cyber; tailored immersive simulation environments for airmen at the tactical and operational levels; and incorporation of performance assessment and feedback tools. These methods and technologies facilitate the development of mission-essential competencies.\n\nIn FY 2021, the entirety of Project 635325, Mission Effective Performance, will be transferred to PE 0603034F, Persistent Knowledge, Awareness & C2 Tech, Project 635325, Mission Effective Performance, as part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and Air Force Science and Technology Strategy, April 2019.  The Project and associated efforts will continue to be executed by the Air Force Research Laboratory Airman Systems Technology Directorate located in Wright-Patterson Air Force Base, Ohio. This is an administrative realignment for consolidation, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Continuous Learning"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate secure, persistent, and standardized LVC training enterprise. Utilize modeling capabilities for technology demonstration efforts focused on developing software-based tools for training that would replace human instructors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.222"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.930"
                                            },
                                            "Text": {
                                                "val": "Continue development of proficiency-based training metrics and assessments in operational contexts. Continue multi-domain operations training development and demonstration. Continue field evaluations for performance-based after action review visualization tools in unit-level and Red Flag-Level training and rehearsal. Continue assessments and evaluations of common range and simulation architecture technologies for Live, Virtual, and Constructive training capabilities. Create methods for rapid development of mission-oriented software agent applications. Develop contested degraded operations environment for multi- domain operations training and rehearsal."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2021, this work is performed under the Readiness effort in PE 0603034F, Persistent Knowledge, Awareness & C2 Tech, Project 635325, Mission Effective Performance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $6.930 million. Funding decreased due to the transfer and realignment of this work to the Readiness effort in PE 0603034F, Persistent Knowledge, Awareness & C2 Tech, Project 635325, Mission Effective Performance, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635327"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Interfaces"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.596"
                        },
                        "CurrentYear": {
                            "val": "19.572"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and readies the transition of technologies to revolutionize the way airmen optimize the capabilities of Air Force systems, including autonomous machines and adaptive teams of Airmen and machines.  Improvements in the presentation of operational information to the community of users, from the system operator to the commander, must be developed in step with advancements in the acquisition, storage, and retrieval of information. This project provides the advances in understanding of human cognitive abilities, as well as the utilization of human interfaces, multisensory fusion, high-resolution image displays, and three-dimensional (3D) audio to customize communications and enhance shared understanding across a diverse user community in air, space, and cyber for maximum situational awareness.\n\nIn FY 2021, Project 635327, Warfighter Interfaces, non-Vanguard efforts and activities will be transferred to PE 0603034F, Persistent Knowledge, Awareness & C2 Tech.  Skyborg Vanguard activities under this Project will be consolidated and transferred in FY 2021 from PE 0603456F, Human Effectiveness Advanced Technology Development, to PE 0603032F, Future AF Integrated Technology Demos, Project 630320, Air Force Vanguards. These transfers are part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and Air Force S&T Strategy, April 2019. This is an administrative realignment and not a new start.  The Project and associated non-Vanguard efforts and activities will continue to be executed by the Air Force Research Laboratory Airman Systems Technology Directorate located in Wright-Patterson Air Force Base, Ohio. This is an administrative realignment for consolidation, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Battlespace Acoustics"
                                    },
                                    "Description": {
                                        "val": "Develops and demonstrates wearable technologies and operator-centric interfaces that increase the\nAirman's combat capabilities. This is accomplished through integrated solutions that develop synergies, maximize battlespace interoperability, and increase combat power while decreasing Airman physical and cognitive workloads."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.342"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.862"
                                            },
                                            "Text": {
                                                "val": "Validate understanding of limitations in human auditory perception to build acoustic countermeasures to control perception of special aviation acoustic signatures. Continue to develop 3D audibility models for special operations aviation through the exploitation of high-fidelity acoustic measurements focusing on effects of atmospherics and terrain. Conduct usability testing and employ advanced engineering methodologies for rapid prototyping, testing and seamless integration of man-wearable communication systems, mobile interfaces, and physiological sensors into tactical ensembles supporting Battlefield Airmen and Para-rescue operations. Expected transitions include a suite of e-textile solutions eliminating conventional cabling through- out tactical vests, an integrated\/wireless hub transfer of power and data to body-worn peripheral devices, and an array rapidly developed technology in response to urgent needs of dismounted operators."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2021, this work is performed under the Airman Machine Interfaces effort in PE 0603034F, Persistent Knowledge, Awareness & C2 Tech, Project 635327, Warfighter Interfaces with the exception of funding associated with the Skyborg Vanguard demonstration which is performed under the Skyborg effort in PE 0603032F, Future AF Integrated Tech Demos, Project 630320, Air Force Vanguards."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $4.862 million. Funding decreased due to the transfer and realignment of this work to the Airman Machine Interfaces effort in PE 0603034F, Persistent Knowledge, Awareness & C2 Tech, Project 635327, Warfighter Interfaces with the exception of funding associated with the Skyborg Vanguard demonstration which is performed under the Skyborg effort in PE 0603032F, Future AF Integrated Tech Demos, Project 630320, Air Force Vanguards, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Role in Semiautonomous Systems"
                                    },
                                    "Description": {
                                        "val": "Develops, demonstrates, and matures software solutions for Command and Control, Intelligence Surveillance & Reconnaissance, Space, and Cyber customers for improved system performance (operator\/analyst and software).  Software ranges from simplistic decision support systems to sophisticated artificial intelligence and machine learning algorithms designed to handle data at the scale of operations. Heavy emphasis is placed on human-machine teaming including workflow design and integration of both automated and human-generated results. Effort leverages significant infrastructure in big-data design and capture, allowing for rapid prototyping of capabilities directly to web-based platforms on classified environments. Program directly supports contested-denied operations in a multi-domain environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.254"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.710"
                                            },
                                            "Text": {
                                                "val": "Flight demonstrate airman-directed control and management of multiple unmanned tactical behaviors involving increasingly complex mission sets (e.g., dynamic mission objectives, high uncertainty, unreliable communication links). Demonstrate integrated decision support and embedded intelligent agent capabilities to assess and reason about manned-unmanned team performance and overall mission effectiveness. Continue to demonstrate adaptive human-machine interfaces and task allocation methods in virtual and live tests in operationally relevant environments. Demonstrate teaming concepts and technologies among cooperative human-machine teams in networked simulation environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2021, this work is performed under the Analytic Tools effort in PE 0603034F, Persistent Knowledge, Awareness & C2 Tech, Project 635327, Warfighter Interfaces, with the exception of funding associated with the Skyborg Vanguard demonstration which is performed under the Skyborg effort in PE 0603032F, Future AF Integrated Tech Demos, Project 630320, Air Force Vanguards."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $14.710 million. Funding decreased due to realignment of research from the Human Role in Semiautonomous Systems effort to PE 0603034F, Persistent Knowledge, Awareness & C2 Tech, Project 635327, Warfighter Interfaces, Analytic Tools effort with the exception of funding associated with the Skyborg Vanguard demonstration which will be realigned to PE 0603032F, Future AF Integrated Tech Demos, Project 630320, Air Force Vanguards, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}