{
    "id": "2021-DefenseAdvancedResearchProjectsAgency-PB-0400-JBOOK-9791cb30a17933e364f6388e243081e196aa85793c267cee3ac7042f1c1057a0-5",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-DARPA-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602702E"
        },
        "ProgramElementTitle": {
            "val": "TACTICAL TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "18"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "295.118"
            },
            "CurrentYear": {
                "val": "313.002"
            },
            "BudgetYearOne": {
                "val": "233.271"
            },
            "BudgetYearOneBase": {
                "val": "233.271"
            },
            "BudgetYearTwo": {
                "val": "199.803"
            },
            "BudgetYearThree": {
                "val": "225.225"
            },
            "BudgetYearFour": {
                "val": "245.549"
            },
            "BudgetYearFive": {
                "val": "334.744"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Tactical Technology Program Element is budgeted in the Applied Research Budget Activity because it supports the advancement of concepts and technologies to enhance the next generation of tactical systems.  The Tactical Technology Program Element funds a number of projects in the areas of Naval Warfare, Advanced Land Systems, Aeronautics Technology and Information Analytics Technology.\n\nThe Naval Warfare Technology project develops advanced technologies for application to a broad range of naval requirements.  Enabling and novel technologies include concepts for expanding the envelope of operational naval capabilities to include the entire sea column such as improved situational awareness over large maritime environments, ship self-defense techniques, novel underwater propulsion modalities, vessels for estuary and riverine operations, high speed underwater vessels, improved techniques for underwater object detection and discrimination, long endurance unmanned surface vehicles, methods and techniques for servicing assets throughout the sea column, and high bandwidth communications.\n\nThe Advanced Land Systems Technology project is developing technologies for enhancing U.S. military effectiveness and survivability in operations ranging from traditional threats to military operations against irregular forces that can employ disruptive or catastrophic capabilities, or disrupt stabilization operations.  Programs seek to break the relative symmetry of land combat to give U.S. forces a decided advantage in the current and future ground battlefield.  The emphasis is on developing affordable technologies that reduce reliance on consolidated forward-operating bases and required lines of communication, and provide small units and individual warfighters with hyper-mobility and hyper-lethality. \n\nAeronautics Technology efforts will address high payoff opportunities that dramatically reduce costs associated with advanced aeronautical and aerospace systems and\/or provide revolutionary new system capabilities for satisfying current and projected military mission requirements.  This includes advanced technology studies of revolutionary propulsion, vehicle, and launch concepts, sophisticated fabrication methods, and examination of novel materials and enabling technologies for aeronautic and aerospace system applications.\n\nThe Information Analytics Technology project develops technology for analyzing data and information arising from: 1) intelligence networks; 2) open, media, and other external sources; 3) sensors and signal\/image processors; and 4) collection platforms and weapon systems.  Technical challenges include the need to: 1) process huge volumes of diverse, incomplete, and uncertain data in tactically-relevant timeframes and 2) counter the information operations of sophisticated adversaries who seek to deceive, degrade, deny, and disrupt the U.S. information enterprise.  Benefits sought include deeper understanding of the evolving operational environment tailored to the needs of commanders at every echelon; an enhanced capability to plan, monitor, and control diverse military operations ranging from stabilization and information operations to combat engagements; and improvements to the efficiency of core military functions such as national and homeland security, warfighter health and readiness, and defense support of law enforcement and civil authorities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "309.466"
                },
                "CurrentYear": {
                    "val": "337.602"
                },
                "BudgetYearOne": {
                    "val": "283.854"
                },
                "BudgetYearOneBase": {
                    "val": "283.854"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "295.118"
                },
                "CurrentYear": {
                    "val": "313.002"
                },
                "BudgetYearOne": {
                    "val": "233.271"
                },
                "BudgetYearOneBase": {
                    "val": "233.271"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-14.348"
                },
                "CurrentYear": {
                    "val": "-24.600"
                },
                "BudgetYearOne": {
                    "val": "-50.583"
                },
                "BudgetYearOneBase": {
                    "val": "-50.583"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-24.600"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-1.500"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.442"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-10.406"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-50.583"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-50.583"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019:  Decrease reflects reprogrammings, the SBIR\/STTR transfer, and a congressionally-directed transfer for the National Security Commission on Artificial Intelligence.\nFY 2020:  Decrease reflects congressional reduction.\nFY 2021:  Decrease reflects completion of the Squad X and Mobile Force Protection (MFP) programs in FY 2020 in the Advanced Land Systems Technology Project."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "TT-03"
                    },
                    "ProjectTitle": {
                        "val": "NAVAL WARFARE TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "40.493"
                        },
                        "CurrentYear": {
                            "val": "42.859"
                        },
                        "BudgetYearOne": {
                            "val": "14.890"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.890"
                        },
                        "BudgetYearTwo": {
                            "val": "13.059"
                        },
                        "BudgetYearThree": {
                            "val": "29.059"
                        },
                        "BudgetYearFour": {
                            "val": "36.059"
                        },
                        "BudgetYearFive": {
                            "val": "59.059"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Naval Warfare Technology project develops advanced technologies for application to a broad range of naval requirements.  Enabling and novel technologies include concepts for expanding the envelope of operational naval capabilities to include the entire sea column such as improved situational awareness over large maritime environments, ship self-defense techniques, novel underwater propulsion modalities, vessels for estuary and riverine operations, high speed underwater vessels, improved techniques for underwater object detection and discrimination, long endurance unmanned surface vehicles, methods and techniques for servicing assets throughout the sea column, and high bandwidth communications.  This project will also examine methods and architectures for distributing maritime operations to enable a more agile, survivable, and cost-effective fleet."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multi-Azimuth Defense Fast Intercept Round Engagement System (MAD-FIRES)"
                                    },
                                    "Description": {
                                        "val": "The Multi-Azimuth Defense Fast Intercept Round Engagement (MAD-FIRES) program seeks to develop a point defense system against today's most stressing threats by developing a highly maneuverable, medium caliber, guided projectile, fire sequencing and control system capable of neutralizing large threat raids of high speed, highly maneuverable targets.  Leveraging recent advancements in gun hardening, miniaturization of guided munition components, and long-range sensors, MAD-FIRES advances fire control technologies, medium caliber gun technologies, and guided projectile technologies enabling the multiple, simultaneous target, kinetic engagement mission at greatly reduced costs.  MAD-FIRES seeks to achieve lethality overmatch through accuracy rather than size, thus expanding the role of smaller combat platforms into missions where they have been traditionally outgunned.  MAD-FIRES, sized as a medium caliber system, enhances flexibility for installment as a new ship self-defense system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.493"
                                            },
                                            "Text": {
                                                "val": "-  Began detailed design of system prototype that includes projectile, gun system, and fire control system.\n-  Updated projectile design based on previous year flight test results.\n-  Validated sensor modeling and simulation through Radio Frequency (RF) chamber testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "29.859"
                                            },
                                            "Text": {
                                                "val": "-  Verify fire control system ability to guide rounds to simulated target.\n-  Verify projectile compatibility with gun feed system.\n-  Verify fire control system ability to acquire and track surrogate threats.\n-  Perform end-to-end demonstration of gun launched guided flight.\n-  Begin detailed planning for end-to-end system demonstration against surrogate targets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.534"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.534"
                                            },
                                            "Text": {
                                                "val": "-  Begin end-to-end tests leading up to demonstrations against flying targets."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects completion of end-to-end system demonstrations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Port Defense \/ Mine Counter Measures (MCM)"
                                    },
                                    "Description": {
                                        "val": "The Port Defense \/ Mine Counter Measures (MCM) program will explore novel technologies and concepts of operations to mature a capability to protect U.S. waterways, thus enabling unencumbered naval operations.  The program will conduct research and development for expendable unmanned underwater vehicles (UUVs) that will be used to support MCM payloads.  This will allow for a paradigm shift in mine clearance efforts away from human-intensive and time-intensive approaches, towards rapid and autonomous sweeping by a large number of UUVs."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.356"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.356"
                                            },
                                            "Text": {
                                                "val": "-  Begin design of miniaturized payloads.\n-  Conduct a trade space analysis of UUVs, payloads, and employment concepts.\n-  Begin preliminary design and risk reduction activities to advance novel technologies and concept of operations.\n-  Begin developing a prototype UUV as a pilot study for expansive and rapid MCM payload support."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Angler"
                                    },
                                    "Description": {
                                        "val": "The undersea domain has significant importance to national security and military operations.  Yet it is a challenging domain in which to operate due to extreme water pressures, restricted communications, ever changing bottom environments, marine fouling and corrosion.  The Angler program seeks to improve U.S. operations in this domain by enabling underwater robotic systems significantly ahead of the state of the art.  These robotic systems would be able to search and manipulate objects autonomously, even in dark, turbulent, and semi-opaque sea conditions without the need for human control and without reliance on the Global Positioning System (GPS).  Key Angler technical challenges include sensing techniques that provide high-resolution navigation without GPS, perception and manipulation strategies for objects with unknown parameters, long duration autonomy approaches to support mission execution, and autonomy approaches that do not rely on human intervention.  Starting in FY 2020, this program is also funded in PE 0603766E, Project NET-02.  The anticipated transition is to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Conducted exploratory trade studies to establish feasibility of technical approaches.\n-  Initiated systems engineering and began design of prototype architecture for autonomous, undersea manipulation operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete Conceptual Design Review (CoDR).\n-  Conduct Preliminary Design Review (PDR).\n-  Test robot subsystems in laboratory or simulation environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects the budget shift from Project TT-03 to Project NET-02."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-04"
                    },
                    "ProjectTitle": {
                        "val": "ADVANCED LAND SYSTEMS TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "119.409"
                        },
                        "CurrentYear": {
                            "val": "113.440"
                        },
                        "BudgetYearOne": {
                            "val": "69.883"
                        },
                        "BudgetYearOneBase": {
                            "val": "69.883"
                        },
                        "BudgetYearTwo": {
                            "val": "33.548"
                        },
                        "BudgetYearThree": {
                            "val": "21.491"
                        },
                        "BudgetYearFour": {
                            "val": "38.951"
                        },
                        "BudgetYearFive": {
                            "val": "75.951"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Advanced Land Systems Technology project is developing technologies for enhancing U.S. military effectiveness and survivability in operations ranging from traditional threats to military operations against irregular forces that can employ disruptive or catastrophic capabilities, or disrupt stabilization operations.  Programs seek to break the relative symmetry of land combat to give U.S. forces a decided advantage in the current and future ground battlefield.  The emphasis is on developing affordable technologies that reduce reliance on consolidated forward-operating bases and required lines of communication, and provide small units and individual warfighters with hyper-mobility and hyper-lethality.  This project will develop methods and technologies to expand the maneuver trade space to include the vertical dimension, including subterranean environments, and will leverage advances in artificial intelligence to enable integrated manned-unmanned operations and decrease warfighter exposure through the use of autonomous agents."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Urban Reconnaissance through Supervised Autonomy (URSA)"
                                    },
                                    "Description": {
                                        "val": "The Urban Reconnaissance through Supervised Autonomy (URSA) program is developing and demonstrating new autonomous agents and techniques that can rapidly discriminate hostile intent and filter out threats during missions ranging from minutes to hours, leveraging natural or created stimuli to elicit behavioral responses among humans in an area.  The program seeks to create a system of autonomous ground and air platforms operating in conjunction with U.S. ground forces that monitor an area overtly to detect hostile forces and establish Positive Identification (PID) before any U.S. troops come into contact.  Military units follow strict rules of engagement (ROEs) that prescribe an escalation of force appropriate with the level of hostilities and confidence that an individual is engaged in nefarious behavior.  This program will establish a Legal, Moral, Ethical (LME) working group comprising multiple individuals (technologists, military, university professors, ethicists, legal experts) to develop an understanding of how escalation of force can and should be appropriately applied in the context of supervised autonomous systems. URSA is exploring scenarios and probing behaviors that will enable identifying innocent civilians and individuals with hostile intent.  This mission requires the integration and maturation of novel sensors, and unmanned ground and air vehicles which leverage current techniques in perspective and reactive autonomy to navigate cluttered urban environments.  URSA is developing new search and probing behaviors to expose human intent and serve as evidence that a potential target is a threat.  It is implementing new dimensions of evidence such as the human reactions to these probing actions to improve confidence in its decisions, and building a novel framework for escalating nonlethal force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.800"
                                            },
                                            "Text": {
                                                "val": "-  Conducted trade space analysis regarding sensors, unmanned systems, human behaviors and other dimensions of evidence, and iterative instigation activities.\n-  Initiated development of URSA system architectures.\n-  Initiated development of URSA Integrated Testbed (UIT).\n-  Held quarterly LME working group meetings and facilitated engagements with technology performers.\n-  Used UIT to perform initial evaluation of URSA system operation and functionality."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate initial URSA system capabilities in limited, controlled, performer-selected environments.\n-  Continue to develop URSA system architectures.\n-  Assess URSA system capabilities and use cases through URSA Integrated Testbed (UIT) environments.\n-  Demonstrate improved URSA system capabilities in limited, controlled, performer-selected environments.\n-  Continue quarterly LME working group meetings and facilitate engagements with technology performers.\n-  Identify URSA end-to-end system capabilities to inform future prototype system development and field experimentation campaign."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.000"
                                            },
                                            "Text": {
                                                "val": "-  Continue to develop and increase the fidelity of the UIT for iterative evaluation of expanding URSA system capability.\n-  Develop test infrastructure for live URSA field demonstrations.\n-  Evaluate URSA performance with incremental field demonstrations in increasingly complex urban environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects transition to field demonstrations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Subterranean (SubT) Challenge"
                                    },
                                    "Description": {
                                        "val": "The DARPA Subterranean (SubT) Challenge is developing novel integrated solutions capable of mapping, navigating, and searching complex and dynamic terrains (tunnel systems, urban underground and cave networks); sensors and computation for perception in austere conditions; distributed information sharing in degraded communications environments; and collaborative autonomy enabling extended operations with minimal human intervention.  The core objective of the SubT Challenge is to discover the solution(s) which best outperforms current approaches for manually and laboriously mapping and searching subterranean environments.  Newly developed capabilities will span across four technology focus areas in autonomy, perception, networking, and mobility technologies.  The program will increase the diversity, versatility, and robustness of relevant system technologies, capable of addressing the multi-faceted needs of a wide range of environments.  Innovations are being explored in the context of a public-facing, broadly inclusive DARPA Challenge."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.060"
                                            },
                                            "Text": {
                                                "val": "-  Conducted baseline design, development, and integration of proposed solutions in the subdomain of tunnel systems.\n-  Conducted circuit competition in the subdomain of tunnel systems.\n-  Assessed technology maturity and predicted technology trends to identify research and development needs and gaps.\n-  Continued development and refinement of the virtual testbed."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "34.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct baseline design, development, and integration of proposed solutions in the subdomain of urban underground.\n-  Conduct circuit competition in the subdomain of urban underground.\n-  Conduct baseline design, development, and integration of proposed solutions in the subdomain of cave networks.\n-  Conduct circuit competition in the subdomain of cave networks.\n-  Continue development and enhancement of the virtual testbed."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.800"
                                            },
                                            "Text": {
                                                "val": "-  Conduct baseline design, development, and integration of proposed solutions in the combined subdomains of tunnel systems, urban underground, and cave networks.\n-  Conduct final competition in the combined subdomains of tunnel systems, urban underground, and cave networks.\n-  Continue development and refinement of the virtual test bed."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects completion of the challenge events."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Underminer*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Tactical Networks of Tunnels (TNT)\n\nThe Underminer effort, an outgrowth of the Subterranean Challenge program, is exploring the development and integration of technologies to investigate, create, and employ technologies that drill\/bore, build, and use the underground environment for tactical operations in rapid, secure resupply.  Underminer is exploring creation and utilization of tunneling, drilling, and boring capabilities for systems at multiple scales.  The program is examining multiple concepts of operation and considering creation and use of both temporary tunnels as well as rapid creation of tunnel networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.140"
                                            },
                                            "Text": {
                                                "val": "-  Initiated trade studies in drilling\/boring methods, geological assessments of an underground route, methods, manpower, and infrastructure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete initial trade studies.\n-  Initiate development of Underminer concept of operation, system architecture, and demonstration test plans.\n-  Begin development and demonstration of enabling technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.601"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.601"
                                            },
                                            "Text": {
                                                "val": "-  Continue development and demonstration of enabling technologies.\n-  Verify that the technologies developed meet the required speed and accuracy thresholds.\n-  Test subsystems in laboratory or representative environments.\n-  Conduct system demonstrations in representative environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects program final demonstrations and reporting."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapunzel"
                                    },
                                    "Description": {
                                        "val": "Urban combat demands that riflemen also serve as combat engineers manipulating their local environment to gain tactical advantage.  The urban environment creates unique challenges in providing solutions for mobility, counter-mobility, survivability, and concealment.  Every pound that a warfighter wears or carries reduces their mobility and mission effectiveness, and, particularly in urban combat, reduced mobility paradoxically reduces their survivability.  The Rapunzel program seeks to enable warfighters to manipulate the urban environment through the application of novel materials research.  Rapunzel envisions soldier-borne or vehicle-borne utility-belt style packaged containers, reels, and spools of material that can perform urban engineering tasks such as create bridges between building rooftops, pull down enemy barriers, or provide false targets and concealment.  The program will identify those mass-manufactured materials, such as extremely high-tensile strength monofilament that can both provide novel mobility between buildings but also provide novel counter-mobility to enemy vehicles due to their electrical conductance properties.  The Rapunzel program will leverage extensive existing research into early developmental materials and invest in the task-based development and packing to provide these materials at appropriate length and size scales for immediate tactical use."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct trade space analysis and technical assessments regarding novel materials that are quickly field assembled and fabricated into lightweight components.\n-  Initiate development of mobility, counter-mobility, survivability, and concealment core requirements and systems architectures.\n-  Initiate development of critical systems engineering approaches and perform baseline demonstrations derived from primitives of existing technologies that can be leveraged to refine program metrics.\n-  Develop operational and technical performance models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.482"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.482"
                                            },
                                            "Text": {
                                                "val": "-  Initiate development of technology area\/task-based core integrated materials system components.\n-  Test materials and systems performance in a lab environment at preliminary scales, masses, and ranges without system packing, volume, or density concerns."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects completion of trade space analysis and shift to the lab environment materials tests."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Proportional Weapons"
                                    },
                                    "Description": {
                                        "val": "The Proportional Weapons program will create a real-time capability to analyze and apply proportional effects for families of weapons that suppress or breach any external structure to neutralize threats, clear spaces at range, keep them intact, and minimize collateral damage.  Novel approaches are needed that are absolutely effective from the air or ground against several scales of primarily urban, concealed threats while not being catastrophically destructive.  Current approaches to identifying, engaging, and assessing effects against evasive ground targets in complex terrain requires significant human oversight combined with human semantic reasoning tied to rules of execution, resulting in slow and methodical engagements.  Proportional weapons will develop next generation effects for ground systems that provides extended range and tunable effects with greatly minimized impact to a warfighter operator.  Proposed technical approaches will be scalable for application to dismounted warfighters, vehicle-borne (air and ground) systems, or as human-in-the-loop payloads for future autonomous platforms."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Begin developing systems architectures and analysis approaches for the proportionality of effects systems at multiple scales against multiple land-based threats.\n-  Execute performance trade studies, develop concepts, and assess technical effects analysis."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY2021 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sustained Combat Operations in Undefined Terrain (SCOUT)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Highly Networked Dissemination of Relevant Data (3HNDRED)\n\nThe Sustained Combat Operations in Undefined Terrain (SCOUT) program will explore an integrated system to aid ground troops in understanding and shaping the battlefield environment before, during, and after tactical operations.  SCOUT will develop ground robotic platforms with enhanced, all-terrain mobility, extended endurance, and novel movement techniques to increase platform survivability and reduce detection.  This capability will enable long-duration pre-mission reconnaissance, extending the timeline of current human scouts by 5-10x, and will support continuous patrolling or tactical resupply during sustainment operations.  SCOUT is envisioned to host mission payloads that will integrate with other heterogeneous sensors, such as soldier-borne, vehicle-borne, weapon status indicators, and manned or unmanned ground\/air assets, to form a complete picture of an area of interest.  This will enable new, networked capabilities at the tactical level, such as automatic generation of reports populated with event, location, and status of forces, both manned and unmanned, to support response.  SCOUT developed systems will provide mobility and extended endurance to enable increased payload access and information to pro-actively stage forces, enable on-demand resupply, or rapidly call for fires in support of timely operations.  The confluence of mobility, endurance, and survivability developed under the SCOUT program will push the state of the art in unmanned ground systems and support on-the-fly battlefield management, providing an asymmetric advantage to U.S. forces."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete preliminary design and research of sensor architecture.\n-  Fabricate multiple sensor hardware kits. \n-  Perform at least two data collection events with military users to assess performance of integrated sensor system and data processing algorithms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate system design for SCOUT robotic platforms.\n-  Initiate development of SCOUT enabling technologies.\n-  Initiate definition of SCOUT platform assessment events."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects initiation of robotic platform design work and enabling technology development."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Squad X"
                                    },
                                    "Description": {
                                        "val": "The U.S. military achieves overmatch against its adversaries in certain regimes; however, this level of overmatch is not realized at the squad to individual dismounted warfighter level.  The goal of the Squad X program is to leverage advances in real-time situational awareness and mission command; organic three-dimensional dismount mobility; extended range tracking, targeting, and response; and unmanned mobility and perception in order to create a squad with substantial combat overmatch.  The concept of overmatch at the squad level includes increased human stand-off, a smaller force density, and adaptive sensing to allow for responses at multiple scales.  Squad X is exploring advanced wearable force protection, advanced organic squad level direct and indirect trajectory precision weaponry, and non-kinetic precision capabilities.  The end result of the Squad X program is an individual dismount unit outfitted with sensors, weaponry, and supporting technology to achieve unit level overmatch as well as the overall integration of unmanned assets alongside the dismounts to create an advanced, dismounted small unit."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.009"
                                            },
                                            "Text": {
                                                "val": "-  Completed initial technology development efforts focusing on human machine interfaces, the squad common operating picture in three dimensions, and the synchronization of kinetic and non-kinetic engagement capabilities.\n-  Completed initial squad-system development efforts focusing on an automatic, augmenting system to increase squad performance and the integration of previously developed technology to enhance dismounted operations.\n-  Conducted system-level experimentation and evaluation in relevant conditions with operational units with increased number of humans and unmanned systems in the squad.\n-  Initiated expanded squad-system development efforts with focus on increased squad performance against threat capabilities analogous to near-peer\/peer states.\n-  Designed and developed integrated systems, to include addition of new sensors, unmanned systems, engagement capabilities, and improved decision algorithms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.440"
                                            },
                                            "Text": {
                                                "val": "-  Continue expanded squad system development efforts focusing on enhanced situational awareness and engagement capabilities.\n-  Continue to develop and optimize the real-world environment abstraction layer for squad activities.\n-  Demonstrate mission planning, rehearsal, and playback capabilities using the squad-leader-in-the-loop (SLIL) 3D simulation environment.\n-  Continue to leverage the squad-leader-in-the-loop (SLIL) environment to plan and rehearse missions with increased squad system\/subsystem and threat capabilities.\n-  Optimize autonomous cross-cuing of squad assets and sensor nodes, and integrated kinetic and non-kinetic engagement capabilities.\n-  Integrate multiple unmanned nodes into the squad system, with enhanced mobility and\/or payload capabilities.\n-  Conduct increasingly complex system-level experimentation and evaluation with operational units, to include: increased number of humans and unmanned systems in the squad and new squad technologies\/capabilities.\n-  Experiment with system performance in multiple locations, terrains and environments.\n-  Experiment with system performance against multiple, technology-enabled adversaries with capabilities analogous to near-peer\/peer states."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Force Protection (MFP)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Mobile Force Protection (MFP) program is to develop and demonstrate an integrated system capable of defeating a raid of self-guided small unmanned aircraft (sUAS) attacking a high value convoy on the move.  By focusing on protecting mobile assets, the program is emphasizing low footprint solutions, in terms of size, weight, power (SWaP), and manning, which will benefit other counter UAS missions and result in more affordable systems.  Defending in a variety of operating environments against these sUAS threats and associated concept of operations requires several breakthroughs in affordable technology to sense, decide and act on a compressed timeline while mitigating collateral damage.  The program is developing solutions applicable to the defense of mobile ground and naval forces that can also potentially defeat more conventional threats.  The solution will be scalable and modular such that it can be deployed in multiple defense applications and does not become obsolete with evolving threat capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "37.400"
                                            },
                                            "Text": {
                                                "val": "-  Updated affordability and unit cost analysis.\n-  Completed preliminary and critical designs of end-to-end objective demonstration system.\n-  Conducted two open-air demonstrations of limited capability configuration systems that include advanced airborne threats and complex environmental factors.\n-  Selected the end-to-end configuration for development and demonstration, addressing convoy on the move against a large raid of variously configured, self-guided sUAS using multiple layered neutralization techniques.\n-  Performed advanced modeling and simulation to validate system performance in operational environment.\n-  Modified and finalized the end-to-end system design to enable operations while on the move by reducing size, weight and power.\n-  Validated graphic user interface that reduces manning false alarm rate, and reaction time.\n-  Conducted final update of affordability and cost analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "-  Fabricate and integrate on the move end-to-end demonstration system.\n-  Integrate 3rd party sensors and interceptors to demonstrate interoperability and software openness.\n-  Validate and complete MFP system engagement modeling and simulation tool for transition.\n-  Complete affordability and unit cost analysis for transition.\n-  Conduct open-air demonstrations that include realistic threats, performance models, signatures, networks, and environmental factors.\n-  Explore opportunities for alternative kill mechanisms with larger magazines for greater effectiveness against swarms.\n-  Transition prototypes to Services for field testing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects program completion."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-07"
                    },
                    "ProjectTitle": {
                        "val": "AERONAUTICS TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "46.696"
                        },
                        "CurrentYear": {
                            "val": "53.119"
                        },
                        "BudgetYearOne": {
                            "val": "56.119"
                        },
                        "BudgetYearOneBase": {
                            "val": "56.119"
                        },
                        "BudgetYearTwo": {
                            "val": "70.119"
                        },
                        "BudgetYearThree": {
                            "val": "84.519"
                        },
                        "BudgetYearFour": {
                            "val": "75.528"
                        },
                        "BudgetYearFive": {
                            "val": "72.528"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Aeronautics Technology efforts will address high payoff opportunities that dramatically reduce costs associated with advanced aeronautical and aerospace systems and\/or provide revolutionary new system capabilities for satisfying current and projected military mission requirements.  This includes advanced technology studies of revolutionary propulsion, vehicle, and launch concepts, sophisticated fabrication methods, and examination of novel materials and enabling technologies for aeronautic and aerospace system applications.  Studies that also fundamentally change the calculus of battle including consideration of a mix of assets, potentially disposable or with limited lifespans, with increased levels of autonomy are included."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "OFFensive Swarm-Enabled Tactics (OFFSET)"
                                    },
                                    "Description": {
                                        "val": "The OFFensive Swarm-Enabled Tactics (OFFSET) program will design, develop, and demonstrate a swarm system architecture to advance the innovation, interaction, and integration of novel swarm tactics.  The program will examine enabling technologies for collaborative autonomy for large teams of unmanned systems, including unmanned ground and air capabilities through the use of both virtual, game-based and physical, live-fly testbeds.  Key research thrusts include the development of advanced swarm tactics-centered autonomy and development of human-swarm teaming interface technologies.  These combined enhancements will facilitate insights and enable employment of these collective systems to address current needs and defeat future threats.  The program will consider technologies supporting U.S. ground and air operations, extensible to other operating environments, requiring organic and\/or tactical swarm capabilities, and leveraging low-cost, rapidly deploy-able, autonomous system technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.500"
                                            },
                                            "Text": {
                                                "val": "-  Conducted capability-based field experimentation events that demonstrate swarm tactics for scaled missions of relevance to urban combat operations.\n-  Explored human-swarm interaction and immersive interfaces of autonomous teams to improve system performance and swarm operator situational awareness.\n-  Integrated systems enablers for enhanced swarm autonomy with advances in associated swarm tactics, primitives, and algorithms.\n-  Initiated swarm sprints for specific technology thrust areas relevant to human-swarm teaming."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate interfaces for and execution of viable swarm tactics-based courses-of-action.\n-  Continue integration of advanced swarm tactics for capability-based experimentation.\n-  Commence swarm sprints focusing on advancing the virtual environment, applying artificial intelligence methods, and augmenting the physical testbed to enable operationally relevant objectives."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct capability-based field experimentation events that demonstrate swarm tactics for scaled missions of relevance.\n-  Continue advancing the virtual environment and augmenting the physical testbed."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects a shift from swarm sprint integration efforts to field experimentation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Aeronautics Technologies"
                                    },
                                    "Description": {
                                        "val": "The Advanced Aeronautics Technologies program will examine and evaluate aeronautical technologies and concepts through applied research.  These may include the feasibility studies of novel or emergent materials, devices and tactics for both fixed and rotary wing air vehicle applications, launch vehicles, as well as manufacturing and implementation approaches.  The areas of interest range from propulsion and power to control techniques to solutions for aerospace mission requirements.  The result of these studies may lead to the development of new programs or improvement of existing systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Performed studies to support development of innovative prototypes.\n-  Initiated new studies of novel approaches to improve operating envelopes.\n-  Conducted trade studies of candidate technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform studies to support development of innovative prototypes.\n-  Initiate new studies of novel technologies to improve speed and range."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate conceptual design studies.\n-  Demonstrate emerging technologies to support maturation plans and risk reduction strategies.\n-  Perform modeling and simulation that support future concepts and novel architectures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Control of Revolutionary Aircraft with Novel Effectors (CRANE)"
                                    },
                                    "Description": {
                                        "val": "The Control of Revolutionary Aircraft with Novel Effectors (CRANE) program will demonstrate revolutionary improvements in aircraft controls technology.  The program will design, build, and flight test an aircraft that is able to fly and maneuver at altitude relying on state of the art Active Flow Control (AFC) technology.  AFC is a broad term that encompasses a range of technology approaches; broadly defined, it is a control mechanism which alters the aerodynamic flow field thru ejection or suction of fluid via an orifice on a lifting body.  An emphasis of the program will be on assessing AFC component technologies, risk reduction and experimentation, integrated testing, fabrication and demonstration of a relevant scale novel and innovative aircraft.  Technologies, design tools and models developed and demonstrated under this program will be made available to all Services as well as the civilian aerospace sector for application to future air systems development."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct technology analysis of AFC components and control scheme.\n-  Complete conceptual design.\n-  Perform risk reduction and experimentation.\n-  Initiate preliminary design of technology demonstrator."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete Preliminary Design Review (PDR).\n-  Initiate detailed design of technology demonstrator.\n-  Initiate flight software and control law development.\n-  Perform wind tunnel and component level testing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects program focus on detailed design and component testing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CounterSwarmAI"
                                    },
                                    "Description": {
                                        "val": "The objective of the CounterSwarmAI program is to develop systems for anticipating and defeating autonomous systems threats of the future.  These adversary systems will likely employ advanced artificial intelligence (AI) and machine learning techniques which will inevitably lead to increased complexity and unpredictability of these advanced threats.  CounterSwarmAI envisions the development of disruptive technologies across the engagement kill chain, themselves AI-empowered, which directly combat these challenges.  CounterSwarmAI decision software will directly interface with future and legacy defensive systems (kinetic and non-kinetic) to rapidly assess, optimally exploit, and efficiently defeat enemy autonomous systems threats.  Innovative solutions will enable (a) autonomous systems which provide understanding and vulnerability exploitation through machine learning, (b) an integrated AI-equipped open architecture for multi-faceted swarm defense, and (c) integration and experimentation with live surrogate swarm threats against current fielded defensive systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the applicability of artificial intelligence advances in large-scale autonomous system threats.\n-  Initiate research and development in machine learning advances and adversarial games to identify salient swarm attributes.\n-  Establish baseline technology advances needed for counter swarm engagement decisions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct capability-based field experimentation events that demonstrate artificial intelligence advances in large-scale autonomous system threats.\n-  Continue to establish technology advances needed for counter swarm engagement decisions.\n-  Develop an integrated software and middleware architecture with limited-scale field demonstrations in relevant operational contexts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter High Energy Lasers (C-HEL)"
                                    },
                                    "Description": {
                                        "val": "The Counter High Energy Lasers (C-HEL) program will provide a system that detects, locates and disrupts HEL adversary kill chains before irreversible damage occurs and offers survivability protection and concept of operations (CONOPS) for multi-domain U.S. assets.  The system will develop novel sensing and detection techniques to detect and locate HEL signatures before and during HEL firing during day\/night conditions and will leverage material advances for protective coatings to improve warfighter endurance during HEL attacks.  Potential detection modalities include low-light scattering detection of high-energy laser systems and coherent detection.  CONOPS, protective materials, and obscurants will be evaluated for potential improvements to survivability of systems targeted by HEL weapons.  Many elements of HEL systems are vulnerable, and HEL defeat systems may include kinetic and optical approaches."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.119"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.119"
                                            },
                                            "Text": {
                                                "val": "-  Develop initial point-of-departure designs for operational C-HEL system.\n-  Initiate trade studies and modeling and simulation to refine operational system concept.\n-  Develop C-HEL operational system requirements, demonstration plans for proof-of-concept prototype, and risk reduction\/technology maturation approach.\n-  Conduct conceptual design review for initial operational system.\n-  Demonstrate and test component level technologies.\n-  Conduct field test of protective coatings in a relevant environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Gremlins"
                                    },
                                    "Description": {
                                        "val": "The goal of the Gremlins program is to develop platform technologies that enable a new class of distributed warfare.  The Gremlins concept envisions small air-launched unmanned systems that can be responsively dispatched in volley quantity from commodity platforms, fly into contested airspace, conduct a moderate duration mission, and ultimately be recovered.  Key enabling technologies for the concept include smaller developmental payloads that benefit from multiple collaborating host platforms.  The Gremlins program will conduct risk reduction and development of the host platform launch and recovery capability and develop and demonstrate a recoverable Unmanned Air Vehicle (UAV) platform concept.  Enabling platform technologies will include precision relative navigation, advanced computational modeling, variable geometry stores, compact propulsion systems, and high speed digital flight control.  The program will leverage these technologies, perform analytic trade studies, conduct incremental development, and ultimately demonstrate the potential for an integrated air-launched Gremlins unmanned platform."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.567"
                                            },
                                            "Text": {
                                                "val": "-  Conducted flight validation for launch and recovery capability.\n-  Fabricated and ground tested flight-worthy assets.\n-  Conducted preliminary flight test demonstrating Gremlins performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.119"
                                            },
                                            "Text": {
                                                "val": "-  Conduct preliminary airborne recovery flight demonstrations.\n-  Conduct final flight test demonstrating full recovery capability.\n-  Conduct flight analysis and reporting of final program objectives."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircrew Labor In-cockpit Automation System (ALIAS)"
                                    },
                                    "Description": {
                                        "val": "The Aircrew Labor In-cockpit Automation System (ALIAS) program designed, developed, and demonstrated a kit enabling affordable, rapid automation of selected aircrew functions across a broad range of aircraft.  ALIAS enabled reduction of aircrew workload and\/or the number of on-board aircrew to improve performance.  The program developed hardware and software to automate select aircrew functions and will employ novel, low impact approaches to interface with existing aircraft monitoring and control systems.  The program also developed tractable approaches to rapidly capture crew-station specific skills and aircraft unique behaviors.  To accomplish this, ALIAS leveraged recent advances in perception, manipulation, machine learning, reusable software architectures, autonomous systems architecture, and verification and validation.  ALIAS culminated in a demonstration of the ability to rapidly adapt a single system to multiple aircraft and execute simple missions.  This reliability enhancement capability enables new operational concepts for reuse of existing air assets and allows a reduction in the number of aircrew required."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.629"
                                            },
                                            "Text": {
                                                "val": "-  Refined human machine interface to support multiple operational mission scenarios.\n-  Conducted flight testing on aircraft using integrated system.\n-  Conducted vehicle demonstrations on aircraft using integrated system.\n-  Conducted flight testing of Fly-by-Wire kit on aircraft."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-13"
                    },
                    "ProjectTitle": {
                        "val": "INFORMATION ANALYTICS TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "88.520"
                        },
                        "CurrentYear": {
                            "val": "103.584"
                        },
                        "BudgetYearOne": {
                            "val": "92.379"
                        },
                        "BudgetYearOneBase": {
                            "val": "92.379"
                        },
                        "BudgetYearTwo": {
                            "val": "83.077"
                        },
                        "BudgetYearThree": {
                            "val": "90.156"
                        },
                        "BudgetYearFour": {
                            "val": "95.011"
                        },
                        "BudgetYearFive": {
                            "val": "127.206"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Information Analytics Technology project develops technology for analyzing data and information arising from: 1) intelligence networks; 2) open, media, and other external sources; 3) sensors and signal\/image processors; and 4) collection platforms and weapon systems.  Technical challenges include the need to: 1) process huge volumes of diverse, incomplete, and uncertain data in tactically-relevant timeframes and 2) counter the information operations of sophisticated adversaries who seek to deceive, degrade, deny, and disrupt the U.S. information enterprise.  Benefits sought include deeper understanding of the evolving operational environment tailored to the needs of commanders at every echelon; an enhanced capability to plan, monitor, and control diverse military operations ranging from stabilization and information operations to combat engagements; and improvements to the efficiency of core military functions such as national and homeland security, warfighter health and readiness, and defense support of law enforcement and civil authorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Warfighter Analytics using Smartphones for Health (WASH)"
                                    },
                                    "Description": {
                                        "val": "The Warfighter Analytics using Smartphones for Health (WASH) program is developing analytic techniques for continuous and real-time assessment of warfighter physiological health and cognitive state based on the multiple sensor data streams generated by modern smartphones.  Recent research in the area of smartphone biometrics has shown the feasibility of measuring user physiological and behavioral parameters for purposes of user authentication.  WASH will extend these smartphone biometrics to reliably measure additional user physiological and behavioral parameters relevant to health assessment and the diagnosis of disease.  WASH aims to produce a mobile application that continuously and reliably assesses warfighter health and mission readiness.  WASH is coordinated with the Naval Health Research Center."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.810"
                                            },
                                            "Text": {
                                                "val": "-  Developed secure, privacy-preserving, cloud-based data ingest and storage technologies for collecting, organizing, and associating user smartphone, physiological health, and behavioral data.\n-  Developed a mobile application to capture user smartphone data passively and securely, and to compute digital biomarkers.\n-  Performed laboratory assessments of sensitivity and specificity of smartphone-based digital biomarkers for detection and diagnosis of physiological disease and assessment of cognitive state."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.580"
                                            },
                                            "Text": {
                                                "val": "-  Develop and conduct periodic audits of the security and privacy controls of the cloud-based data ingest and storage infrastructure, and perform upgrades as appropriate. \n-  Refine digital biomarker computation to enable discrimination of noise based on context, for example, vehicular vibration versus behavioral movement. \n-  Perform field assessments of sensitivity and specificity of smartphone-based digital biomarkers for detection and diagnosis of physiological disease and assessment of cognitive state in collaboration with Naval Health Research Center."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Continue to enhance periodic audits of the security and privacy controls of the cloud-based data ingest and storage infrastructure, and perform upgrades as appropriate.\n-  Evaluate algorithms to associate digital biomarkers with physiological and cognitive state across a diverse set of relevant ambient contexts.\n-  Increase scale of cloud-based data ingest and storage infrastructure for a larger study in collaboration with Naval Health Research Center."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase is due to continued work to develop and integrate techniques to analyze user smartphone data, and additional work to evaluate the performance of techniques to assess user physiological health and cognitive state."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adapting Cross-domain Kill-Webs (ACK)"
                                    },
                                    "Description": {
                                        "val": "The Adapting Cross-domain Kill-Webs (ACK) program will assist military decision makers with rapidly identifying and selecting options for tasking and re-tasking assets within and across organizational boundaries.  Based on technologies developed in the Resilient Synchronized Planning and Assessment for the Contest Environment (RSPACE) program (budgeted in PE 0603766E, Project NET-01), ACK will assist users with selecting sensors, effectors, and support elements across military domains (space, air, land, surface, subsurface, and cyber) to form and adapt kill chains to deliver desired effects on targets.  Today's Command and Control (C2) organizations and processes cannot support multi-domain warfighting concepts, especially during joint operations.  ACK will address this challenge by utilizing a decentralized approach to allocating resources to tasks and assigning mission orders to assets, motivated by ideas developed in online commerce, sourcing, and supply chain management, such as bid requests and offers.  The impact of ACK will be to accelerate asset re-allocation and assignment decision timelines to be on the order of minutes, and the output of ACK will be automated tools and decision aids to support the selection of the elements of a kill-chain and assignment of roles and responsibilities to each of the elements.  Technology developed under this program will be transitioned to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Began development of the bid request and offer language and message sets for C2 node and virtual liaison coordination across domains.\n-  Created multi-domain capability models as digital artifacts to support evaluations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop capability (sensors, weapons, communications, etc.) representations necessary to support the ACK program concept.\n-  Begin development of the supplier-side, virtual liaison offer generation algorithms, and the consumer-side, C2 node algorithms for adjudicating amongst the offered capabilities.\n-  Begin development of a supporting user interface that enables an operator to visualize recommendations and select a final plan.\n-  Begin development of the evaluation test bed."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete development of evaluation test-bed.\n-  Assess the ability of virtual liaisons to quickly adapt mission plans in the test bed environment. \n-  Assess the ability of C2 node software to adjudicate offers and support rapid user assessment in visual interfaces.\n-  Identify Service partners and develop plans for demonstration of cross-domain mission adaptation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increase is due to shift from tool and test bed development to demonstration, testing, and enhancement."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modeling Adversarial Activity (MAA)"
                                    },
                                    "Description": {
                                        "val": "The Modeling Adversarial Activity (MAA) program is developing technologies for generating high-confidence indications and warnings for weapons of mass terror (WMT) activities.  WMT pathways consist of networks or links among individuals, groups, organizations, and other entities that act to promote or enable the development, procurement, possession, transportation, or proliferation of WMTs and related capabilities.  Monitoring and controlling WMT pathways is essential to denying access to WMT technology, knowledge, materials, expertise, and weapons.  MAA will create graph models reflecting prototypical WMT pathways, develop methods for creating merged activity graphs by aligning entities across multiple intelligence modalities, develop algorithms to match empirical activity graphs with pathway models, and create synthetic data sets at scale to support development and testing of WMT activity detection techniques.  MAA technology development is being coordinated with the Defense Threat Reduction Agency (DTRA) and the Department of Homeland Security (DHS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.500"
                                            },
                                            "Text": {
                                                "val": "-  Implemented graph alignment techniques, and assessed strengths and weaknesses of alternative approaches on synthetic data while improving performance and scalability.\n-  Applied techniques for approximate matching of activity graphs, created an initial prototype pathway recognizer, and demonstrated the capability to detect modeled WMT activity sequences in synthetic data.\n-  Developed a plan for expanding the graph alignment and matching techniques to a broader range of graphs, such as noisy knowledge graphs derived from multiple structured and unstructured sources."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.500"
                                            },
                                            "Text": {
                                                "val": "-  Evaluate methods to support partial pathway matching and adapt pathway models, including mechanisms for refining prototype pathway recognizers that are generating high rates of false alarms.\n-  Generalize the graph alignment and matching techniques to noisy knowledge graphs derived from multiple structured and unstructured sources.\n-  Develop techniques for approximate matching of activity graphs for real world data with rich semantics.\n-  Scale methods to enable calculations on realistically large graph models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.225"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.225"
                                            },
                                            "Text": {
                                                "val": "-  Evaluate the scalability of techniques for both construction of large, semantically-rich graphs and approximate matching of activity graphs with rich semantics on real world data.\n-  Extend real-time graph alignment capabilities to environments with frequent information updates.\n-  Explore methods to tune the end-to-end system to maximize detection and graph matching performance.\n-  Collaborate with transition partners to implement techniques in their environments, and to optimize techniques for efficient and timely execution on their computational infrastructure."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects ramping down of work to develop techniques and software for WMT pathway discovery, and the focus shifting to evaluation on realistic data."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data-Driven Discovery of Models (D3M)"
                                    },
                                    "Description": {
                                        "val": "The Data-Driven Discovery of Models (D3M) program is developing automated model discovery techniques and tools that enable non-expert users to create empirical models of real, complex processes and phenomena.  The ability to understand the battlespace is driven increasingly by analysis of sensor and open source data.  The DoD and the Intelligence Community (IC) are fundamentally limited by a shortage of expert data scientists to construct empirical models that predict behaviors and anticipate contingencies during tactical and strategic planning.  D3M is addressing this need by creating technologies that automate the construction of complex empirical models.  D3M technologies include a library of data modeling primitives that are automatically selectable; automated approaches for composition of complex models from modeling primitives; and intuitive mechanisms for human-model interaction that enable curation of models by non-experts.  D3M is focused on the types of empirical modeling problems commonly encountered by the DoD and IC."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.310"
                                            },
                                            "Text": {
                                                "val": "-  Enhanced modeling primitives and incorporated the primitives in integrated toolkits.\n-  Developed and synthesized multi-modal predictive models for unsolved problems, including automated data collection for data augmentation.\n-  Developed question formalization frameworks and specifications for question decomposition to support user-model interaction.\n-  Demonstrated automated composition of complex models in coordination with operators from multiple domains."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "-  Extend modeling primitives to handle heterogeneous and unstructured data from disparate sources and integrate into toolkits.\n-  Extend composability techniques to enable the construction of data analytic pipelines for complex problems, such as predicting events utilizing a combination of open source intelligence data and data from protected sources.\n-  Formulate measures and models for normal\/anomalous behavior of financial markets, and propose indications and warnings to quickly detect and characterize attacks on financial infrastructure. \n-  Collaborate with transition partners from the DoD and IC to perform quantitative assessments of automatically-generated models and to compare these with their internal-expert-developed models on real-world data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.034"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.034"
                                            },
                                            "Text": {
                                                "val": "-  Complete the library of modeling primitives with support for unsupervised and semi-supervised machine learning, including unsupervised data discovery.\n-  Extend automated data collection to support discovery and augmentation of datasets with limited or no human-in-the-loop, and with support for non-traditional application domains where insufficient or no training data exists.\n-  Develop scalable techniques for integrating heterogeneous, high-volume financial data streams to enable near-real-time situational awareness of financial markets.\n-  Enable transition and deployment of complete open source end-to-end software systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease is the result of development work ramping down and the focus shifting to demonstrations in collaboration with transition partners."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Causal Exploration of Complex Operational Environments"
                                    },
                                    "Description": {
                                        "val": "The Causal Exploration of Complex Operational Environments program is developing advanced modeling, analysis, simulation, and visualization tools to enable command staffs to rapidly and effectively design, plan, and manage missions in complex operational environments.  The U.S. military increasingly operates in remote and unstable parts of the world where mission success depends heavily on cooperation with a wide variety of stakeholder groups on civil, economic, and military matters.  These groups typically include host nation government organizations, local civilian groups, and non-governmental organizations, each of which has priorities, sensitivities, and concerns that may differ significantly.  Current mission design and planning technologies do not adequately model the range of options or the inherent uncertainties.  This program will develop tools to create causal, computational models that represent the most significant relationships, dynamics, interactions, and uncertainties of the operational environment including political, military, economic, and social factors.  These tools will enable command staffs to design and quantitatively assess potential courses of action in complex operational environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.400"
                                            },
                                            "Text": {
                                                "val": "-  Developed and demonstrated techniques to quantify uncertainty in inputs and models, and refined methodologies and measurements to address dynamically changing models and enable component comparisons.\n-  Expanded visualizations and user interfaces to support exploration and refinement of models.\n-  Produced an initial prototype system and collaborated with transition partners to assess models for operational environments with complexities such as tribal rivalries, resource shortages, and insurgent activities.\n-  Conducted a collaborative experiment in which COCOM planners and program developers worked together to validate and refine the technology on simulated operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate techniques to model degrees of uncertainty through all parts of the system, to enable users to quickly assess the robustness of operational designs, and to update models of operational environments as new information arrives.\n-  Integrate language processing and social media analysis technologies to enable indications and warnings of adversary information operations campaigns. \n-  Conduct collaborative experiments in which military planners and program developers work together to further refine the technology on simulated operations, and an operational evaluation to measure usability and suitability of the system.\n-  Transition system and support incorporation of training materials into Service school curriculum."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.500"
                                            },
                                            "Text": {
                                                "val": "-  Develop scalable social media analytics for real-time effectiveness assessment of adversary information operations campaigns and countermeasures.\n-  Identify additional transition partners and tailor system functionality to meet key needs for operational deployment.\n-  Conduct final operational evaluation to measure usability and suitability of the system for operational deployment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease is due to ramping down of work to develop technologies, and focus shifting to operational evaluation with military users."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Semantic Forensics (SemaFor)"
                                    },
                                    "Description": {
                                        "val": "The Semantic Forensics (SemaFor) program, building on technologies introduced in MediFor, will develop technologies to defend against the falsification of multimedia and disinformation campaigns.  Statistical detection techniques have been successful, but media generation and manipulation technology is advancing rapidly, and purely statistical detection methods are now insufficient.  Existing media generation and manipulation algorithms are data driven and are prone to making semantic errors that provide defenders an opportunity for asymmetric advantage.  SemaFor will create semantic and statistical analysis algorithms that determine if media is generated or manipulated; attribution algorithms that infer if media originates from a particular organization or individual; and characterization algorithms that reason about whether media was generated or manipulated for malicious purposes.  SemaFor aims to create technologies to identify, deter, and understand adversary disinformation campaigns."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.700"
                                            },
                                            "Text": {
                                                "val": "-  Devise initial algorithms that reason about semantic inconsistencies in multi-modal media assets to detect if they have been manipulated, if their purported sources are correct, or if the manipulation would have a negative real world impact. \n-  Create baseline approaches for fusing multi-source semantic and statistical information into summary indicators for detection, attribution, and characterization of impact.\n-  Formulate an architecture for a semantic media analysis system to support demonstration and evaluation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.620"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.620"
                                            },
                                            "Text": {
                                                "val": "-  Develop general semantic characterization algorithms that reason about whether a media asset or narrative is synthetic.\n-  Develop mechanisms for explaining algorithmically-generated semantic inferences, and apply semantic analysis techniques to multimedia. \n-  Develop a system prototype and evaluate performance on existing and purpose-built text, image, video, and audio libraries.\n-  Develop challenge problems that emphasize threat scenarios in collaboration with DoD and Intelligence Community (IC) partners."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase is due to ramping up of development of semantic techniques for reasoning about inconsistencies in multimedia and initiation of prototyping and evaluation work."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Media Forensics (MediFor)"
                                    },
                                    "Description": {
                                        "val": "The Media Forensics (MediFor) program is creating technologies for analyzing media content to determine trustworthiness for military and intelligence purposes.  Current approaches to media forensics are labor intensive, requiring analysts and investigators to undertake painstaking analyses to establish context and provenance.  The program will develop, integrate, and extend image and video analytics to provide forensic information that can be used by analysts and automated systems to quickly determine the integrity of open source and captured images and video.  Technologies will transition to operational commands and the Intelligence Community (IC)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.500"
                                            },
                                            "Text": {
                                                "val": "-  Enhanced the effectiveness of forensic algorithms that must operate at large scales and in near-real time.\n-  Developed association methods to track and assess related media assets that are subject to coordinated manipulation by adversaries.\n-  Developed quantitative measures of integrity relevant to diverse needs of government users and specific missions.\n-  Evaluated the effectiveness of the integrated integrity-assessment platform on data containing manipulations of interest."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.304"
                                            },
                                            "Text": {
                                                "val": "-  Enhance robustness of integrity assessment approaches to deep-fake and other generative attacks.\n-  Harden the integrity assessment prototype, and demonstrate on large scale datasets in collaboration with transition partners from the DoD and IC."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Distributed Battle Management (DBM)"
                                    },
                                    "Description": {
                                        "val": "The Distributed Battle Management (DBM) program developed mission-driven architectures, protocols, and algorithms for battle management (BM) in contested environments.  The military is turning to networked weapons and sensors onboard a heterogeneous mix of multi-purpose manned and unmanned systems.  In contested environments, it is a challenge for BM networks to communicate with subordinate platforms due to extensive adversarial cyber and electronic warfare operations, anti-satellite attacks, and the need for emissions control in the face of a formidable integrated air defense system.  The DBM program developed a distributed command architecture with decentralized control of mission-focused asset teams.  The architecture enabled rapid reaction to ephemeral engagement opportunities and maintained a reliable BM structure, despite limited communications and platform attrition in continuously evolving threat environments.  The program incorporated highly automated decision making capability while maintaining vital human-in-the-loop operator approval.  DBM technologies transitioned to the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Used DBM components in a live-virtual experiment in support of transition to the services (Navy or Air Force).\n-  Used DBM components (fusion and resource management) in support of 8 live-fly events for the System of Systems Integration Technology and Experimentation (SoSITE) program (budgeted in PE 0603766E, Project NET-01) incorporating increased complexity in terms of new platforms and payloads and overall scale.\n-  Expanded the number of flight systems modeled in DBM system."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}