{
    "id": "2021-Navy-PB-1319-JBOOK-7db8e596d0ddeb1f5b53adfad61b01414eb438597126a733951e3c67dba6beab-17",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA6-U_RDTE_JustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605873M"
        },
        "ProgramElementTitle": {
            "val": "Marine Corps Program Wide Supt"
        },
        "R1LineNumber": {
            "val": "188"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "21.158"
            },
            "CurrentYear": {
                "val": "34.734"
            },
            "BudgetYearOne": {
                "val": "42.749"
            },
            "BudgetYearOneBase": {
                "val": "42.749"
            },
            "BudgetYearTwo": {
                "val": "33.145"
            },
            "BudgetYearThree": {
                "val": "32.989"
            },
            "BudgetYearFour": {
                "val": "31.394"
            },
            "BudgetYearFive": {
                "val": "32.397"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) provides the analytical foundation for the Marine Corps Studies System (MCSS), including mandated Mission Area Analyses and Cost and Operational Effectiveness Analyses. The MCSS is the front end of the Marine Corps' acquisition system.  This PE also supports the material acquisition process as follows: managing the Marine Corps Operational Test and Evaluations (OT&E); providing Chem Bio Consequence Management of capabilites for Weapons of Mass Destruction (WMD) incident response forces; and conducting Phase A activities to investigate potential material solutions that validate needs, program costs, business decisions, and prevent undue delays in pursuing priority requirements."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "21.538"
                },
                "CurrentYear": {
                    "val": "37.265"
                },
                "BudgetYearOne": {
                    "val": "36.338"
                },
                "BudgetYearOneBase": {
                    "val": "36.338"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.158"
                },
                "CurrentYear": {
                    "val": "34.734"
                },
                "BudgetYearOne": {
                    "val": "42.749"
                },
                "BudgetYearOneBase": {
                    "val": "42.749"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.380"
                },
                "CurrentYear": {
                    "val": "-2.531"
                },
                "BudgetYearOne": {
                    "val": "6.411"
                },
                "BudgetYearOneBase": {
                    "val": "6.411"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-2.531"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.033"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.347"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "8.182"
                                },
                                "BudgetYearOneBase": {
                                    "val": "8.182"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.771"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.771"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2021 funding request was reduced by $2.000M to account for the availability of prior year execution balances.\n\nThe net increase of $8.015M from FY 2020 to FY 2021 is primarily due to increased scope of Marine Corps Wargaming Capabilities.  Wargaming Capabilities increase of $8.531M reflects multiple integrated prototyping competitive vendor awards to develop end-to-end, comprehensive\/integrated prototypes for the entire life cycle of wargaming from design through execution through postgame analysis which follow with a competitive down select to one contractor in the first half of FY22. The integrated prototype contracting efforts begin in 4QFY20 and complete in 4QFY21. The contractor selected will then provide the production solution starting in FY23. The production system will link up with the new wargaming facility being built by the USMC in MILCON project P-719."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0030"
                    },
                    "ProjectTitle": {
                        "val": "Studies & Analysis\/MC"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "5.563"
                        },
                        "CurrentYear": {
                            "val": "4.196"
                        },
                        "BudgetYearOne": {
                            "val": "2.348"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.348"
                        },
                        "BudgetYearTwo": {
                            "val": "2.748"
                        },
                        "BudgetYearThree": {
                            "val": "3.186"
                        },
                        "BudgetYearFour": {
                            "val": "3.608"
                        },
                        "BudgetYearFive": {
                            "val": "4.039"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Marine Corps Wargaming Capability Center transitions from Project 0030 to Project 3009 in FY20."
                        },
                        "ProjectMissionDescription": {
                            "val": "Marine Corps Requirements Oversight Council (MROC) established Operations Analysis Directorate (OAD) as the sole operations research, analytic support, and studies management program for the Marine Corps Study System (MCSS).  MCSS analysis is achieving greater efficiency, productivity, and innovation through operations research methodologies such as: operational analysis, statistical analysis, multi-objective decision methods, optimization, cost analysis, and a wide range of computer-based models and combat simulations insuring the optimization of resources now and in the future.  Analyses spans the spectrum of conflict in a Joint, Interagency, Intergovernmental, and Multinational (JIIM) context to inform critical senior level decision makers of current and future national security issues and provides unique and distinct analytic capabilities that enable the collaboration and sharing of analyses that reduces the duplication of topics that are of broad interest. MCSS is an integral part of the Marine Corps and Joint Chiefs decision-making processes to organize, man, train, equip, sustain, and transform resources from the current to the future force.\n\nThis program element has been revised into two specialized analytical divisions: (1) External Analysis Division (EAD) - responsible for providing joint external analysis is the Marine Corps' sole representative in the joint modeling arenas.  Provides deployed on site professional operations analysis support to Special Purpose MAGTFs in CENTCOM and AFRICOM. (2) Combat Development Analysis Division responsible for executing a select portfolio of studies for senior leadership, Capabilities Based Assessment (CBA) and Marine Corps Enterprise Integration Plan (MCEIP)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Studies & Analysis\/MC"
                                    },
                                    "Description": {
                                        "val": "The Marine Corps Studies System (MCSS), the sole responsibility of the Operations Analysis Directorate (OAD), Combat Development and Integration (CD&I), Marine Corps Combat Development Command (MCCDC),supports the Commandant's Planning Guidance (CPG) and Commanding General CD&I's Force Design Plan.  Program provides research and analysis and findings to ensure a greater understanding of issues and alternatives concerning force design, tactics, wargaming, strategies, intelligence, weapon selection and retention, systems' programs, cyber intel, and resource allocation.  Efforts are selected by the Studies Requirements Review Board (SRRB) and approved by the CG, Combat Development and Integration (CD&I). with focus on current and future USMC mission requirements and the need for comprehensive analyses that meets the Commandant's Strategic Goals, supports and  protects forces in theater, and utilizes funds efficiently."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.563"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.196"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-  Continued:  Synthetic Operations Research Model (STORM) joint armed forces effort that supports modeling and simulation analyses involving irregular warfare missions and force design plans executed in a future Defense Planning Guidance scenario.  These missions include information operations, offensive tactical and operational CYBER operations, foreign internal defense, special direct action arising from intelligence gathered from Human Intelligence (HUMINT) and technical (SIGINT, CYBER) means.\n\n-  Completed:  Marine Air Ground Task Force (MAGTF) Requirements Analysis in response to Congressional inquiries. Space-Based Capabilities efforts which explored Joint Navigation Warfare Center (JNWC) databases and models to identify algorithms that can be built that define the effect on receivers and equipment. Improved Marine Corps Enterprise Network (MCEN) defensive cyber operations and provided recommendations to the Marine Corps Cyberspace Operations Group (MCCOG).  Munitions Requirements Processes determined the projected inventory against future requirements.  Intelligence without Satellite Communications documented intelligence analysts' reliance on SATCOM and the limitations to planning and operations jamming or other interference would cause.\n\n-  Completed:  Studies and analysis requested adhoc by senior level leadership to support combat development and systems acquisition decisions.  Core competencies include examination of Aviation, C4ISR, Maneuver, Logistics, and Seabasing capabilities in order to evaluate and identify operational deficiencies, and to explore potential solutions. \n\n-  Initiated:  Studies and analysis submitted via the Marine Corps Studies System Call for Studies that support the Commandant's 2020-2025 Vision and Strategy Areas of concentration including: Force Development and Combat Readiness; National Security Environments Threats and Strategic Planning; Intelligence Information and Networks; Capability Integration; Weapons Systems; and Space Based capabilities.  Provided focused analyses regarding force realignments, training, and equipment support that best meet the tactical needs of the Marine Corps while building a leaner better educated force\n\n-  Initiated and Completed:  Provided combat analyst assessment teams for national emergencies and contingencies. Conducted baseline analysis to support Mission Capability Packages (MCPs), Investment Strategy, Joint Capability Areas (JCAs), and the Naval Strategic Plan providing assessments for future force development.  Provided analysis of tactical operations within the USMC and formulate ways to improve the effectiveness of the forces to win and minimize costs and lives lost.\n\n-  Update to Data Center equipment as required."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.348"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.348"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-  Continue:  Analysis and studies in the areas of: Joint Capabilities Assessments; Naval Strategic Plan Assessments; equipment capabilities assessments to include aviation and tactical vehicles acquisitions, and studies analyzing threat assessments from changing hostile entities. These studies and analysis efforts require follow-on analysis or longer period of data analyses and metrics preparation to complete.\n\n-  Continue:  Synthetic Operations Research Model Phase II (STORM) joint armed forces effort that supports modeling and simulation analyses involving irregular warfare missions and force design plans executed in a future Defense Planning Guidance scenario.  These missions include information operations, offensive tactical and operational CYBER operations, foreign internal defense, special direct action arising from intelligence gathered from Human Intelligence (HUMINT) and technical (SIGINT, CYBER) means.\n\n-  Complete:  Studies and analysis efforts initiated in FY20 in the areas of Fleet Logistics and Composition and Mission Capabilities Integration; Offensive Tactical and Operational CYBER Operations Weapons Systems and Space Based Capabilities; and Naval and Joint Services Strategic Planning studies. \n\n-  Continue:  Studies and analysis submitted via the Marine Corps Studies System Call for Studies that support the Commandant's 2020-2025 Vision and Strategy Areas of concentration including: Force Development and Combat Readiness; National Security Environments Threats and Strategic Planning; Intelligence Information and Networks; Capability Integration; Weapons Systems and Space Based Capabilities. Provide focused analyses regarding force realignments, training and equipment support that best meet the tactical needs of the Marine Corps while building a leaner better educated force.\n\n-  Initiate:  Studies and analysis requested adhoc by senior level leadership to support combat development and systems acquisition decisions. Core competencies include examination of Aviation, C4ISR, Maneuver, Logistics, and Seabasing capabilities in order to evaluate and identify operational deficiencies, and to explore potential solutions.\n\n-  Initiate:  Provide combat analyst assessment teams for national emergencies and contingencies. Conduct baseline analysis to support Mission Capability Packages (MCPs), Investment Strategy, Joint Capability Areas (JCAs), and the Naval Strategic Plan providing assessments for future force development.  Provide analysis of tactical operations within the USMC and formulate ways to improve the effectiveness of the forces to win and minimize costs and lives lost.\n\n-  Initiate:  Studies directed by the Commandant Marine Corps (CMC) to invest in the advancement of Big-Data Analytics and the potential for Machine Learning as a means to ensure a cost effective roadmap for implementing progressive advancements for institutional, economic and evolutionary efficiencies.\n\n-  Initiate:  The Modeling and Simulation Analytical Toolkit (MSAT) Phase VI that supports analysis involving irregular warfare missions executed in a future Defense Planning Guidance scenario.  These missions include information operations, offensive tactical and operational CYBER operations, foreign internal defense, special direct action arising from intelligence gathered from Human Intelligence (HUMINT) and technical (SIGINT, CYBER) means.\n\n-  Initiate:  Acquisition of new modeling and simulation tools that support changing and evolving analytical and techniques and allow for efficient collection of metrics."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $1.848M from FY20 to FY21 is due to the completion of Phase I STORM, joint armed forces effort that supports modeling and simulation analyses involving irregular warfare missions and force design plans executed in a future Defense Planning Guidance scenario. STORM Phase II is the continuing effort in FY21. Phase I costs were higher due to the complexity of initial research."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "1109\/4630"
                                    },
                                    "Title": {
                                        "val": "Marine Corps Wargaming Capability"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "28.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.991"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.131"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0033"
                    },
                    "ProjectTitle": {
                        "val": "OT&E Support"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "14.090"
                        },
                        "CurrentYear": {
                            "val": "14.333"
                        },
                        "BudgetYearOne": {
                            "val": "14.906"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.906"
                        },
                        "BudgetYearTwo": {
                            "val": "15.291"
                        },
                        "BudgetYearThree": {
                            "val": "15.585"
                        },
                        "BudgetYearFour": {
                            "val": "15.953"
                        },
                        "BudgetYearFive": {
                            "val": "16.289"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Marine Corps Operational Test and Evaluation Activity (MCOTEA) supports the material acquisition process by managing the Marine Corps Operational Test (OT) programs for Acquisition Categories (ACAT) I through ACAT IV (less OT of manned aircraft) and performs other functions that may be directed by the Commandant of the Marine Corps. The primary purpose of Operational Test and Evaluation (OT&E) is to provide information to the Milestone Decision Authority (MDA) regarding the Operational Effectiveness (OE) and Operational Suitability (OS) of the system addressed at a decision point. MCOTEA must ensure that the Marines in the Operating Forces receive the very best possible equipment and support. MCOTEA must also ensure each system proposed for acquisition is tested adequately, evaluated objectively, and reported independently.\n\nMarine Corps Operational Test and Evaluation Activity (MCOTEA) is the only unit that provides the Marine Corps with required operational test and evaluation (OT&E) capability, ensuring the Marine Corps is compliant with laws and regulations, and ensuring that training and equipment are operationally effective, relevant, and suitable.  Additionally, MCOTEA's early involvement, coordination, and oversight in developmental testing and evaluation of new combat and combat support systems ensures that our Marines are the best trained, and have the best equipment, with the lowest test costs for taxpayers. Finally, MCOTEA's support of rapid acquisitions ensures that Marines in the fight are supported with the newest and most advanced equipment and that the Marine Corps is compliant with regulations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MCOTEA"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.090"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.333"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue evaluating, quantifying, and reporting on programs for the operational effectiveness, suitability and survivability of planned acquisitions to meet warfighting capabilities and will be providing Milestone Decision Authority (MDAs) to programs that are inherently governmental and a comprehensive understanding of operational risk associated with ACAT programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.906"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.906"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue evaluating, quantifying, and reporting on programs for the operational effectiveness, suitability and survivability of planned acquisitions to meet warfighting capabilities and will be providing Milestone Decision Authority (MDAs) to programs that are inherently governmental and a comprehensive understanding of operational risk associated with ACAT programs."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $0.573M is a result of civilian pay\/benefits\/awards rate increases\/assumptions."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0606942M\/4038"
                                    },
                                    "Title": {
                                        "val": "Cyber Vulnerability Evaluation"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.731"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "6.731"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2330"
                    },
                    "ProjectTitle": {
                        "val": "Chem Bio Consequence Mgmt"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.505"
                        },
                        "CurrentYear": {
                            "val": "1.591"
                        },
                        "BudgetYearOne": {
                            "val": "1.620"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.620"
                        },
                        "BudgetYearTwo": {
                            "val": "1.654"
                        },
                        "BudgetYearThree": {
                            "val": "1.687"
                        },
                        "BudgetYearFour": {
                            "val": "1.721"
                        },
                        "BudgetYearFive": {
                            "val": "1.755"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Family of Incident Response Systems (FIRS) consists of equipment, systems, and services designed to provide Weapons of Mass Destruction (WMD) incident response forces the capabilities needed to effectively respond to a terrorist attack using Chemical, Biological, Radiological, Nuclear, and High-Yield Explosives (CBRNE). FIRS meets the mission requirements for the detection; mass casualty decontamination; force protection; responder inter-agency interoperability; Command, Control, Communications, Computers & Intelligence (C4I); urban search and rescue; medical and general support requirements needed by these forces to mitigate the effects of a CBRNE terrorist attack. FIRS relies primarily on Commercial Off-The-Shelf\/Non-Developmental Items (COTS\/NDI) equipment and systems that meet the particular mission requirements of Consequence Management (CM). Nuclear, Biological, and Chemical (NBC) systems are adopted if they meet the CM mission requirements. FIRS Research & Development effort allows the program to keep abreast of emerging technologies in the commercial sector and address operational capability gaps that cannot be met by commercial items."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "FIRS: Reconnaissance Mission Area"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.580"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Completed: CALS FC-IS naval system integration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $.300M between FY20 and FY21 is due to RDT&E efforts transitioning under Family of Incident Response Systems to better reflect program plan."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FIRS: Force Protection Mission Area"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.925"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.291"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue durability test of Chemical Biological Incident Response Force's (CBIRF's) CBRN personal protection equipment items, including Class 2 and Class 3 suits."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $1.291M between FY20 and FY21 is due to RDT&E efforts transitioning under Family of Incident Response Systems to better reflect program plans."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FIRS: Family of Incident Response Systems"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.620"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.620"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue durability test of Chemical Biological Incident Response Force's (CBIRF's) Chemical, Biological, Radiological and Nuclear (CBRN) personal protection equipment items, including Class 2 and Class 3 suits.\n-Initiate communication integration on improved Mobile Chemical Agent Detector (iMCAD)\n-Initiate Dismounted Reconnaissance Sets, Kits, and Outfits (DR SKO) training emulator device\n-Initiate development Dismounted Reconnaissance Sets, Kits, and Outfits (DR SKO) analytic, detection, and identification training devices.\n-Initiate Information Assurance (IA) \/ Cybersecurity accreditation for Dismounted Reconnaissance Sets, Kits, and Outfits (DR SKO) \/ Chemical Biological Incident Response Force (CBIRF) Equipment\n-Initiate development of Gas Chromatograph Mass Spectrometry (GCMS) replacement of Guardian.\n-Initiate development of the Chemical Biological Incident Response Force (CBIRF) standoff chemical agent detection."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $1.620M between FY20 to FY21 is due to Reconnaissance Mission Area and Force Protection Mission Area efforts transitioning under Family of Incident Response Systems to better reflect program plans."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PMC\/2220"
                                    },
                                    "Title": {
                                        "val": "Wpns & Cmbt Vehs under $5 million"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.042"
                                        },
                                        "CurrentYear": {
                                            "val": "0.540"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.556"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.556"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3009"
                    },
                    "ProjectTitle": {
                        "val": "Marine Corps Wargaming Capability"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "11.469"
                        },
                        "BudgetYearOne": {
                            "val": "20.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.000"
                        },
                        "BudgetYearTwo": {
                            "val": "9.500"
                        },
                        "BudgetYearThree": {
                            "val": "8.500"
                        },
                        "BudgetYearFour": {
                            "val": "6.000"
                        },
                        "BudgetYearFive": {
                            "val": "6.120"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Previously executed within Proj 0030 Studies & Analysis\/MC"
                        },
                        "ProjectMissionDescription": {
                            "val": "The Wargaming Capability (WGC) program office is unique from other programs in that the program office is responsible for the system of systems within the facility as well as coordinating the unique manpower requirements.  The USMC Wargaming Capability (WGC) consists of Wargaming tools and systems, a Wargaming Center (MILCON Project P-719), and the necessary personnel supporting the new capability.  This capability will facilitate force development, war plan assessment, and concept and combat development through an integrated purpose-built facility utilizing highly classified information embedded in all aspects of planning, execution, and analysis. WGC will provide an enhanced basis for analytically-informed decision support to capability development prioritization and resourcing. The WGC program acquisition strategy takes advantage of 10 U.S.C 2302 Middle Tier of Acquisition (MTA) and was designated a MTA for Rapid Prototyping in May 2019.  The overarching strategy consists of three phases: Phase I: Risk Reduction Prototyping (FY19 - FY20); Phase II: Integrated Prototyping (FY20 - FY22); Phase III: Follow-on Production (FY23 - FY25+)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Wargaming Capability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.469"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "PM WGC was designated as a Middle Tier of Acquisition. In FY20 PM WGC continues efforts in Phase I: Risk Reduction Prototyping and executes Phase II: Integrated Prototyping through the use of Other Transaction Authority (OTA) agreements with traditional and non-traditional defense contractors. The OTAs awarded during Phase I Risk Reduction Prototyping will support and develop an informed performance specification for the Integrated Prototyping phase by establishing the feasibility\/viability of current state-of-the-art technologies and capabilities. In Phase II: Integrated Prototyping, PM WGC will award OTAs to two or more vendors for the full representative wargaming solution in 4QFY20. Major milestones for Phase II, within FY20 are: planning and execution of an initial design review and technical interchange meeting and initial vendor deliverables including their software and product development strategy.  These development efforts will take into account sustainability, maintainability, and training requirements for the USMC.\n\nDesign and develop Information Technology (IT) and network infrastructure and identify and apply cybersecurity controls to specific technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue multiple vendor-built prototype efforts by focusing on solutions that combine four different capability sets: (1) wargame design and scenario generation; (2) scalable intelligent data services; (3) player interface and visualization; (4) advanced analytic tools. Major milestones for Phase II within FY21 are: (a) the creation of final allocated baselines based upon performance specification requirements for the system; (b) development and integration of multiple components of the proposed solutions; (c) Tailored Test Readiness Review to evaluate the readiness of the prototype to proceed into Developmental Testing; (d) Developmental Testing of each vendor's proposed solution.   PM WGC will execute a final design review, developmental test, and cyber evaluation review of each vendor prototype.  Developmental testing and cyber evaluation of the vendor-built prototypes in FY21 will lead to a single vendor selection in FY22. Prototypes support the development of the world class wargaming solution, built upon the four capability sets that incorporates data capture tools, data analysis tools, advanced models and simulations, cross domain solutions, dynamic 2-D to 3-D visualization, player interface tools, and scenario generation. Continue to document the allocated baseline and the follow-on system baseline. Continue development of cybersecurity measures and logistics elements (e.g. sustainability, maintainability, and training).\n\nContinue to design and develop Information Technology (IT) and network infrastructure."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase of $8.531M reflects multiple integrated prototyping competitive vendor awards to develop end-to-end, comprehensive\/integrated prototypes for the entire life cycle of wargaming from design through execution through postgame analysis which follow with a competitive down select to one contractor in the first half of FY22. The integrated prototype contracting efforts begin in FY20 and complete in FY21. The contractor selected will then provide the production solution starting in FY23. The production system will link up with the new wargaming facility being built by the USMC in MILCON project P-719."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PMC\/4630"
                                    },
                                    "Title": {
                                        "val": "Common Computer Resources"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "28.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.991"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.131"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3783"
                    },
                    "ProjectTitle": {
                        "val": "Information Environment Strategy, Policy and Governance"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "3.145"
                        },
                        "BudgetYearOne": {
                            "val": "3.875"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.875"
                        },
                        "BudgetYearTwo": {
                            "val": "3.952"
                        },
                        "BudgetYearThree": {
                            "val": "4.031"
                        },
                        "BudgetYearFour": {
                            "val": "4.112"
                        },
                        "BudgetYearFive": {
                            "val": "4.194"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "This is a new Project in FY 2020."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Information Environment (IE) is a global, interconnected, complex, continuously changing eco-system that is increasingly connected across our war fighting functions.  Given the complexity and the speed of changes in the IE and to address the significant role information now plays in current and future conflicts, a unifying operational and technical strategy must be developed to outpace our adversaries.\n\nAnalysis will inform the development and integration of Marine Corps Information Environment Operations (IE Ops) that are guided by the Commandant's Strategic Plan, Marine Corps Operating Concepts (MOC).  Research and analysis efforts support: design and coordinated implementation of an Objective Network to fight on and through a contested environment; design and collaboration on a Naval Tactical Grid and a Joint Tactical Grid; a threat estimate to inform capability development; and analysis to inform the development and fielding of an integrated information capability.  These efforts will be accomplished leveraging analytic support from government Labs and Industry to dynamically exploit our National Defense Strategy (NDS) priority operational problems related to the Information Environment through limited user evaluations and functional capability assessments with Marines.  In addition, rapid development of capabilities to address problems in the IE Ops will be developed utilizing the Accelerator process which utilizes best commercial practice of design thinking."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Information Environment Strategy"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.145"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Initiate innovation activities across the information domain to develop user centered capabilities for the future operating environment.  \n- Implement a data science team to support the digital transformation of Marine Corps data stores to data and information across the Services and other DoD partners and position the Marine Corps to leverage DoD investments in Artificial Intelligence and Machine Learning. \n- Implementation of Accelerator Team and methods, scaling best commercial practices of Agile Development and Design Thinking tools, to support the rapid design and development of Minimally Viable Products (MVPs) with Marines\/stakeholders for the information environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.875"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.875"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct innovation activities across the information domain to develop user centered capabilities for the future operating environment.\n- Development of an enterprise data environment and platform, define and implement a data architecture, and provide a mechanism to quickly assess and adopt Artificial Intelligence capabilities.\n- Continue rapid development of capabilities to address problems in Information operations utilizing the Accelerator and incubator processes which utilizes best commercial practice of design thinking, lean launch pad, and agile implementation.  The Marine Corps Information Environment Enterprise (MCIEE) Accelerator team will develop and transition software and physical device\/hardware minimally viable products."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $0.730M from FY20 to FY21 required for scaling of MCIEE Accelerator methods to physical device\/hardware environment."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}