{
    "id": "2021-AirForce-PB-3600-MJBOOK-0-0-4ccc939241b47239c36ee98d5519ce37a7e18b46d494a025321d2035cb3d38d7-19",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-AIRFORCE_V3B-U_RDTE_MasterJustificationBook_Air_Force_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603034F"
        },
        "ProgramElementTitle": {
            "val": "Persistent Knowledge, Awareness, & C2 Tech"
        },
        "R1LineNumber": {
            "val": "20"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "102.276"
            },
            "BudgetYearOneBase": {
                "val": "102.276"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "117.849"
            },
            "BudgetYearThree": {
                "val": "119.079"
            },
            "BudgetYearFour": {
                "val": "126.278"
            },
            "BudgetYearFive": {
                "val": "134.837"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops and conducts integrated enterprise advanced technology demonstrations in persistent knowledge, awareness, and command & control that provide compelling advantage to the warfighter in kinetic and non-kinetic multi-domain operations for air, space, cyberspace, land, sea and undersea. This program develops multi-domain battlespace awareness capabilities through advanced aerospace sensors\/signals and exploitation algorithms, counter-countermeasures, advanced data handling, multi-domain fusion techniques\/visualization, secure net-enabled architectures and communications\/networks, and operation\/upgrade of the Maui Space Surveillance System (MSSS). This program develops training, simulation, mission rehearsal and other Airman performance-aiding methods including adaptive Airman-machine\/interface teaming and multisensory fusion. This program develops electronic and cyber warfare capabilities including trusted sensors\/systems, cyber susceptibility discovery and mitigation, and cyber protection\/resiliency. \n\nIn the FY 2021, the Air Force is consolidating its existing thirteen Advanced Technology Development (ATD), Research Development Test and Evaluation (RDT&E), Budget Activity 03 (BA 03) PEs into five new capability focused RDT&E BA 03 PEs to better align with the Air Force Science and Technology (S&T) Strategy signed by the Secretary of the Air Force in April 2019. This consolidation will improve and accelerate delivery of integrated transformational, multidisciplinary, collaborative technology solutions necessary to enable new Air Force warfighting capabilities that support of the National Defense Strategy. This new structure will provide the Air Force and Congress with a clearer understanding and increased transparency of integrated technology solutions and demonstrations key to enabling the Air Force future force design.\n\nIn FY 2021,the entirety of Project 634335, Cyber Concepts, is transferred from PE 0603270F, Electronic Combat Technology, to PE 0603034F, Persistent Knowledge, Awareness & C2 Tech.\n\nIn FY 2021, the entirety of PE 0603444F, Maui Space Surveillance Systems, and the associated Project\/activities are transferred to PE 0603034F, Persistent Knowledge, Awareness & C2 Tech.\n\nIn FY 2021, the entirety of Project 635321, C4I Battlespace Dev and Demo, is transferred from PE 0603788F, Battlespace Knowledge Development and Demonstration, to PE 0603034F, Persistent Knowledge, Awareness & C2 Tech.\n\nIn FY 2021, the entirety of Project 635325, Mission Effective Performance is transferred from PE 0603456F, Human Effectiveness Advanced Technology Development, to PE 0603034F, Persistent Knowledge, Awareness & C2 Tech. \n\nIn FY 2021, non-Vanguard efforts and activities in Project 635327, Warfighter Interfaces, are transferred from PE 0603456F, Human Effectiveness Advanced Technology Development, to PE 0603034F, Persistent Knowledge, Awareness & C2 Tech.\n\nIn FY 2021, the entirety of PE 0603203F, Advanced Aerospace Sensors, and the associated Projects are transferred to PE 0603034F, Persistent Knowledge, Awareness & C2 Tech.\n\nAll these transfers detailed above are part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept, and Air Force S&T Strategy, April 2019. This is an administrative realignment and not a new start. \n\nThe Air Force Science and Technology portfolio will continued to be managed at the Enterprise level by the Air Force Technology Executive Officer, dual-hatted as the Air Force Research Laboratory (AFRL) Commander, and executed across the various AFRL Technology Directorates and locations. \n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver science & technology capabilities. The use of program funds in this PE would be in addition to the civilian pay expenses budgeted in program elements 0601102F, 0602102F, 0602201F, 0602202F, 0602203F, 0602204F, 0602602F, 0602605F, 0602788F, 0602298F, and 1206601SF.\n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "102.276"
                },
                "BudgetYearOneBase": {
                    "val": "102.276"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "102.276"
                },
                "BudgetYearOneBase": {
                    "val": "102.276"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "102.276"
                                },
                                "BudgetYearOneBase": {
                                    "val": "102.276"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase in FY 2021 of $102.276 million is due to the following PEs, Projects, and efforts being transferred to PE 0603034F, Persistent Knowledge, Awareness, & C2 Tech:\n\n1) Entirety of Project 634335, Cyber Concepts, from PE 0603270F, Electronic Combat Technology\n\n2) Entirety of PE 0603444F, Maui Space Surveillance Systems, and associated Project 634868, Maui Space Surveillance System\n\n3) Entirety of Project 635321, C4I Battlespace Dev and Demo, from PE 0603788F, Battlespace Knowledge Development and Demonstration\n\n4) Entirety of Project 635325, Mission Effective Performance from PE 0603456F, Human Effectiveness Advanced Technology Development\n\n5) Entirety of Project 635327, Warfighter Interfaces, from PE 0603456F, Human Effectiveness Advanced Technology Development, with the exception of Skyborg Vanguard activities.\n\n6) Entirety of PE 0603203F, Advanced Aerospace Sensors, and the associated Projects 6369DF, Target Attack and Recognition Technology and 63655A, Advanced Aerospace Sensors Technology.\n\nThese transfers in FY 2021 are part of the Air Force RDT&E BA 03 PE Consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept, and Air Force S&T Strategy, April 2019."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "634335"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Concepts"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "4.699"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.699"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.934"
                        },
                        "BudgetYearThree": {
                            "val": "6.971"
                        },
                        "BudgetYearFour": {
                            "val": "8.520"
                        },
                        "BudgetYearFive": {
                            "val": "14.612"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates methods to discover cyber susceptibilities, assess avionics systems, formulate mitigation strategies, and investigate use of tools and technologies to automate this process. It is designed to apply developed vulnerability discovery, vulnerability mitigation, and cyber protection technology to avionics systems and components and embedded systems. This involves technologies for trusted sensors and trusted systems that deter exploitation of our critical hardware and software. This project aims to develop cyber resilience and protect systems through adaptation of the system to the threat.  It demonstrates these technologies in open and adaptable architectures for system integration in field demonstrations and proves out the technologies through rapid integration of sensors and architectures for technology transition. It integrates research efforts in electronic and cyber warfare to rapidly demonstrate a capability for rapid fielding.\n\nIn FY 2021, the entirety of Project 634335, Cyber Concepts, is transferred from PE 0603270F, Electronic Combat Technology, to PE 0603034F, Persistent Knowledge, Awareness, & C2 Tech, Project 634335, Cyber Concepts, as part of the Air Force RDT&E BA 03 PE Consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and AF Science and Technology Strategy, April 2019. The Project and associated efforts will continue to be executed by the Air Force Research Laboratory Sensors Technology Directorate located in Wright Patterson Air Force Base, Ohio. This is an administrative realignment for consolidation, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Avionics Cyber Vulnerabilities"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate methods, techniques, and technical tools to enable, assist, and improve the vulnerability discovery processes. Use developed tools and techniques to assess avionics boxes, systems, busses, and components. Investigate techniques to mitigate discovered vulnerabilities.  Develop and demonstrate mitigation and protection technologies on future concept platforms for adaptability and resilience."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2020 and prior, this work is performed under Avionics Cyber Vulnerabilities effort in PE 0603270F, Electronic Combat Technology, Project 634335, Cyber Concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Complete transition of vulnerability mitigation technologies to legacy weapon systems. Begin demonstrations of agile, resilient and lethal capabilities of next-generation architecture. Provide integration support for emerging technologies such as autonomy, alternative-navigation technologies, open system architecture standards and approaches, multispectral and distributed intelligence surveillance and reconnaissance, and electromagnetic spectrum warfare.  Continue to transition next-generation architectures to adopting programs\/platforms, and open architecture approaches to rapidly integrate advanced mission system capability for next- generation architectures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $1.500 million. Funding increased due to the transfer and realignment of this work from the Avionics Cyber Vulnerabilities effort in PE 0603270F, Electronic Combat Technology, Project 634335, Cyber Concepts, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Avionics Cyber Protections"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate advanced automated analysis tools and protection techniques to prevent exploitation of cyber susceptibilities in avionics systems.  This strategy would include discovery and mitigation of likely attack vectors, remediation of susceptibilities, and safeguards to assure the integrity of embedded software."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2020 and prior, this work is performed under the Avionics Cyber Protections effort in PE 0603270F, Electronic Combat Technology, Project 634335, Cyber Concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.199"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.199"
                                            },
                                            "Text": {
                                                "val": "Continue to enhance and extend cyber protection tools, techniques and test beds for manned and unmanned air vehicles, mission and support equipment. Complete development of system integration laboratories to test resilient and agile mission system architecture concepts on avionics; intelligence, surveillance, and reconnaissance; positioning, navigation, and timing systems. Continue to flight test and demonstrate advanced cyber protection capabilities on mission systems. Continue to collaborate with program offices and end-users to transition resilient and agile technologies. Leverage open system architecture standards and approaches to demonstrate agile, resilient and autonomous capabilities for current and next-generation architectures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY2020 by $3.199 million. Funding increased due to the transfer and realignment of this work from the Avionics Cyber Protections effort in PE 0603270F, Electronic Combat Technology, Project 634335, Cyber Concepts, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "634868"
                    },
                    "ProjectTitle": {
                        "val": "Maui Space Surveillance System"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "12.090"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.090"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "12.319"
                        },
                        "BudgetYearThree": {
                            "val": "12.924"
                        },
                        "BudgetYearFour": {
                            "val": "13.264"
                        },
                        "BudgetYearFive": {
                            "val": "13.608"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program funds ground-based optical space situational awareness (SSA) technology development and demonstration at the Maui Space Surveillance System (MSSS) in Hawaii, as well as the operation and upgrade of the facility. Efforts in this program have been coordinated through the Department of Defense Science and Technology Executive Committee process to harmonize efforts and eliminate duplication.\n\nIn FY 2021, the entirety of PE 0603444F, Maui Space Surveillance System (MSSS), Project 634868, Maui Space Surveillance System, is transferred to PE 0603034F, Persistent Knowledge, Awareness, & C2 Tech, Project 634868, Maui Space Surveillance System, as part of the Air Force RDT&E BA 03 PE Consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and AF Science and Technology Strategy, April 2019. The Project and associated efforts will continue to be executed by the Air Force Research Laboratory Directed Energy Technology Directorate located in Kirtland Air Force Base, New Mexico. This is an administrative realignment for consolidation, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operate and Upgrade Maui Space Surveillance System"
                                    },
                                    "Description": {
                                        "val": "Operate and upgrade the Maui Space Surveillance System to support development, demonstration, and integration of ground-based optical space situational awareness technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2020 and prior, the work is performed under the  Maui Space Surveillance System effort in PE 0603444F, Maui Space Surveillance System, Project 634868, Maui Space Surveillance System."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.090"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.090"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain Maui Space Surveillance System facility and experimental equipment in a mission-ready state. Perform needed upgrades and modernization to keep facilities and equipment in good working order and allow Maui Space Surveillance System to perform efficiently and reliably. Continue to operate Maui Space Surveillance System facility for development and demonstration of ground based optical space situational awareness capabilities in conjunction with customer programs and an operational Space Situational Awareness mission. Continue to accept control of geosynchronous satellite imaging capability, collecting images as requested by mission partners. Transition of dynamic telescope system operations into Maui Space Surveillance System capability baseline will be complete."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $12.090 million. Funding increased due to the transfer and realignment of this work from the Operate and Upgrade Maui Space Surveillance System effort in PE 0603444F, Maui Space Surveillance System, Project 634868, Maui Space Surveillance System, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635321"
                    },
                    "ProjectTitle": {
                        "val": "C4I Battlespace Dev and Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "29.201"
                        },
                        "BudgetYearOneBase": {
                            "val": "29.201"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "37.095"
                        },
                        "BudgetYearThree": {
                            "val": "38.141"
                        },
                        "BudgetYearFour": {
                            "val": "39.161"
                        },
                        "BudgetYearFive": {
                            "val": "39.956"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The National Defense Strategy and Air Force Future Operating Concept established science and technology challenges to enable operational agility (the ability to rapidly generate and shift among multiple solutions for a given challenge) as a way to adapt swiftly to any situation or enemy action. In order to enable multi-domain operations, this project will begin to shape future research and development to focus on technologies in support of multi-domain command and control.\n\nIn order to achieve operational agility, the Air Force must be able (a) to monitor, assess, plan, and execute missions rapidly across the full spectrum of operations at all levels of war and during all phases of conflict; (b) to field advanced, secure, net-enabled architectures and communications\/network technologies in support of persistent, global, and survivable kinetic and non-kinetic military operations; (c) to process and exploit data and information from a variety of sources and domains to create a common operating picture of the battlespace; and (d) to provide the decision maker and staff with seamless access to tailored information within a mobile, dynamic, and scalable, globally distributed Air Operations Center, as well as among other producers, consumers, and managers of information relevant to other particular Communities of Interest (COI).\n\nIn FY 2021, the entirety of Project 635321, C4I Battlespace Dev and Demo, is transferred from PE 0603788F, Battlespace Knowledge Development and Demonstration, to PE 0603034F, Persistent Knowledge, Awareness, & C2 Tech, Project 635321, C4I Battlespace Dev and Demo, as part of the Air Force RDT&E BA03 PE Consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and Air Force Science and Technology Strategy, April 2019. The Project and associated efforts will continue to be managed by the Air Force Research Laboratory Information Technology Directorate located in Rome, NY. This is an administrative realignment for consolidation, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multi-Domain Command and Control"
                                    },
                                    "Description": {
                                        "val": "Perform research and development (R&D) that will advance existing, or discover new, command and control capabilities to support multi-domain operations (MDO) for air, space, cyberspace, land, sea, and undersea."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior, this work is performed under the Multi-Domain Command and Control effort in PE 0603788F, Battlespace Knowledge Development and Demonstration, Project 635321, C4I Battlespace Dev and Demo."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.919"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.919"
                                            },
                                            "Text": {
                                                "val": "Continue to execute experiments, based on operational scenarios, which incorporate process management execution into the extensible Space command and control framework, and which integrate disparate data and applications, providing a pedigree for proposed tasking options to decision makers. Continue to develop software capabilities that employ cyber, directed energy, and electronic warfare weaponry. Continue to provide on-the-fly valuable quantitative evaluations of cyber assets to cyber operators, enabling them to present viable cyber options to commanders in multi-domain settings. Develop tools, technology, and framework for execution management of operational center process workflows and applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $6.919 million.  Funding increased due to the transfer and realignment of this work from the Multi-Domain Command and Control effort in PE 0603788F, Battlespace Knowledge Development and Demonstration, Project 635321, C4I Battlespace Dev and Demo, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nuclear C3 Modernization"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate the advancement of existing nuclear capable forces to ensure command, control, and connectivity for the President without constraints."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior, this work is performed under the Nuclear C3 Modernization effort in PE 0603788F, Battlespace Knowledge Development and Demonstration, Project 635321, C4I Battlespace Dev and Demo."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.308"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.308"
                                            },
                                            "Text": {
                                                "val": "Continue to perform real-time monitoring of ionospheric conditions over the Continental United States (CONUS). Continue testing of very-low-frequency (VLF) stubb antenna for reachback. Continue testing of prototype compact high-frequency (HF) antennas. Enhance communication link availability prediction for better Command, Control, and Communications (C3) planning and simulation. Develop visualization tool for providing common operation picture (COP) to commanders and Nuclear C3 (NC3) operators."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $3.308 million. Funding increased due to the transfer and realignment of this work from the Nuclear C3 Modernization effort in PE 0603788F, Battlespace Knowledge Development and Demonstration, Project 635321, C4I Battlespace Dev and Demo, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Artificial Intelligence\/Autonomy\/Machine Learning"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate to harness the speed and scale of computers and machines to address problems of complexity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior, this work is performed under the Artificial Intelligence\/Autonomy\/Machine Learning effort in PE 0603788F, Battlespace Knowledge Development and Demonstration, Project 635321, C4I Battlespace Dev and Demo."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.597"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.597"
                                            },
                                            "Text": {
                                                "val": "Continue to operationalize and implement state of the art learning models. Continue to integrate within the StreamlinedML framework. Continue development of model recommendation & user workflow capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $2.597 million. Funding increased due to the transfer and realignment of the work from the Artificial Intelligence\/Autonomy\/Machine Learning effort in PE 0603788F, Battlespace Knowledge Development and Demonstration, Project 635321, C4I Battlespace Dev and Demo, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data to Decisions"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate the collection, management, analysis, and exploitation of complex data for availability to Air Force and other stakeholders."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior, this work is performed under the Data to Decisions effort in PE 0603788F, Battlespace Knowledge Development and Demonstration, Project 635321, C4I Battlespace Dev and Demo."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.543"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.543"
                                            },
                                            "Text": {
                                                "val": "Continue to refine and test technologies for ultra-wideband electronics intelligence signal detection and prosecution. Continue development and demonstration of intelligence analysis capabilities from multiple intelligence sources for both near-real time and post mission. Continue research and development in data analytics and strategic indications and warnings. Continue to perform service-based capability development. Complete work for object based production optimized processing and automated-association capability."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $4.543 million. Funding increased due to the transfer and  realignment of this work from the Data to Decisions effort in PE 0603788F, Battlespace Knowledge Development and Demonstration, Project 635321, C4I Battlespace Dev and Demo, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Assured Communications & Networks"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate secure and reliable communications to ensure the delivery of timely, reliable, and actionable information to warfighters and systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior, this work is performed under the Assured Communications & Networks effort in PE 0603788F, Battlespace Knowledge Development and Demonstration, Project 635321, C4I Battlespace Dev and Demo."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.385"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.385"
                                            },
                                            "Text": {
                                                "val": "Continue development and demonstration for rapid waveform development of multi-mission software defined radio frequency capability. Continue wideband high frequency waveform development and testing. Continue ionospheric research, propagation modeling and simulation. Continue beacon data collection on both the V and W frequency bands along with waveform development and simulation. Continue development of test platform for Common Very Low Frequency Receiver Increment Two."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $8.385 million. Funding increased due to the transfer and realignment of this work from the Assured Communications & Networks effort in PE 0603788F, Battlespace Knowledge Development and Demonstration, Project 635321, C4I Battlespace Dev and Demo, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Game Changing Computing Power"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate computer architectures with greater capacity and sophistication to enable game-changing computing power to the warfighter anywhere, anytime."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior, this work is performed under the Game Changing Computing Power effort in PE 0603788F, Battlespace Knowledge Development and Demonstration, Project 635329, Cyber Battlespace Development and Demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.449"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.449"
                                            },
                                            "Text": {
                                                "val": "Continue work to improve software specifications using evolutionary approaches to optimize computer processing.  Continue work in the areas of nanotechnology for autonomous systems.  Continue work in the area of neuromorphic intelligent computing systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $3.449 million. Funding increased due to the transfer and  realignment of the non-cyber work from the Game Changing Computing Power effort in PE 0603788F, Battlespace Knowledge Development and Demonstration, Project 635329, Cyber Battlespace Development and Demonstration, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635325"
                    },
                    "ProjectTitle": {
                        "val": "Mission Effective Performance"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "7.067"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.067"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "7.213"
                        },
                        "BudgetYearThree": {
                            "val": "6.356"
                        },
                        "BudgetYearFour": {
                            "val": "7.503"
                        },
                        "BudgetYearFive": {
                            "val": "7.655"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions advanced training, simulation, mission rehearsal, and other performance-aiding methods and technologies to enhance warfighter readiness.  This project also develops advanced methods and technologies to enable interactive live, virtual, and constructive (LVC) environments for performance-aiding methods and technologies. Focus areas include integrated high-fidelity weapon systems training technologies for air, space, and cyber; tailored immersive simulation environments for airmen at the tactical and operational levels; and incorporation of performance assessment and feedback tools. These methods and technologies facilitate the development of mission-essential competencies.\n\nIn FY 2021, the entirety of Project 635325, Mission Effective Performance, is transferred from PE 0603456F, Human Effectiveness Advanced Technology Development, to PE 0603034F, Persistent Knowledge, Awareness & C2 Tech, Project 635325, Mission Effective Performance, as part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and Air Force Science and Technology Strategy, April 2019.  The Project and associated efforts will continue to be executed by the Air Force Research Laboratory Airman Systems Technology Directorate located in Wright-Patterson Air Force Base, Ohio. This is an administrative realignment for consolidation, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Readiness"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate secure, persistent, and standardized live, virtual, and constructive training enterprise. Utilize modeling capabilities for technology demonstration efforts focused on developing software-based tools for training that would replace human instructors.\n\nIn FY 2021, this effort is renamed from Continuous Learning to Readiness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior, this work is performed under the Continuous Learning effort in PE 0603456F, Human Effectiveness Advanced Technology Development, Project 635325, Mission Effective Performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.067"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.067"
                                            },
                                            "Text": {
                                                "val": "Complete initial development of proficiency-based training metrics and assessments in operational contexts. Continue multi-domain operations training development and demonstration. Continue field evaluations for performance-based after action review visualization tools in unit-level and Red Flag-Level training and rehearsal. Continue assessments and evaluations of common range and simulation architecture technologies for Live, Virtual, and Constructive training capabilities. Complete portfolio migration focused on advanced research and transitions under a Readiness product line construct with emphases on standards for training and operational data, tools for rapid development of mission-focused software agent applications. Continue to develop realistic in contested degraded operations environment for multi- domain operations training and rehearsal."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $7.067 million. Funding increased due to the transfer and realignment of this work from the Continuous Learning effort in PE 0603456F, Human Effectiveness Advanced Technology Development, Project 635325, Mission Effective Performance, as part of the Air Force RDT&E BA03 PE Consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635327"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Interfaces"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "13.881"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.881"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "13.308"
                        },
                        "BudgetYearThree": {
                            "val": "13.621"
                        },
                        "BudgetYearFour": {
                            "val": "16.443"
                        },
                        "BudgetYearFive": {
                            "val": "16.778"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and readies the transition of technologies to revolutionize the way airmen optimize the capabilities of Air Force systems, including autonomous machines and adaptive teams of Airmen and machines.  Improvements in the presentation of operational information to the community of users, from the system operator to the commander, must be developed in step with advancements in the acquisition, storage, and retrieval of information. This project provides the advances in understanding of human cognitive abilities, as well as the utilization of human interfaces, multisensory fusion, high-resolution image displays, and three-dimensional (3D) audio to customize communications and enhance shared understanding across a diverse user community in air, space, and cyber for maximum situational awareness.\n\nIn FY 2021, Project 635327, Warfighter Interfaces, non-Vanguard efforts and activities is transferred from PE 0603456F, Human Effectiveness Advanced Technology Development, to PE 0603034F, Persistent Knowledge, Awareness & C2 Tech, Project 635327, Warfighter Interfaces, as part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and Air Force S&T Strategy, April 2019. This is an administrative realignment and not a new start.  The Project and associated non-Vanguard efforts and activities will continue to be executed by the Air Force Research Laboratory Airman Systems Technology Directorate located in Wright-Patterson Air Force Base, Ohio. This is an administrative realignment for consolidation, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Airman Machine Interfaces"
                                    },
                                    "Description": {
                                        "val": "Develops and demonstrates wearable technologies and operator-centric interfaces that increase the\nAirman's combat capabilities. This is accomplished through integrated solutions that develop synergies, maximize battlespace interoperability, and increase combat power while decreasing Airman physical and cognitive workloads.\n\nIn FY 2021, this effort is renamed from Battlespace Acoustics to Airman Machine Interfaces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior, this work is performed under the Battlespace Acoustics effort in PE 0603456F, Human Effectiveness Advanced Technology Development, Project 635327, Warfighter Interfaces."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.881"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.881"
                                            },
                                            "Text": {
                                                "val": "Prepare for transition of advanced wearable technologies improving situation awareness and enhancing communication effectiveness for dismounted operators. Develop and demonstrate manned-unmanned pilot vehicle interface mission intents and team concepts for tactical environments. Develop team collaborative interfaces focusing on cognitive workload reduction. Prototype innovative man-wearable interfaces tailored to Special Warfare operations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $4.881 million. Funding increased due to the transfer and realignment of this work from the Battlespace Acoustics effort in PE 0603456F, Human Effectiveness Advanced Technology Development, Project 635327, Warfighter Interfaces, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Analytic Tools"
                                    },
                                    "Description": {
                                        "val": "Develops, demonstrates, and matures software solutions for Command and Control, Intelligence Surveillance & Reconnaissance, Space, and Cyber customers for improved system performance (operator\/analyst and software).  Software ranges from simplistic decision support systems to sophisticated artificial intelligence and machine learning algorithms designed to handle data at the scale of operations. Heavy emphasis is placed on human-machine teaming including workflow design and integration of both automated and human-generated results. Effort leverages significant infrastructure in big-data design and capture, allowing for rapid prototyping of capabilities directly to web-based platforms on classified environments. Program directly supports contested-denied operations in a multi-domain environment.\n\nIn FY 2021, this effort is renamed from Human Role in Semiautonomous Systems to Analytic Tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 and prior, this work is performed under the Human Role in Semiautonomous Systems effort in PE 0603456F, Human Effectiveness Advanced Technology Development, Project 635327, Warfighter Interfaces."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "Prepare to transition speech-to-text technologies for military intelligence producing systems. Enhance and prepare for transition Electronic Order of Battle tools for multiple theaters of operation. Test and host open source speech-to-text methods on multiple networks. Enhance automated speed of detections for national imagery exploitation. Perform technical demonstrations at exercises supporting United States Pacific Command and United States European Command."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY 2020 by $9.000 million. Funding increased due to the transfer and realignment of this work from the Human Role in Semiautonomous Systems effort in PE 0603456F, Human Effectiveness Advanced Technology Development, Project 635327, Warfighter Interfaces, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "63665A"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Aerospace Sensors Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "19.471"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.471"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "21.750"
                        },
                        "BudgetYearThree": {
                            "val": "21.963"
                        },
                        "BudgetYearFour": {
                            "val": "22.402"
                        },
                        "BudgetYearFive": {
                            "val": "22.857"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project area develops and demonstrates aerospace sensor and processing technologies for intelligence, surveillance, reconnaissance, target, and attack radar applications in both manned and unmanned platforms, including electro-optical sensors and electronic counter-countermeasures for radars.  It provides aerospace platforms with the capability to precisely detect, track, and target both airborne (conventional and low radar cross-section) and ground-based, high-value, time-critical targets in adverse clutter and jamming environments.  Project activities include developing multi-function radio-frequency systems including radar and electronic warfare technology and the position and timing information to enable distributed sensing.  Desired warfighting capabilities include the ability to detect concealed targets in difficult background conditions.\n\nIn FY 2021, the entirety of Project 63665A, Advanced Aerospace Sensors Technology is transferred from PE 0603203F, Advanced Aerospace Sensors, to PE 0603034F, Persistent Knowledge, Awareness & C2 Tech, Project 63665A, Advanced Aerospace Sensors Technology, as part of the Air Force RDT&E BA03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and AF Science and Technology Strategy, April 2019. This work will continue to be executed by the Air Force Research Laboratory Sensors Technology Directorate located at Wright Patterson Air Base, Ohio. This is a administrative realignment, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Persistent Sensing in Contested Environment Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop active radio frequency sensor solutions to use against difficult-to-detect targets in challenging environments, and advanced radio frequency architectures for open and reconfigurable systems.  Enable persistent intelligence, surveillance and reconnaissance over wide areas, and detect advanced air and ground targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2020 and prior, this work is performed under the Persistent Sensing in Contested Environment Technologies effort in PE 0603203F, Advanced Aerospace Sensors, Project 63665A, Advanced Aerospace Sensors Technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.903"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.903"
                                            },
                                            "Text": {
                                                "val": "Analyze results of airborne ground moving target indication data collections. Continue advanced multi-static ground moving target indication radar demonstration, increasing complexity with additional transmit degrees of freedom from multiple transmit platforms. Continue analysis of asynchronous noise waveform performance with multiple transmitters. Initiate evaluation of space-time adaptive processing algorithm performance using synthetic and real flight data. Initiate investigation of novel algorithms with processing distributed across multiple receive platforms.  Initiate system-of-systems design to optimize transmit\/receive architecture."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increase compared to FY2020 by $2.903 million. Funding increased due to the transfer and realignment of this work from the Persistent Sensing in Contested Environment Technologies effort in PE 0603203F, Advanced Aerospace Sensors, Project 63665A, Advanced Aerospace Sensors Technology, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Passive Radio Frequency Sensing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop advanced techniques and prototype passive radio frequency sensors to intercept, collect, locate and track enemy radio frequency sensor systems for intelligence, surveillance and reconnaissance of air and ground targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2020 and prior, this work is performed under the Passive Radio Frequency Sensing Technologies effort in PE 0603203F, Advanced Aerospace Sensors, Project 63665A, Advanced Aerospace Sensors Technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.801"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.801"
                                            },
                                            "Text": {
                                                "val": "Conduct real-time passive radar illumination selection manager demonstrations using realistic operational environments.  Conduct development of advanced passive radar modes and signal processing algorithms.  Initiate advancement of electronic support subsystems to incorporate wide bandwidth receivers and agile emitter tracking. Initiate implementation of passive radar modes using wideband arrays with rapid digital beamforming capabilities.  Initiate integration of electronic support, illumination selection manager, and passive radar subsystems to develop full passive multi-mode radar system for future ground\/airborne demonstration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increase compared to FY2020 by $5.801 million. Funding increased due to due to the transfer and realignment of this work from the Passive Radio Frequency Sensing Technologies effort in PE 0603203F, Advanced Aerospace Sensors, Project 63665A, Advanced Aerospace Sensors Technology, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Range Sensing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop radio frequency sensor technology to detect, locate, and identify air and ground targets at long ranges, including those that are low-observable, or use deception or camouflage."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2020 and prior, this work is performed under the Long Range Sensing Technologies effort in PE 0603203F, Advanced Aerospace Sensors, Project 63665A, Advanced Aerospace Sensors Technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.785"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.785"
                                            },
                                            "Text": {
                                                "val": "Initiate analysis of over-the-horizon radar data collections to demonstrate novel algorithms for detection and high accuracy tracking of highly maneuvering targets. Conduct development of passive over-the-horizon radar systems to provide predicted performance against challenging targets including cruise missiles and hypersonic vehicles.  Conduct development of low cost radio frequency payloads for small satellites. Initiate detailed component design and prototype payload fabrication."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY2020 by $2.785 million. Funding increased due to the transfer and realignment of this work from the Long Range Sensing Technologies effort in PE 0603203F, Advanced Aerospace Sensors, Project 63665A, Advanced Aerospace Sensors Technology, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Triple Raven Advanced Technology Demonstration"
                                    },
                                    "Description": {
                                        "val": "Advance, demonstrate, and transition innovative imaging and non-imaging optical sensing technologies for surveillance and reconnaissance of airborne and ground-based objects of interest in an anti-access\/area denial environment. This effort includes the development of systems, subsystems, and components necessary to yield new capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2020 and prior, this work is performed under the Laser Radar for Non-Cooperative Identification effort and the Passive Electro-Optical Sensing for Surveillance and Reconnaissance Technologies effort in PE 0603203F, Advanced Aerospace Sensors, Project 63665A, Advanced Aerospace Sensors Technology,"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.982"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.982"
                                            },
                                            "Text": {
                                                "val": "Begin integration of dual-band detector system onto the new unobscured freeform afocal telescope and begin integration into a stable optical gimbal in preparation for flight testing. Perform sensor trade studies to extend dual-band extended range imaging to provide full multi-spectral imaging capabilities - equivalent to today's multi-camera systems. Develop high power agile waveform laser, processing algorithms, and photon-counting detectors. Conduct a bread-board demonstration of the laser radar system on a laboratory-class aircraft at short ranges to allow early risk-reduction of entire system."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY2020 by $7.982 million. Funding increased due to the transfer and realignment of this work from the Laser Radar for Non-Cooperative Identification effort and Passive Electro-Optical Sensing for Surveillance and Reconnaissance Technologies effort in PE 0603203F, Advanced Aerospace Sensors, Project 63665A, Advanced Aerospace Sensors Technology, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "6369DF"
                    },
                    "ProjectTitle": {
                        "val": "Target Attack and Recognition Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "15.867"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.867"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "19.230"
                        },
                        "BudgetYearThree": {
                            "val": "19.103"
                        },
                        "BudgetYearFour": {
                            "val": "18.985"
                        },
                        "BudgetYearFive": {
                            "val": "19.371"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project area develops and demonstrates advanced technologies for closed-loop, multi-domain, multi-intelligence sources, multi-platform, multi-sensor automation and autonomy, providing capabilities in battle management, fire control, battlespace awareness and visualization, predictive analytics, target recognition, sensor and information fusion, and sensor \/ platform asset tasking.  This project also conducts advanced investigations to determine solution credibility, in terms of underlying technology and in terms of consistency with future Air Force missions within highly contested environments.  This project includes robust techniques to support intelligence, surveillance, and reconnaissance and targeting missions within adverse weather conditions and against adversaries employing deceptive techniques.  This project includes development of software-intensive solutions suitable for cloud-based integration and for development\/operations-like operational environments.  This project develops technology for effective management of online and offline information sources incorporating both constrained and cooperative sensing.  In FY 2020, this project was realigned to better reflect technical areas being emphasized such as autonomy, multi-domain and multi-sensor information processing, leverage of machine learning developments and enterprise-level modeling, simulation and analysis.\n\nIn FY 2021, the entirety of Project 6369DF, Target Attack and Recognition Technology, is transferred from PE 0603203F, Advanced Aerospace Sensors, to PE 0603034F, Persistent Knowledge, Awareness & C2 Tech, Project 6369DF, Target Attack and Recognition Technology, as part of the Air Force RDT&E BA03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and AF Science and Technology Strategy, April 2019. This work will continue to be executed by the Air Force Research Laboratory Sensors Technology Directorate located at Wright Patterson Air Base, Ohio. This is a administrative realignment, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multi-INT Analytics Development"
                                    },
                                    "Description": {
                                        "val": "Develop advanced techniques for multi-domain closed-loop sensing that apply predictive analytics to available information, inferring candidate course-of-action hypotheses and recommending confirmatory\/refutative sensing tasks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2020 and prior, this work is performed under the Advanced Multi-Source Exploitation effort and the Sensing Assignments and Multisource Analytics effort in PE 0603203F, Advanced Aerospace Sensors, Project 6369DF, Target Attack and Recognition Technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.867"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.867"
                                            },
                                            "Text": {
                                                "val": "Develop improvements over state-of-the-art analytics with automated multi-sensor fusion and predictive analytics, Pattern of Life (PoL) modeling and persistent monitoring, and graph-based World Model representation.  Mature techniques for persistent and immediate observation of anomalous behavior. Continue creation of a government owned testbed and user system with closed-loop reasoning and modular, well-characterized algorithms.  Continue development of the World Model representation to improve the current intelligence data\/analysis \"stovepipes,” for deeper analytics."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increased compared to FY2020 by $15.867 million. Funding increased due to the transfer and realignment of this work from the Advanced Multi-Source Exploitation effort and Sensing Assignments and Multisource Analytics effort in PE 0603203F, Advanced Aerospace Sensors, Project 6369DF, Target Attack and Recognition Technology, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}