{
    "id": "2021-DefenseAdvancedResearchProjectsAgency-PB-0400-JBOOK-9791cb30a17933e364f6388e243081e196aa85793c267cee3ac7042f1c1057a0-10",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-DARPA-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603739E"
        },
        "ProgramElementTitle": {
            "val": "ADVANCED ELECTRONICS TECHNOLOGIES"
        },
        "R1LineNumber": {
            "val": "56"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "100.042"
            },
            "CurrentYear": {
                "val": "123.616"
            },
            "BudgetYearOne": {
                "val": "95.864"
            },
            "BudgetYearOneBase": {
                "val": "95.864"
            },
            "BudgetYearTwo": {
                "val": "142.412"
            },
            "BudgetYearThree": {
                "val": "154.559"
            },
            "BudgetYearFour": {
                "val": "154.510"
            },
            "BudgetYearFive": {
                "val": "163.496"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Advanced Electronics Technologies Program Element is budgeted in the Advanced Technology Development Budget Activity because it seeks to design and demonstrate state-of-the-art manufacturing and processing technologies for the production of various electronics and microelectronic devices, sensor systems, integrated photonic-electronic components that have military applications and potential commercial utility. Introduction of advanced product design capability and flexible, scalable manufacturing techniques will enable the commercial sector to rapidly and cost-effectively satisfy military requirements.\n\nThe Mixed Technology Integration project funds the advanced development and demonstration of selected basic and applied electronics research programs.  Examples of technologies with funded development and demonstration activities include, but are not limited to: (1) reducing the size, weight, and power (SWaP) of components for laser weapon systems that will protect airborne platforms from emerging surface-to-air missiles; (2) integrated photonic-electronic components for positioning, navigation and timing in GPS-denied environments; (3) flexible, software-defined cameras that enable real-time image analysis of complex scenes to provide more actionable information; and (4) optical communications systems that rely on no moving parts enabling their use on SWaP-restricted platforms.  Funding under this project is intended to advance transitioning novel technologies to use, providing advanced components compatible with mid-term and other future warfighting requirements.\n\nThe Beyond Scaling Advanced Technologies Project is a continuation of DARPA's basic and applied research in this area and will support activities in large scale co-development with leading industry players to enable and accelerate transformative computing interactions with industry. Funding under this project will include developing new technologies and capabilities in commercial settings, establishing access to these new processes and commercial state-of-the-art (SOTA) foundries, developing manufacturable processes for integrated photonics, new architectures and integration technologies for advanced field programmable gate arrays (FPGAs), and innovating back end of line technologies for wide bandgap semiconductors."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "111.099"
                },
                "CurrentYear": {
                    "val": "128.616"
                },
                "BudgetYearOne": {
                    "val": "196.405"
                },
                "BudgetYearOneBase": {
                    "val": "196.405"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "100.042"
                },
                "CurrentYear": {
                    "val": "123.616"
                },
                "BudgetYearOne": {
                    "val": "95.864"
                },
                "BudgetYearOneBase": {
                    "val": "95.864"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-11.057"
                },
                "CurrentYear": {
                    "val": "-5.000"
                },
                "BudgetYearOne": {
                    "val": "-100.541"
                },
                "BudgetYearOneBase": {
                    "val": "-100.541"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-5.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-7.321"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.736"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-100.541"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-100.541"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019:  Decrease reflects reprogrammings and the SBIR\/STTR transfer.\nFY 2020:  Decrease reflects congressional action.\nFY 2021:  Decrease reflects completion of various Mixed Technology Integration programs in FY 2020."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MT-15"
                    },
                    "ProjectTitle": {
                        "val": "MIXED TECHNOLOGY INTEGRATION"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "51.871"
                        },
                        "CurrentYear": {
                            "val": "58.279"
                        },
                        "BudgetYearOne": {
                            "val": "36.131"
                        },
                        "BudgetYearOneBase": {
                            "val": "36.131"
                        },
                        "BudgetYearTwo": {
                            "val": "75.512"
                        },
                        "BudgetYearThree": {
                            "val": "102.559"
                        },
                        "BudgetYearFour": {
                            "val": "102.510"
                        },
                        "BudgetYearFive": {
                            "val": "111.496"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Mixed Technology Integration project funds the advanced development and demonstration of selected basic and applied electronics research programs.  Examples of technologies with funded development and demonstration activities include, but are not limited to: (1) reducing the size, weight, and power (SWaP) of components for laser weapon systems that will protect airborne platforms from emerging surface-to-air missiles; (2) integrated photonic-electronic components for positioning, navigation and timing in GPS-denied environments; (3) flexible, software-defined cameras that enable real-time image analysis of complex scenes to provide more actionable information; and (4) optical communications systems that rely on no moving parts enabling their use on SWaP-restricted platforms.  Funding under this project is intended to advance transitioning novel technologies to use, providing advanced components compatible with mid-term and other future warfighting requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Reconfigurable Imaging (ReImagine)"
                                    },
                                    "Description": {
                                        "val": "The Reconfigurable Imaging (ReImagine) program aims to create multi-functional readout integrated circuits (ROICs) that fundamentally change the way camera systems collect, process and relay image information. This is accomplished by adding multifunctional flexibility in the ROIC.  Today, most cameras are designed to capture high quality imagery at standard frame rates.  These traditional camera architectures collect a single type of data across the full image frame.  Specialty cameras can be used to capture different spatial, spectral or temporal data but are rarely deployed because of the cost and complexity of adding imaging subsystems for niche measurements.  Although these measurements are typically only desired for specific features or regions of interest (ROIs) in a scene, the cameras collect the specialized data over the full image frame.  The ReImagine architecture, conversely, would enable a single, real-time reconfigurable, software-defined camera system with the ability to collect different data in different ROIs.  Depending on the need, a ReImagine imager would be able to selectively collect and simultaneously process data from a specific ROI, for example, at a higher resolution (i.e., foveated imaging), at a higher frame rate or with 3-D depth information.  The system would interface with virtually any sensor and could therefore be used in any spectral band.  By demonstrating more efficient data collection and computation across ROIs, ReImagine ROICs will enable real-time analysis of much more complex scenes and provide more actionable information than has ever been possible.  Technologies from this program are intended for transition to the Air Force, Navy and Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.738"
                                            },
                                            "Text": {
                                                "val": "-  Completed the design and functional verification testing of the first generation (Gen-1)digital ROIC.\n-  Began fabrication of 2 Gen-1 prototype cameras that integrate the Gen-1 ROIC.\n-  Developed a detailed operational description and simulation for the ReImagine Gen-2 multi-functional digital ROIC, mapping applications and demonstrating enhanced operation and capability.\n-  Initiated the design and layout of the ROIC interface and focal plane array layers to operate with the Gen-2 multi-functional digital ROIC for enhanced programmable functionality.\n-  Continued the design of the ReImagine Gen-2 reconfigurable ROIC, updated and augmented based on Gen-1 performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the ReImagine reconfigurable sensing system concept using the Gen-1 reconfigurable ROIC.\n-  Complete the Gen-2 ROIC tier 1 design and submit to the foundry for manufacturing.\n-  Begin designing a multi-functional digital ROIC camera prototype system integrating multiple tier 3D implementations and the Gen-2 reconfigurable ROIC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.960"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.960"
                                            },
                                            "Text": {
                                                "val": "-  Complete functional verification testing of Gen-2 ROIC tier 1.\n-  Complete the design and build of the Gen-2 prototype camera that integrates the Gen-2 ROIC.\n-  Fully demonstrate the updated ReImagine reconfigurable sensing system concept."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects a shift from development of a multi-functional digital ROIC camera prototype to conducting final demonstrations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wideband Secured and Protected Emitter and Receiver (WiSPER)"
                                    },
                                    "Description": {
                                        "val": "The Wideband Secured and Protected Emitter and Receiver (WiSPER) program aims to develop an ultra-broadband technology platform to demonstrate a robust, secure and protected communication link. WiSPER technology provides high signal coding gain to deliver a secured and protected link with significantly enhanced capacity for next generation DoD communications. Current terrestrial tactical radios operate with limited bandwidth at prescribed low frequency bands, which are unable to support high capacity with multiple users, and are vulnerable to interference and jamming. WiSPER technology addresses military needs for assured communications, electronic warfare (EW) communications deception, throughput, security, and size, weight, and power limitations of future command, control, communications, computers, intelligence, surveillance and reconnaissance missions. The program will develop an ultra-broadband compact antenna, radio frequency front end electronics, mixed signal circuits, and featureless waveform technologies. The WiSPER program will culminate with the integration and demonstration of a secured communication link.  Technologies developed under the WiSPER program are planned for transition to the Services."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.500"
                                            },
                                            "Text": {
                                                "val": "-  Complete system study of transceiver architecture for ultra-broadband, secure communication links.\n-  Perform initial studies of antenna, integrated circuits, and waveform to implement ultra-broadband communications.\n-  Simulate and optimize the transceiver architecture design."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.000"
                                            },
                                            "Text": {
                                                "val": "-  Integrate the 1st-generation brassboard prototype transceiver.\n-  Prepare testing environment for secured radio prototype in laboratory.\n-  Perform laboratory testing of secured radio prototype in laboratory environment.\n-  Prepare to implement 2nd generation secured transceiver prototype."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects the program shifting from developing and fabricating components of the 1st-generation of transceivers to implementing a 2nd generation secured transceiver prototype."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Portable Optical Integrated Network Transceivers (POINT)"
                                    },
                                    "Description": {
                                        "val": "To enable advanced communications and improve network resiliency, the Portable Optical Integrated Network Transceivers (POINT) program aims to develop low size, weight, and power (SWaP) photonic transceivers and demonstrate them in free-space optical (FSO) links for micro-satellites and small mobile platforms. The high-SWaP of existing optical terminals with gimbals and telescopes are incompatible with micro-satellite payload capacity and mission requirements. POINT will leverage recent development of optical phased array based transmitter technology combined with wide field of view, dual-mode, high-speed imaging receivers. The integrated optical transceivers will have no moving parts, resulting in a radical reduction in SWaP, enabling advanced and resilient communications for small Low-Earth Orbit (LEO) satellites and other mobile platforms. The program will develop and demonstrate an FSO link applicable to LEO-LEO or LEO-Ground missions, providing high bandwidth, efficient, and secure communication links for resilient command, control, communications, computer, intelligence, surveillance, and reconnaissance operations in space. Other terrestrial uses of the technology include interference-free operation in denied environments and low probability of intercept\/low probability of detection tactical links.  Technologies developed under the POINT program are planned for transition to the Services."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.171"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.171"
                                            },
                                            "Text": {
                                                "val": "-  Develop and mature chip-scale photonic transmitters and receivers with sufficient bandwidth, range, and field of regard to acquire and maintain robust FSO links up to 1 Gbps at 200 km.\n-  Develop gimbal-free FSO terminals with form-factor and SWaP compatible with deployment on micro-satellites and small mobile platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precise Robust Inertial Guidance for Munitions (PRIGM)"
                                    },
                                    "Description": {
                                        "val": "The Precise Robust Inertial Guidance for Munitions (PRIGM) program is developing inertial sensor technologies for positioning, navigation, and timing (PNT) in GPS-denied environments.  These inertial sensors can provide autonomous PNT information when GPS is unavailable.  The program exploits recent advances in integrating photonic (light-manipulating) components into electronics and in employing microelectromechanical systems (MEMS) as high-performance inertial sensors for use in extreme environments. Whereas conventional MEMS inertial sensors suffer from inaccuracies due to factors such as temperature sensitivity, photonics-based PNT techniques have demonstrated the ability to mitigate these inaccuracies.  PRIGM is focusing on two areas: (1) By 2020, it aims to develop and transition a Navigation-Grade Inertial Measurement Unit (NGIMU), a state-of-the-art MEMS device, to DoD platforms; and (2) By 2030, it aims to develop Advanced Inertial MEMS Sensors that can provide gun-hard, high-bandwidth, high dynamic range navigation for GPS-free munitions.  These advances will enable navigation applications, such as smart munitions, that require low-cost, size, weight, and power (SWaP) inertial sensors with high bandwidth, precision and shock tolerance.  PRIGM will advance state-of-the-art MEMS gyros from TRL-3 devices to a TRL-6 transition platform, eventually enabling the Service laboratories to perform TRL-7 field demonstrations.  The ultimate goal is to develop a complete MEMS-based NGIMU with a mechanical\/electronic interface identical to existing DoD-standard tactical-grade MEMS IMUs, providing a drop-in replacement for existing DoD systems.  Service laboratories have been actively involved throughout program development and remain engaged to facilitate transition of NGIMU prototypes, which will be delivered at the program conclusion.  This program has basic research efforts funded in PE 0601101E, Project ES-01 and applied research efforts funded in PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.600"
                                            },
                                            "Text": {
                                                "val": "-  Delivered two MEMS-based, navigation-grade, integrated IMU prototypes (non-gun hardened) for government evaluation.\n-  Commenced development of MEMS-based, navigation-grade, integrated IMU meeting SWaP constraints, performance metrics, environmental requirements, and shock survival."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Deliver two MEMS-based, navigation-grade, integrated IMU prototypes for government evaluation.\n-  Evaluate MEMS-based, navigation-grade, integrated IMU prototypes (non-gun hardened) in laboratory environment.\n-  Evaluate MEMS-based, navigation-grade, integrated IMU prototypes (non-gun hardened) in operational environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Array Development (RAD)"
                                    },
                                    "Description": {
                                        "val": "The Rapid Array Development (RAD) program is building an immersive electromagnetic environment for use by the warfighter to understand the effects of electronic maneuvers and developing new electronic maneuver warfare (EMW) techniques. The program is leveraging recent developments in flexible and adaptive radio frequency (RF) hardware, access to a larger variety of more powerful computing platforms, and advances in software virtualization to radically change the development and deployment cycle for EMW techniques. Currently, the development cycle for EMW algorithms is long and costly. However, they must be able to evolve rapidly in order to adapt to new modes of operation and changing operating parameters associated with modern military threats. The programmable RAD testbeds will ultimately train warfighters on how to deal with legacy and emerging threats in the RF spectrum through maneuvers, signal jamming tactics, signal intelligence gathering, and other missions. The outcome of RAD will be better tactics, techniques, and procedures for handling EMW as well as the identification of new technology assets for deploying EMW capabilities. Technologies developed under the RAD program are planned for transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.533"
                                            },
                                            "Text": {
                                                "val": "-  Initiated development of a compute engine to optimize the implementation of electromagnetic (EM) algorithms on a system of heterogeneous processors.\n-  Explored use of toolchains and toolsets for programming on heterogeneous computing systems.\n-  Explored new models of machine learning and supervisory controls to manage complex allocation of processing resources.\n-  Initiated development of flexible array technology to be the common hardware platform for an immersive applications development environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.779"
                                            },
                                            "Text": {
                                                "val": "-  Explore development of a processing platform capable of executing EMW algorithms, array configuration, data flow, and end-user interactions.\n-  Design a software framework for rapidly developing new EMW applications.\n-  Initiate development of a full EMW mission control system to include electromagnetic spectrum monitoring and management.\n-  Initiate plans for a testbed installation at a military base or radar test range and begin electromagnetic spectrum monitoring."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Efficient Ultra-Compact Laser-Integrated Diodes (EUCLID)"
                                    },
                                    "Description": {
                                        "val": "The Efficient Ultra-Compact Laser-Integrated Diodes (EUCLID) program aimed to significantly reduce the size of laser diode pump modules (DPMs) while increasing their electrical-to-optical efficiency.  EUCLID leveraged advances in thermal management components to design, build, test, and demonstrate densely packageable, prototype DPMs that are less than half the size of their commercial counterparts.  The program pursued improved optical components that can more efficiently focus light from individual laser diodes.  The resulting EUCLID DPMs will be available for procurement and integration into ultra-low size, weight, and power fiber-laser array weapons systems, enabling integration into a variety of Air Force, Navy, Army, and Missile Defense Agency platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Built and tested prototype DPMs which produce >4 kW of optical power and >58% efficiency and are suitable for powering a coherently combinable fiber laser amplifier assembly.\n-  Generated detailed designs of a compact, packaged 4 kW diode pump assembly based on the prototype DPMs."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MT-16"
                    },
                    "ProjectTitle": {
                        "val": "BEYOND SCALING ADVANCED TECHNOLOGIES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "48.171"
                        },
                        "CurrentYear": {
                            "val": "65.337"
                        },
                        "BudgetYearOne": {
                            "val": "59.733"
                        },
                        "BudgetYearOneBase": {
                            "val": "59.733"
                        },
                        "BudgetYearTwo": {
                            "val": "66.900"
                        },
                        "BudgetYearThree": {
                            "val": "52.000"
                        },
                        "BudgetYearFour": {
                            "val": "52.000"
                        },
                        "BudgetYearFive": {
                            "val": "52.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Beyond Scaling Advanced Technologies Project is a continuation of DARPA's basic and applied research in this area and will support activities in large scale co-development with leading industry players to enable and accelerate transformative computing interactions with industry. Funding under this project will include developing new technologies and capabilities in commercial settings, establishing access to these new processes and commercial state-of-the-art (SOTA) foundries, developing manufacturable processes for integrated photonics, new architectures and integration technologies for advanced field programmable gate arrays (FPGAs), and innovating back end of line technologies for wide bandgap semiconductors."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Beyond Scaling - Access"
                                    },
                                    "Description": {
                                        "val": "The Beyond Scaling - Access program will demonstrate the design and fabrication of advanced electronics through collaborations with leading industry players. It accomplishes complementary goals of working in a commercial environment for innovation beyond-SOTA to develop electronics for military capabilities, while simultaneously strengthening our domestic ecosystem and ensuring that the DoD has enduring access to SOTA technologies.  Although the United States has led the development of advanced electronics since its inception and is home to three of the five leading-edge silicon foundries, recent investments by foreign competitors are threatening this leadership. Additionally, the fabrication cost of next generation microelectronics has increased at an alarming rate. While the commercial sector is able to spread these costs over a large volume of products, the low volumes used by the DoD has led to a cost barrier in meeting its future technology needs. This program will forge forward-looking collaborations among the commercial electronics community, defense industrial base, university researchers, and the DoD. Activities include establishing design capabilities for advanced digital logic in SOTA foundries, developing new architectures for field programmable gate arrays (FPGAs) using commercial manufacturing flows, and lowering the technical hurdles for ubiquitous heterogeneous integration by revolutionizing back end compound semiconductor processes. Technologies from this program are intended for transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "30.200"
                                            },
                                            "Text": {
                                                "val": "-  Established SOTA microelectronics fabrication paths at a leading-edge commercial foundry and began chip design efforts.\n-  Began new partnerships between the commercial sector and defense industrial base, to develop DoD-tailored Electronics Resurgence Initiative (ERI) technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.137"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate fabrication of DoD microelectronic designs in a leading-edge commercial foundry.\n-  Develop architectures and design tools for advanced, high-bandwidth FPGAs.\n-  Establish initial architecture specifications for potential commercially manufactured devices with DoD relevance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.733"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.733"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate application of Electronics Resurgence Initiative technologies in DoD-relevant applications.\n-  Develop process flows for scaled transistor and interconnect technology for more complex (>10,000 device) III-V circuits.\n-  Demonstrate fabrication of advanced FPGAs to achieve breakthrough high-bandwidth dataflow for DoD applications such as communications\/radar beamforming, or synthetic aperture radar."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects demonstration of multiple technologies fabricated through various commercial process flows."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Millimeter Wave Digital Arrays (MIDAS)"
                                    },
                                    "Description": {
                                        "val": "The Millimeter Wave Digital Arrays (MIDAS) program is developing a common millimeter wave phased-array tile that is scalable to large arrays to provide wideband frequency agility from 18-50 GHz with element-level digital beamforming.  Millimeter wave systems are used today to achieve physical security through the use of narrow antenna beams in a small form-factor.  We see this applied to satellite communications and tactical line-of-sight communications such as in the F-22 and F-35.  One of the challenges of using directional communications in mobile applications is the problem of knowing where to point the antenna when both platforms are mobile.  This can be solved with digital beamforming to enable a mobile platform to listen in all directions with many antenna beams to facilitate neighbor discovery when transmitting. Digital beamforming also enables multiple beams to communicate with several neighbors simultaneously.  This capability will increase the network throughput and robustness that will be tolerant to unexpected outages.  To achieve these goals, the program will develop a common digital phased array tile that can be used to build large arrays from this common block.  The program will be executed in two primary technical areas.  First, advanced complementary metal oxide semiconductor (CMOS) technology will be used to develop the core transceiver elements at a size and power consumption that is required to fit in the small size required by current millimeter wave systems.  Second, a combination of advanced packaging and high-performance compound semiconductors will be used to build the wideband antenna and front-end amplifiers necessary to make a complete system.  Technologies from this program are intended for transition through commercial industry to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.971"
                                            },
                                            "Text": {
                                                "val": "-  Completed preliminary and critical design reviews for fabricating millimeter wave frequency, low-power, 16-element, element-level digital phased arrays in advanced CMOS.\n-  Designed wideband and efficient power amplifiers, low-noise amplifiers and transmit\/receive switches co-packaged with wideband antenna arrays.\n-  Explored fundamental technical innovations relevant to millimeter wave digital arrays in the areas of converters, filters, oscillators, and broadband apertures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.200"
                                            },
                                            "Text": {
                                                "val": "-  Fabricate and test millimeter wave frequency low-power, 16-element, element-level digital phased arrays in advanced silicon CMOS.\n-  Begin designs of millimeter wave 64-element digital phased arrays in advanced CMOS co-integrated with compound semiconductor power amplifiers and wideband apertures.\n-  Continue demonstrating advancements in the fundamental technologies relevant to millimeter wave digital arrays in the areas of converters, filters, oscillators, and broadband apertures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Finalize designs of millimeter wave 64-element digital phased arrays in advanced CMOS co-integrated with compound semiconductor power amplifiers and wideband apertures.\n-  Begin finalizing advancements in the fundamental technologies relevant to millimeter wave digital arrays in the areas of converters, filters, oscillators, and broadband apertures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects the program shifting from demonstrating to finalizing advancements in the fundamental technologies relevant to the millimeter wave digital arrays."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Photonics in the Package for Extreme Scalability (PIPES)*"
                                    },
                                    "Description": {
                                        "val": "*Previously part of Beyond Scaling - Access\n \nThe Photonics in the Package for Extreme Scalability (PIPES) program aims to develop optical signaling technologies for digital microelectronics. Distributed and parallel computing architectures are now pervasive across all size scales, from personal-scale multicore processing units to enterprise-scale high performance computing systems, and span application domains from consumer electronics to DoD systems. Increasingly, however, the benefits of parallelism are constrained not by the limits of computation at individual nodes but by the movement of data between nodes. PIPES will advance microelectronics capabilities by intimately integrating photonics with advanced integrated electronics to yield system connectivity with an unprecedented combination of high aggregate bandwidth, power efficiency, channel density, and link reach. Specifically, PIPES will develop photonic input\/output (I\/O) capability for application-specific integrated circuits and FPGAs, widely used in advanced DoD sensors and RF systems. The goal of the program is improving I\/O bandwidth density, efficiency, and reach by >100x to enable disruptive DoD system parallelism and performance scaling. As PIPES technologies mature, they are anticipated to proliferate into central processing units, graphical processing units, and emerging tensor-flow processing units that will impact a wide range of dual-use applications including artificial intelligence, machine learning, large scale emulation, and high performance computing. Technologies from this program are intended for transition to larger scale commercial performers and the Services."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Design and begin fabrication of silicon photonics and electronic drive circuitry to enable package-level photonic interconnects for state-of-the-art (SoA) FPGAs, targeting 10x improvements to link energy and bandwidth over current SoA performance.\n-  Develop and demonstrate innovative component technologies for next-generation photonic interconnects, targeting concepts for 100x improvement to link energy and bandwidth over current SoA performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Integrate silicon photonics and electronic drive circuitry, and characterize packaged photonic interconnect demonstrator performance to enable FPGAs with photonic interfaces.\n-  Define system integration concepts that leverage PIPES photonic connectivity for defense applications.\n-  Integrate innovative component technologies and characterize link performance of next-generation photonic interconnect capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects the program shifting from designing to integrating silicon photonics and electronic drive circuitry, and characterizing the packaged photonic interconnect demonstrator's performance to enable FPGAs with photonic interfaces."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technologies for Mixed-mode Ultra Scaled Integrated Circuits (T-MUSIC)*"
                                    },
                                    "Description": {
                                        "val": "*Previously part of Beyond Scaling - Access\n\nThe Technologies for Mixed-mode Ultra Scaled Integrated Circuits (T-MUSIC) program will develop an on-shore ultra-broadband radio frequency (RF) mixed-mode semiconductor integrated circuits foundry platform for the critical interface to convert high speed analog signals to a digital representation for commercial and military systems. The mixed-mode circuits take signals from the physical world (analog, RF) and transform them to be processed in computing systems (digital). As defense and commercial wireless applications move to higher frequencies to carry faster data traffic, integrating the broadband mixed-mode circuitries with high speed digital processing logics onto one integrated chip is needed to attain the performance required for future systems. T-MUSIC seeks to integrate high-speed, high-performance analog and digital electronics together in highly scaled silicon complementary metal-oxide semiconductor (CMOS) foundries on-shore. Such processes will enable the high integration and performance needed for DoD-relevant and commercial 5G\/6G applications. The goal of T-MUSIC technology is to enable wireless operations beyond 100 GHz with very wide bandwidth with low noise and high dynamic range. In parallel, T-MUSIC aims to develop the next-generation terahertz (THz) mixed-mode devices based on the advanced digital CMOS fabrication platform. The T-MUSIC program will establish advanced on-shore foundry capabilities to establish a long-term domestic world-class RF mixed-mode System-on-Chip technology for intended transition to DoD and commercial applications."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop 350 GHz high speed mixed-mode device technology leveraging domestic foundry fabrication processes and facilities.\n-  Define device topology and advanced fabrication techniques through simulation and experiments in foundries.\n-  Explore advanced materials, device structures, and integration processes for THz devices in a domestic CMOS process platform."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "-  Fabricate and demonstrate foundational mixed-mode analog\/digital circuit building blocks in domestic foundries.\n-  Identify the development specification for next-generation 400 GHz high speed mixed-mode device technology.\n-  Demonstrate advanced materials, THz device structures, and integration process based on domestic CMOS process platform."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects the program shifting from developing to fabricating foundational mixed-mode analog\/digital building blocks in domestic foundries."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}