{
    "id": "2021-Army-PB-2040-JBOOK-8f7fdbb59cb85b132b0478715b87ff02c7eb359f73f79d73e48c9151ed5a28f2-30",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603728A"
        },
        "ProgramElementTitle": {
            "val": "Environmental Quality Technology Demonstrations"
        },
        "R1LineNumber": {
            "val": "73"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "28.079"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "28.079"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) is being eliminated, with continuity of effort realigned to the following PEs:\n* PE 0603119A Ground Advanced Technology\n* PE 0603462A Next Generation Combat Vehicle Advanced Technology \n* PE 0603463A Network C3I Advanced Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE matures and demonstrates technologies that assist the Army to reduce or eliminate environmental impacts both in the United States and abroad, and provide science and technology solutions to Army environmental challenges as a force multiplier in mission planning, material acquisition and soldier preparedness. Project 002 demonstrates tools and methods for compliance with environmental laws relevant to conservation of natural and cultural resources while providing a flexible realistic training environment for mission activities. The Army also requires the ability to assess, establish, upgrade, and secure infrastructure while in theatre to enable deployed force operations. This project matures and demonstrates tools for robotic and autonomous agile infrastructure modification and custom designed construction for expeditionary structures on demand. Project 025 demonstrates pollution prevention tools and methods to minimize the Army's use and generation of toxic chemicals and hazardous wastes. Project 03E focuses on technologies for advanced life cycle analysis, advanced sensing, and technologies to empower rapid fielding of next generation energetics, propellants and munitions.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, the Army Modernization Strategy, and supports the Army Strategy for the Environment.\n\nFY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nThis PE is fully coordinated and complementary to PE 0602720A (Environmental Quality Technology).\n\nWork in this PE is performed by the Army Engineer Research and Development Center, Vicksburg, MS, and the Army Futures Command (AFC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "29.132"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "28.079"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.053"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.933"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.12"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "002"
                    },
                    "ProjectTitle": {
                        "val": "Environmental Compliance Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.352"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.352"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2020 this Project is realigned to:\nProgram Element (PE) 0603462A Next Generation Combat Vehicle Advanced Technology, Project: \n* BK8 Robotics for Engineer Operations Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates technologies transitioned from PE 0602720A (Environmental Quality Technology), Projects 048 and 896, and PE 0602784 (Military Engineering), Projects T41 and T45. This Project assists Army installations and operations in achieving environmental compliance. Army facilities are subject to fines and facility shutdowns for violations of federal, state, and local environmental regulations. Efforts under this Project enable the Army to reduce environmental constraints at installations while complying with the myriad of federal, state, local, and host country environmental regulations and policy. In addition, this project matures capabilities to assess, establish, upgrade, and construct infrastructure to project power and enable deployed force operations. Current and planned efforts enable the Army to perform additive and advanced manufacturing for deployed force infrastructure, support robotic and autonomous engineering during combat operations, and ensure infrastructure resiliency. Technologies demonstrated aim to reduce the cost of resolving compliance issues for the Army, sustain the viability of testing and training ranges, protect critical resources, and expand capacity to perform construction and supporting tasks in high risk\/threat and dynamic environments.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, supports the Army Strategy for the Environment, and supports the Army Modernization Priority for Next Generation Combat Vehicle, Air Missile Defense and Network\/C3I.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the Army Engineer Research and Development Center (ERDC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Robotics for Engineer Operations"
                                    },
                                    "Description": {
                                        "val": "Mature and demonstrate robotic and autonomous technologies for Engineer operations supporting mobility, countermobility, and advanced construction methods for deployed operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.352"
                                            },
                                            "Text": {
                                                "val": "Matured risk mitigation frameworks associated with contingency autonomous construction methods and activities; and matured algorithms and decision making software for control processes (bandwidth needs, response time lag, and override response times) developed to facilitate autonomous methods necessary for expedient point of need construction."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "03E"
                    },
                    "ProjectTitle": {
                        "val": "Environmental Restoration Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.727"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.727"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned to:\nProgram Element (PE) 0603463A Network C3I Advanced Technology, Projects: \n* AR4 Intelligent Environmental Battlefield Awareness Advanced Technology \n* AR6 Understanding the Environment as a Threat Advanced Technology\nPE 0603119A Ground Advanced Technology, Project:\n* BM1 Protection from Advanced Weapon Effects Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates technologies transitioned from PE 0602720A (Environmental Quality Technology) Projects 835 and 896 that address the management and mitigation of hazardous materials and chemicals, with a focus on mitigating impacts of new materiel that will enter the Army inventory within the next decade and beyond. This Project will shape and protect Army investments in next generation fires by delivering proactive, scientifically sound risk and environmental impact management strategies. Efforts in this Project assess environmental factors in mission planning activities that impact the battlefield landscape of future threats while also identifying opportunities and impacts to mission success in sparse data environments. These efforts will enable mission planners to identify the industrial\/commercial resources used as components of weapons development. Technologies matured within this Project: inform the Army of potential environmental threats, opportunities, and mission impacts; help decision makers understand environmental threats in urban and industrial contested environments; and provide rapid sensing and assessment of the presence and extent of dangerous compounds in battlefield environments. \n\nA key aspect of this work is the enhancement of risk assessment and life cycle analysis techniques that can more accurately predict and identify the environmental liabilities associated with fielding new systems and technologies. Efforts also identify ways to economically comply with myriad federal, state, and host country regulations dealing with contaminated soil and water. This Project includes pilot-scale field studies to demonstrate technological feasibility and optimize performance and productivity of risk mitigation techniques.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, the Army Modernization Strategy, and supports the Army Strategy for the Environment. \n\nWork in this Project is performed by the Army Engineer Research and Development Center (ERDC), Vicksburg, Mississippi."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hazard Assessment for Military Materials"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates tools to assess hazard and risk of Army-unique chemicals and materials. The tools provide for rapid environmental baseline survey reporting and screening assessments of existing and future militarily relevant compounds and allow for improved predictive risk assessment and provide environmental life cycle assessment capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.273"
                                            },
                                            "Text": {
                                                "val": "Characterized environmental fate, degradation and transport of obscurants and tone-down materials in different environments ranging from open lands to dense urban areas."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Risk Analysis of Fires"
                                    },
                                    "Description": {
                                        "val": "This effort is focused on health implications of new, to-be fielded munitions and investigates the overall life cycle of the materials to shape and protect Army investments in next generation fires supporting Army Modernization Priority Long Range Precision Fires."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.822"
                                            },
                                            "Text": {
                                                "val": "Demonstrated proactive environment, safety, and occupational health risk assessment tools to ensure rapid fielding of energetics, propellants, and munitions; validated models to predict chemical impacts on select species using embryo gene expression; and demonstrated new computational technologies with high potential for meeting the Army?s needs to predict the toxicity of new and novel chemical agents used in munitions, smoke screens, and energetics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Understanding the Environment as a Threat"
                                    },
                                    "Description": {
                                        "val": "This effort provides environmental conditions and hazards in contested environments to enable operational planning and decisions to understand environmental threats from informed modeling and simulation supporting Modernization Priority Network\/C3I Mission Planning Applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.632"
                                            },
                                            "Text": {
                                                "val": "Demonstrated predictive tools to inform engineer reconnaissance and provide environmental situational awareness for mission planning; demonstrated in silico prediction of physical, chemical and biological properties of insensitive munitions compounds and their transformation products in the natural water, arid and semi-arid environments; and matured models capable of predicting chemical behavior in complex environments to support scientifically defensible knowledge, tools, and guidance."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "03F"
                    },
                    "ProjectTitle": {
                        "val": "Environmental Quality Tech Demonstrations (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "20.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional increases supporting the maturation and demonstration of technologies that assist the Army in becoming environmentally compliant and limiting future liability without compromising readiness or training assets critical to the success of the future force.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Army Engineer Research and Development Center (ERDC), Vicksburg, Mississippi."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Autonomous Transport Innovation"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Autonomous Transport Innovation"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Safe Carbon Nanotechnology Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8"
                                        },
                                        "Text": {
                                            "val": "Rapid Safe Carbon Nanotechnology Research"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Smart Bases"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Smart Bases"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Sensors for Explosives"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "2"
                                        },
                                        "Text": {
                                            "val": "Environmental Sensors for Explosives"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}