{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-855515f7cbe1443b1cc76e32ff869263061a887974718017fcc8f688288c6578-57",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604771D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Tactical Information Distribution System (JTIDS)"
        },
        "R1LineNumber": {
            "val": "127"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "125.338"
            },
            "PriorYear": {
                "val": "46.210"
            },
            "CurrentYear": {
                "val": "54.102"
            },
            "BudgetYearOne": {
                "val": "54.985"
            },
            "BudgetYearOneBase": {
                "val": "54.985"
            },
            "BudgetYearTwo": {
                "val": "41.775"
            },
            "BudgetYearThree": {
                "val": "34.949"
            },
            "BudgetYearFour": {
                "val": "35.053"
            },
            "BudgetYearFive": {
                "val": "35.350"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program provides in-depth technical, engineering, integration support, and system of system analysis for space, missile defense, cyber, C4ISR, NC3, and nuclear weapons program portfolio management.\n- Command, Control, Communications, Computers and Intelligence, Surveillance, and Reconnaissance:  Develop and maintain a roadmap to improve data link interoperability, data link waveform standards, and global enterprise capabilities, enabling resilient, survivable federated networks.\n- Nuclear Forces (Nuclear Command, Control, and Communications (NC3)): Execute NC3 Enterprise Capability Portfolio Management on behalf of the Under Secretary of Defense for Acquisition and Sustainment (USD(A&S)).\n- Cyberspace as a Warfighting Domain Acquisition support and portfolio management of cyber capabilities to assure resilient weapons systems and critical infrastructure; improved Defense Industrial Base cybersecurity; cyber mission force capabilities to conduct offensive and defensive cyber missions.\n- Secure and Robust Mission Critical Software:  Advance capabilities in both software-intensive warfighting systems and enterprise defense business systems; support agile acquisition software pilots\n- Acquisition Staff Support:  Provide advice to acquisition decision makers on strategies to develop, produce, and sustain Major Defense Acquisition Programs"
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "34.425"
                },
                "CurrentYear": {
                    "val": "40.102"
                },
                "BudgetYearOne": {
                    "val": "26.718"
                },
                "BudgetYearOneBase": {
                    "val": "26.718"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "46.210"
                },
                "CurrentYear": {
                    "val": "54.102"
                },
                "BudgetYearOne": {
                    "val": "54.985"
                },
                "BudgetYearOneBase": {
                    "val": "54.985"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "11.785"
                },
                "CurrentYear": {
                    "val": "14.000"
                },
                "BudgetYearOne": {
                    "val": "28.267"
                },
                "BudgetYearOneBase": {
                    "val": "28.267"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "14.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "12.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.709"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "NC3 PE Transfer"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.689"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.689"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.617"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.617"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Cancelled Account"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.006"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.022"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.022"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Defense Wide Review Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.405"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.405"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Cyber Resilence Mission Assurance"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "35.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "35.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2021 overall increase of is the result of planned program changes in OUSD (A&S)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "771"
                    },
                    "ProjectTitle": {
                        "val": "Link-16 Tactical Data Link (TDL) Transformation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "111.918"
                        },
                        "PriorYear": {
                            "val": "19.492"
                        },
                        "CurrentYear": {
                            "val": "12.563"
                        },
                        "BudgetYearOne": {
                            "val": "5.265"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.265"
                        },
                        "BudgetYearTwo": {
                            "val": "6.745"
                        },
                        "BudgetYearThree": {
                            "val": "6.959"
                        },
                        "BudgetYearFour": {
                            "val": "7.000"
                        },
                        "BudgetYearFive": {
                            "val": "7.236"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Provide in-depth technical, engineering, integration support, and system of system analysis for space, missile defense, cyber, C4ISR, NC3, and nuclear weapons program portfolio management.\n–  Command, Control, Communications, Computers and Intelligence, Surveillance, and Reconnaissance:  Develop and maintain a roadmap to improve data link interoperability, data link waveform standards, and global enterprise capabilities, enabling resilient, survivable federated networks.\n–  Nuclear Forces (Nuclear Command, Control, and Communications (NC3)):   Execute NC3 Enterprise Capability Portfolio Management on behalf of the Under Secretary of Defense for Acquisition & Sustainment (USD(A&S))."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Common Joint Tactical Information Initiatives"
                                    },
                                    "Description": {
                                        "val": "FY19 Accomplishments:\n\nProjects supporting the Deputy Assistant Secretary of Defense for Information and Integration Portfolio Management (DASD(I&IPM)):\n\n- Established the scope of the NC3 enterprise by developing the NC3 Portfolio Definition list comprised of 204 objects, which includes programs, facilities, and systems that support surveillance and warning, command and control, Satellite Communications, Terrestrial and transport, air and force delivery programs, and special access programs.  \n- Implemented and supported a new NC3 governance process consisting of semi-annual NC3 Enterprise Reviews co-chaired by the Deputy Secretary of Defense and the Vice Chairman of the Joint Chiefs of Staff to address critical NC3 capability gaps and targeted investment decisions.\n- Developed an initial NC3 Integrated Master Schedule for NC3 portfolio areas to track dependencies among related programs and identified critical paths to high priority NC3 capabilities to support enterprise-wide decision making. \n- Established portfolio reporting processes to support oversight of delayed acquisition programs by the Council on Oversight of the National Leadership Command, Control, and Communications System as required by the FY 2018 National Defense Authorization Act section 1654.  Managed quarterly reporting and provided the semi-annual reports to congress as required by statute. \n- Agile in Global Command & Control System Joint Enterprise (GCCS-JE) Program & Joint Planning and Execution Services (JPES) Program: As requested by DISA PEO, Program Manager, Lead Architect and Technical Staff, developed and delivered agile framework for GCCS-J Modernization.  Gave agile dev and dev ops presentations and provided written material to PMO government and contactor staff. Provided technical presentations and analyses for Program Increment Planning, Data Interface Design Sessions, Software Demos, Development Team Retrospective Hot Wash, etc. Analyzed schedules and timelines provided by vendors and identified the risks involved and developed actions to mitigate these risks. Resulted in a restructure of GCCS modernization focusing on execution delivery.\n- Joint Cyber Command and Control (JCC2) Portfolio Management (USD(A&S) is PSA):  Provided technical and acquisition expertise to the Air Force Executive Agent in developing the initial JCC2 architecture, pilots, and acquisition strategy. Supported development of Joint Cyber C2 ICD and received formal approval. The Air Force JCC2 recently demonstrated situational awareness capability in a successful recent Service level CSB.\n- Conducted the analysis and authored the Tactical Data Relay Business Case Analysis (BCA) final report supporting Airborne Intelligence Surveillance and Reconnaissance Data Transport Task Force. Resulted in sustainment of relay capability during FY20 PBR.\n- Planned, prepared, managed and executed the Spectrum Efficient National Surveillance Radar (SENSR) Spectrum Pipeline Plan as the PSA for SENSR program Acquisition.  Authored key documents and orchestrated DoD activities supporting the SENSR program. \n- Completed Wideband communication services (WCS) Analysis of Alternatives (AoA) Final Report write-up & prepared WCS AoA Sufficiency Package staffing to USD(A&S); delivered Sufficiency Review request to D,CAPE. Prepared briefing and participated in WCS AoA Briefing to C4\/Cyber FCB with the aim of Joint Staff endorsement as acquisition planning document. GAO declared the report comprehensive.  ASD(A) recently signed acknowledgement memo to GAO.\n- Prepared and briefed to Common Data Link (CDL) community and staffed an information memo to USD(A&S) regarding CDL waveform modernization status for FY 2019.  Prepared and facilitated data call and prepared and briefed FY 2020 CDL modernization status for waveforms and crypto.\n- Completed revision of JTNC Charter as lead contributor to align with responsibilities outlined in DSD memorandum Enhancing DoD’s Joint tactical Networks and Datalinks Modernization, and to develop JTNC FY 2020 Management Plan and Tri-Service funding plan.\n- Collected High Frequency (HF) Capability Portfolio Management (CPM) programs, terminals, recap plans, and budgets into current HF data set. Investigated 4G HF spec compliance of USMC’s planned procurement of Harris AN\/PRC-160 radios. Working to mitigate interoperability issues.\n- Developed construct for an enterprise level Tactical Data Link (TDL) dataset to improve TDL portfolio management and analysis. Collected TDL community Capability Portfolio Management (CPM) programs, terminals, recap plans, budgets, etc. into current HF data set. Documented deficiency in acquisition and interoperability insight and prepared recommendation to USD(A&S) for stronger A&S engagement and advocacy across the joint community.  \n- Developed and delivered interoperability roadmap and capability assessment describing problem\/challenges, COAs, and developed \"road map\" for US, NATO, and coalition partners. Co-chaired United States - France Communications Interoperability Sub-Working Group with French counterparts to address interoperability with the United States and France 4th and 5th generation aircraft.  Developed Terms of Reference and way-forward plan for execution—approved by the French counterpart.  \n- Evaluated five Army and Navy acquisition programs for compliance with Mid-Tier Acquisition (MTA) guidance.  Prepared recommendations to the Assistant Secretary of Defense for Acquisition (ASD(A)) for his review of other programs and development of DoD’s MTA policy.\n\nProjects supporting the Deputy Assistant Secretary of Defense for Acquisition Enablers (DASD(AE)):\n \n- Advanced Software - Provided Technical\/Engineering support to agile acquisition pilots and new software pathways policy development, including support as administrator and curator for the online agile community of practice, provided subject matter expert contributions & Technical\/Engineering support to individual agile acquisition pilots as pilot advisor, assisted pilot programs with development of their required program documentation, and provided agile coaching and training.  \n- Delivered 180-day status report & drafted final congressional pilot reports. Provided technical\/ engineering support to agile acquisition pilots.\n- Developed draft interim policy and guidance on a new software acquisition pathway for the Department.\n- Created and executed a wargame to refine interim software acquisition policy with Services, Agencies, Office of the Secretary of Defense (OSD) Acquisition and Joint Staff stakeholders. \n- Developed a draft Implementation Strategic Roadmap that identifies short, medium, and long-term goals for each of the Defense Science Board (DSB) recommendations.\n- Developed practical approaches to encourage adoption of game-changing software development and sustainment approaches that will deliver capabilities that catalyze greater mission impact to the warfighter and Enterprise more rapidly while better controlling cost and improving resilience in the current and emerging cyber threat environment.    \n- In Agile Pilot Program, identified likely risk areas, developed risk reduction approaches, and proposed appropriate metrics for new programs that will better reflect the health of software programs undergoing modernization or in development.\n- Provided technical analysis and support to Software Provenance and Supply Chain Risk Management (SCRM) policy development, including implementation plans for changes in statue, regulation, and management direction. Provided technical assessments and course of action recommendations to address cybersecurity engineering and risk management considerations in the procurement process.  Upon request, provided technical expertise and industry assessments to facilitate development of standard procedures to institutionalize SCRM in the procurement process.  \n- DASD(AE) coordinated with USCYBERCOM, OGC, CIO, USD(I), DPC, and USD(P) on policy development and implementation of FY 2019 NDAA Section 889 and Section 889 waiver processes, which are currently in official coordination with the Services.  \n- DASD(AE) continues to coordinate with these offices and conduct threat assessments in bi-weekly Scoping and Mitigation meetings with DoD SCRM TAC.\n- DASD(AE) answered several direct SECDEF Requests for Information (RFIs) on Chinese and Russian software companies posing a risk to National Security Systems (NSS). \n- DASD(AE) used 10 USC 2339a authorities to prohibit NSS use of a software company with foreign ownership control or influence concerns. \n\nProjects supporting the Deputy Assistant Secretary of Defense for Platforms & Weapons Portfolio Management (DASD(P&WPM)):\n \n-  Provided advice to USD(A&S) and ASD(A) senior leaders on strategies to produce, develop, and sustain the F-35 Lightning II program and worldwide fleet of aircraft.  F-35 is the DoD’s largest and highest priority acquisition program.  Provided expert acquisition\/program support to enable Planning, Programming, Budgeting and Execution (PPBE) for the F-35 Program Objective Memorandum (POM) and overall program requirements development.  Collaborated with OSD, JCS, F-35 JPO, Air Force, & Navy.  Assisted with routine reports including 30-60-90 and 5-15 inputs to ASD(A) and OUSD(A&S).  Participated in weekly F-35 Action Officer synchronization meetings and helped generate weekly F-35 sustainment reports.  Provided support to monthly F-35 Acquisition Small Group meetings. Provided additional portfolio support to Director for Air Weapons and Platforms for general air platforms and weapons portfolio management.\n- Launched ground combat vehicle portfolio manager position.  Responded to GAO recommendations on Amphibious Combat Vehicle (ACV) and fact checked additional reports on the M1-A1 Abrams tank program.  Participated in the Strategic Portfolio Review on Asymmetric China Response.\n  -Launched inaugural Air Defense Portfolio management position. Monitored Patriot and Short Range Air Defense programs as well as other associated and competing programs.  Participated in initial efforts to establish the new Cruise Missile Defense of the Homeland cross functional team.\n  - Provided critical direct support and expertise to the Counter Unmanned Air Systems (CUAS) portfolio manager.  Supported the stand-up of the CUAS Senior Integration Group, CUAS Executive Committee and multiple CUAS working groups.  Synchronized CUAS efforts across the department to include all services.  Reduced duplication of efforts and helped develop common standards.  Provided periodic recommendations to OUSD(A&S) and DOD(CIO) on adjudicating Commercial Off-the-Shelf (COTS) UAS waivers on a bi-weekly basis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.492"
                                            },
                                            "Text": {
                                                "val": "- Common Data Link (CDL) Principal Staff Assistant: Continue to coordinate with CDL Executive Agent (EA) to develop and maintain a technology roadmap and terminal database to improve interoperability, configuration management, and focused technology investments. Continue implementation and oversight of an enterprise transition strategy to modernize DoD ISR waveforms to converge on a DoD standard for tactical ISR communications. Update CDL technology development roadmap to reflect current trends in technology that can add enhanced capabilities to CDL systems. Continue planning and conduct of CDL SRP and IPT meetings to develop and refine the CDL investment portfolio and to identify strategic ISR communications issues the DoD will face in the future. Conduct analysis of Airborne ISR communications transport infrastructure in coordination with Joint Staff, Services and Combatant Commands in order to identify a way ahead for establishing an effective\/efficient global enterprise capability. Conduct annual CDL enterprise modernization analysis and review Service PPBE submissions to assess enterprise migration to Bandwidth Efficient CDL by 2023. Continue to promote open system development solutions that expand the vendor base and allow increased competition and innovation. Expand the CDL Reference Implementation Laboratory concept of a government owned technical baseline while assessing a Common Development Environment that encourages rapid develop, testing, and fielding of new capabilities.\n- Acquisition Management and Oversight: Provide technical assistance in developing IT related acquisition policy, including updates to DoD Series 5000 necessitated by changes in statue, regulation and management direction. Provide technical assessments and programmatic recommendations across DASD functional areas to address interoperability gaps and work early in the systems engineering.\n- FAB-T: Support IOT&E execution. Work to assure the program has a successful LRIP-2 decision. Continue to support PNVC integration and test. Provide risk assessments of system integration into the various airborne, ground fixed and ground transportable systems prior to installation. Support implementation of additional reliability testing to provide increased data for program acquisition and operational decisions.\n- Wideband SATCOM AoA: Complete AoA assessing material solutions for WGS replenishment and for supporting other traditional commercial supplied users considering life-cycle cost, performance, suitability, operational effectiveness, and resiliency. Provide final report to D, CAPE for sufficiency review and work with GAO on Congressionally directed review.\n- Evolved AEHF \/ AEHF: Provide programmatic analysis, technical reviews, and assessments of the Evolved AEHF and AEHF programs to reduce development, integration, and procurement risks. Provide risk assessments as the program continues to launch spacecraft and improve the Mission Planning Element. Work to support efforts for the Evolved AEHF and assess implementation of XDR and PTW waveforms on new satellite payload and bus.\n- Mid-Term Polar SATCOM (MPS) \/ EPS: Provide programmatic analysis, technical reviews, and assessments of the MPS and EPS programs to reduce development, integration, and procurement risks. Assess risk as the TT&C system is integrated and tested prior to operations. Work to support and assess efforts for the follow-on MPS system, whether as a hosted payload or a free flyer. \n- MUOS capable terminals: Support FOT&E execution. Provide analysis, technical assessments and fielding reviews for implementing the MUOS capability. Work to support the certification of ground, maritime and airborne terminals, and testing required to enable operational authorizations.\n- Joint Tactical Networking Center (JTNC): Provide technical and programmatic analysis to support the Defense Acquisition Executive's role as the co-chair of the JTNC Board of Directors (BoD). Provide Secretariat functions for the JTNC BoD.\n- All former JTRS(HMS, MNVR, AMF, JTN)Programs – Upon request, provide technical expertise and recommendations to facilitate program compliance with IT related acquisition policy, in accordance with DoD Series 5000 and applicable Milestone Decision Authority direction. Provide programmatic recommendations regarding cost\/schedule\/performance tradeoffs and application of evolving acquisition policies, based on lessons observed in oversight of acquisition programs across the Department.\n- Ground Tactical Networks Advanced Capabilities: Mature narrowband dismounted communications capability with radio hardware prototype, robust modeling and simulation, and reusable waveform software code. Form industry engagement to promote transition into non-developmental item radios.\n- Integrated Electromagnetic Spectrum Operations (EMSO): Track implementation of iEMSO strategy in radio and EW device development plans. Assess and down-select technical interoperability and architectural approaches. Ensure adequate funding and testing to assess maturity of solutions. Develop science and technology roadmap to synchronize transition of key technologies to programs of record for spectrum-dependent systems. FY17 work will focus will focus on selected sensor and electronic warfare systems and continue work on communications systems.\n- Electronic Warfare: Maintain situational awareness of and contribute to evolving DoD and Service electronic warfare strategy, and in conjunction with Electromagnetic Spectrum Operations efforts, assist in coordinating development of new and integrated enterprise capabilities.\n- Tactical Data Link Modernization: Provide OSD oversight and cross-Service coordination of Tactical Data Link (TDL) modernization issues funded during FY16-FY17 Program Reviews. Identify areas where additional risk reduction activities are necessary in order to meet CAPE and DMAG guidance\/schedule. Track and assess testing of Link 16 capability improvements in Multi-function Information Distribution System (MIDS-J) terminals (4th Gen aircraft), Communications, Navigation & Identification (CNI) terminal in F-35, emerging 6th Gen aircraft concepts, and Weapons Data Link (WDL) radios. Assess transferability of these improvements to other omni-directional TDLs, such as TTNT. Begin establishing an improved enterprise governance model for Tactical Data Links. Continue to perform oversight and joint acquisition integration of Service implementation of congressionally directed (FY17 NDAA) focus on a modular open system approach (MOSA), to the maximum extent practicable for TDLs, in synchronization with CDL, and other appropriate capabilities. Identify MADL evolution technology development needs for further funding to enable transition to F-35 and other platforms, and begin establishment of a Government Controlled Technical Baseline for MADL. Assess modeling and simulation infrastructure and currency with adversary threat emitters to improve investment decisions on TDL improvements.\n- Space Ops: Conduct SATOPS Modernization technical assessments; provide technical Oversight\/AFSCN Modernization Implementation; conduct AFSCN Event Driven Net Centric Review\/Technical Assessment.\n- PNT Programs Technical Assessments: Continue OIPT leadership role. Develop and implement Annual GPS Enterprise Review to verify readiness of GPS III, MGUE, and OCX programs to progress to next phase of the acquisition process. Ensure synchronization of the three programs to meet the direction of the DAE. Conduct deep dive technical analyses to understand all phases of the GPS enterprise programs and predecessor programs that are part of the GPS Enterprise. Review PNT programs for data strategies, systems engineering, risks and mitigations in support of milestone decisions. Initiate and conduct studies to expedite fielding and support of M Code capability for forces in the field. Conduct Nunn-McCurdy Reviews of program that have critically breached APB cost parameters and prepare for DAE Certification. Report results to congress after DAE Certification and ensure regular reporting is conducted IEW public law. Conduct reviews of innovative acquisition efforts intended to reduce overall satellite cost through payload and spacecraft competition. Conduct Quarterly OCX Reviews at USD\/SECAF\/CEO level to ensure OCX maintains progress towards fielding user required capabilities. Develop and implement contingency plans to ensure constellation command and control management and enable early M-Code availability.\n- PNT Portfolio Management: Continue implementation of GPSEM\/PNT Assurance Investment Strategy and Roadmap, ensuring AoA recommendations are addressed. Continue to support major program milestones and internal OSD reviews such as Strategic Portfolio Reviews, DMAGs, etc.\n- National Leadership Command Capability (NLCC): Continue in lead role as primary action office for A&S in her role as Nuclear Command, Control, and Communications (NC3) Enterprise Capability Portfolio Manager and co-chair of the Council on Oversight of the National Leadership Command, Control, and Communications System (CONLC3S). Work directly with United States Strategic Command Nuclear Enterprise Center and the CONCL3S Executive Secretariat (DOD CIO) to oversee all aspects of NC3 and National Leadership Command Capability (NLCC) governance and subordinate working groups that prepare\/tee up decisions and execute assigned actions.  Continue as primary action office for NC3 enterprise capability portfolio management.  Continue as primary A&S action office to respond to congressionally-directed actions. Continue as primary A&S representative to NC3 and NLCC-related studies, analyses, and policy updates. Also lead review process for any NC3 and NLCC related documents.\n- NC3 Capability Portfolio Manager (CPM): Work collaboratively and support Commander US Strategic Command (CDRUSSTRATCOM) in his role as the NC3 Enterprise Lead. In this capacity, manage NC3 modernization and sustainment activities across approximately 220 programs, systems, and projects as a portfolio of capabilities rather than a series of episodic and unsynchronized programs. With increased acquisition and resource responsibilities the NC3 CPM will lead the NC3 Enterprise process, develop and advocate for NC3 within the Program Budget and Review process, and provide CDRUSSTRATCOM  resource and acquisition information to inform operational risk assessment.  \n- Joint C2 Portfolio Management: Collaborate with CIO as PSA for C2, and Joint Staff J6 as the User Capabilities POC to invigorate the JC2 Governance Framework.  Increase relevancy and enhance the relationship with the PM-CESG Program Managers and other members and the OSD and Joint Staff.\n- C2 Data: Provide technical expertise for ensuring C2 data are visible, accessible, understandable, trustable and interoperable. Provide technical assessment and assistance for implementation of National Information Exchange Model (NIEM)-based information exchanges across the DoD. Update the C2 Authoritative Data Source roadmap and update C2 data architecture. \n- Joint C2 Architecture: Provided technical expertise for the update the Joint C2 Architecture to guide Joint C2 capability area development activities across the Services, Agencies and Combatant Commands. \n- Continue Analysis of Alternatives on the Coalition Information Sharing Environment. This AT&L-led independent 18-month study will analyze and recommend a preferred alternative to determine the most effective and efficient means for the Department of Defense to provide a coalition network and services in support of Mission Partner operations.\n- Software Provenance and Supply Chain Risk Management:  Continue to provide technical analysis and support to Software Provenance and Supply Chain Risk Management policy development, including implementation plans for changes in statue, regulation and management direction.  Provide technical assessments and course of action recommendations to address cybersecurity engineering and risk management considerations in the procurement process.  Upon request, provide technical expertise and industry assessments to facilitate development of standard procedures to institutionalize SCRM in the procurement process.  Focus areas may include development implementation plans, policy development and piloting initiatives, technical assessments of threat information sharing tools, evaluation of independent continuous monitoring capabilities, and recommendations for legislative change proposals to improve DoD’s execution of SCRM\n- Advanced Software - Pilot Program: Continue to provide Technical\/Engineering support to Agile Acquisition Pilots and Policy development, Support as Administrator and Curator for the online Agile Community of Practice, Provide SME contributions & Technical\/Engineering support to individual Agile Acquisition Pilots as Pilot Advisor, Assist pilot programs with development of their required program documentation, Provide agile coaching and training.  Provide Technical\/Engineering support to Software Provenance and Supply Chain Risk Management Planning: Develop Campaign Plan and implementation plan for \"Deliver Uncompromised\" initiatives, Draft \"101\" type informational briefing materials, courseware inputs, ID and assess info sharing tools, development of draft policy\/procedures documents. Deliver a 180 day status report & draft final Congressional Pilot reports, Provide Technical\/ Engineering Support to Agile Acquisition Pilots.\n- Advanced Software - Defense Science Board Recommendations Implementation: Continue to develop practical approaches to encourage adoption of game-changing software development and sustainment approaches that will deliver capabilities that catalyze greater mission impact to the warfighter and Enterprise more rapidly while better controlling cost and improving resilience in the current and emerging cyber threat environment.  Develop a final Implementation Strategic Roadmap that identifies short, medium, and long-term goals for each of the DSB recommendations.  It will identify likely risk areas, develop risk reduction approaches, and propose appropriate metrics for new programs that will better reflect the health of software programs undergoing modernization or in development. \n- Innovative Acquisition Approaches: Continue to develop or enhance innovative acquisition approaches across hardware, software, IT infrastructure and services acquisition policy and processes to better align with best practices and modern technology approaches. Facilitate widespread adoption of rapid acquisition paths through translating lessons learned\/best practices into policy, guidance, and training products and tools, working in partnership with the Acquisition Accelerator sponsored by Strategy Data & Design.\n\n- Set-up expanded Air Defense Offensive Counter Air (ADOCA) F-35 support to advise OUSD (A&S) and OASD (A) senior leaders on strategies to produce, develop, and sustain the F-35 Lightning II program and worldwide fleet of aircraft.  Provides expert acquisition\/program support to enable PPBE planning for the F-35 POM and overall program requirements development.  Collaborates with OSD, JCS, F-35 JPO, HAF, & OPNAV as needed.  Provides additional portfolio support to ADOCA as required. \n\n- Establish the following Mission Engineering capabilities: Develop and manage effects kill chains and enabling architectures. Work with engineers and architects to translate operational needs to capabilities and system networks. Implement kill chains in modeling and simulation environments and execute effects\/kill chain performance assessments. Compiles and lends meaning to large amounts of program capability data. Uses expertise in sorting through existing analysis, reviews, studies, industry data, requirements documents, operational scenarios, etc. to uncover data relevant to a thorough evaluation of the effectiveness of a defined mission area.  \n\n- Launch Maneuver Warfare support which will exploit firepower and attrition on key elements of opposing forces.  The Maneuver Element Analyst advocates strategic movement that can bring about the defeat of an opposing force more efficiently than by simply contacting and destroying enemy forces until they can no longer fight. Instead, in maneuver warfare, the destruction of enemy targets is combined with isolation of enemy forces and the exploitation by movement of enemy weaknesses."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.563"
                                            },
                                            "Text": {
                                                "val": "Projects supporting DASD(I&IPM):\n- Common Data Link (CDL) Principal Staff Assistant: Continue to coordinate with CDL Executive Agent (EA) to develop and maintain a technology roadmap and terminal database to improve interoperability, configuration management, and focused technology investments. Continue implementation and oversight of an enterprise transition strategy to modernize DoD Intelligence, Surveillance and Reconnaissance (ISR) waveforms to converge on a DoD standard for tactical ISR communications. Update CDL technology development roadmap to reflect current trends in technology that can add enhanced capabilities to CDL systems. Continue to plan and conduct CDL Senior Review Panel and IPT meetings to develop and refine the CDL investment portfolio and to identify strategic ISR communications issues the DoD will face in the future. Conduct analysis of Airborne ISR communications transport infrastructure in coordination with Joint Staff, Services and Combatant Commands in order to identify a way ahead for establishing an effective\/efficient global enterprise capability. Expand the CDL Reference Implementation Laboratory concept of a government owned technical baseline while assessing a Common Development Environment that encourages rapid development, testing, and fielding of new capabilities.\n- Ground Tactical Networks Advanced Capabilities: Mature narrow band dismounted communications capability with radio hardware prototype, robust modeling and simulation, and reusable waveform software code. Form industry engagement to promote transition into non-developmental item radios.\n- Spectrum: Maintain situational awareness of and contribute to evolving DoD and Service Spectrum strategy, and in conjunction with EMSO efforts, assist in coordinating development of new and integrated enterprise capabilities. Provide technical and acquisition support for the Spectrum Efficient National Air Surveillance Radar (SENSR) system to ensure development and delivery of DoD requirements and acquisition artifacts to a Cross-Department activity led by the Federal Aviation Administration (FAA).  Support includes integrating DoD stake-holders capabilities; working with FAA and the Department of Homeland Security; interfacing with North American Aerospace Defense Command, Air Combat Command, and the Services to ensure DoD equities; and providing acquisition expertise during the development of a request for proposal (include development of artifacts and source selection).\n- Tactical Data Link Modernization: Provide OSD oversight and cross-Service coordination of Tactical Data Link (TDL) modernization issues currently under review as part of a larger DoD interoperability emphasis led by the Chief Information Office and the Joint Staff and in conjunction with USD(A&S)under the recently DSD formed governance council, C3LB.  Support Interoperability working groups and cross functional teams for developing strategies for advanced technology development and fielding of data link capabilities. Track and assess testing of Link 16 capability improvements in Multi-function Information Distribution System (MIDS-J) terminals (4th Gen aircraft), Communications, Navigation & Identification (CNI) terminal in F-35, emerging 6th Gen aircraft concepts, and Weapons Data Link (WDL) radios. Assess transferability of these improvements to other omni-directional TDLs. Begin establishing an improved enterprise governance model for Tactical Data Links. Identify Multi-functional Data Link (MADL) evolution technology development needs for further funding to enable transition to F-35 and other platforms, and begin establishment of a Government Controlled Technical Baseline for MADL as briefed to USD(A&S). Assess modeling and simulation infrastructure and currency with adversary threat emitters to improve investment decisions on TDL improvements. Conduct DoD wide assessment of TDL Low Probability of Detection\/Low Probability of Intercept waveforms and work with OSD and the Services on an executable acquisition strategy for modernization. Develop, with D\/CIO and J6, robust waveform repository providing programmatic technical guidance to the Joint Tactical Network Center.  Continue to enhance Link-16 and other waveforms by active engagement and leadership at the Joint Datalink Acquisition Working Group\". Provide product support in CDL and Link-16 Crypto Modernization working with Service EAs and NSA.\n- Joint C2 Portfolio Management: Increase relevancy and enhance the relationship with the PM-CESG Program Managers and other members and the OSD and Joint Staff. Provide technical expertise in agile development processes and support C2 program including the Global C2 System-Joint Expanded (GCSS-JE) in the development of a comprehensive agile development strategy. Actively engage J6 in continuing development of JADC2. Provide technical expertise for ensuring C2 data are visible, accessible, understandable, trustworthy and interoperable. \n- Strategic Deterrence:  Support recapitalizing the nation's nuclear deterrent, driving risk reduction in nuclear modernization programs, enhancing sustainment of existing legacy nuclear capabilities, and implementing the Nuclear Posture Review.\n- NC3 Capability Portfolio Management: Continues support to USD(A&S) in its roles as the Principal Staff Assistant (PSA) for\nNuclear Command, Control, and Communications (NC3), the NC3 Enterprise Capability Portfolio Manager, and co-chair of the\nCouncil on Oversight of the National Leadership Command, Control, and Communications System (CONLC3S). Works with\nServices, DoD Components, USSTRATCOM Nuclear Enterprise Center, and CONCL3S Executive Secretariat (DOD CIO) to\noversee all aspects of NC3 governance. This includes organizing capability reviews, directing performance of the acquisition\nsystem in support of NC3, developing investment and programming guidance, responding to congressionally-directed actions,\ncompleting NC3-related studies, analyses, and policy updates, and assessing DoD Component plans, programs, and budgets forbudget justification and execution.\n- NC3 Analytical Support: Continue development, evaluation, and procurement of hardware and software to establish an NC3\nprogram and capability analysis system. Continue enhancement of analytical tools to focus on NC3 capability evaluation.\nComplete technical studies to identify evolving data needs. Assess DoD Components plans for transitioning technology and\nmodernizing existing NC3 systems. Identify and evaluate opportunities for inserting new technology into the NC3 system.\n- DASD AE:   Innovative Acquisition Approaches: Develop or enhance innovative acquisition approaches across hardware, software, IT infrastructure and services acquisition policy and processes to better align with best practices and modern technology approaches. Facilitate widespread adoption of rapid acquisition paths through translating lessons learned\/best practices into policy, guidance, and training products and tools, working in partnership with the Acquisition Accelerator sponsored by Strategy Data & Design."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.265"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.265"
                                            },
                                            "Text": {
                                                "val": "- Common Data Link (CDL) Capability Portfolio Management (CPM): Continues to execute USD(A&S) roles as Principal Staff Assistant (PSA) for CDL. Work with DoD Components to maintain currency of the CDL technology roadmap and terminal database to prioritize commonality, open architecture, and non-proprietary systems for current and emerging platform, sensor, and weapons ISR data transport requirements.  Conduct annual CDL enterprise modernization analysis and review Service PPBE submissions to assess enterprise migration off To Be Sunset (CDL-TBD) waveforms by 2023. \n- Intelligence, Surveillance, and Reconnaissance Data Transport and Task, Process, Exploit and Disseminate Intelligence Information: Technical Support as the co-lead with USD(I) to modernize and migrate the DoD Distributed Common Ground family of systems to an enterprise capability.\n- Command, Control, and Communications Leadership Board (C3LB): As a Tri-Chair, provide strategic planning, prioritization, policy execution, resource review, and effective capability management and oversight of DoD C3 and Electromagnetic Spectrum (EMS) initiatives. Accelerate and synchronize fielding of modernized networking solutions across the joint force with the objective of establishing priorities and strategies that enable implementation across the DoD C3 and EMS enterprises.    \n- Joint Tactical Networking Center (JTNC): Provide technical and programmatic analysis to support DoD’s rapid identification, characterization, procurement, fielding, and sustainment of modular, innovative tactical communications products that ensure secure, interoperable, and resilient C4ISR capabilities. Develop, with D\/CIO and J6, robust waveform repository providing programmatic technical guidance to the JTNC.  Continue to enhance Link-16 and other waveforms by active engagement and leadership at the Joint Datalink Acquisition Working Group\". Provide product support in CDL and Link-16 Crypto Modernization working with Service EAs and NSA.\n- Ground Tactical Networks Advanced Capabilities: Mature narrowband dismounted communications capability with radio hardware prototype, robust modeling and simulation, and reusable waveform software code. Pursue industry engagement to promote transition into non-developmental item radios.\n- Integrated Electromagnetic Spectrum Operations (EMSO): Implement integrated transport, radio communications, and Electronic Warfare(EW)\/EMSO capability development to ensure NDS objectives for integrated Spectrum operations and capabilities  are met. Provide acquisition support to the Department’s 5G strategy\n- Spectrum: Provide executive guidance, technical expertise, and acquisition support for the Spectrum Efficient National Air Surveillance Radar (SENSR) system. Develop and deliver mission capability requirements and acquisition artifacts to the Joint Program Office (JPO)-led by the Federal Aviation Administration (FAA). In FY21 SENSR enters a critical stage with a Milestone B decision and initiation of acquisition with RFP release and source selection and prototype development.  \n- Tactical Datalink: Conduct assessment of TDL Low Probability of Detection\/Low Probability of Intercept waveforms and work with the Services to create a TDL Modernization Roadmap and executable acquisition strategy for modernization in accordance with DEPSECDEF Memorandum “Enhancing DoD's Joint Tactical Networks and Datalink Modernization.” Track and assess capability improvements in Multi-function Information Distribution System (MIDS) and F-35 Communications, Navigation & Identification (CNI) terminals, emerging 6th Gen aircraft and Weapons Data Link (WDL) concepts. \n- Provide technical expertise for Joint All Domain Command and Control (JADC2) Architecture Operations Planning Team (OPT) and provide coordination and AO support for level reviews of JADC2 RA products as they are developed to support critical cross-functional team timelines and deliverables.  OPT deliverable is JADC2 Reference Architecture documents and products ready for formal staffing.  \n-  Strategic Deterrence:  Support the recapitalizing the nation's nuclear deterrent, driving risk reduction in nuclear modernization programs, enhancing sustainment of existing legacy nuclear capabilities, and implementing the Nuclear Posture Review.\n- NC3: In the role as NC3 Capability Portfolio Manager (CPM), support the NC3 governance process to provide analysis to senior leadership bodies (NC3 Enterprise Review, Deputy's Management Action Group, SECDEF Weekly Priorities Review, etc.) and recommend investment and policy alternatives for decision."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 to FY 2021 decrease of $12.810 million dollar decrease is the result of multiple planned program changes in OUSD(A&S).  A new Program Element (PE) was created for the Nuclear Forces (Nuclear Command, Control, and Communications (NC3) program and $3.689 million was moved from this PE to the new NC3 PE.  Other decreases are a result of the OUSD(A&S) leadership decisions."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Utilize existing fixed-price and cost-plus contracts (where appropriate) to continue providing  in-depth technical, engineering, integration support, and system of system analysis for space, missile defense, and C4ISR."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Resources will be used to provide technical, systems engineering and acquisition management oversight of programs, projects and activities to maximize the Department’s return on investment in information technology resources and to affect a comprehensive approach for assessing and procuring critical information systems from initial design, through development to capability delivery in support of improved weapons systems performance and military operations."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "NA"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Link-16 Tactical Data Link (TDL) Transformation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OUSD A&S DASD I&IPM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pentagon"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "111.918"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "19.492"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "12.563"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.265"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.265"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-01"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Link-16 Comm Tactical Data Link (TDL) Transformation"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Contract Awards"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "105"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Capability & Platform Resilience"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "13.420"
                        },
                        "PriorYear": {
                            "val": "26.718"
                        },
                        "CurrentYear": {
                            "val": "26.539"
                        },
                        "BudgetYearOne": {
                            "val": "36.742"
                        },
                        "BudgetYearOneBase": {
                            "val": "36.742"
                        },
                        "BudgetYearTwo": {
                            "val": "32.030"
                        },
                        "BudgetYearThree": {
                            "val": "24.990"
                        },
                        "BudgetYearFour": {
                            "val": "25.053"
                        },
                        "BudgetYearFive": {
                            "val": "25.114"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Provides resources for developmental acquisition support and portfolio management in support of three primary Goals in support of the Department of Defense (DoD) Cyber Strategy\n1) Trained and Equipped Cyber Mission Force\n2) Cyber Hardened Weapon Systems and Critical Infrastructure\n3) Enhanced Defense Industrial Base (DIB) Cyber Security\n\nThe Office of the Undersecretary of Defense for Acquisition and Sustainment (OUSD(A&S)) conducts mission engineering for cyberspace operations to inform and support the development of Joint Cyber capabilities as the Department conceives, develops, and rapidly fields cyber capabilities for Cyberspace Operations. The newly established OUSD(A&S) Chief Information Security Office (CISO) was created to improve planning, coordination, synchronization, and integration of cyber activities and increase DoD wide emphasis on reducing the cyber risk to critical DoD missions and enhancing DIB Cyber Security.\n\nFunds provide technical, systems engineering, trend analysis, and portfolio management of programs, projects, and activities developing cyber capabilities to maximize the Department's return on investment of cyberspace resources and effect a comprehensive approach for assessing, procuring, and sustaining critical cyber capabilities and cyber resilient systems and platforms from initial design, through development to capability delivery in support of weapons systems performance and military\noperations.\n\nAdditionally, these funds will provide systems analyses, portfolio management, and executive support of Senior Cyber Leadership forums, enterprise wide systems engineering and operational impact analyses related to Cyber capabilities, enhancing cyber resilience within systems and platforms, and enhancing the cybersecurity of the DIB.\n\nResources will also be used to provide expertise required for exercising technical direction over design, performance, cost parameters, and determining and mitigating cyber risks of key systems and their dependencies. The goal of this funding is to assure capability advantage, reduce time to the field, evaluate projects and concepts, minimize cyber related performance and operational risk of developing and fielding complex systems, ensure program dependencies are documented and included in acquisition decisions, and address cyber security requirements, gaps, and required technical solutions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Capability and Platform Resilience"
                                    },
                                    "Description": {
                                        "val": "FY19 Accomplishments:\nGoal 1: Trained and Equipped Cyber Mission Force\n- Provided acquisition oversight of Cyber-related Joint Urgent and Emergent Operational Needs Statements in support of Combatant Command (CCMD) requirements.\n- In collaboration with U.S. Cyber Command (USCYBERCOM), completed the initial DoD Cyberspace Operations Capability Strategic Roadmap for Fiscal Years 2020 – 2025\n- In collaboration with USCYBERCOM, completed the 2019 initial Joint Cyber Warfighting Architecture (JCWA) enterprise architecture artifacts, overview and summary information, a system context model, and proposed an operational context diagram to USCYBERCOM.\n- At the Top Secret\/Sensitive Compartmented Information-level, collaborated with USCYBERCOM to conducted mission analysis of real world cyberspace operations and developing key insights to inform cyber capability development.\n- Developed Cyber Mission Model Version 1.0.  Validated and delivered the model to Army Cyber Command to support planning and execution of cyberspace operations.\n\nGoal 2: Cyber Hardened Weapon Systems and Critical Infrastructure\n- Tracked and provided oversight of DoD wide Service and Agency Cyber Vulnerability Assessment and Mitigations for Weapon Systems and Critical Infrastructure in support of National Defense Authorization Act (NDAA) FY 2016 - Section 1647 and NDAA FY 2017 – Section 1650.\n- Planned and executed the Cyber Resilience III Wargame in support of US European Command (USEUCOM) and identified cyber risks to the USEUCOM Ballistic Missile Defense (BMD) Mission.\n- Initiated development of the Cyber Defense Plan for USEUCOM BMD Mission\n- Initiated planning for Cyber Resilience IV Wargame in support of US Indo-Pacific Command (USINDOPACOM).\n- Completed Cyber Resiliency Assessment of key elements of the US Transportation Command (USTRANSCOM) Global Logistics Infrastructure.\n- Initiated development of methods for cyber hardening legacy weapon systems and critical infrastructure.\n- Advanced and matured tools and methodologies for conducting Deep Cyber Resiliency Assessments (DCRA).\n- Assessed tools and capabilities for Enterprise Wide Application to Cyber Hardening Weapon Systems and Critical Infrastructure.  Conducted assessment of commercial off-the-shelf Software Scrambling capabilities in collaboration with the National Security Agency.\n\nGoal 3: Enhanced DIB Cybersecurity\n- Initiated development of the Cybersecurity Maturity Model Certification (CMMC) and successfully rolled out the CMMC to industry.\n- Initiated a range of DIB Cyber Security Pathfinders.\n- Contributed to the establishment of a new A&S focus area on supply chain risk management (SCRM).\n- Performed pilots for Supply Chain Illumination to enhance DIB security."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.718"
                                            },
                                            "Text": {
                                                "val": "- Cyber Investment Management: Synchronize and coordinate cyberspace acquisition activities, conduct quantitative assessments, and ensure cyberspace investments align with Department priorities, required capabilities and evolving cyber threats. Provide support of the Cyber Investment Management Board and develop implementation guidance and associated direction that provides strategic guidance and feedback to senior leaders. Continue to plan and conduct CIMB\/CCT meetings to refine the cyber investment portfolio, review execution of cyber requirements and acquisition processes, and to identify strategic cyber issues the DoD will face in the future.\n- Refine the Cyber investment portfolio results, ensuring return on investment and risk ultimately leading to an optimization phase focusing on process improvement is included.\n- Conduct investment analysis of the DoD-wide Cyber Special Access Program (SAP) portfolio to include return on investment and risk analysis.\n- Continue oversight of implementation of the Cyber Situational Awareness EoA (phase II) recommendations.\n- As Principal Staff Assistant OPR for the Unified Platform (UP), oversee the Air Force’s, as DoD Executive Agent, capability development via portfolio management and governance.  Assess UP’s interfaces, dependencies, and linkages with other components of the Joint Cyber Warfighting Architecture to enable effective and efficient offensive and defensive effects.\n- Continue oversight of Joint Cyber Command and Control (C2) capability development.\n- Ensure Platform Resilience\/Mission Assurance (PR\/MA); Oversee implementation of the recommendations on Cyber vulnerabilities of Department of Defense weapon systems and tactical communications systems.\n- Ensure execution of the evaluation of cyber vulnerabilities of DoD critical infrastructure plan. Conduct data gathering and technical assessments to support the development of meaningful acquisition requirements for the PCTE and other programs of interest as they relate to capabilities of diverse DoD cyber range capabilities.\n- Manage the portfolio of DoD cyber training systems (includes DoD Persistent Cyber Training Environment (PCTE)); govern the PCTE as a member of the PCTE governance boards.\n- Continue to synchronize and govern the DoD Cyber Ranges that support Cyber Training and Testing & Evaluations as a member of the Cyber Ranges governance boards. Implement DoD Cyber Strategy by incorporating the cyber ranges reference architecture into the Joint Cyber Warfighting Architecture.\n- With USCYBERCOM, manage the portfolio of Joint Cyber Warfighting Architecture components to enable the cyber mission force to efficiently and effectively conduct offensive and defensive cyber missions.  Supports offensive and defensive architecture development and portfolio management in collaboration with USCYBERCOM.\n- Joint Cyber C2: Continue oversight of Joint Cyber Command and Control (C2) capability development. Upon request, support implementation of the preferred alternative identified during the Joint Cyber C2 AoA. Continue oversight of implementation of the Cyber Situational Awareness EoA (phase II) recommendations. Track the status and provide technical recommendations associated with piloting efforts associated with the recommendations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.539"
                                            },
                                            "Text": {
                                                "val": "Goal 1: Trained and Equipped Cyber Mission Force\n- Advance and mature capabilities for conducting mission engineering for cyberspace operations.\n- In coordination with USCYBERCOM, manage the components of the JCWA portfolio to enable the cyber mission force to efficiently and effectively conduct offensive and defensive cyber missions.  Support offensive and defensive architecture development and portfolio management in collaboration with USCYBERCOM.\n- As Principal Staff Assistant (PSA) Office of Primary Responsibility (OPR) for the Unified Platform (UP), oversee the Air Force’s, as DoD Executive Agent (EA), capability development via portfolio management and governance.  Assess UP’s interfaces, dependencies, and linkages with other components of the JCWA to integrate and analyze data from offensive and defensive operations and enable effective and efficient offensive and defensive effects.\n- Manage the portfolio of DoD cyber training systems; including the DoD Persistent Cyber Training Environment (PCTE), and govern the PCTE as a member of the PCTE governance boards.\n- In support of Mission Engineering for Cyberspace Operations, continue to build the Cyber Mission Model (CMM) to include cyberspace tools and payloads.  Directly inform JCWA decisions using Modeling and Simulation (M&S) tools.\n- Continue to synchronize and govern the DoD Cyber Ranges that support Cyber Training and Testing and Evaluations as a member of the Cyber Ranges governance boards.  Implement DoD Cyber Strategy by incorporating the cyber ranges reference architecture into the JCWA.\n\nGoal 2: Cyber Hardened Weapon Systems and Critical Infrastructure\n- Mature and enhance the OUSD(A&S) CISO Organization.\n- Ensure Platform Resilience\/Mission Assurance (PR\/MA) in support of DoD Strategic Cybersecurity Program.\n- Oversee implementation of the recommendations on cyber vulnerabilities of DoD weapon systems and tactical communications systems.\n- Ensure execution of the evaluation of cyber vulnerabilities of DoD critical infrastructure plan.\n- Stand up Mission Focused Cyber Hardening (MFCH) Teams to prioritize investments in mitigating cyber vulnerabilities to Defense Critical Missions.\n- In support of MFCH Teams, develop a construct for measuring readiness of the kinetic force to operate in a contested cyber environment with the objective of enhancing CCMD understanding of Cyber Risk to Mission as a warfighting readiness issue.\n- Enhance Cybersecurity Engineering for Major Defense Acquisition Programs.\n- Conduct Cyber Resilience V assessment in support of USTRANSCOM.\n- Initiate planning for Cyber Resilience VI assessment in support a CCMD to be identified.\n- Conduct DCRA for the Positioning, Navigation, and Timing Enterprise.\n- Advance Tools and Methodologies for assessing cyber risks to DoD missions and enhance knowledge repositories for storing and analyzing data from cyber vulnerability assessment and mitigation activities.\n- Conduct kinetic and non-kinetic nodal analysis assessments (congressional add)\n- Encrypted and authenticated data in transit analysis (congressional add)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "36.742"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "36.742"
                                            },
                                            "Text": {
                                                "val": "Goal 1: Trained and Equipped Cyber Mission Force\n- Continue to advance and mature capabilities for conducting mission engineering for cyberspace operations.\n- With USCYBERCOM, manage the portfolio of Joint Cyber Warfighting Architecture (JCWA) components to enable the cyber mission force to efficiently and effectively conduct offensive and defensive cyber missions.  Support offensive and defensive architecture development and portfolio management in collaboration with USCYBERCOM.\n- As PSA OPR for the UP, oversee the Air Force’s, as DoD EA, capability development via portfolio management and governance.  Assess UP’s interfaces, dependencies, and linkages with other components of the JCWA to integrate and analyze data from offensive and defensive operations and enable effective and efficient offensive and defensive effects.\n- Manage the portfolio of DoD cyber training systems; including the DoDs PCTE and govern the PCTE as a member of the PCTE governance boards.\n- In support of Mission Engineering for Cyberspace Operations, continue to build CMM to include cyberspace tools and payloads.  Directly inform JCWA decisions using M&S tools.\n- Continue to synchronize and govern the DoD Cyber Ranges that support Cyber Training and Testing and Evaluations as a member of the Cyber Ranges governance boards.  Implement DoD Cyber Strategy by incorporating the cyber ranges reference architecture into the JCWA.\n- Advance Missions Analysis\/Mission Engineering Capabilities for cyberspace operations through application of data science development of an operational level model for cyber warfare.\n\nGoal 2: Cyber Hardened Weapon Systems and Critical Infrastructure\n- Continue to mature and enhance the OUSD(A&S) CISO Organization\n- Ensure PR\/MA in support of the Strategic Cybersecurity Program\n- Ensure execution of the evaluation of cyber vulnerabilities of DoD critical infrastructure plan.\n- In support of CCMDs, assess the cyber risk to Defense Critical Missions through the conduct of cyber resiliency assessments. \n- Reduce cyber risk to Defense Critical Missions through employment of Mission Focused Cyber Hardening Teams to prioritize and drive mitigations of critical cyber vulnerabilities. \n- Advance Tools and Methodologies for conducting assessing cyber risks to DoD missions"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 to FY 2021 increase is the result of planned program changes in OUSD(A&S)."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Utilize existing fixed-price and cost-plus contracts (where appropriate) to continue developmental acquisition support and portfolio management in support of three primary Goals in support of the Department of Defense (DoD) Cyber Strategy"
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "NA"
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "NA"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contract awards"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OUSD OCISO (A)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pentagon\/Mark Center"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "13.420"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "26.718"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "26.539"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "36.742"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "36.742"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Cyber Capability and Platform Resilience"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Contract Awards"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "028"
                    },
                    "ProjectTitle": {
                        "val": "Cybersecurity: Cybersecurity Maturity Model Certification (CMMC) and Pathfinders"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "15.000"
                        },
                        "BudgetYearOne": {
                            "val": "12.978"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.978"
                        },
                        "BudgetYearTwo": {
                            "val": "3.000"
                        },
                        "BudgetYearThree": {
                            "val": "3.000"
                        },
                        "BudgetYearFour": {
                            "val": "3.000"
                        },
                        "BudgetYearFive": {
                            "val": "3.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Develop Cybersecurity Maturity Model Certification (CMMC) framework that incorporates multiple cybersecurity standards and references into a unified standard that encompasses both the progression of capabilities and controls as well as the institutionalization of processes to secure Controlled Unclassified Information (CUI) within the Defense Industrial Base (DIB) sector.   Conduct pathfinders and implement 3rd party regulator and CMMC assessment organizations under a governance structure.\n\nConduct pathfinders to assess the feasibility and efficacy of employing emerging commercial services\/tools\/platforms that provide insights into cybersecurity threats and vulnerabilities that are relevant to the DIB sector and the DoD supply chain.\n\nPartner with the DIB sector to demonstrate cost-effective and scalable cybersecurity services that augment and\/or enhance existing commercial capabilities and services.  Focus on cybersecurity services for small-to-medium sized DIB companies that are critical to the DoD supply chain but lack sufficient cybersecurity capabilities to protect CUI.\n."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DIB Secure Cloud Managed Services Pilot"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "Develop CMMC framework, conduct related CMMC pathfinders and assessments of select DIB members, and plan for the needed infrastructure (tools, platforms, databases, etc.) to support the requirements for the 3rd party assessments and certifications. \n\nConduct pathfinders to assess the feasibility and efficacy of employing emerging commercial services\/tools\/platforms that provide insights into cybersecurity threats and vulnerabilities that are relevant to the DIB sector and the DoD supply chain.  Analyze data from pathfinders to inform the way forward.\n\nPartner with the DIB sector to develop and demonstrate cost-effective and scalable cybersecurity services that augment and\/or enhance existing commercial capabilities and services."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.978"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.978"
                                            },
                                            "Text": {
                                                "val": "Update and refine CMMC framework based on cyber threats and pathfinding outputs.  Continue implementation of CMMC to a broader set of DoD contracts and in turn, the DIB sector.  Continue to mature associated CMMC infrastructure. \n\nMature and expand the deployment of services\/tools\/platforms that provide insights into cybersecurity threats and vulnerabilities that are relevant to the DIB sector and the DoD supply chain.\n\nUpdate and transition cost-effective and scalable cybersecurity services and best practices to commercial sector for broader deployment to the small-to-medium sized companies in the DIB sector"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 to FY 2021 decrease is the result of planned program changes in OUSD(A&S)."
                                        }
                                    }
                                }
                            ]
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Management Services\/Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OUSD OCISO (A)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pentagon\/Mark Center"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "15.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "12.978"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "12.978"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "DIB Secure Managed Services Pilot"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Cybersecurity: Cybersecurity Maturity Model Certification (CMMC) and Pathfinders"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}