{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-855515f7cbe1443b1cc76e32ff869263061a887974718017fcc8f688288c6578-29",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603781D8Z"
        },
        "ProgramElementTitle": {
            "val": "Software Engineering Institute (SEI)"
        },
        "R1LineNumber": {
            "val": "61"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "14.468"
            },
            "PriorYear": {
                "val": "15.016"
            },
            "CurrentYear": {
                "val": "15.111"
            },
            "BudgetYearOne": {
                "val": "12.598"
            },
            "BudgetYearOneBase": {
                "val": "12.598"
            },
            "BudgetYearTwo": {
                "val": "12.825"
            },
            "BudgetYearThree": {
                "val": "13.090"
            },
            "BudgetYearFour": {
                "val": "13.491"
            },
            "BudgetYearFive": {
                "val": "13.816"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The Software Engineering Institute (SEI) Advanced Technology Development Program Element (PE) applies the software and computer science concepts developed under the 0602751D8Z PE to research, develop, and rapidly transition state-of-the-art software technology, tools, development environments, and best practices to improve the engineering, management, fielding, evolution, acquisition, and sustainment of software-intensive DoD systems."
        },
        "ProgramElementMissionDescription": {
            "val": "Software is more pervasive than ever, and computer programs are growing in size and complexity.  Designing, managing, and securing integrated, complex, and large- scale mission-critical systems are abilities that the DoD and the Defense Industrial Base (DIB) have not yet mastered.  Reliance on software-intensive mobile and net- based products and systems has increased (e.g., Joint Tactical Radio System, USS ZUMWALT (DDG-1000), Joint Strike Fighter, F-22, and Army Modernization).  As stated in the February 2018 Defense Science Board Report, “Design and Acquisition of Software for Defense Systems,” software is a crucial and growing part of weapons systems and the national security mission, and the DoD must address its ability to build and sustain software continuously and indefinitely.  With growing global parity in software engineering, the DoD must maintain leadership to ensure a competitive advantage.\n\nThe Software Engineering Institute (SEI) Federally Funded Research and Development Center (FFRDC) was established in 1984 as an integral part of the DoD’s initiative to identify, evaluate, and transition software engineering technologies and practices.  The mission of the SEI is to provide the DoD with technical leadership and innovation through research and development to advance the practice of software engineering and technology.  The SEI works across government, industry, and academia to improve the state of software engineering from the technical, acquisition, and management perspectives.  The SEI engages in research and development of critical software technologies and tools and collaborates with the larger software engineering research community.  It facilitates rapid transition of software engineering technologies into practice and evaluates emerging software engineering technologies to determine their potential for improving software-intensive DoD systems.  Since its inception, the SEI has helped to transform the fields of software engineering and acquisition, network security, real-time systems, software architectures, and software-engineering process management.\n\nThe SEI Program Element (PE) addresses the critical need to research, develop, and rapidly transition state-of-the-art software technology, tools, development environments, and best practices to improve the engineering, management, fielding, evolution, acquisition, and sustainment of software-intensive DoD systems.  The research conducted by this PE directly benefits the technical domains such as Command, Control, Communications, Computers, and Intelligence (C4I), Autonomy and Artificial Intelligence (AI), Cyber, and Engineered Resilient Systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "15.016"
                },
                "CurrentYear": {
                    "val": "15.111"
                },
                "BudgetYearOne": {
                    "val": "15.239"
                },
                "BudgetYearOneBase": {
                    "val": "15.239"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "15.016"
                },
                "CurrentYear": {
                    "val": "15.111"
                },
                "BudgetYearOne": {
                    "val": "12.598"
                },
                "BudgetYearOneBase": {
                    "val": "12.598"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-2.641"
                },
                "BudgetYearOneBase": {
                    "val": "-2.641"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.126"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.126"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.015"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.015"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Reduction for Defense Wide Review"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.500"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.500"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Defense-Wide Review: The FY 2021 funding request was reduced by $2.500 million during DWR to realign funds for higher priority DoD missions."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "781"
                    },
                    "ProjectTitle": {
                        "val": "Software Engineering Institute (SEI)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "14.468"
                        },
                        "PriorYear": {
                            "val": "14.016"
                        },
                        "CurrentYear": {
                            "val": "14.114"
                        },
                        "BudgetYearOne": {
                            "val": "12.598"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.598"
                        },
                        "BudgetYearTwo": {
                            "val": "12.825"
                        },
                        "BudgetYearThree": {
                            "val": "13.090"
                        },
                        "BudgetYearFour": {
                            "val": "13.491"
                        },
                        "BudgetYearFive": {
                            "val": "13.816"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project focuses on two main research thrusts with known military applications:  (1) Software Engineering, Systems Verification and Validation, and Mission Assurance (formerly Mission Assurance); and (2) Information Assurance.\n\nSEI research focuses on the most significant and pervasive software challenges within the DoD, such as the scalability and reliability of software assurance, supply chain risk management, validation of and trust in autonomous systems, human-computer and human-technology teaming and interaction, computing and communication at the tactical edge, and efficiency and performance of acquisition strategies and software development appropriate for a contested cyber environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Software Engineering Institute Advanced Technology Development in the Area of Software Engineering, Systems Verification and Validation, and Mission Assurance"
                                    },
                                    "Description": {
                                        "val": "This research seeks to mature and rapidly prototype techniques to verify methods for identifying requirements, systems of systems architectures, and virtual integration of components.  Furthermore, research in this area will pursue rapid prototyping and transitioning of capabilities that verify requirements for software assurance, analysis\/control of unverified code and automated repair of damaged code.  Software production and code analysis methods developed through this program will also improve the ability to predict how complex software systems, including AI-enabled systems, will behave in untested environments.  Increasingly, large numbers of lines of code and the addition of machine-learning techniques will require a commensurate increase in sophisticated verification and validation mechanisms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.716"
                                            },
                                            "Text": {
                                                "val": "•\tDevelop and prototype full-lifecycle software cost models to assess\/predict the cost DoD software acquisitions.\n•\tDevelop a decision aid prototype that automatically guides DoD developers in refactoring code so that it can be harvested for re-use in a new system; select components could be replaced; or it could be upgraded to new hardware."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.881"
                                            },
                                            "Text": {
                                                "val": "•\tDevelop methods and prototypes for verifying timing properties of software executing on multiple cores of a processor.\n•\tAutomate the fielding and deployment of machine learning algorithms on novel computing architectures to allow faster and cheaper software capabilities as well as the realization of performance improvements within the hardware."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.826"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.826"
                                            },
                                            "Text": {
                                                "val": "•\tVerify and extend conformance checking for design properties of for DoD systems and software, demonstrating a reduction in the mean time required to detect design non-conformance from months to hours.\n•\tPrototype an AI test harness that enables developers to elicit requirements and conduct an independent verification of the security properties of the neural network components through unit, integration, and uncertainty tests."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in budget from FY 2020 to FY 2021 reflects additional resources required for prototype development."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Software Engineering Institute Advanced Technology Development in the Area of Information Assurance"
                                    },
                                    "Description": {
                                        "val": "Powerful machine learning algorithms can be subverted by malicious manipulation or falsification of data collected through normal channels.  Algorithms must be trusted and effective in the presence of adversaries.  This thrust seeks to defend against and minimize the impacts of information falsification attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.300"
                                            },
                                            "Text": {
                                                "val": "•\tDevelop and test assurance frameworks and methodologies for Internet of Thing (IoT) devices, control nodes, and other intermediaries in DoD mission and edge systems.\n•\tDevelop, test, and prototype ML enabled automated detection against research and military datasets and video; the prototypes will use unsupervised machine learning (ML) approaches that incorporate minimal, opportunistic analyst feedback and include means to continually verify underlying data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.233"
                                            },
                                            "Text": {
                                                "val": "•\tPrototype verified enforcers that prioritize mission critical functions while assuring component behavior to enable use of unverified commodity software components in military autonomous systems\n•\tPrototype a system that implements new algorithms and measures the effectiveness of classifier precision, classifier recall, and reused adjudications.\n•\tPrototype techniques to verify evasion defenses from post-training adversarial inputs as an integrated part of a continuous integration lifecycle to reduce the number of weaknesses."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.772"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.772"
                                            },
                                            "Text": {
                                                "val": "•\tCreate an AI test harness enabling software engineers to elicit requirements and conduct an independent verification of the security properties of neural network components through unit, integration, and uncertainty tests."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease in information assurance technology research is due to a need to leverage existing spending by the DoD services and focus on more fundamental research in this area."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BA 2, PE # 0602751D8Z"
                                    },
                                    "Title": {
                                        "val": "Software Engineering Institute Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.279"
                                        },
                                        "CurrentYear": {
                                            "val": "9.580"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.573"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.573"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.712"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.749"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.001"
                                        },
                                        "BudgetYearFive": {
                                            "val": "10.204"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "816"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Security"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.000"
                        },
                        "CurrentYear": {
                            "val": "0.997"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "SEI research focuses on the most significant and pervasive cybersecurity challenges within the DoD, such as the scalability and reliability of software assurance, supply chain risk management, validation of and trust in autonomous systems, human-computer and human-technology teaming and interaction, computing and communication at the tactical edge, and efficiency and performance of acquisition strategies and software development appropriate for a contested cyber environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Security"
                                    },
                                    "Description": {
                                        "val": "DoD network-centric and data-dependent autonomous systems are currently developed with a focus on function rather than security.  This approach makes them particularly vulnerable to cyber-attacks, a risk we seek to mitigate by developing, prototyping, and demonstrating new tools, technologies, and techniques to increase their cyber security."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "•\tDevelop technologies and techniques for automated code repair.\n•\tDevelop techniques and prototypes that automate the examination and analysis of binary malware code"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.997"
                                            },
                                            "Text": {
                                                "val": "•\tPrototype DoD specific secure DevOps process, to include integration of advanced techniques and mission requirements that exceed commercial industry norms and capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funds re-aligned for other DoD priorities."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}