{
    "id": "2021-Navy-PB-1319-MJBOOK-0-0-744c7ee94c2cc798fbfd935e35baade9caa8a86b67e6f22ecedd75220314848f-2",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601153N"
        },
        "ProgramElementTitle": {
            "val": "Defense Research Sciences"
        },
        "R1LineNumber": {
            "val": "3"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "487.362"
            },
            "CurrentYear": {
                "val": "463.829"
            },
            "BudgetYearOne": {
                "val": "467.158"
            },
            "BudgetYearOneBase": {
                "val": "467.158"
            },
            "BudgetYearTwo": {
                "val": "478.089"
            },
            "BudgetYearThree": {
                "val": "487.336"
            },
            "BudgetYearFour": {
                "val": "496.945"
            },
            "BudgetYearFive": {
                "val": "506.884"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Office of Naval Research (ONR) was established by Congress in 1946 to plan, foster and encourage scientific research in recognition of its paramount importance to maintaining American naval power.  This Program Element (PE) addresses DON's basic research needs to target and solve some of the Navy's and national most vexing challenges. Basic research is the seed corn for new ideas and lays the foundation for new innovative technologies and future naval capabilities. This PE's basic research efforts include scientific study and experimentation directed toward increasing knowledge and understanding of national security in the maritime domain and related aspects of physical, chemical, engineering, environmental and life sciences. Ultimately, basic research efforts lead to and support more advanced aspects of applied research in capability-related 'thrusts', which advance Navy and Marine Corps objectives in: Autonomous Systems; Artificial Intelligence and Machine Learning; Command, Control, Communications and Computers (C4); Information Analysis and Decision Support; Intelligence, Surveillance and Reconnaissance; Logistics; Materials; Operational Environments; Platforms; Power and Energy Technology; Sensors and Electronics; Warfighter Performance and Protection; Weapons; and Science, Technology, Education and Mathematics (STEM) education and outreach. \n\nDecisive naval capability begins with Science and Technology (S&T) research.  This PE ensures a robust portfolio of naval relevant S&T and enables new technological concepts to maintain maritime superiority.  These investments are selected to meet research priorities set by the Chief of Naval Research and defined in the Naval Research and Development Framework, which support Navy and Marine Corps near to long-term requirements.  Scientific breakthrough from this research become solutions to technical challenges via the Future Naval Capabilities (FNCs) pipeline, and new capability options for the future in the Innovative Naval Prototypes (INPs) portfolio.\n\nToday's Sailors and Marines are enabled by naval Science and Technology (S&T). Since its inception, the Office of Naval Research (ONR) has fostered scientific research related to the maintenance of maritime superiority and national defense.  ONR manages the Department of the Navy's (DON) portfolio of naval Basic and Applied research, and Advanced Technology Development investments to ensure naval forces can effectively deter conflict, but when called upon, fight, win and come home safe. Current investments hedge against uncertainty, providing solutions to commanders today, and options for the future. The Naval S&T budget supports higher guidance defined by the National Defense Strategy, and responds to requirements identified by the Secretary of the Navy through research priorities set by the Chief of Naval Research, coordinated across the Naval Research Enterprise (NRE), and outlined in the Naval R&D Framework. In addition, ONR's S&T investment portfolio supports National Naval Responsibilities (NNR) critical to the naval services where the Navy has historically taken the lead (ocean acoustics, undersea weapons, naval engineering, undersea medicine and sea-based aviation) to ensure decisive naval capability in the maritime domain.\n\nThis Program Element (PE) funds Basic Research and systematic study directed toward greater knowledge or understanding of the fundamental aspects of phenomena and of observable facts without specific applications towards processes or products in mind. The work in this PE can be classified between Technology Readiness Level (TRL) 1 (basic principles observed and reported) and TRL 2 (technology concept and\/or application formulation).\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "499.102"
                },
                "CurrentYear": {
                    "val": "470.007"
                },
                "BudgetYearOne": {
                    "val": "472.158"
                },
                "BudgetYearOneBase": {
                    "val": "472.158"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "487.362"
                },
                "CurrentYear": {
                    "val": "463.829"
                },
                "BudgetYearOne": {
                    "val": "467.158"
                },
                "BudgetYearOneBase": {
                    "val": "467.158"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-11.740"
                },
                "CurrentYear": {
                    "val": "-6.178"
                },
                "BudgetYearOne": {
                    "val": "-5.000"
                },
                "BudgetYearOneBase": {
                    "val": "-5.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-11.678"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "5.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-11.740"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-5.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: The reduction in FY 2021 is due to completion of the Basic Research Challenge efforts and Young Investigator Program efforts, and due to the realignment of resources for basic research administered through ONR Global to higher priority Navy requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Defense Research Sciences"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "448.266"
                        },
                        "CurrentYear": {
                            "val": "458.329"
                        },
                        "BudgetYearOne": {
                            "val": "467.158"
                        },
                        "BudgetYearOneBase": {
                            "val": "467.158"
                        },
                        "BudgetYearTwo": {
                            "val": "478.089"
                        },
                        "BudgetYearThree": {
                            "val": "487.336"
                        },
                        "BudgetYearFour": {
                            "val": "496.945"
                        },
                        "BudgetYearFive": {
                            "val": "506.884"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Office of Naval Research (ONR) was established by Congress in 1946 to plan, foster and encourage scientific research in recognition of its paramount importance to maintaining American naval power.  This Project addresses DON's basic research needs to target and solve some of the Navy's and national most vexing challenges. Basic research is the seed corn for new ideas and lays the foundation for new innovative technologies and future naval capabilities. This Project's basic research efforts include scientific study and experimentation directed toward increasing knowledge and understanding of national security in the maritime domain and related aspects of physical, chemical, engineering, environmental and life sciences. \n\nUltimately, basic research efforts lead to and support more advanced aspects of applied research in capability-related 'thrusts', which advance Navy and Marine Corps objectives in: Autonomous Systems; Artificial Intelligence and Machine Learning; Command, Control, Communications and Computers (C4); Information Analysis and Decision Support; Intelligence, Surveillance and Reconnaissance; Logistics; Materials; Operational Environments; Platforms; Power and Energy Technology; Sensors and Electronics; Warfighter Performance and Protection; Weapons; and Science, Technology, Education and Mathematics (STEM) education and outreach.\n\nThis Project sustains U.S. Naval Science and Technology (S&T) superiority, provides new technological concepts for the maintenance of naval power and national security, and helps avoid scientific surprise. These investments are based-on satisfying research priorities defined in the Naval Research and Development Framework. Scientific breakthroughs from this basic research provide solutions to technical challenges via the Future Naval Capabilities (FNCs) pipeline, and new capability options for the future force in the form of Innovative Naval Prototypes (INPs)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air, Ground and Sea Vehicles"
                                    },
                                    "Description": {
                                        "val": "Sailors and Marines operate air, ground and sea vehicles in some of the most extreme environments on the planet. Basic research advances the capacity of naval platforms operating under, on and above the seas, and to project power ashore. Ongoing research in the Air, Ground and Sea Vehicles activity will increase platform performance, reliability, improve human-machine teaming, reduce the cost of at-sea operations and enhance the effectiveness of distributed maritime operations.  \n\nThe efforts research focus include: surface and subsurface signatures; free-surface, subsurface, and propulsor hydromechanics; hull life assurance; advanced ship concepts; distributed intelligence for automated survivability; advanced electrical power systems; air vehicles; air platforms propulsion and power; air platforms survivability and signature control; special aviation projects; environmental quality; logistics; power generation, energy conversion, and storage; and advancements in naval technology innovations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "56.453"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "56.469"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Air Vehicles\nBasic research investments include fixed-wing, rotary wing, and vertical\/short takeoff and landing (V\/STOL) aircraft, ship\/aircraft dynamic interface, air vehicle management, and control, aerodynamics, and aeromechanics. Additional research investments include airframe structures and materials science address durability, service life, readiness, affordability, and future capabilities development. Most airframe challenges are not platform or design specific; they are fully represented in both current new-build and planned next-generation platform designs. Additional areas of research include metallic structures and materials, composite structures and materials, and advanced concepts related to: design, failure analysis, materials selection, fabrication, and sustainment of air-vehicle structures. Conducting university research supports rotorcraft technology areas such as tilt rotor aeromechanics, rotor flow field\/ship air wake coupling during shipboard operations, flight simulation of advanced ducted fan air vehicles, active rotor control for enhanced shipboard operations, autonomous rotorcraft operations in shipboard environment, and innovative rotor design concepts for naval applications. Continuing Sea-Based Aviation National Naval Responsibility (NNR) research in Virtual Dynamic Interface (VDI), advanced manned\/unmanned handling qualities and control for Naval operations, improved fixed wing launch and recovery high lift aerodynamics and performance, Enhanced fixed wing V\/STOL operations, and autonomous deck operations. Continuing SBA Structures and Materials NNR research for advanced airframes in metallic structures, combined loading mechanics, lightweight advanced polymer and ceramic composites, inspection and repair of composite structures, material coatings and sealants, and advanced concepts in manufacturing and multifunctional structures.\n\nScience of Autonomy and Control of Unmanned Systems \nConduct basic research related to critical multidisciplinary autonomy and unmanned systems challenges that cut across areas\/domains, including air, sea, undersea and ground. This includes multi-disciplinary research into the science of autonomy and unmanned control and focuses on four interrelated areas: scalable and robust distributed collaboration among autonomous or unmanned systems; human\/unmanned system collaboration; autonomous perception and intelligent decision-making; and intelligent architectures for autonomous systems. \n\nScience of Advanced Naval Power and Energy Systems \nConduct basic research related to critical S&T to investigate efforts related to thermal science and engineering; power electronics\/electro-magnetics; distribution and control of power; power management; and energy conversion, storage and generation. Pursue research in computer-aided material design; scarce materials mitigation strategies; electrochemical materials; and functional polymeric materials, leading to technological underpinnings for advanced energy capture and power storage and distribution. \n\nScience of Advanced Naval Platform Performance \nConduct basic research related to critical S&T to investigate efforts related to propulsor, surface, and subsurface hydrodynamics; platform dynamics and performance; alternative hull materials; structural acoustics; and submarine security. Expand research related to naval engineering, platform design, and multiple platform control, including COLUMBIA CLASS Program, SSN(X), unmanned surface vessels, and swarm boats efforts, and support to the centers for innovative naval technology.\n\nSea Platform Survivability Science \nConduct basic research related to critical S&T to investigate efforts related to platform structural reliability; acoustic and non-acoustic (electromagnetic) signatures; computational mechanics and signatures; metamaterials; and digital ship design and optimization, and improving the understanding of the generation, radiation, propagation, scatter, and detection of a variety of signal types (acoustic, chemical, optical, electromagnetic, hydrodynamic and radiological) associated with a submarine's operation.\n\nMaterials & Coatings Science\nPursue research in identifying new nanostructured materials and coatings processing, ultimately for naval applications. \n\nCorrosion Control Science \nConduct basic research related to critical S&T to investigate corrosion control technologies. \n\nShip and Air Platform Machinery and Systems \nConduct basic research to advance the technical superiority of Sea-Based Aviation Science and Technology NNR in propulsion, power and thermal management related technologies with emphasis on propulsion cycles, subsystems, and integration, turbo machinery and drive systems, jet noise reduction, hot section materials and coatings, and small UAV propulsion. Conduct research to improve the power density, fuel efficiency, range and operating reliability of future large, medium and small engines. Continue studies to obtain a better fundamental understanding of the technologies involved with Rotating Detonation Engines and integration into platforms and weapon systems using thermodynamic models, Computational Fluid Dynamics and sub-scale experiments. Pursue research for better fundamental understanding of the underlying physics of jet noise production from multi-stream, hot, supersonic jets, and control schemes through fundamental modeling of unsteady and turbulent flow fields and development of more accurate and efficient computational tools. Continue basic research to improve jet engine material durability and temperature and temperature rate capabilities in both benign and corrosive environments. Increase the technical maturity of lightweight ceramic heat exchangers for small engines with no new efforts identified."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "56.362"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "56.362"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sea-Based Aviation National Naval Responsibility (Formerly Air Vehicles)\n- Conduct research for Air Vehicle Science & Technology in aerodynamic interface, advanced manned\/unmanned handling qualities and control for Naval operations, control law synthesis methods to improve aircraft launch and recovery, high lift aerodynamics and performance, advanced methods to achieve fixed wing efficiency with Vertical\/Short Take-off and Landing (V\/STOL) launch & recovery, and autonomous deck operations.  \n- Conduct ongoing research in Aircraft Science & Technology efforts include: advanced analytical methods for achieving guaranteed performance in multibody control systems, advanced modeling and analysis methods for ship\/aircraft aerodynamic interface, air vehicle flying qualities and control, and mechanical\/environmental failure prediction research.  \n\nFlight Dynamics & Control (Formerly Air Vehicles) \nResearch will develop theory and analysis methods to better understand the phenomena and natural dynamics of air vehicles operating in the marine environment. Collaborative research will improve our knowledge of control system interactions between piloted aircraft and human performance. \nThe Focus areas are:\n- Multibody control systems and the ability to demonstrate guaranteed performance relative to a desired end state; \n- Robust and precise control in the presence of highly turbulent flow fields; \n- Algorithms to enable precise ship-relative navigation in GPS-denied environments.  \n\nAerodynamics (Formerly Air Vehicles) \nResearch will develop advanced computational methods addressing the Navy-unique challenges:\n- Fully coupled aerodynamic interface between ships and aircraft; \n- Advanced methods for reduced-order modeling of complex flow fields; \n- Advanced methods for manipulating more precisely the flow fields around air vehicles operating in the maritime environment.\n\nScience of Autonomy and Control of Unmanned Systems\nResearch related to critical multidisciplinary autonomy challenges that cut across areas\/domains, including air, sea, undersea and ground. This includes multi-disciplinary research into the science of autonomy focuses on four interrelated areas: \n- Scalable and robust distributed collaboration among autonomous systems; \n- Human\/unmanned system collaboration;\n- Perception-based adaptation across uncertain naval environments;\n- Embodied and situated intelligence and architectures.  \n- Expand research on agile, theory-based tools and methods for safe, assured, robust, verifiable,\nand trustable autonomy.\n\nAir Platform Machinery and Systems(Formerly Ship and Air Platform Machinery Systems)\n- Conduct basic research to advance the technical superiority of Sea-Based Aviation Science and Technology in Propulsion, Power and Thermal management related technologies with emphasis on propulsion cycles, subsystems, and integration, turbo machinery and drive systems, and hot section materials and coatings. \n- Conduct basic research to improve the power density, fuel efficiency, speed, range and operating reliability of future large, medium and small engines. \n- To obtain a better fundamental understanding of the technologies involved with Rotating Detonation Engines and integration into platforms and weapon systems using thermodynamic models, Computational Fluid Dynamics and sub-scale experiments will continue studies in FY21.  \n- Conduct basic research for high stage-loading and efficient turbomachinery including distortion tolerant fans, casing treatments and advanced methods in blade-disk aerodynamics; advanced cooling and thermal management for engines and auxiliary systems including new concepts of heat collection, distribution and rejection; advanced turbine engine materials and coatings; highly integrated propulsion inlets and exhausts and dust ingestion research: including modeling, separating, deposition, coatings and sensing. \n- To improve jet engine material durability and temperature rate capabilities in both benign and corrosive environments will continue its basic research in FY21.\n\nPlatform Design and Engineering (covers efforts previously called Science of Advanced Naval Platform Performance and Sea Platform Survivability Science)\n- Conduct basic research related to critical S&T to investigate efforts related to platform performance, platform autonomy and control, platform survivability and tactical submarine evolution plan (TSEP) S&T. \n- Efforts for platform performance, autonomy and control include, but are not limited to, the following: understanding, predicting and controlling turbulent free-surface and stratified wakes leading to mitigation, tools to accurately predict platform maneuvering performance supporting future designs, current platform operational tactics, platform control and \"digital twins\" and developing reliability-based knowledge and tools to improve performance and affordability of ship hull structural systems from cradle to grave. \n- Efforts for platform survivability and TSEP S&T include, but are not limited to, the following: structural acoustic and propulsor source characterization, developing signature mitigation technologies, providing state of the art signature and detection range prediction tools that accurately model platforms to emerging threats and developing wideband, light-weight, affordable low observable materials. \n\nPower, Energy & Propulsion (covers efforts previously called Science of Advanced Naval Power and Energy)\n- Conduct basic research related to critical S&T to investigate efforts related to heat transfer and thermal management; power generation; energy storage; distribution and control; and motors and actuators. \n- Efforts include, but are not limited to, the following: wide band gap (WBG) materials growth for next generation power electronic devices, improving power density, efficiency and control authority of WBG SiC Power Electronic Building Blocks by increasing switching frequencies, developing multidisciplinary collaborative ship design tools and nanostructured heat transfer surfaces and materials for enhanced thermal transport.\n\nSustainment and Logistics (covers efforts previously called Corrosion Control Science)\n- Conduct basic research related to critical S&T to investigate maintenance technology, manufacturing and repair, sustainment technologies and advanced logistics.\n- Efforts include, but are not limited to, the following: corrosion control, condition-based maintenance and prognostics, repair and component replacement technologies, replenishment at sea and decision support.\n\nMaterials (covers efforts previously called Materials & Coatings Science and Science of Advanced Naval Power and Energy)\n- Pursue research in computer-aided material design; scarce materials mitigation strategies; electrochemical materials and functional polymeric materials, leading to technological underpinnings for advanced energy capture and power storage and distribution; structural materials for performance improvement and resiliency; identifying new nanoengineered materials and processing for naval applications."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2020 to FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Atmosphere and Space Sciences"
                                    },
                                    "Description": {
                                        "val": "Effective Naval operations depend upon accurately understanding the maritime operating environment and predicting its characteristics at high spatial and temporal resolution in areas that may be inaccessible. Understanding atmospheric phenomena and their impact on the electromagnetic spectrum from the sea surface to space provides a significant warfighting advantage. Efforts include: Marine Meteorology and Prediction and Space Sciences. These efforts support basic research on process studies, fundamental observations, data discovery, and modeling in the atmosphere and space with the goal of improving the ability to predict the battlespace environment anywhere on the globe. Emphasis is placed on the marine atmosphere, the tropics, polar regions, the ionosphere and other areas where new understanding is needed in order to overcome predictability barriers that limit the accuracy of current forecast models. Efforts are underway to understand the interactions of physics between the atmosphere, space, land, ocean and ice, represent these coupled processes in models, and extend them across scales from local to planetary, with the goal of extending the skill of predictions to seasonal and interannual timescales. Recent efforts have also focused on the processes that control tropical cyclone formation, structure and intensity changes and phenomena that affect electromagnetic and electro-optic propagation in the marine atmosphere. Research results provide the foundation for improved global and regional forecasts of the operational environment and for development of next-generation coupled prediction systems. Research areas evolve in response to priorities of the Oceanographer of the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.196"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.899"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The overall objective of this research is to improve the quality of the atmospheric and space environmental products that are provided to the warfighter and to allow accurate assessment of the impact of space and atmospheric phenomena on the performance of weapon systems. These objectives require advancing our basic understanding of atmospheric and space processes ranging from the surface to space, including interactions of the atmosphere with the land, sea, waves, and ice.\n \nBattlespace Environments\n\nNavy operations in the littoral zone are affected by complex topography and air-sea-land contrasts and phenomena occurring on very short time and space scales. Research is supported to investigate key physical processes, clouds\nand moisture phenomena in order to improve their representation in models. Efforts are focused on those phenomena that affect the predictability of parameters of most relevance to Naval operations (e.g. coastal meteorology,surface winds, visibility, refractivity, etc.). New and non-conventional observational data sources are explored through efforts that develop novel data assimilation methodologies in order to realize the full potential of such observations.  Systems are being employed which operate in or through the earth's upper troposphere, middle and upper atmosphere and the near\nspace environment where environmental supports are crude or non-existent,thus, efforts are supported that seek to extend the range of prediction systems to much higher altitudes. Research is supported to improve understanding of the physics of the upper atmosphere and ionosphere, and to improve the representation of the interface between the troposphere and stratosphere because of its effects upon medium term weather prediction.\n\nMarine Meteorology and Prediction\n\nResearch initiatives to improve the sub-grid scale parameterization of clouds, radiation and mixing in the marine boundary layer that developed several innovative new \"scale-aware\" parameterizations; transition these to applied research and directly into a new version of the Navy's global numerical weather prediction system (NAVGEM). This activity is scheduled to be completed in FY 2020. High-altitude airborne field experiments over major hurricanes during which an unprecedented set of high-resolution soundings covering the full depth of the storms were obtained allowed detailed physical processes to be observed for the first time.This activity is scheduled to be completed in FY 2020.\nResults from airborne observations over tropical cyclones will be analyzed and applied to new and existing models to make a substantial improvement in the skill for predicting intensity and structure change in tropical cyclones.\nAtmospheric process research will seek to advance our understanding of atmospheric and space processes ranging from the surface to space.  This includes marine boundary layer physics, air-sea-wave-ice coupling, processes affecting electro-optic and electromagnetic propagation, and better representation of clouds and moisture in numerical weather prediction models. A new research initiative will be initiated to focus on the origin, evolution and effects of Arctic cyclones that are poorly predicted but are believed to have a strong influence on Arctic ice.  Airborne observations over the Arctic from high-altitude research aircraft will be used to investigate processes from the stratosphere to the surface in order to improve their representation in numerical weather prediction models that can be coupled to the physics of the ocean and ice. \n\nSpace Research\n\nPerform best-in-class, experimentally-led sensing research and development (R&D) that is integrated across three environmental areas -- geospace, heliospace, and high-energy space -- which underpin, connect, and inform successful operations, with metrics to increase technology readiness towards rapidly prototyping solutions for accelerated delivery. Geospace research will attempt to overcome key scientific and computational impediments to a future physics-based Navy ionospheric prediction capability recently identified as a critical capability gap for high frequency (HF) radio-wave technologies for electromagnetic maneuver warfare, by means of focused scientific research on key drivers from the lower atmosphere and thermosphere that are necessary to achieve short term forecasts of HF propagation globally. Heliospace efforts may advance our understanding of solar magnetic fields and how they influence the near-earth environment. High-energy space development will assist in understanding particle acceleration mechanisms in high energy solar flares by studying gamma-ray and neutron emissions that are measured in space. \n \nSpace Sciences  \n\nOn-going investigation to assimilate observations into space weather models, with an eventual goal of a prediction system that could provide detection and warnings of tsunamis as a variety of observational systems will be utilized to increase the understanding of the physics of ionospheric irregularities and other space weather phenomena. Recent observations have shown that a number of phenomena, including tsunamis, can generate acoustic gravity waves that have an airglow signature in the thermosphere\/ionosphere."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.060"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.060"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Battlespace Environments  \n- Develop the quality of the environmental products that are provided in support of war fighters and to more accurately assess the impact of the atmosphere on the performance of weapon systems, we must advance our basic understanding of atmospheric processes ranging from thousands of kilometers down to meters, including interactions of the atmosphere with the land, sea, wave, and ice. \n- Improve our ability to exploit environmental observations to help us characterize those processes more accurately. Navy operations are increasingly taking place in the littoral zone, where complex topography and air-sea-land contrasts affect the environment on very short time and space scales, as well as in the tropics and sub-tropics, where longer time scale oscillations and seasonal signals also affect short-term weather events. While today's numerical analysis and prediction systems are more capable of resolving and predicting highly variable phenomena than were the systems of 10-20 years ago, there are still processes that are not well understood, including, atmospheric clouds and moisture, that require further study to improve their representation in models. \n- Comprehend the distribution of aerosols in the atmosphere play and important role moisture formation as well as atmospheric visibility.  A growing number of non-conventional observational data sources require new and novel data assimilation methodologies to be developed before their potential is fully realized. Systems are being employed which operate in or through the earth's upper troposphere, middle and upper atmosphere and the near space environment where environmental supports are crude or non-existent. \n- Understand the measurements and predictive models are needed to mitigate these shortfalls. \n- Recognize the interface between the troposphere and stratosphere is gaining increased attention because of its possible effect upon medium term weather prediction. This is most convincingly seen in the influence of the jet stream on the trajectory of storm systems and air masses in the troposphere. Current analysis indicates that incorporation of correct physics at this boundary and assimilation of stratospheric data into numerical weather prediction models may be almost as important as the physical interaction with the ocean surface. \n\nMarine Meteorology and Prediction\n- Launch the Land-Air-Sea Interaction Closures research initiative to improve coupled nearshore atmospheric and oceanographic phenomena\n- Investigate key physical processes, clouds and moisture phenomena in order to improve their representation in models. Efforts will be focused on those phenomena that affect the predictability of parameters of highest relevance to Naval operations. New and non-conventional observational data sources will be explored and novel data assimilation methodologies will be developed and tested that will continue research in FY21.  \n- Conduct deployment of observing systems in the upper troposphere, middle and upper atmosphere and the near-space environment to extend the range of prediction systems to much higher altitude. \n- Carry forward the research to improve medium range weather prediction through enhanced understanding of the physics of the upper atmosphere and ionosphere, and to improve the representation of the interface between the troposphere and stratosphere.\n- Move forward the research initiative to improve the understanding of processes that contribute to the poorly predicted rapid intensification of tropical cyclones (TCs) through major observing experiments.\n- Extend the analysis of high-altitude airborne field observations over major hurricanes (during which an unprecedented set of high-resolution soundings covering the full depth of the storms were obtained) allowed detailed physical processes to be observed for the first time.\n- The field and modeling initiatives that focus on the origin, evolution and effects of Arctic cyclones believed to have a strong influence on Arctic ice will continue in FY21. \n- Finished the predictability of Intra-Seasonal Tropical Oscillations (PISTON) research initiative and field studies of monsoonal phenomena in the northern Indian Ocean.\n\nSpace Research\nThis program perform best-in-class, experimentally-led sensing research and development (R&D) that is integrated across three environmental areas -- geospace, heliospace, and high-energy space -- which underpin, connect, and inform successful operations, with metrics to increase technology readiness towards rapidly prototyping solutions for accelerated delivery.  The following programs include:    \nGeospace\n- To take away key scientific and computational impediments to a future physics-based Navy ionospheric prediction capability recently identified as a critical capability gap for high frequency (HF) radio-wave technologies for electromagnetic maneuver warfare, by means of focused scientific research on identification of which key drivers from the lower atmosphere and thermosphere are necessary to achieve short term forecasts of HF propagation globally.  \nHeliospace \n- Launch efforts to advance the understanding for the solar magnetic fields and how it influence the near-earth environment.  \nHigh-Energy Space \n- Launch efforts to understand particle acceleration mechanisms in high energy solar flares by studying gamma-ray and neutron emissions that are measured in space."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2020 to FY 2021 is due to increase emphasis and investment in Heliospace and High-Energy Space focused basic research."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Science Addressing Hybrid Threats"
                                    },
                                    "Description": {
                                        "val": "Naval expeditionary forces increasingly face the specter of hybrid adversaries using conventional weapons combined with terror, crime, cyber, information operations, etc. A hybrid adversary is flexible and adapts quickly to synchronize advanced state weapons systems, disruptive commercial technologies, cheap expedient homemade weapons, and a variety of novel tactics. The Sciences Addressing Hybrid Threats (SAHT) (formerly Counter Improvised Explosive Device (IED)) activity seeks to establish and nurture science to counter these growing challenges, while collaborating with and leveraging results from more traditional naval research portfolios. \n\nThe SAHT Sciences program provides research for Naval Forces to fight hybrid threats, and adversaries in expeditionary operations. Naval Expeditionary Forces need science advances to address a range of Basic Research challenges that result from physical and operational environmental limitations so harsh that solutions push basic discovery and invention. Naval Forces able to operate amphibiously and in the littoral will have all of their capabilities exposed to degrading sea and land physical effects. Expeditionary forces operating austerely must be agile and lethal but will be constrained by size, weight, and power requirements and must be sustained across distributed forces covering large areas.\n\nComplicating the problem context further is the nature of hybrid threats, and adversaries. A hybrid adversary can be state or non-state using a combination of conventional and irregular methods and weapons. For example a hybrid threat could use criminal acts in concert with conventional artillery and IEDs and in turn social media for combined effects greater and broader than the sum of the parts. These coordinated multivariate threats occur across the spectrum of conflict with a dynamic but unified strategy. A hybrid adversary is flexible and adapts quickly, synchronizing advanced state weapons systems, disruptive commercial technologies, cheap expedient homemade weapons, and a variety of tactics. The Sciences Addressing Hybrid Threats program seeks to establish and nurture science to address these threats not covered in more conventional warfare science efforts and in environments not researched elsewhere.\n\nThe efforts research focus include: physics addressing the electromagnetic spectrum for use in Command and Control and high energy physics addressing Directed Energy Weapons; machine perception, reasoning and collaborative behaviors of autonomy enabling numerous potential expeditionary autonomous systems; artificial intelligence enabling future Intelligence systems; optics, electronics, and photonics research to enable revolutionary spectral awareness in small low power sensors; computer and network science to enable expeditionary computing coupled with Data Science research to conduct data analysis; fundamental chemistry and materials science research to advance technologies to support sustainment; basic materials research to explore and improve armor and structural materials; electrochemical energy conversion and storage research to sustain the force; chemistry and physics to provide disruptive energetics for expeditionary Fires; and biology, physiology, and cognitive sciences addressing the Naval Expeditionary warfighters human abilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.194"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.823"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct work in hazard defeat to understand new concepts, techniques and methods, for the design, growth, and characterization of electronic, electro-optic, and bio sensors to counter hybrid explosive hazards threats, immersive sciences for automated methods for generating content and\/or behaviors for use augmented and mixed reality technologies, and neuromorphic computing and novel opto-electronic technologies. End perovskite chemistry based solar cell efforts. Initiate efforts in understanding multifunction machine learning and artificial intelligence systems operating in realistic electromagnetic threat environments.  \n\nEvaluate and quantify the changes in electrical signaling, resulting from strain on the neuronal cells subjected to shock and blast waves.  The study is critical to define and understand blast and impact injuries at the cellular level resulting in mild or severe traumatic brain injury.  Studies on hearing loss from repeated exposure to high levels of acoustic waves created by high performance jet engines operating on ocean platforms.  Understanding of fundamental changes on IR optical standoff and point detection of improvised explosives, chemical warfare agents and toxic industrial chemicals.  Develop and demonstrate a predictive framework of IR spectral signatures based on the fundamental optical properties of materials.  Earlier studies on related topics have provided design and fabrication of protection garments from IED explosives and advanced design concepts for helmets to significantly reduce neuronal damage caused by shock and blast waves. Novel biomaterials that enable epidermal electronics for warfighter protection to light weight distributed chemical sensors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.290"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.290"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct high specificity standoff detection efforts to provide high probability detection and classification of explosive components in support of hazard defeat to counter continuously evolving explosive threats. \n- Extend exploring concepts, techniques and methods, for the design, growth, and characterization of electronic and electro-optic sensors to counter improvised explosive devices (IEDs).\n- Carry-Forward the artificial intelligence \/ machine learning investigation of multifactorial information environment parameters in order to automate the process of detecting, identifying and distinguishing intent.  Conduct discovery research on multi-class, multi-objective deep reinforced learning algorithms with automated training.  \n- Carry-on the investigation of ultra-wideband compact hybrid analog and digital computational devices and algorithms that can adapt to dynamic information and electromagnetic threat environments.  Utilizing existing knowledge of emergent behavior in distributed robotic systems as a foundation, conduct discovery research and develop theories for creating swarming behavior in heterogeneous multi-domain autonomous systems. \n- Launch the research and develop theories to predict adversarial behavior in autonomy-enabled battle spaces.  \n- Conduct researching novel energetic materials that provide order of magnitude increases over current conventional energetics in reactive, explosive, and propulsive phenomena including high-energy ingredient synthesis, modeling, characterization, and the fundamentals of initiation mechanisms for these materials. \n- The research in materials, chemistry and physics, emphasizing phenomena that demonstrate non-linear behavior for naval applications will continue to expand in FY21.\n- Conduct research to explore new, rugged, low cost, and high specific power sources, including solar cell technologies, including investigation into the stability of the solar cells."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2020 to FY 2021 in due to reduced basic research investment in materials and designs for blast resistant garments and helmet design."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Systems"
                                    },
                                    "Description": {
                                        "val": "Naval forces operate under, on and above the seas. Coordinating multi-domain operations are inherently complex. Improving human-machine effectiveness, teaming and rapid decision-making in a distributed maritime environment is essential to respond within the time constraints of an AI-dominant future. Human Systems research contributes to solutions and technologies that resolve complexity and respond rapidly to new threats beyond human speed. \n\nThe efforts research focus include: Research on attention and decision making in human and human-machine teaming tasks related to Naval missions, including command decision making, cognitive systems for human-machine teaming, computational neuroscience, human interactions with autonomous systems, attention and sensory processing, social cultural and behavioral modeling, and social network and computational social sciences."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.114"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.563"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Command Decision Making\n\nDevelop approaches for proactive decision support for Naval command and control tasks, with an emphasis on supervised machine learning of expert planning and dynamic re-planning. \n\nHuman-Machine Teaming\n\nDevelop empirical and computational models of cognition and create algorithms and architectures that aspire to human-level intelligence or ability. The algorithms and cognitive models serve to: (i) Advance the understanding of human cognition; (ii) Enable systems to recognize, understand, predict, perform, assist, and evaluate human behavior; and (iii) Improve the effectiveness of intelligent systems, human users\/operators, and hybrid human-machine teams in Naval operations. \n\nNeurosciences and Human Interaction With Autonomous Systems\n\nDevelop neuroscience principles to identify neural circuits, architectures, and algorithms that can be emulated to develop novel sensing, control, pattern recognition, neuromorphic processors, and intelligent systems. Conduct research on neural mechanisms of memory consolidation, working memory, and retrieval to enable intelligent systems with human-like associative memory skills. \n\nAttention In Sensory Processing\n\nDevelop mechanisms of attention, including its role in skilled perceptual and cognitive performance. Understand attention to task-relevance as a factor in personnel selection and training. Incorporate mechanisms of attention into machine learning. \n\nSocial, Cultural, and Behavioral Modeling\n\nDevelop computationally-efficient methods to model human behavior and social network analytics. Efforts include modeling information and cyber warfare, as well future sensor and weapon developments and their impact on Warfighter performance. Use machine learning to create synthetic decision makers. \n\nSocial Networks and Computational Social Science\n\nDevelop methods and tools pertaining to social media network analysis, including problems of monitoring social media, social hysteria propagation, and group polarization to support methods for information environment assessment, humanitarian assistance, and disaster response."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.863"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.863"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Command Decision Making\n- Conduct research to explore Command and Control (C2) human-machine collaboration and management of algorithms that adapt using machine learning (ML). \n- Utilize machine learning algorithms for analysis and forecasting of \"what if\" scenarios across the human capital enterprise.\n\nCognitive Science for Human-Machine Teaming\n- Explore previously developed computational models that act as surrogates, teammates, trainers, and assistants to human warfighters. \n- Conduct research on empirical and computational models of cognition and create algorithms and architectures that can be embedded into autonomous systems to provide higher-level intelligence and ability. \n- Explore natural communication between humans and machines in Naval domains, including natural language dialogue for intuitive interfaces that lower cognitive load.\n\nComputational Neuroscience\n(This thrust was previously part of the Neurosciences and Human Interaction With Autonomous Systems FY20 Plan)\n- Conduct research to identify neural circuits, architectures, and algorithms that can be emulated to develop novel sensing, control, pattern recognition, neuromorphic processors, and intelligent systems. \n- Explore neural network dynamics and build large-scale models of cerebral cortex. \n- Conduct discovery research on neural mechanisms of memory processes. \n- Explore neural models of sensorimotor control and spatial navigation.\n\nHuman Interaction with Autonomous Systems\n(This thrust was previously part of the Neurosciences and Human Interaction with Autonomous Systems FY20 Plan) \n- Explore warfighter collaboration with autonomous and mission-capable robotic systems. \n- Explore approaches for training robots to perform complex manipulation skills using machine learning and human demonstration. \n- Conduct research to begin developing models of effective collaboration between humans and intelligent machines on complex tasks.\n\nAttention in Sensory Processing\n- Conduct research to create and validate measures of the role of attention in the performance of complex military tasks.  \n- Investigate novel, brain-based, approaches to computer vision that incorporate top-down attentional processing to facilitate input interpretation. \n- Develop novel, neurally inspired, techniques exploiting attentional mechanisms to facilitate recognition of sound sources in highly-cluttered acoustic environments.\n\nSocial, Cultural, and Behavioral Modeling\n- Conduct research to improve computational efficiency and effectiveness in modeling human behavior, information and cyber warfare. \n- Discover improved information warfare models, sensors and associated metrics of conflict and competition for estimating warfighter performance. \n- Develop models of decision-making and strategy needed to develop synthetic decision makers.  \n- Investigate machine learning and artificial intelligence techniques for effective information environment exploitation.\n\nSocial Networks and Computational Social Science\n- Conduct research to develop algorithms, methods and tools for analysis of social hysteria propagation and group polarization; improve methods of information environment assessment and strategic communication.  \n- Refine detection of adversarial information maneuvers across social media platforms. \n- Conduct research to develop information environment assessment capabilities for humanitarian assistance and disaster response."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2020 t0 FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mathmatics, Computer, and Information Sciences"
                                    },
                                    "Description": {
                                        "val": "Basic research efforts directed toward increasing knowledge and understanding in mathematical foundation and computational theory and tools for design, communication, and control, with emphasis on intelligent autonomous system.  The purpose is to sustain U.S. Naval Science and Technology (S&T) superiority, provide new technological concepts for the maintenance of naval power and national security, and help avoid scientific surprise. Advancements in computing capacity\/speed, algorithms and data science is foundational to a more interoperable, synchronized and distributed naval force. The pace and complexity of modern naval operations requires rapid access to secure, accurate information.  \n\nEfforts include: Mathematical foundation and computational theory and tools for design, communication, and control of intelligent autonomous systems; theory, algorithms and tools for decision support; decision theory, algorithms, and tools; heterogeneous information integration, management, and presentation; information assurance, computation and information foundation for cyber defense, secure and reliable information infrastructure for command and control; mathematical optimization for optimal resource allocation and usage; modeling and computation of complex physical phenomena; modeling and computation for electromagnetic and acoustic wave propagation and scattering; seamless, robust connectivity and networking; foundations for novel computing hardware, including nanoscale materials, emerging devices and circuits, emerging computational architecture and nanofabrication. \n\nThe Science of Artificial Intelligence Program focuses on discovery research to extend state-of-the-science in artificial intelligence for the unique challenges of the Naval domain. These challenges include operations in spatially and temporally variable and uncertain environments with limited communications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "44.836"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "50.354"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Communications and Networking\n\nConduct basic research in antenna technology to include electrically small antennas, wideband multifunction antennas, compatibility of phased array antennas with naval platforms and marine environments, directional beam forming\/steering techniques, and special-purpose submarine communication antenna systems; radio communications to include anti-jam and low-probability-of-intercept techniques, satellite communications (SATCOM) performance enhancements, interference mitigation, adaptive equalization, bandwidth efficient modulation, cognitive radio for dynamic spectrum management, and high data rate tactical communications techniques including communications at speed and depth (for submarines); and wireless networks to include mobile ad-hoc wireless networking algorithms\/protocols, end-to-end Quality-of-Service, joint\/coalition interoperability, service oriented tactical networking, mission-based policy and network controls and management.\n\nQuantum Information Sciences\n\nConduct basic research of quantum key distribution (QKD) protocols and implementations for the purpose of understanding the security implications for QKD in the maritime environment, the development of protocols that simultaneously minimize leakage of information to the environment and the creation of secure networks, as well as schemes to maximize the information carried by a continuous or discrete variable; and research of algorithms for naval functions such as routing, weapon-target pairing, etc., a key application such as radar cross section calculation.\n\nNanoscale Computing Devices and Systems\n\nDevelop novel techniques for synthesis, assembly and characterization of molecular scale (sub-10 nanometers) nanographene structures for their electronic, optical, magnetic and quantum functionalities. Research, assess, test and develop alternative computing architectures (beyond von-Neumann), including but not limited to, various implementations of neuromorphic architectures and quantum information systems.\n\nMathematical Data Science\n\nConduct basic research in mathematics, probability, statistics, signal processing, machine learning, data engineering, and information theory. The program aims to develop rigorous mathematical and algorithmic answers to questions that are currently addressed using heuristics or non-principled approaches. Focus is on problems in learning and inference from both big and small data, representation of data, modeling dynamical properties of and determining causal effects in complex networks, multi-modal, multi-scale information integration, and decision making under uncertainty.\n\nMachine Learning, Reasoning and Intelligence\n\nConduct basic research in the area of building intelligent agents that can function in the environments in which warfighters operate, that is, environments that are unstructured, open, complex and dynamically changing. Agents (cyber or physical) do not yet have the level of intelligence needed to operate in such open, uncertain and unpredictable environments either independently or alongside warfighters. In the area of Intelligence for Autonomous Agents, basic research includes the development of principles for machine intelligence, efficient computational methods, algorithms and tools for building versatile smart agents that can perform missions autonomously with minimal human supervision and collaborate seamlessly with teams of warfighters and other agents. In the area of Image Understanding, basic research includes the development of theory and algorithms for understanding surveillance imagery, for semantic search of visual datasets, and for autonomous agent perception. The main focus is on reconstructing 3D scenes, recognizing object classes and specific objects, recognizing activities and events, inferring intentions, as well as succinct natural language descriptions of images and video.\n\nApplied and Computational Analysis Program\n\nConduct basic research in modern and classical mathematical analysis with emphasis on mathematical and computational models of physical phenomena. Naval interest in waves, flows, materials, structures, and information processing motivates research in the areas of multi-phase, multi-physics, including analytically rigorous and computationally robust and efficient modeling of fatigue, fracture, dislocation, nucleation, shocks and contact lines; dynamical systems, and oceanic and atmospheric modeling, including fluid transport, mixing, and predictability of models for nonlinear dynamics; and inverse problems arising from acoustic and electromagnetic wave propagation and scattering.\n\nCyber Security and Complex Software Systems\n\nConduct basic research in computing systems and complex software systems that meet required assurances for security, safety, reliability and performance to measurably improve the information-processing challenges of future naval systems.  Cyber Security sub-program investigates and develops wide-ranging principles and techniques for continuously maintaining confidentiality, integrity, and availability of information and information infrastructures, focusing on the software, the hardware and the network. The program seeks to establish an autonomic, secure and dependable informational infrastructure toward achieving Information Dominance. Complex Software sub-program investigates principles, algorithms and methods, and develops software engineering tools for achieving efficient, timely, robust and secure software executables, focusing on science for software construction, correctness and efficiency by revisiting software development and deployment methodology. Efficient, timely, robust and secure software is a requirement for secure information infrastructure toward achieving Information Dominance.\n\nNetworked Sensing\n\nConduct basic research in optical components and infrared technologies including lasers and focal plane arrays using narrow bandgap semiconductors for the purpose of imaging through clouds, fog, haze and dust; persistent surveillance for severely size constrained airborne applications; detecting anomalies and targets; and autonomous sensing for Unmanned Autonomous Vehicle (UAV) platforms and networked sensing over multiple sensors and\/or sensor platforms.\n\nMathematical Optimization and Operations Research\n\nThe primary focus of the Mathematical Optimization program is the development of new, cutting-edge theory and algorithms for most efficiently solving problems in linear, nonlinear, integer, and combinatorial\noptimization. Theoretical development, algorithmic design and analysis, computational methods, and software prototypes for large-scale problems are of interest. This directive includes, but is not limited to, cutting plane\nand polyhedral techniques for mixed-integer programming, decomposition approaches for large (non)convex problems, and interior-point and first-order algorithms for conic\/convex optimization. Advances that produce provably optimal or near-optimal solutions, as well as those applicable to large problem domains are favored. Innovative strategies for dealing with uncertainty from stochastic optimization, robust optimization, and simulation-based optimization are of growing interest. Research supported by this program is expected to make fundamental contributions to the areas of\nmathematical optimization and operations research.\n\nInformation Technology: To address the continued need for improving the operational capability of Naval information and communication systems in the areas of: high assurance software; secure tactical connectivity; AI and autonomy; and the processing, integration, and presentation of information. The expected payoff is: the development of improved methods for producing, analyzing, and securing Naval software systems; new design concepts for future Naval tactical communication systems and networks; intelligent autonomy and improved interaction with autonomous systems; and improved methods for information analysis, fusion, and presentation. New research projects will deliver technology for improved AI inference and human\/AI interaction,  predictive models for human cognitive performance, models for predicting and controlling complex networks in uncertain and hostile environments, and technology for improved presentation of complex, information-rich datasets.\n\nIntegration of domain knowledge and machine learning to enable fast and robust learning of diverse, complex concepts and tasks. Development of artificial intelligence in support of: (i) Informing and assisting different stages of the decision making process, and (ii) Developing interfaces and dialogue systems for human-machine teaming. Efforts in distributed artificial intelligence will identify principles and tractable computational methods for flexible and resilient approaches to learning, sharing, reasoning, and decentralized planning for situation awareness. Efforts will develop brain-inspired artificial intelligence algorithms and architectures and neuromorphic hardware to accelerate deep learning."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "60.046"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "60.046"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Communications and Networking: \nDevelop the scientific foundation and understanding of wireless communications and networking technologies that enable the Naval warfighter to maintain access to mission critical information in contested environments. Research thrust areas include:\nTactical Communications: \n- Complete cross-layer cooperation and relay forwarding with improved throughput\n- Complete multicast network coding\n- Continue interference alignment studies with improved source and channel coding for better interference management. Transitioned to a 6.2 Applied Research program for prototyping with digital chaos.\n- Continue developing new techniques for wireless distributed computing and device-to-device communication\n- Initiate development of new algorithmic framework for signal retrieval using non-uniform sparse array geometries \n- Initiate novel wireless communications methods across air-water boundary\n\nTactical Networks:\n- Complete developing principles of a Wireless Network Operating System. Transitioned to a 6.2 Applied Research program for software implementation.  \n- Complete unified approach to fast-converging multipath congestion control, scheduling and routing\n- Continue developing a feedback control model to determine the limit of fast adaptive traffic engineering.\n- Continue investigations in to new algorithms, protocols and middleware for dynamic and scalable multi-hop ad hoc wireless networking in contested environments  \n- Initiate Artificial Intelligence\/Machine Learning (AI\/ML) techniques for multi-dimensional Quality-of-Service optimization\n- Initiate development of cognitive methods and algorithms to maintain network resiliency  under link disruptions without adding excess overhead \n\nQuantum Information Sciences \n- Continue research on novel techniques for controlling quantum states to improve performance of surveillance and navigation sensors and clocks \n- Continue research on integrated chips for quantum information processing enabled by quantum optics for potential improvements in surveillance and communications\n- Initiate research on demonstrations of systems having a quantum advantage in the solution of optimization problems and quantum simulation of complex physical systems\n   \nNanoscale Computing Devices and Systems \n- Complete research on neuromorphic chip design and testing. Next phase will be systems level prototyping, carried out under the Technology Candidate program \n- Continue research on ultra-low power nanoelectronic devices, circuits and systems \n- Continue research on atomic precision control of graphene nanostructures using chemical synthesis techniques \n- Continue research on spin based electronics, focusing on single atom and single molecule level control\n- Initiate research on carbon based quantum systems that are compatible with bottom-up chemical synthesis paradigm \n\nMathematical Data Science \n- Complete research in decision-making under uncertainty using game-theoretic approaches.\n- Continue basic research in mathematics, probability, statistics, signal processing, machine learning, data engineering, and information theory. \n- Initiate research on privacy in complex networks. \n\nMachine Learning, Reasoning and Intelligence \n- Continue developing the science base and computational methods for building versatile intelligent agents which can function autonomously in uncertain, unstructured, uncontrolled, open-world environments, and can collaborate seamlessly with humans and other agents.\n- Initiate program in developing new mathematical methods for principled design of deep learning architectures and analysis of their behavior. Deep learning is a powerful technique for knowledge acquisition and model-building, however mathematical tools for predicting their performance in cases for which they are not trained does not yet exist. Thus far, deploying learning-based intelligent systems require exhaustive and expensive empirical verification. This program is expected to develop techniques for predicting performance learning-based systems, to improve their generalization abilities, and to reduce the need for empirical verification.\n\nApplied and Computational Analysis Program\n- Continue to develop robust, reliable and near-real-time computational models for predicting environmental behavior , i.e. atmospheric, oceanic, and material sciences.  Research areas include: \n-Multi-Scale\/Multi-Physics Modeling:  Hydrodynamics, salinity and thermodynamics \n-Dynamical Systems and Oceanic and Atmospheric Modeling:  Develop mathematical tools to understand the complex structure of the oceans and atmosphere\n-Inverse Methods:  Develop mathematical tools for acoustics, electromagnetism and optics.\n\nCyber Security and Complex Software Systems \n- Complete research on ONR invented BFT++ classes of CPS resiliency, as it has transitioned to FNCs\n- Complete research and development of de-bloating and de-layering of COTS for attach surface reduction, as the projects have transitioned to INP.\n- Continue ONR signature research on automated exploration of cryptographic algorithms\n- Continue further development of heterogeneous processing operating systems & compiler (Popcorn Linux) for supporting hypervisors and virtualization, building an alternative cloud infrastructure that is more efficient, powerful and secure.\n- Continue to explore novel application  of ONR's concept of hybrid, formal-statistical machine learning (Learn2Reason) in cyber security and software systems environment\n- Continue to explore variations of physics-based cyber physical system security approaches beyond ONR's BFT++\n- Continue to improve scalability and capability of bottom-up (binary) formal methods\n- Continue further development of  capability for automatic generation of material decoys (Noise Factory)\n- Initiate Investigation on security aspect of non-volatile main memory usage for future computing systems\n- Initiate research on applications & efficacy of autonomic computing for cyber physical systems\n\nNetworked Sensing \nThe primary focus of the Networked Sensing program is to conduct basic research in optical components and infrared technologies to enable significant leap-ahead capabilities for the survivability and lethality of Naval forces in complex environments.  \n- Complete efforts that explored computational imaging techniques for next-generation waveform design for active three-dimensional imaging and measuring and inverting the effects of light scattering on imaging (e.g., seeing through fog).  \n- Continue efforts exploring advanced photonics techniques to maximize information extraction from individual photons and through tailored optical beams with the goal of being able to image at long-ranges and in degraded conditions.   \n- Continue efforts on fundamental implications of classical entanglement on imaging and metrology.\n- Initiate efforts to discover highly-sensitive, multi-spectral detector materials and active sensing modalities for imaging through clouds, fog, haze and dust.\n\nMathematical Optimization and Operations Research \n- Complete advances to special continuous nonconvex programs wherein both the objective to be optimized and the restrictions that enforce the system characteristics are expressed in terms of decision variables that are allowed to realize a continuum of values. \n- Complete advances to stochastic optimization that include a framework for distributed decomposition of different classes of large-scale problems, and the solving of real-size instances of nonlinear chance-constrained stochastic programs. \n- Complete the development of new families of cutting planes that effectively remove infeasible or non-optimal solutions from consideration. \n- Complete a major update of the Pajarito mixed-integer nonlinear programming solver; this code is the fastest open-source mixed-integer second order conic program software.\n- Continue investigations on discrete and nonlinear-continuous programs for which input parameters are known with certainty, but for which the acquisition of optimal decision strategies can be computationally intensive. \n- Continue research on optimizing stochastic programs that, due to incomplete or partial information, have input parameters that are not known with certainty. \n- Continue to Identify exploitable mathematical structures within specific decision problems for the purpose of devising superior solution algorithms.\n- Initiate new methods for strategically formulating and solving optimization problems that arise in resource allocation, logistics, and system planning.\n\nScience of Artificial Intelligence (AI)\n- Explore principled computational frameworks for integrating domain knowledge and machine learning for fast robust learning of diverse, complex concepts and tasks with light supervision. Domain knowledge includes physical models as well as rules, relations and semantic descriptions. A complementary objective is to gain insights into how humans incorporate prior knowledge and learning from scant data to improve their skills and learn new concepts and tasks, and use these insights to inform the computational framework.\n- Explore artificial intelligence in support of collaborative, complex command decision making. The objectives are to advance the scientific understanding of collaborative complex-decision making that is typical of Naval command decision making, and to develop AI technologies that actively inform and assist either in individual tasks or in the overall decision-making process. Key features of the desired technologies are that they possess the ability to assess the relative meaning and the context-sensitive importance of new or changing information, and convey or explain the basis of their recommendations in human-understandable terms.\n- Decentralized perception and planning in dynamics environments. The objective is to develop a unified framework for perception and planning for resources distributed across multiple platforms (agents, platforms, autonomous systems or vehicle swarms) to exploit the massive, diverse data obtained, while subject to communication limitations.  Efforts in distributed artificial intelligence will identify principles and tractable computational methods for flexible and resilient approaches to learning, sharing, reasoning, and decentralized situation awareness and action planning.  4.  Efforts will develop new brain-inspired artificial intelligence algorithms and architectures that provide richer computational capabilities than current deep learning networks and to model compact neuromorphic hardware suitable for edge computing and signal processing in small Naval platforms.\n\nInformation Technology \n- Address the continued need for improving the operational capability of Naval information and communication systems in the areas of: high assurance software; secure tactical connectivity; AI and autonomy; and the processing, integration, and presentation of information. The expected payoff is: the development of improved methods for producing, analyzing, and securing Naval software systems; new design concepts for future Naval tactical communication systems and networks; intelligent autonomy and improved interaction with autonomous systems; and improved methods for information analysis, fusion, and presentation. New research projects will deliver technology for improved AI inference and human\/AI interaction,  predictive models for human cognitive performance, models for predicting and controlling complex networks in uncertain and hostile environments, and technology for improved presentation of complex, information-rich datasets."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This funding increase from FY 2020 to FY 2021 is in response to the CNO Design for Maritime Supremacy 2.0, instructing ONR to advance and guide AI fundamental research enabling: AI verification methods; long-duration missions for Naval unmanned surface ships; AI processing at the tactical edge; intelligent agents that rapidly learn, generate high-volume course of action excursions and assist humans in making collaborative, complex decisions, and achieve the goal of enabling our sailors and marines to make better decisions faster than our adversaries in dynamic environments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Materials\/Processes"
                                    },
                                    "Description": {
                                        "val": "Lighter, faster, stronger is a winning combination. Naval materials research produces quieter submarines, fuel-efficient ships\/vehicles and systems capable of operating under extreme temperature and chemical environments. New materials will result in warfighting advantages, as well as, systems that ensure environmental compliance, improved system reliability\/resilience, stealthier materials, reduced manufacturing\/maintenance and lower total ownership costs.  \n\nThe efforts research focus include: structural materials; functional materials; maintenance reduction; undersea warfare, physics and chemistry of materials, and manufacturing science. \n\nAccomplishments and plans described below are examples for each effort category. This activity also includes peer-review basic research to develop innovative solutions and enhance the science and engineering base. \n\n\n\nBeginning in FY 2020, The Environmental Science thrust has been re-aligned under Functional Materials to address the evolution of work within this program area."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "56.957"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "58.636"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Structural Materials\n \nConduct basic research related to critical science and technology (S&T) for structural materials, including, but not limited to, the following: structural metals, polymer composite materials, solid mechanics, propulsion materials, sensors & non-destructive evaluation (NDE) prognostics and structural cellular materials. \n\nFunctional Materials (Formerly Environmental Science)\n\nConduct basic research related to critical S&T for functional materials, including, but not limited to, the following: transduction materials, acoustic transduction science, nanoparticles, oxide materials, and anti-fouling and fouling release coatings including investigation of effect of new polymers, materials, processes, and novel testing methodologies for coating efficacy for environmental quality control.\n\nMaintenance Reduction \n\nConduct basic research related to critical S&T for maintenance reduction, including, but not limited to, the following: corrosion models, stainless steel carburization, corrosion, and coatings. \n\nManufacturing Science\n\nAdditive Manufacturing (AM) using structural metals is of particular interest to the Navy for a wide variety of applications. However, the composition and properties of the AM alloy can change significantly during deposition, requiring new alloy development efforts to determine the initial composition that will produce the intended composition and properties in the AM-fabricated component.  This effort will begin to address the need by designing, developing and optimizing new metallic alloy compositions for AM that are resistant to the effects of the Naval\/maritime environment.\n\nMaterials and Chemistry\n\nDesigning advanced materials depends on novel synthesis, processing, characterization, and performance. This effort addresses all materials including metals, alloys, ceramics, composites, semiconducting and superconducting material and bimolecular materials.  Some examples of ongoing studies are (1) uncovering the physical, chemical, optical and biological phenomena in the nanometer scale, (2) understanding the effect of coatings on the conductions of ions and electrons, (3) developing better understanding on the performance of spin-polarized electrons for advanced electronic switches and memories, (4) developing fundamental understanding of electron transfer and carbon fixation pathways in microbial consortia and relate them to energy harvesting, material synthesis ans sensing, (5) understanding the mechanism of bioactuation for novel would healing applications, biocatalysis for mitigation and sensing, biocorrosion\/fouling for improving operational efficiency and reducing operational maintanace cost, (6) computational capabilities to understand the microstructures\/defects in metals and alloys of Naval interest, computational fluid dymnamics simulations for jet engine noise reduction, flapping wing design to hypersonics. Several accomplishments have been demonstrated for materials using 3D printing, mobility of electrons of one spin, design of microbial cells to extract power from the coastal ocean sediments.\n\nUndersea Warfare  \n\nLaboratory and theoretical\/numerical studies focused on creating new techniques for understanding, predicting, and controlling the interactions between acoustic and elastic waves such as:  underwater coupling architectures that achieve a broad range of acoustic impedances; and the creation of high efficiency silicon based thin film thermoelectric modules for undersea warfare applications by exploiting nanocrystallization, multilayering to control thermal conductivity."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "56.784"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "56.784"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Structural Materials \n- Conduct basic research related to critical science and technology (S&T) of the composition-processing-structure-property relationships that define structural materials capabilities using and enabling an Integrated Computational Materials Engineering (ICME) approach to build, capture and exploit understanding of key materials systems including, but not limited to, the following: structural metals, polymer composite materials, solid mechanics, propulsion materials, and additive manufacturing.\n\nFunctional Materials \n- Conduct basic research related to critical S&T for functional materials, including, but not limited to, the following: transduction materials, acoustic transduction science, and anti-fouling and fouling release coatings including investigation of effect of new polymers, materials, processes, and novel testing methodologies for coating efficacy for environmental quality control.\n\nManufacturing\n- Conduct basic research related to critical S&T for manufacturing science to develop a fundamental understanding of the processes and materials to enable advances in manufacturing technology for naval systems. \n- Efforts include, but are not limited to, the following: multidisciplinary research task into furthering the sciences associated with advances in manufacturing processes, using Integrated Computational Materials Engineering (ICME) approach to develop new naval advanced manufactured (AM) alloys, determining the effects of alloy chemistry, AM parameters and post processing on mechanical and corrosion properties and developing new alloys for expeditionary AM use without post processing.\n\nMaterials and Chemistry\n- Conduct efforts on: atomistic simulations of complex materials chemistry and solid state physics including characterization and control of dopants and defects at the single-atom-scale, 2D materials, heterostructure processing and properties; nanoscale design, synthesis, processing and characterization of functionalized particles, surfaces and solids; magentoekectronics, spintronics, topological phases and two dimensional materials for low power, high speed microelectronics; surface chemistry for advanced catalytic functions supporting advanced synthesis and processing, nanoscale driven reaction and transport mechanisms for power and energy, corrosion science and electrochemical current control; and direct control of a material's magnetic order through metamagnetic phase transitions to enable tunable, ultra-low power and high speed components for electronic and energy harvesting.\n\nUndersea Materials\n- Laboratory and theoretical\/numerical studies focus on creating new techniques for understanding, predicting, and controlling the interactions between acoustic and elastic waves such as: underwater coupling architectures that achieve a broad range of acoustic impedances;  the creation of high efficiency silicon based thin film thermoelectric modules for undersea warfare applications by exploiting nanocrystallization, multilayering to control thermal conductivity; and the creation of high performance transducer materials, such as textured ferroelectric ceramics, to achieve high power performance at reduced cost and complexity."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2020 to FY 2021 is due to decreased investment in basic research associated with Undersea Materials and research associated with the interactions between acoustic and elastic waves."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medical and Biological Sciences"
                                    },
                                    "Description": {
                                        "val": "The health and performance of Sailors and Marines is a top priority. Extensive research in the medical and biological sciences discover and leverage breakthroughs to improve naval warfighter performance, so they can fight, win and come home safe. Sailors and Marines operate in the harshest working environments at sea and around the world. Conducting research, developing new equipment and gaining a better understanding of challenges in their operating environments will ensure optimal performance, prevent harm and equip the DON to provide the best care for its warfighters.\n\nDiscover and leverage emerging multi-disciplinary basic research to improve warfighter health within areas including bio-inspired autonomous systems; bioengineering; biophysics; synthetic biology; microbial electrochemical systems and microbiome research; bio-inspired multi-spectral camouflage; sensory neuroscience and physiology; Naval force health protection; undersea medicine; health monitoring and modeling research; and health and welfare of the Navy's marine mammals."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.159"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.707"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Bio-Inspired Autonomous Systems\n\nDevelop bio-inspired propulsion and control systems that enable high-lift, stealthy propulsion without propellers and achieve high maneuverability for underwater vehicles. Efforts include: (i) Bio-sensing for sensorimotor control; (ii) Bio-inspired design principles for distributed sensing, actuation and control in soft biological structures; and (iii) Principles of locomotion of amphibious animals to enable bio-inspired amphibious and cross-domain vehicles. \n\nBioengineering and Life Sciences\n\nDevelop DNA-based nanostructures for fundamental circuits and biosensing; biomimetic and bio-inspired underwater adhesives; biopolymer energy sources; and explore approaches to generate nanomaterials by design. Pursue research in biological and bio-inspired, water-responsive materials for energy conversion and actuators. Maintain the health and fitness of the U.S. Navy's marine mammals for duty and readiness.\n\nNaval Biosciences and Synthetic Biology for Naval Applications\n\nDevelop research on synthetic biology for bioelectronics devices, materials, and information processing. Efforts include: (i) Elucidating microbe-materials interactions and extracellular electron transfer mechanisms for detection of materials defects\/failures, identifying novel biogenic structures, and improving microbial electrochemical functions; (ii) Exploring the role of the human microbiome in host response to behavioral and physical stressors; (iii) Developing synthetic biology approaches to enable manipulation of microbiome organisms for Warfighter resilience or status monitoring; (iv) Executing research on synthetic biology approaches to enable novel bioelectronics and information processing strategies. \n\nWarfighter Augmentation\n\nDevelop cognitive and physiological systems that enable human performance to exceed current limitations, including novel adaptations to inhospitable environments. Efforts include: Alternative oxygen sources, epigenetic modifications of globin protein expression for variable regulation of oxygen tissue supplies, bionics, texture-shifting of biological organisms, and multi-functional textiles. \n\nSensory Neuroscience and Physiology\n\nInvestigate neurological pathways of sensory systems including: (i) Examining mechanisms of nerve cell and axonal fiber deterioration in high noise environments; (ii) Accelerating understanding of nerve cell and axonal regeneration; and (iii) Exploring novel treatment strategies for hearing restoration. \n\nPhysiological Monitoring and Modeling\n\nDevelop fundamental mechanisms that enable prediction and identification of cognitive and physical performance levels in extreme expeditionary environments. Design novel low-powered sensing capabilities. \n\nNaval Force Health Protection\n\nDiscover technologies including: (i) Novel modeling and simulation approaches to improve Warfighter protection; (ii) Maritime casualty care; and (iii) Medical logistics through optimized design, development, and operational planning. \n\nUndersea Medicine and Performance\n\nDevelop cognitive and physiological responses in undersea environments to expand the operational envelope (e.g. depth and time) for divers and combat swimmers. Explore enhancement of human physiology with pharmacological agents and other therapies to protect humans from undersea environmental challenges.\n\nStress Responses\n\nDevelop impact of military operational environments on biomarkers predictive of individual Warfighter's reactivity to stress. Explore effects of chronic stress in conjunction with circadian cycle changes on these biomarkers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.648"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.648"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Bio-Inspired Autonomous Systems\n- Conduct discovery research on bio-inspired propulsion that enables stealthy propulsion and amphibious ability. Explore bio-inspired closed loop control with biosensor for obstacle avoidance, and high maneuverability. Explore schooling and swarming based on previously identified principles of bio sensing.\n\nBioengineering and Life Sciences\n- Conduct development of nanometer-sized, 1-, 2-, and 3-dimensional DNA nanostructures with no undesired side products; a semiconductor chip-based device for massively parallel electronic detection of DNA sequences using reconfigurable DNA nanostructures as detectors; and DNA-based approaches for creating chemically-addressable systems with nm-scale precision over mm-scale ranges.  \n\n- Extend exploring the influence of charge on the bonding of adhesive polymers, the delivery of adhesives underwater using a combination of oppositely charged polymers, and the generation of adhesives from biological polymers. \n- Carry on with discovery research on the mechanisms underlying the water-responsive behaviors of bacterial spores. Further explore silk-based biomaterials for energy harvesting and energy storage.\n\n- Move-Forward to combine machine learning with multiscale computational modeling to design biological composite materials with any optimized material functions.  \n\nNaval Biosciences and Synthetic Biology for Naval Applications\n- Research directed toward engineering biological systems for microbial-based sensing, bio-electronics\/electronic materials, and microbiome strategies for warfighter augmentation. Efforts include: synthetic biology studies of electroactive microbial chassis to enable opto-electronic sensing, signaling and electronic materials; elucidating natural\/engineered microbial mechanisms of biogenic mineral synthesis and sequestration (including rare-earth minerals); investing synthetic biology approaches for designing microbes\/microbial communities to enhance warfighter resilience and sensory capabilities.\n\nWarfighter Augmentation\n- Conduct discovery research on bio-inspired mechanisms to develop multi-spectral camouflage technologies. Efforts include texture and shape modulation, color adaptation, near to far infrared concealment, and mechanisms for tunable regulation of multi-functional textiles.\n\nSensory Neuroscience and Physiology\n- Investigate means for enhancing warfighter sensory perception, including exploration of neurological pathways of the auditory system. Advance strategies to improve sound localization, augment auditory function, and discover novel treatments for auditory injury mitigation and therapy.\n\nPhysiological Monitoring and Modeling\n- Conduct discovery research on novel sensing capabilities and biomarkers for understanding individual biological functions. Further improve physiologic signal monitoring capabilities that exceed current capabilities. Explore innovative technologies for real-time sensing and observation of individual responses to environmental and operational stressors.\n\nNaval Force Health Protection\n- Conduct exploration of computational models and soft material properties to predict warfighter injuries. Results will guide future development of protective gear and casualty prevention strategies.  Conduct discovery research on novel nanoscale therapeutics for treating expeditionary traumas. Explore autonomy as a means to prolonged casualty care and evacuation.  \n\nUndersea Medicine\n- Further our understanding of human physiology in the extreme conditions experienced in the undersea environment and compare this to marine mammals, which have adapted to these conditions.  Explore oxygen availability in the ocean for novel approaches to undersea life support.  Transitioned pharmacological candidates to applied research efforts to validate efficacy and refine treatment protocol.\n\nStress Response\n- Conduct discovery research on human performance in stressful or austere environments and on indicators (e.g. biomarkers) of human vulnerability and human resilience. Explore the effects of circadian rhythm disruption combined with chronic variable stress on the neuroimmunoendocrine stress axis."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2020 to FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ocean Sciences"
                                    },
                                    "Description": {
                                        "val": "Understanding and predicting oceanographic phenomena provides significant warfighting advantages to naval forces. Ocean Sciences research addresses the full spectrum of physical oceanography to enable observation, modeling, and prediction of the maritime environment.  Efforts include: studying common operating areas for naval forces in the open oceans, the Arctic and littorals; elucidating the coupling between oceanographic and acoustical phenomena relevant to such mission areas such as Anti-Submarine Warfare and Mine Warfare; development of global, regional and local predictive models that fully couple the ocean-atmosphere-wave-ice domains; development and use of autonomous systems for the collection of environmental observations and continuing support to research vessels of the U.S. Academic Research Fleet to enable at-sea oceanographic science.\n\nResearch within the Ocean Sciences subactivity responds to the mission needs of the Oceanographer of the Navy's mission. At-sea research involves ancillary studies to ensure full compliance with environmental requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "74.420"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "81.641"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Physical Oceanography and Prediction\n\nComplete studies of the flow encountering abrupt topography in the Western Pacific on the mean and transient circulation structures. Continue the study of multi-scale embedded modeling and prediction. Conduct the studies of the prediction of and observations of 3-D Lagrangian studies and abilities to predict the vertical pathways in the ocean. Conduct the evaluation of novel employment of instrumentation including drifters and unmanned undersea vehicles to study these 3-D Lagrangian structures. Conduct the studies of the input and fate of near-initial shear and energy in the ocean via observational and predictive studies in the Greenland, Ireland, United Kingdom (GIUK) regions. Conduct the evaluation and testing and \"hardening\" of ocean instrumentation in high wave states and austere conditions. Conduct the study of the improvement of prediction systems by identifying, targeting, and obtaining key observations in critical targeted areas. Continue the evaluation of novel delivery systems of expeditionary ocean instrumentation to support targeted observing.\n  \nLittoral Geosciences and Optics  \n\nDevelop methodologies and\/or observing technologies, for air, sea surface or subsurface, manned or unmanned, which are: a) nimble, cost-effective, rapidly re-locatable, or will offer bold insight into littoral dynamics, (e.g., tagging of marine seabirds in the Distributed, Autonomous, Scalable Hydrographic Charting and Meteorology and Oceanography (METOC) Sampling (DASHCAMS) Department Research Initiative (DRI)), or b) utilize sensors on operational platforms in ways which increase battlespace awareness or can be used to map the maritime domain while idle. Conduct studies and modeling of shelf, near-shore, delta, estuarine, and riverine dynamics, including surface and internal waves, currents, stratification, sediment transport and the seabed response (Inner Shelf DRI) and coastal winds driving shallow water response (Coastal Land-Air-Sea DRI). Conduct studies to understand shallow water features which will affect acoustic propagation or acoustic system performance (Undersea Remote Sensing DRI) and\/or events which cause swimmer or navigational hazards (bathymetry-wave-current-wind interactions). Conduct studies using remote sensing of the coastal and riverine environment, above and below the sea surface and canopy, using electro-optic (EO), infrared (IR), radar, synthetic aperture radar (SAR),interferometric SAR (inSAR) and acoustic, from land or ship-based, unmanned vehicles, airplanes or satellites (Undersea Remote Sensing DRI). Develop new remote sensing tools and algorithms that can be used to initialize forecast models in distant, remote and\/or denied areas. Conduct modeling and field studies of storm processes affecting the littoral environment, including the atmosphere, sea surface, water column, sea bed and suspended or dissolved materials. Predicting the initiation, transport and\/or erosion of materials in response to storm events that create navigationally significant bathymetry or traffic-ability changes and\/or changes in optical clarity.\n\nMarine Mammals and Biology \n\nAreas of research include monitoring and detection, integrated ecosystem, and effects of sound on marine mammals. Conduct basic research to develop and test new and existing technology to detect, classify, localize and potentially track marine mammals in the marine environment, which are used to develop density and abundance estimates of marine mammals as a required input for all Navy sound effects modeling done under mandate of the federal Marine Mammal Protection Act and National Environmental Policy Act. Conduct multidisciplinary studies including tagging, visual surveys, and passive acoustics to collect baseline measures of marine mammal behaviors and distributions relative to environmental features and marine mammal prey fields. These baseline measures provide a context for interpreting responses to naval acoustic sources. Also, continue research on the effects of sound include behavioral, physiological (hearing and stress response), and population-level consequences of sound exposure on marine life. Conduct research to characterize the gas management and kinetics (stores and use) in marine mammals. Conduct research using increase in funds to characterize and quantify the cumulative effects of multiple stressors on marine mammal populations. Conduct research to advance our understanding of sound reception mechanisms in mysticetes (large whales).\n\nEffects of Sound \n\nResearch on behavioral, physiological (hearing and stress response), and potentially population-level consequences of sound exposure on marine life. Research to characterize the causal chain of events leading from sound exposure to biologically significant behavioral reactions that might increase risks of population-level effects and\/or the potential for stranding. An additional focus is to characterize the gas management and kinetics (stores and use) in marine mammals. Research the mechanisms that enable marine mammals to dive to deep depths for long durations while mitigating, if not avoiding, health threats. Initiate research to advance our understanding of sound reception mechanisms in mysticetes (large whales) will require a thorough exploration of the anatomy surrounding the ear and the whole head combined with modeling sound propagation through various tissues of whale heads and\/or bodies. Another research focus is to better understand the stress response in marine mammals to sound exposure. Research on understanding of the natural variation of stress markers, better understand and characterize the relationships among hormones or other biomarkers in different matrices, define and compare the quantitative and temporal relationships of hormones across the different matrices, and evaluate and characterize the relationship between the physiological stress response in marine mammals and acoustic exposure and biologically significant disturbance. Research to develop statistical models of the population consequences of acoustic disturbance to be fitted to data from marine mammal populations and lead collaborative development of transferable models of the effects of disturbance on marine mammals.\n\nMonitoring and Detection\n\nResearch to develop and test new and existing technology to detect and classify marine mammals in the marine environment and during periods of low light such as passive acoustics, and infrared (IR). Research and development of passive acoustic signal processing algorithms for detection, classification, and localization of marine mammals. Continue the development and testing of autonomous hardware platforms using passive acoustics and\/or IR to detect and classify marine mammals using a variety of fixed, towed, floating, and profiling platforms. \n\nArctic sciences \n\nResearch to improve the understanding of physical processes in the Arctic environment that impact current and projected Naval operations. Efforts include research to characterize the behavior of sea ice, including melt and reformation, ice rheology and motion, and interactions with ocean stratification, surface waves, and the atmosphere. The research program includes development of Arctic System models and data assimilation techniques for improved prediction, exploration and development of new sensors and unmanned platforms to collect observations of the Arctic environment, and the research into new algorithms to characterize sea ice from space-based remote sensing. An effort to better understand processes controlling the stratification of the Arctic Ocean will conclude this year. \n\nOcean Acoustics \n\nExpand research to understand propagation and scattering of acoustic energy in a wide range of ocean environments. New emphasis will be placed on the information content contained in underwater acoustic signals for use in machine learning\/big-data analytics. Areas of research include shallow-water scattering mechanisms related to reverberation and clutter; seabed acoustic measurements supporting geo-acoustic inversion; acoustic propagation through internal waves and coastal ocean processes and the development of unified ocean\/seabed\/acoustic models, including scattering from rough surfaces, biologics and bubbles; and penetration\/propagation within the porous seafloor. In deep water research will include the effects of environmental variability induced by ocean internal waves, internal tides and mesoscale processes, and by bathymetric features including seamounts and ridges, on the stability, statistics, spatial distribution, and predictability of broadband acoustic signals. Also of interest is the coherence and depth dependence of deep-water ambient noise. An increasing emphasis will be placed on understanding the effects of Arctic conditions on acoustic propagation and ambient noise, particularly in under-ice environments, as facilitated by a basin wide data collection effort scheduled to begin in FY 2020.\n\nBattlespace Environments \n\nThe overall objective of this research is to improve basic understanding of physical, seafloor and biological oceanographic processes on space and time scales of naval interest. The work includes studies of aspects of ocean\ncirculation (fronts, eddies and turbulence), thermodynamics (mixing and acoustic impacts), waves (including their impact on sea ice and rogue waves), sea ice (including land fast ice) as well as ocean boundary layer processes.\nEmphasis is on improved measurements, laboratory and model based experiments to quantify and understand important oceanographic processes that lead to the development of ocean dynamic\/thermodynamic models from global to submesoscale\nscales, and to couple these oceanographic models with atmospheric, ice, biological, sediment response, and optical models. Surveillance of coastal land areas and waters is important to support Navy operations, so the research\nfoci include an improved use of overhead (airborne and satellite) active and passive microwave sensors, overhead optical sensors, surface-based (ships and ground-based) grazing angle microwave sensors. To predict bottom boundary\nphysical, geological, geochemical, geoacoustic and geotechnical properties in shallow-water operating areas requires: a) an improved understanding of processes that generate and modify the shape, structure and physical properties of the seafloor, subsea floor, ocean water column and ice-cover and topography\/morphology; b) use of rapid, airborne characterization of littoral environments including time-varying coastal topography, littoral bathymetry, sea-level height, land and seafloor sedimentary structures to explain\/predict the observed changes; c) remote sensing of bulk properties of Arctic sea-ice over broad two-dimensional areas that previously could be sampled only at spot\nlocations by in-situ sampling; and d) quantification of the influence of turbulence generated at the seafloor boundary layer on vertical mixing and stratification in shallow water outside the surf zone."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "82.968"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "82.968"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Physical Oceanography and Prediction\nAreas of research include ocean circulation, thermodynamics and mixing, and the dynamics of surface gravity waves, nonlinear internal waves and the interaction of waves with sea ice in order to inform a basic understanding of sub-mesoscale physical oceanography parameters from the tropics to the poles. Sub-mesoscale understanding of the ocean is necessary to support the required fidelity and accuracy of ocean feature inputs to navy warfighting applications. \n- The studies of monsoon intraseasonal variability and air-sea interaction in the Bay of Bengal in the Indian Ocean will complete in FY21. \n- The three-dimensional Lagrangian ocean circulation and the prediction of vertical pathways in the ocean will continue its studies.\n- The input and fate of near-initial shear and energy in the ocean via observational and predictive studies in the Greenland, Iceland, United Kingdom (GIUK) regions will continue its studies.\n- The novel delivery systems of expeditionary ocean instrumentation to support targeted observing will continue its evaluation.\n- The ocean fronts, eddies and turbulence; ocean thermodynamics including mixing and acoustic impacts; ocean boundary layer processes and surface gravity waves in sea ice and rogue waves will continue its studies. \n- The study on the rapid evolution of the upper ocean in the high North Atlantic between Iceland and the European continent to better understand the physical processes that control vertical and horizontal density structures in the upper ocean will initiate in FY21. \n- The seasonal variability of processes that control sea surface temperature in the Arabian Sea to understand the relevant space and time scales that will enable improved prediction of extended range ocean and weather forecasts through the reduction of ocean temperature biases in coupled models will initiate a study to explore in FY21.\n\nLittoral Geosciences and Optics\nAreas of research include understanding processes and predicting the evolution of the highly nonlinear, coupled nearshore region in which mutual interactions of the atmosphere, sea surface, water column and seabed are all important.  \n- The modeling and field studies of high spatial and temporal resolution coastal land-air-sea interactions and their role in creating atmospheric electromagnetic ducting will initiate its fundamental theoretical in FY21. The objective is to resolve wind forcing in coastal areas in order to more accurately force coastal wave and current models and understand when ducting may occur in such land-air-sea configurations as nearshore mountains, estuaries and urban coastal environments. \n- The rocky coasts which line a significant portion of the world's coastline but have been poorly studied will initiate the systematic studies in FY21.\n- The autonomous, scalable, hydrographic charting and parameter sampling littoral studies using autonomous systems paired with remote sensing will initiate and distributed in FY21.\n- The ocean phenomenologies that can be sensed via airborne and satellite active and passive microwave sensors, overhead optical sensors, and ship or shore-based grazing angle microwave sensors to enable surveillance of the entire battlespace environment will continue research in FY21.\n- The sonar undersea remote sensing using autonomous underwater vehicles in conjunction with land, air and satellite remote sensing will continue its efforts in FY21.  The objective is to both provide subsea interpretation of undersea dynamics from sonar remote sensing, and to provide the subsea structure of surface dynamics\/manifestations viewed from space.\n- The predict physical, geological, geochemical, geoacoustic and geotechnical properties of the seafloor in shallow-water operating environments will continue its research in FY21.\n- The field and modeling efforts to elucidate inner shelf dynamics will conclude in FY21. \n\nMarine Mammals and Biology\nAreas of research include monitoring and detection, integrated ecosystem, and effects of sound on marine mammals. \n- Carry out multidisciplinary studies including tagging, visual surveys, and passive acoustics to study baseline measures of marine mammal behaviors and distributions relative to environmental features and marine mammal prey fields. Research on behavioral, physiological and population-level consequences of sound exposure on marine life. \n- Conduct physiological studies of diving in marine mammals. The objective is to understand the mechanisms that enable marine mammals to dive to deep depths for long durations while mitigating or avoiding health threats. \n- Extend to study the sound reception mechanisms in large whales through the exploration of the anatomy and sound propagation through various tissues. The objective is to estimate the hearing range of large whales with a particularly emphasis to identify the regions of greatest sensitivity.\n- Move forward to characterize the stress response in marine mammals to sound exposure and how it may affect animal health, fitness, and survival. Research objectives are to study the natural variation of stress markers, better understand and characterize the relationships among hormones or other biomarkers, and define and compare the quantitative and temporal relationships of hormones. Increased emphasis will be on studies to evaluate and characterize the relationship between the physiological stress response via hormones and biomarkers in marine mammal immune status, and animal health and biologically significant effects on individual fitness and survival. \n- Extend studies to develop statistical models of the population consequences of acoustic disturbance. The objective is to characterize the causal chain of events leading from sound exposure to biologically significant behavioral and physiological.\n- Conduct research to develop technologies to detect and classify marine mammals in the marine environment to provide marine mammal density and abundance estimates required for Navy sound effects modeling done under mandate of the federal Marine Mammal Protection Act (MMPA) and National Environmental Policy Act (ESA).\n\nArctic Sciences\nAreas of research include the complex processes governing the interaction of the arctic atmosphere, ocean, and sea ice, including formation, deformation, and melting.  Physical processes in the arctic environs are inherently different from those in non-polar regions. \n- Finished stratified ocean dynamics in the Arctic (SODA) research initiative to better understand the evolving oceanic structures and interaction of fresh and salt water in the high latitudes.\n- Ended the sea ice dynamics experiments (SIDEx) research initiative to better understand the impact of increasing open water on the formation, evolution and disintegration of the Arctic ice pack.\n- Extend Arctic fieldwork to characterize the behavior of sea ice, including melt and reformation, ice rheology and motion, and interactions with ocean stratification, surface waves, and the atmosphere. \n- Move forward the development of Arctic System models and data assimilation techniques for improved prediction and development of new sensors and unmanned platforms to collect observations of the Arctic environment, including development new algorithms to characterize sea ice from space-based remote sensing. \n- Conduct the remote sensing of bulk properties of Arctic sea-ice over broad two-dimensional areas that previously could be sampled only by localized in-situ methods.\n\nOcean Acoustics\nAreas of research contribute to improved basic understanding of the physical, seafloor and biological parameters that affect acoustic propagation in the ocean. Accurate acoustic predictions are required to keep our undersea assets undetected as well as to enable the detection and tracking of adversary assets.\n- Conduct research to understand propagation and scattering of acoustic energy in shallow-water ocean environments. Areas of research include shallow-water scattering mechanisms related to reverberation and clutter; seabed acoustic measurements supporting geoacoustic inversion; acoustic propagation through internal waves and coastal ocean processes and the development of unified ocean\/seabed\/acoustic models, including scattering from rough surfaces, biologics and bubbles; and penetration\/propagation within the porous seafloor.\n- Extend the investigation in optimal representations information contained in acoustic data. Specific efforts will include the investigation summary statistics and sparse encoding of underwater acoustic data. The objective is to enable efficient analysis and compact representations of acoustic scenes. \n- Launch efforts in auralization applicable to the ocean battlespace. Specific efforts will include investigations into source separation, characterization, and recombination along with physical, biological, and anthropogenic sound generating mechanisms. An objective is to model and simulate acoustic phenomena in undersea environments to be rendered as virtual soundfields.  \n- Conduct research into the effects of environmental variability induced by ocean internal waves, internal tides and mesoscale processes, and by bathymetric features including seamounts and ridges, on the stability, statistics, spatial distribution, and predictability of broadband acoustic signals. Also of interest is the coherence and depth dependence of deep-water ambient noise. \n- Carry out investigations into the effects of Arctic conditions on acoustic propagation and ambient noise, particularly in under-ice environments, as facilitated by an FY20 trans-arctic basin collection effort. Initiate analysis of data  from the trans-arctic basin collection effort. \n- Launch the joint physical oceanography and acoustic field studies to investigate propagation and scattering in regions characterized by complex bathymetry and\/or meteorological and oceanographic forcing. Specific efforts will include processes studies with the objective of linking observed ocean and acoustic phenomena. An objective is to characterize oceanographic phenomena and the effects on acoustic propagation and scattering at different frequencies.  \n- Begin the efforts in characterizing and forecasting sediment acoustic properties. Specific efforts will include investigations aimed at linking local physical and biological processes to acoustic observables. Continue analysis efforts related to acoustic seabed characterization experiment. Specific efforts will include development and verification of geoacoustic models and inference techniques for soft sediments based on experimental evidence.\n\nBattlespace Environments \n- This research is to improve basic understanding of physical, seafloor and biological oceanographic processes on space and time scales of naval interest. Emphasis is on improved measurements, laboratory and model based experiments to quantify and understand important oceanographic processes that lead to the development of ocean dynamic\/thermodynamic models from global to sub-mesoscale scales, and to couple these oceanographic models with atmospheric, ice, biological, sediment response, and optical models. While today's numerical analysis and prediction systems are more capable of resolving and predicting highly variable phenomena than were the systems of 10-20 years ago, there are still oceanographic processes that are not well understood and must be studied including aspects of ocean circulation (fronts, eddies and turbulence), thermodynamics (mixing and acoustic impacts), waves (including their impact on sea ice and rogue waves), sea ice (including landfast ice) as well as ocean boundary layer processes.  Navy and Marine Corps requirements also include: a) an improved use of overhead (airborne and satellite) active and passive microwave sensors, overhead optical sensors, surface-based (ships and ground-based) grazing angle microwave sensor, b) use of remote sensing of bulk properties of Arctic sea-ice over broad two-dimensional areas that previously could be sampled only at spot locations by in-situ sampling, and c) use of newly available higher resolution (sub-mesoscale) oceanographic data."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2020 to FY 2021 is due to support of enhanced at-sea field experimentation in support of Task Force Ocean activities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Science and Engineering Education, Career Development and Outreach"
                                    },
                                    "Description": {
                                        "val": "Maintaining maritime superiority requires a highly technical naval workforce. Science and Engineering Education, Career Development and Outreach activity addresses the critical need to attract the brightest and cultivate the best. These experiences prepare participants for rewarding Naval civilian careers and build the extra-mural performer base community.\n\nThe efforts research focus include: participation in science fairs, summer research interns\/fellows at Naval laboratories, graduate fellowships for individuals expected to become members of the engineering faculty at Historically Black Colleges and Universities and Minority Institutions (HBCU\/MIs), and curricular enrichment programs. Grants awarded center on Naval research efforts supporting Science, Technology, Engineering and Math (STEM). Outreach includes the encouragement, promotion, planning, coordination and administration of Naval S&T efforts to promote the development of a highly skilled Naval technical workforce.\n\nThe Department of the Navy's (DON) Historically Black Colleges and Universities\/Minority Institutions (HBCU\/MI) program oversees the Navy's efforts to engage and support our nation's HBCU\/MIs and is responsible for developing and managing efforts that strengthen and support the capabilities of HBCU\/MIs to participate in basic, applied, and advanced research programs within the Naval Research Enterprise (NRE). \n\nSCHOOLHOUSE TRAINING: Discovery research on instructional strategies and techniques for schoolhouse training including virtual, augmented, and mixed reality environments. Correlate effective schoolhouse training and measures of downstream performance, including development of theories into skill acquisition and decay. \n\nThe ONR Young Investigator Program (YIP) was established in 1985 to attract outstanding faculty members to the Department of Navy's basic research program by identifying individuals that show exceptional promise for doing creative research and encourage their teaching and research careers through long term support. Young Investigator awards are for a period of three years. Annual request for proposals are solicited via a funding opportunity announcement and is open to tenure-track faculty in science, engineering, and mathematics. Topics are competitively selected based on faculty achievements, technical proposal, benefit to the Navy and Marine Corps, and institution support. \n\nNaval Research Institution: Through a Memorandum of Understanding between the United States Naval Academy (USNA) and the Office of Naval Research, this program contributes to the technical education of midshipmen by providing an opportunity to enhance their experience in research and knowledge of the positive impact that understanding of Science, Technology, Engineering, and Mathematics (STEM) has on fleet and forces capabilities. \n\nFunding also supports the Office of Naval Research (ONR) Global mission to serve as the enduring Navy and Marine Corps global presence in technical and operational communities, investing in trusted partnerships to discover and connect science and technology leaders for sustained maritime security. This is accomplished by establishing quality, relevant connections between the international research and development community, Naval fleet\/forces, Department of Defense (DOD), other US Government agencies and international partners. The direct impact of this investment is to leverage international basic research during increasingly dynamic global interdependence and improve the ability to solve DON Science & Technology challenges through shared knowledge with partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "43.232"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "49.014"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support Science, Technology, Education and Mathematics (STEM) initiatives and multi-year efforts that are intended to be approximately three years in length and in topics supporting STEM education relevant to naval science and technology workforce development. Start development of pilot efforts to improve STEM through the development of new curricula and experiential learning activities that respond to new naval Science and Technology personnel and knowledge needs.  Expand existing successes to scale working projects and achieve greater impact and implementation of funded efforts.  Support new activities to targeting regional efforts to drive greater impact on educational systems and increase workforce opportunity for the naval Science and Technology community. Continue coordination of Department of the Navy (DON) STEM efforts.  This effort will continue to  support programs that provide hands-on research experiences in STEM fields for United States Naval Academy (USNA) midshipmen and faculty members to enhance the midshipmen's educational environment at the USNA.\n\nEnhance and maximize HBCU\/MI's faculty and student awareness of STEM and other defense-related educational research opportunities to make significant contributions to the NRE by increasing the number of students and faculty participating in DoN HBCU\/MI fellowships and internships and increasing the number of Research and Development grants awarded by the DoN HBCU\/MI Program to HBCU\/MIs. Support efforts to provide student internships and faculty fellowships that will increase the capability of Science and Technology efforts into a new age of discovery. Ongoing efforts include attracting student veterans to research and career opportunities in STEM related fields.\n\n25 to 35 Young Investigators are selected for award annually from the many proposals received. Ongoing efforts cover a wide range of topics of naval S&T interest. Recent topics include innovative technical approaches to: vortex flow in hypersonic aerodynamics; real-time accurate positioning in robotics, acoustic meta-materials for marine surfaces, cyclone intensity forecasting, advanced mathematical optimization for statistical applications, cephalopod inspired camouflage, digitization of human performance, soil characterization capability from remote sensing, thermal transport at solid-solid interfaces, and high-temperature multi-principal alloys. These and other research topics will benefit today's and the next generation warfighter by improving lethality, survivability, communications, and training. Additionally, many of these investigators will provide long-term support and knowledge in solving naval related S&T challenges.\n\nONR Global will foster collaboration with international organizations and researchers by awarding grants in innovative basic research to discover, access and assess revolutionary, high-payoff technologies for future Naval missions and capabilities.\n\nSCHOOLHOUSE TRAINING: Discovery research efforts include: (i) Developing optimized training and retention models; (ii) Designing better training schedules; and (iii) Developing skill tutors for maintenance tasks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "42.734"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "42.734"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support Science, Technology, Education and Mathematics (STEM) initiatives and multi-year efforts that are intended to be approximately three years in length and in topics supporting STEM education relevant to naval science and technology workforce development. Start development of pilot efforts to improve STEM through the development of new curricula and experiential learning activities that respond to new naval Science and Technology personnel and knowledge needs. Expand existing successes to scale working projects and achieve greater impact and implementation of funded efforts. Support new activities to targeting regional efforts to drive greater impact on educational systems and increase workforce opportunity for the naval Science and Technology community. Continue coordination of Department of the Navy (DON) STEM efforts. \n\nThis effort will continue to support programs that provide hands-on research experiences in STEM fields for United States Naval Academy (USNA) midshipmen and faculty members to enhance the midshipmen's educational environment at the USNA. \n\nYoung Investigator Program (YIP) \nEach year, 25 to 35 individuals that show exceptional promise for performing creative research receive YIP awards. Topics are competitively selected based on faculty achievements, technical proposal, benefit to the Navy and Marine Corps, and institution support. Ongoing efforts cover a wide range of topics of naval S&T interest. Recent topics include innovative technical approaches to: vortex flow in hypersonic aerodynamics; real-time accurate positioning in robotics, acoustic meta-materials for marine surfaces, cyclone intensity forecasting, advanced mathematical optimization for statistical applications, cephalopod inspired camouflage, digitization of human performance, soil characterization capability from remote sensing, thermal transport at solid-solid interfaces, and high-temperature multi-principal alloys. These and other research topics will benefit today's and the next generation warfighter by improving lethality, survivability, communications, and training. Additionally, many of these investigators will provide long-term support and knowledge in solving naval related S&T challenges. Complete Young Investigator Program projects initiated in fiscal year 2019.\n\nONR Global will continue to foster collaboration with international organizations and researchers by awarding grants in innovative basic research to discover, access and assess revolutionary, high-payoff technologies for future Naval missions and capabilities.\n\nSCHOOLHOUSE TRAINING: Research efforts include: (i) Developing optimized training and retention models; (ii) Designing better training schedules; and (iii) Developing skill tutors for maintenance tasks.\n\nThe Naval Enterprise Partnership Teaming will continue with the Universities for National Entrepreneurship (NEPTUNE) program to promote and sponsor Naval Postgraduate School personnel to conduct research in the areas of Navy Energy Education & Training and course curriculum development for NPS energy-related courses for energy security and energy resiliency.  Additionally, the US Naval Academy (USNA) will perform research on the combustion chemistry of Navy engines and other energy-related areas. Conduct discovery research to develop simulators for teaching dynamic tasks using new cognitive models.  Develop artificial intelligence-based tutors to teach transfer across military career ratings.\n\nHistorically Black Colleges and Universities \/ Minority Institutions (HBCU\/MI)\nExpand the opportunities for HBCU\/MI's faculty and student to participate in fellowships and internships at warfare centers and labs thereby increasing the number of STEM and Defense-related research. Develop new outreach plans to increase the number of HBCU\/MI white paper and grant proposal submissions.  Establish a HBCU\/MI Post-doctoral program that supports the efforts of increasing the number of HBCU\/MI students working within the Navy STEM related fields. Increase the number of science fairs at HBCU\/MI that have partnerships with local schools."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The reduction from FY 2020 to FY 2021 is due to completion of the Basic Research Challenge efforts and Young Investigator Program efforts, and due to the realignment of resources for basic research administered through ONR Global to higher priority Navy requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensors, Electronics and Electronic Warfare (EW)"
                                    },
                                    "Description": {
                                        "val": "Basic research efforts directed toward increasing knowledge, developing components and algorithmic advances for electronics, sensing and electronic warfare to ensure the Navy has the appropriate technologies in order to counter current and future threats.  These efforts are broadly applicable to sensing and electronic warfare on individual Naval platforms, as well as, efforts that seek to integrate capabilities across multiple platforms. \n  \nThe efforts research focus include: sensing, diagnostics, and detectors; navigation and timekeeping; nanoelectronics; wide band gap power devices; real-time targeting; Electro-Optical\/Infra-Red (EO\/IR) electronics; EO\/IR electronic warfare; EO\/IR sensors for surface\/aerospace surveillance; Radio Frequency (RF) sensors for surface\/aerospace surveillance; solid state electronics; vacuum electronics; and RF electronic warfare."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "47.295"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "48.804"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sensors, Electronics and Electronic Warfare (SEEW)\n\nConduct basic research in the areas of solid state transistors and devices for high frequency analog and digital operation; high efficiency, highly linear amplifiers for microwave, millimeter-wave, low-noise, and power applications; superconducting and other technologies which are designed to deliver software defined, wide band, simultaneous signal functionality for conventional system contexts, including, but not limited to, satellite communications (SATCOM), Surveillance, Electronic Warfare (EW), signal intelligence (SIGINT), and communications; electronics and photonics technology that provides for the control, reception, transmission and processing of signals; and continue research to advance navigation, timekeeping and sensing technology, including cooling and trapping of atoms and ions; Bose-Einstein condensation and coherent matter- wave physics; optically-based frequency standards; improved time and frequency metrology using quantum entanglement and quantum logic processing; quantum optomechanics; and coherence and control of quantum systems.\n\nElectronics  \n\nCreate new knowledge and understanding and explore new concepts, components, techniques and methods, for the design, growth, and characterization of electronic, electromagnetic, quantum phenomenology, and electro-optical materials, fabrication processes, electronic and electro-optic components, including novel electromagnetic concepts and techniques, and plasma phenomena and theory. Create new knowledge and understanding for quantum computing algorithms and their use to create new understanding of materials by design, process optimization, and quantum simulation.\n\nElectromagnetic Warfare \n\nFundamental research is being conducted looking at a very novel concept of using radars for long range speech reception and playback is ongoing.  Radar Cross Section (RCS) prediction capabilities for naval vessels is being researched to cover ultra-wide bandwidths, significantly expanding our predictive narrow band capabilities.  When coupled with another developmental effort on multistatic radar theory will provide a broad perspective of target signatures essential to defining radar and EW performance requirements.  Research in the Electro-Optical\/Infra-Red (EO\/IR) domain will demonstrate new filtering technique enabling 30x gain in sensitivity  and 3x gain in resolution for multi-color image sensors.\n\nMaterials and Chemistry  \n\nDesign novel experiments and theoretical models to create advanced or improved materials using new concepts and techniques for applications and sensors and advanced electronics. Improve target identification algorithms utilizing nonlinear dynamics. Understand and demonstrate the principles and mechanisms of DNA-based molecular-scale machines to amplify detection of biochemical agents. Fabricate single atomic layer of materials to create 2-dimensional ferromagnets and semiconductors. The material of choice will be single layer Molybdenum disulfide (MoS2) for utilization as indirect gap semiconductors. The Navy unique single stage accelerator mass spectrometer to evaluate the fine scale detection limits of fusion products and isotopes.  Understand protein-surface interactions leading highly sensitive biosensors. First principle theoretical models are developed to understand the principles governing the interactions between surfaces and small molecules. Previous studies in these areas have demonstrated success in designing biological and chemical sensors with parts per trillion sensitivity as well as understanding of electronic mobility of graphene due to the effects of edge and defects.\n\nUndersea Warfare \n\nLaboratory, field, and theoretical\/numerical studies to investigate physical phenomenon related to acoustic propagation and scattering in oceanic environments such as: prediction of the scattering signature of a structure using noise sources of opportunity; fundamental physical phenomena of wave propagation in ocean environments; approaches to separate of an acoustical field from turbulent flow on an acoustic array; and new structural acoustics theory."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "52.862"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "52.862"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sensors, Electronics and Electronic Warfare (SEEW)\n- Conduct basic research in the areas of solid state transistors and devices for high frequency analog and digital operation; high efficiency, highly linear amplifiers for microwave, millimeter-wave, low-noise, and power applications; superconducting and other technologies which are designed to deliver software defined, wide band, simultaneous signal functionality for conventional system contexts, including, but not limited to, satellite communications (SATCOM), Surveillance, Electronic Warfare (EW), signal intelligence (SIGINT), and communications; electronics and photonics technology that provides for the control, reception, transmission and processing of signals.  \n- The single photon emission in solid state materials and approaches to manipulate emitter properties through structured materials will initiate studies in FY21.\n- The novel techniques for the cooling and trapping of atoms and molecules. Continue the development of protocols for sensing and timekeeping devices based on quantum systems, including clocks with improved short and long term performance and electromagnetic field sensors will continue basic research in FY21.\n- The development of inertial and gravity sensors based on light-atom interferometry will continue in FY21. \n\nElectronics\n- Create new theories and explore new concepts, components, techniques and methods, for the design, growth, and characterization of electronic, electromagnetic, quantum phenomenology, and electro-optical materials, fabrication processes, electronic and electro-optic components, including novel electromagnetic concepts and techniques, and plasma phenomena and theory. \n- Develop a understanding for quantum computing algorithms and their use to create new understanding of materials by design, process optimization, and quantum simulation. \n\nElectromagnetic Warfare\nThe projects in this area conduct basic research efforts with the overarching objective to establish the mathematical constructs, techniques, computational procedures, and scientific foundations the for analysis\/design of signal, image, control, and data generating systems for use in Navy, other DOD, dual-use, or commercial development programs.  Each project has defined objectives within the contexts of the Naval Research Enterprise Research and Development Strategic Framework and Marine Corps S&T Strategic Plan.  \nThese efforts include: \n- Develop ultrafast, efficient, and accurate time domain (TD) algorithms to predict the ultra-wideband radar cross-section (RCS) of complex naval platforms by solving the long-standing late-time instability problem; \n- Investigating mathematical, statistical and algorithmic issues associated with performing robust and adaptive detection and discrimination of targets when sensed by multiple, resource-constrained, unmanned vehicle sensors operating in a decentralized fashion and in highly cluttered environments. \n- Conducting research to establish basic feasibility of novel emerging non-linearized imaging and feature extraction techniques with respect to existing and\/or realistic multi-static sensing geometries, research to utilize and enhance the understanding and applicability of topological techniques to enable improved capabilities for target detection, object identification, and data fusion. \n- Carrying out research to enable the imaging of self-illuminating thermal objects occluded by walls by sensing non-specular reflections from rough surfaces such as open doors and around corners to allow for asymmetric warfare through image recovery in previously denied conditions. \n- Engage in research to develop advanced multi-dimensional Convolutional Neural Network approaches and algorithms to investigate and demonstrate improved means of analyzing high-dimensional data resulting in improved results for classification, segmentation, anomaly\/ target detection. \n\nMaterials and Chemistry \n- Design novel experiments and theoretical models to create advanced or improved materials using new concepts and techniques for applications and sensors and advanced electronics. \n- Improve target identification algorithms utilizing nonlinear dynamics. Understand and demonstrate the principles and mechanisms of DNA-based molecular-scale machines to amplify detection of biochemical agents. \n- Fabricate single atomic layer of materials to create 2-dimensional ferromagnets and semiconductors. The material of choice will be single layer MoS2 for utilization as indirect gap semiconductors. \n- Conduct unique single stage accelerator mass spectrometer to evaluate the fine scale detection limits of fusion products and isotopes. \n- Recognize the protein-surface interactions leading highly sensitive biosensors. \n- Develop principle theoretical models to understand the principles governing the interactions between surfaces and small molecules. Prior studies in these areas have demonstrated success in designing biological and chemical sensors with parts per trillion sensitivity as well as understanding of electronic mobility of graphene due to the effects of edge and defects. \n\nUndersea Warfare\nEfforts include research in Laboratory, field, and theoretical\/numerical studies to investigate physical phenomenon related to acoustic propagation and scattering in oceanic environments such as: \n- Prediction of the scattering signature of a structure using noise sources of opportunity.  \n- Fundamental physical phenomena of wave propagation in ocean environments. \n- Develop approaches to separate an acoustical field from turbulent flow on an acoustic array. \n- Create new structural acoustics theory for scattering from large, complex undersea objects. \n- Develop new approaches to monitoring the acoustic signature and structural state of undersea vessels."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2020 to FY2021 is due to increased investment in the defects in Bio-Sensors that detect the interaction between surface and small molecules."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Weapons"
                                    },
                                    "Description": {
                                        "val": "Naval S&T discovers, develops and delivers decisive naval capabilities. Superior defense deters aggression, but when called upon, enables naval forces to fight, win and come home safe. This Program focuses on a number of fundamental scientific areas aimed at expanding the underlying understanding of disciplines that are broadly useful for a wide range of naval weapon applications. Research into emerging technologies like directed energy explore the scientific limitations of laser technology for utilization in maritime environments. Continued research in hypersonics will address unique challenges like extreme temperatures and air flow. Ultimately, naval S&T strives to ensure that no Sailor or Marine will ever be in a fair fight.  \n\nThe efforts research focus includes: undersea weaponry; air weaponry; energetic materials and solid rocket propulsion; expeditionary operations, including communications, materials, landmine detection, human sensory enhancements, lightweight power sources and information efficiency; directed energy and counter directed energy, hypersonic aerodynamics and materials, and applied electromagnetics. This activity includes peer-review basic research to develop fundamental knowledge and enhance the science and engineering workforce and technology base."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.848"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.419"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research will focus on undersea weaponry; energetic materials and rocket propulsion; directed energy, counter directed energy, applied electromagnetics, and hypersonics.\n\nUndersea Weaponry\nPursue advanced concepts for sea warfare and weapons to include conducting basic science and research to explore new ideas and technologies to enhance the performance of existing power & energy sources, undersea weapons, unmanned vehicles, aircraft, ships and submarines for the Navy. Sunset efforts on supercavitation and expand autonomous control technology for surface and subsurface vehicles and weapons.\n\n\nAir Weaponry\nResearch will focus on the areas of solid and hybrid rocket propulsion, advanced structural and aperture materials, navigation, aerodynamics, single and multi-missile control, and power management.  This effort will enable missiles with greatly increased speed, range and lethality to meet future naval warfare needs.\n\nDirected Energy\nResearch will focus on the scientific limitations of laser technology for utilization at tactically significant ranges. The goals of the program include research of laser sources, adaptive optics compensation techniques, understanding of long range atmospheric propagation physics, and characterization of laser-matter interactions. This program will lead to understanding which directed energy (DE) is best for Naval defense applications.\n\nCounter Directed Energy\nResearch will investigate ability to counter directed energy weapons in high energy lasers or high power radiofrequency devices. Analytical models, modeling and simulation, and laboratory experiments on laser and High Power Microwave protection methods for future naval aviation, missiles, and surface ship systems and platforms.\n\nEnergetic Materials and Rocket Propulsion \nResearch will investigate new energetic chemical compounds with superior specific energy and energy density, brisance, insensitivity, etc. for useful warhead fills and solid rocket propellants. Methods for improved understanding of formulations and advanced modeling and simulations on composite energetic materials will be investigated along with new methods and instruments for characterization.   \n\nHypersonics\nResearch will address the fundamental understanding of the underlying phenomena unique to hypersonic flight where extreme temperatures and other unique flow and material conditions arise. Areas of research include boundary layer physics in shockwave dominated flows around highly-swept or slender bodies, Aero-thermo-elastic and\/or aero-servo-elastic effects arising from control surface actuation at high speeds, descriptions of high-speed boundary layer transition that unify theories across disparate external conditions, novel strategies for extending regions of laminar flow and advanced hypersonic aerodynamic design tools that incorporate modern predictions of transition pathways, freestream noise contributions, time\/heating dependent surface finish effects, and unsteady aerodynamics. Ultra-high temperature materials, coatings, and thermal protection systems will also be investigated."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.541"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.541"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Undersea Weapons\nConduct basic research related to critical S&T to develop technologies for legacy and next-generation offensive and defensive undersea weapons (USWs) and payloads capable of engaging threat submarines, surface ships and torpedoes. Efforts include, but are not limited to, the following: \n- Undersea and Surface Vehicle Autonomy \n- Advanced concepts for Sea Warfare \n- USW Hydro and Propulsion,\n- USW Warheads \n- Naval Undersea Research Program\n\nAir Weaponry\nResearch will focus on the areas of solid and hybrid rocket propulsion, advanced structural and aperture materials, navigation, aerodynamics, single and multi-missile control, and power management. This effort will enable missiles with greatly increased speed, range and lethality to meet future naval warfare needs.\n\nDirected Energy and Counter Directed Energy\nResearch will focus on the fundamental scientific processes of laser and microwave technologies leading towards Naval utilization at tactically significant ranges in offensive and defensive applications.  Program goals included the research:\n- Laser\/Microwave Sources \n- Adaptive Optics\n- Antennas \n- Power\/Energy Conversion and Modulation\n- Understanding of Propagation\/Interaction Physics\n- Characterization of laser-matter interactions for ultra-intense laser beams\n- Electromagnetic-Electronic Coupling\n- Identifying new nanostructured materials and coatings processing for naval applications.\n- Investigate unique interactions of photons with materials and coatings, including nonlinear optical materials and unique photochromic materials that react by creating direct mechanical strain from photons.\n\nEnergetic Materials and Rocket Propulsion\nResearch will investigate advanced energetic materials which provide reactive, explosive, and propulsive phenomena including high energy ingredient synthesis, modeling, characterization, and the fundamentals of initiation, decomposition and combustion\/shock.  Research will include:\n- Synthetic methodology for new energetic materials and material concepts with superior specific energy and energy density, brisance, insensitivity, etc. for useful warhead fills and solid rocket propellants. \n- Novel Diagnostic methods for improved understanding of formulations and dynamic combustion\/shock and related energetic materials dynamic phenomena.\n- Advanced modeling and simulations on energetic materials, along with new methods and instrumentation for characterization.\n\nHypersonics\nBasic research will address long-range weapon components able to survive high temperature exposure for several minutes and thwart anti-access\/ area denial countermeasures. Additional areas of research include: \n- Hypersonic boundary-layers and shock-wave \/ boundary-layer interactions \n- Prediction of hypersonic weapon flight performance and control including the influence of non-continuum, non-equilibrium and aero-thermo-servo-elastic effects \n- Environment-material interactions \n- Test facilities, instrumentation and diagnostics \n- Ultra-High temperature materials\n- High-Speed Propulsion"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2020 to FY 2021 is a result of increased investments in Energetic Materials, Hypersonics and Counter Directed Energy Weapons technologies research."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Basic Research Challenge"
                                    },
                                    "Description": {
                                        "val": "The ONR Basic Research Challenge (BRC) program was established in 2008 to competitively select and fund promising research programs in new areas not addressed by the current basic research program. The program stimulates new, high-risk basic research projects in multidisciplinary and departmental collaborative efforts, and funds topics that foster leading edge science and attract new principal investigators and organizations. Basic Research Challenge awards are for a period of four years. Topics are submitted by Office of Naval Research (ONR) program officers and are selected for BRC awards. Basic Research Challenge award topics are then issued as a broad agency announcement.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.562"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Beginning in FY 2020, the Basic Research Challenge program resources have been realigned into associated research efforts across the basic research portfolio to better align these resources with Navy Basic Research opportunities and priorities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "39.096"
                        },
                        "CurrentYear": {
                            "val": "5.500"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "44.596"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Basic Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "33.787"
                                        },
                                        "Text": {
                                            "val": "Conduct basic research efforts including scientific study and experimentation directed toward increasing knowledge and understanding in national security related aspects of physical, engineering, environmental and life sciences. Basic research effort subject areas include: Autonomous Systems; Artificial Intelligence\/Machine Learning; Command, Control, Communications and Computers (C4); Marine as a System; Information Analysis and Decision Support; Intelligence, Surveillance and Reconnaissance; Logistics; Materials; Operational Environments; Platforms; Power and Energy Technology; Sensors and Electronics; Warrior Performance and Protection; Weapons and Support (Education and Outreach)."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Navy ROTC Cybersecurity Training Program"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5.309"
                                        },
                                        "Text": {
                                            "val": "Explore and implement a collegiate program to train Navy ROTC and civilian students to be  able to provide and enhance Naval cybersecurity as military or civilian experts. Funding will also support professorial mentoring and continued\neducation outreach."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.500"
                                        },
                                        "Text": {
                                            "val": "Explore and implement a collegiate program to train Navy ROTC and civilian students to be  able to provide and enhance Naval cybersecurity as military or civilian experts. Funding will also support professorial mentoring and continued\neducation outreach."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}