{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-855515f7cbe1443b1cc76e32ff869263061a887974718017fcc8f688288c6578-30",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603826D8Z"
        },
        "ProgramElementTitle": {
            "val": "Quick Reaction Special Projects (QRSP)"
        },
        "R1LineNumber": {
            "val": "62"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "469.939"
            },
            "PriorYear": {
                "val": "57.004"
            },
            "CurrentYear": {
                "val": "35.647"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2021, all funding and project investment areas in the Quick Reaction Special Projects (QRSP) Program Element (PE) will transition to PE 0603338D8Z Defense Modernization and Prototyping.  The new PE will continue to leverage the year of execution processes that allow QRSP to rapidly develop relatively low cost, risk reducing prototypes for potentially high payoff opportunities.  Through consolidation, the PE increases the Department’s ability to coordinate activities across the Services and Defense Agencies, removes duplication of effort, enables rapid pivots to new threats, and provides the resources necessary to ensure technological overmatch against future threats.  This realignment directly supports the Department’s modernization plans by streamlining investments, reducing the time from discovery to deployment, and enabling development of disruptive technologies to help realize the National Defense Strategy.\n\nFunding in the QRSP PE enables leadership within the Office of the Under Secretary of Defense for Research and Engineering (OUSD(R&E)) to leverage rapidly maturing technologies from small and non-traditional businesses within the year of execution and incubate them to potentially game-changing capabilities.  Through streamlined processes, QRSP captures emergent opportunities and addresses time sensitive mission threats through low cost, higher-risk prototypes.\n\nIn FY 2020, the Quick Reaction Fund (QRF) within the QRSP PE was transferred to PE 0603699D8Z Emerging Capabilities Technology Development to support the priorities of the Under Secretary of Defense for Research and Engineering (USD(R&E)).  Additionally, in FY 2020 the Joint Rapid Acquisition Cell Support (JRAC) was transferred to PE 0903399D8Z within the Office of the Under Secretary of Defense for Acquisition and Sustainment for alignment and execution.  To support the transition of JRAC to the Office of the Under Secretary of Defense for Acquisition and Sustainment, previously appropriated funding for JRAC is displayed within the Rapid Reaction Fund."
        },
        "ProgramElementMissionDescription": {
            "val": "The Quick Reaction Special Projects (QRSP) Program Element (PE) funds the development of risk-reducing prototypes and accelerates capability innovation to deliver performance to the joint warfighter at the speed of relevance.  QRSP prototypes increase warfighter lethality, affordably counter emerging technological threats, and help address the immediate needs of the Combatant Commands (CCMD).  Due to the relatively low average cost of projects, QRSP is able to explore higher-risk opportunities with potentially higher reward.  Project selection is guided by Department-level strategies and priorities, such as the National Defense Strategy, the Chairman’s Capability Gap Assessment, the Department of Defense’s (DoD) modernization priorities, and the CCMD’s Integrated Priority Lists (IPLs).\n\nThe QRSP Program supports four major project codes that expedite development and transition of new capabilities to the warfighter.  These project codes are:  1) Quick Reaction Fund (QRF), 2) Rapid Reaction Fund (RRF), 3) Joint Rapid Acquisition Cell (JRAC) support, and 4) Strategic Multi-Layered Assessment (SMA).  Efforts within these project codes align to DoD science and technology priorities, address challenges identified in the National Defense Strategy, and support the DoD’s modernization priorities. Funding and activities within QRF transferred to other Program Elements in FY 2020.\n\nRRF develops prototypes to counter emerging threats; anticipates adversaries’ exploitation of new technologies; and, expedites delivery of effective, affordable, and critically needed capabilities to the warfighter.  RRF initiatives accelerate innovation by rapidly developing high-risk prototypes with the potential for immediate and impactful transition of warfighter capabilities.  RRF leverages emerging capabilities, such as machine learning algorithms and software intelligence, to enable novel prototypes with agile technology insertion paths.  Funded projects also leverage existing capabilities from the traditional industrial base and non-traditional suppliers in the commercial sector, academia, international arenas, and small businesses.      \n\nSMA supports senior leadership within the CCMDs, Joint Force Commanders, and other government agencies by assessing complex operational and technical challenges, which require collaborative multi-agency and multi-disciplinary approaches.  With input from across the U.S. government, academia, and the private sector, the SMA develops options to Joint Staff and CCMD-generated challenging problems to inform senior leadership.  Each assessment is initiated at the request of CCMD senior leadership.  The Joint Staff Deputy Director for Global Operations (DDGO) sets priorities for SMA programs.  SMA products are typically generated within six to nine months and directly contribute to the decision-making process of the Joint Staff and CCMD senior leadership."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "59.490"
                },
                "CurrentYear": {
                    "val": "47.147"
                },
                "BudgetYearOne": {
                    "val": "48.828"
                },
                "BudgetYearOneBase": {
                    "val": "48.828"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "57.004"
                },
                "CurrentYear": {
                    "val": "35.647"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.486"
                },
                "CurrentYear": {
                    "val": "-11.500"
                },
                "BudgetYearOne": {
                    "val": "-48.828"
                },
                "BudgetYearOneBase": {
                    "val": "-48.828"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-11.500"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.976"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Transfer to Defense Modernization and Prototyping PE"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-48.828"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-48.828"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.010"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2020 Congressional reduction of $11.500 million was directed for Prior year carryover. \n\nThe FY 2021 baseline reduction is the transfer out of QRSP resources to PE 0603338D8Z Defense Modernization and Prototyping to provide alignment, transparency and focus supporting development of key technologies and modernization within OUSD(R&E) identified capability thrust priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "826"
                    },
                    "ProjectTitle": {
                        "val": "Quick Reaction Fund"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "145.237"
                        },
                        "PriorYear": {
                            "val": "18.499"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2020, the Quick Reaction Fund (QRF) was transferred to Program Element 0603699D8Z Emerging Capabilities Technology Development.  There were no new projects and only FY 2019 close out activities are reported."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Quick Reaction Fund (QRF) provided the Combatant Commands (CCMDs), Services, and joint warfighters opportunities to capitalize on relatively mature technologies.  QRF leveraged maturing technology to rapidly prototype and field-test promising new prototypes that have immediate impact on time-sensitive operational needs.  Capabilities addressed National Defense Strategy priorities and informed programs of record or new acquisition pathways to more effectively and affordably push innovation to the field.  QRF focused on projects that have the potential to address conventional, disruptive, and asymmetric warfare needs.  QRF initiatives typically delivered a prototype application within 12 months of being funded.  In FY 2020, QRF funds transferred to PE 0603699D8Z Emerging Capabilities Technology Development to facilitate rapid prototyping and experimentation to support the DoD’s modernization priorities.\n \nRecent success stories and significant transitions of note include:\n• Vintage Racer matured an advanced capability to prosecute targets of interest.  The project successfully validated aerodynamic design with wind tunnel testing and integrated a guidance subsystem for targeted kinetic effects before culminating in a FY 2019 flight test.  Documentation and prototype technologies transitioned to the U.S. Army for additional development and follow-on acquisition activities.   \n• Dead Center demonstrated advanced, highly tailorable algorithms to meet critical warfighter mission needs in multiple domains, culminating in a user demonstration of the advanced algorithms designed to enhance warfighter effectiveness.  The project integrated these algorithms with repurposed commercial-off-the-shelf (COTS) hardware to demonstrate a flexible, multi-platform functionality in a low size, weight, and power form factor to meet specific, highly tailored mission critical needs.  Project deliverables, including prototypes and system documentation, transitioned to a classified DoD partner.\n• Battle Axe was a nine-month effort that leveraged several existing, high technology readiness level (TRL) technologies and developed a new, electronic-attack (EA) capability.  The prototype provided a rapidly deployable, low size, weight, power, and cost counter intelligence, surveillance, and reconnaissance (ISR) solution to the warfighter.  Further details of this project are classified.\n• Olympus focused on the development of fully customizable cyber tools for open network exploitation to enhance the CCMDs’ capability to operate and exploit cyber information in near real-time.  The solution leveraged best practices of the U.S. Government’s cyber workforce and expanded the capability of the DoD to operate in cyber space with government-off-the-shelf (GOTS) customized software tools.  Further details of this project are classified."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Red Dawn Phase II"
                                    },
                                    "Description": {
                                        "val": "Red Dawn enabled greater visibility into threat indications and warnings (I&W) through the integration of existing data sources and advanced data science techniques.  Red Dawn Phase II developed enhanced I&W visualization tools and analytics for the warfighter providing the users with greater situational awareness.  Additionally, this project ensured a two-way flow of information with existing, on-going efforts.  Red Dawn transitioned to the U.S. European Command (USEUCOM) and other DoD agencies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.320"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ballistic Missile Defense (BMD) Visualization Support Tool"
                                    },
                                    "Description": {
                                        "val": "The BMD Visualization Support Tool provides timely, tailored, and fused information that enables the Commander, U.S. Northern Command (USNORTHCOM) to provide the President of the United States and senior White House officials with BMD visuals during time-urgent events.  The project developed a working prototype that resides on the Secure Internet Protocol Router (SIPR) network, conducted modifications based on feedback from the user community, and supported user community exercises.  The tool transitioned to the North American Aerospace Defense Command (NORAD)\/USNORTHCOM."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.550"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Predictive Analytics for Condition Based Maintenance"
                                    },
                                    "Description": {
                                        "val": "Predictive Analytics demonstrated the ability to apply predicative models for maintenance on legacy ground combat equipment to enhance lethality through improved readiness.  The prototype system collects and stores engine performance data and fault codes, applies machine learning principles to collected data, and anticipates required maintenance before issues cause expensive damage to engine hardware.  Prototyping focused on building a framework to understand engine data from the M-88 platform and extrapolating actionable steps.  The prototype transitioned to the U.S. Marine Corps for further development and assessment.  This prototype also supports the M-1 tank chassis and was leveraged by the U.S. Army tank fleet."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MANGO SALSA"
                                    },
                                    "Description": {
                                        "val": "MANGO SALSA advanced the development and deployment of novel signature reduction technology for end user evaluation.  MANGO SALSA enhances the CCMDs’ capability to operate and execute missions.  With this capability, the warfighter has the ability to alter signatures via low power, lightweight systems tolerant of typical environmental conditions.  The solution demonstrated reduced signatures for military vehicles and advanced the DoD modernization priority for microelectronics.  Further details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.400"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Project 419"
                                    },
                                    "Description": {
                                        "val": "Project 419 demonstrated an end-to-end collection system to address ongoing information needs.  The project resulted in a limited operational capability for critical information that otherwise would be disrupted due to resource outages or conflicting tasking.  Using existing assets, Project 419 provided initial operations collection via a unique sensor system.  It also leverages long-dwell to enable an advanced capability with the potential to characterize critical undiscovered signals of interest for CCMDs and intelligence agencies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.600"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wildwood"
                                    },
                                    "Description": {
                                        "val": "Wildwood provided solutions to the widespread cyber challenges faced by DoD and the Defense Industrial Base (DIB) that are the legacy of Advanced Research Projects Agency Network (ARPANET), Transmission Control Protocol (TCP), and other systems initially designed for small trusted enclaves.  Wildwood developed, tested, and deployed a network of spatially diverse nodes on the open internet for experimentation, measurement, testing, and modeling of a proposed network technology, architecture, and hardware that breaks with the historic internet paradigm.  Wildwood enables replacement of the current security model by moving from a reactionary profile to a well-designed, defensible, high-speed network architecture that can provide privacy in both fact of transmission and content in traffic.  A fully deployed system will radically reduce the cyber vulnerability footprint, without requiring redesign of the legacy, currently vulnerable system, and will reduce the cost of security imposed on DoD, DIB, and civilian systems.  Wildwood transitioned to Missile Defense Agency and a classified DoD partner for further development and implementation of a fully deployed system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Project Hornet"
                                    },
                                    "Description": {
                                        "val": "Project Hornet developed and tested an advanced, hand-launched unmanned aerial system (UAS) that can be used by forward-deployed personnel to interdict and disrupt adversary electronic capabilities in contested environments.  The UAS platform provides Special Operations Forces (SOF), along with Service and Interagency partners, with a versatile, adaptive capability that can be applied to a diverse range of adversary electronic threats.  After a successful demonstration, Project Hornet transitioned to U.S. Army Special Operations Command (USASOC), which intends to use flexible acquisition authorities to rapidly transition the capability to the broader SOF community.  Further details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.279"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ghost Chronograph"
                                    },
                                    "Description": {
                                        "val": "Ghost Chronograph is an engineering design prototype and validation study to identify key requirements for next generation adaptive array algorithms to overcome limitations in current electronic warfare (EW) systems.  The design refined key performance parameters including differential geometry effects, transmit and receive parameters, atmospheric variations, energy characterization, and power density that determine the performance and limitations of robust EW systems across the electromagnetic spectrum.  The design transitioned to United States Indo-Pacific Command (INDOPACOM) and Pacific Air Forces (PACAF) to inform an operational system that combines discontinuous spectrum channels to provide higher bandwidth and robustness.  Further details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.300"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lightweight Remote Weapons System (LRWS)"
                                    },
                                    "Description": {
                                        "val": "LRWS rapidly developed and evaluated a remote weapon station (RWS) with significant size weight and power reduction to enable operations on remotely operated small ground vehicles.  LRWS reduced the swap of current crewed weapon systems from 350lbs to 70lbs with equivalent lethality.  LRWS includes sensor integration such as a daytime zoom camera, thermal imager, laser range finder to enable rapid targeting and man-in-the-loop engagement within seconds of detecting a target within the azimuth range of 360 degrees, elevation ranges of 60 degrees up and 20 degrees down.  LRWS uses advanced algorithms to compensate for ammunition, range, and camera parallax and supports 5.56mm, 7.62mm, and .50 caliber ammunition.  LRWS transitioned to U.S. Special Operations Command (USSOCOM) for immediate force protection of SOF operators while conducting the operational evaluation of the prototype units and will subsequently be available to all operators within the USSOCOM, and through the U.S. Army Combat Capabilities Development Command Armament Center (CCDC (AC)) and Product Manager Crew Served Weapons (PM CSW)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.200"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Blast Artillery Projectile (EBAP)"
                                    },
                                    "Description": {
                                        "val": "EBAP is a 155mm artillery projectile prototype leveraging advanced technologies to demonstrate significant lethality enhancements.  The project incorporates an innovative explosive charge configuration with hybrid enhanced blast explosive (HEBX) and a high density reactive material (HDRM) to generate enhanced blast and overpressure effects coupled with an increased high temperature duration.  This design produces catastrophic damage compared to existing 155mm high explosive artillery projectiles, allowing for less rounds to be used and visual confirmation of damage on a target.  The EBAP project developed the prototype and culminated in a large-scale static-arena test for a vehicle target, demonstrating its destructive effects.  EBAP transitioned to the U.S. Marine Corps for user evaluation and the Office of Naval Research for further development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.700"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Project VANGUARD 2.0"
                                    },
                                    "Description": {
                                        "val": "VANGUARD developed a virtual reality environment for enhanced operational collaboration for disparate, geographically separated organizations and personnel.  The environment was developed as an unclassified demonstration to enable rapid development and integration of commercially based visual mapping and analytical tools.  Project VANGUARD 2.0 efforts focused on extending this tool to a classified environment with the ability to ensure connectivity across disparate databases with differing security.  The end result provides direct support of targeting analysts and decision makers during the targeting process, and brings together U.S. Army and U.S. Air Force objectives in a joint initiative.  In 2019, the system was deployed across 363 Intelligence, Surveillance, and Reconnaissance Wing subordinate units and assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.400"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "QRF leverages the Services’ and Defense Agencies' most efficient and effective acquisition approach for rapid prototyping.  This includes using Other Transaction Authorities and new or existing contract vehicles."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "828"
                    },
                    "ProjectTitle": {
                        "val": "Rapid Reaction Fund"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "311.697"
                        },
                        "PriorYear": {
                            "val": "36.182"
                        },
                        "CurrentYear": {
                            "val": "33.296"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2021, the Rapid Reaction Fund (RRF) will transition to PE 0603338D8Z Defense Modernization and Prototyping.  This realignment directly supports the Department’s modernization plans by streamlining investments, reducing the time from discovery to deployment, and enabling development of disruptive technologies to help realize the National Defense Strategy."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Rapid Reaction Fund (RRF) produces innovative prototypes with a high potential for disruptive improvement and transitions them to joint warfighters and Combatant Commands (CCMDs).  RRF’s streamlined business processes address mission gaps through partnerships with small and non-traditional companies, Service labs, Federally Funded Research and Development Centers, allied nations, and transition partners within the warfighter user community.  RRF anticipates adversaries' exploitation of technology, including current and emerging commercial capabilities, and rapidly responds to new threats and opportunities.  Project selection is guided by department-level strategies and priorities, such as the National Defense Strategy and the DoD’s modernization areas.  Needs are identified and prototype projects are funded within the year of execution to demonstrate the feasibility of new technologies, enable integration into larger systems, and deliver affordable capabilities faster than standard acquisition cycles.  RRF prototypes inform future acquisition or transition through rapid technology refresh and insertion into joint mission capabilities.  These lower-cost prototypes and innovative business processes give the Under Secretary of Defense for Research and Engineering (USD(R&E)) the agility to quickly explore new, higher-risk technology areas that have the potential for immediate, game-changing impacts.\n\nIn prior years, RRF supported the creation of novel sensing systems; provided low-cost capabilities for small-footprint operations; expanded human, social, and cultural knowledge relevant to military decision making; increased small unit situational awareness; produced advanced biometrics and forensics capabilities; performed strategic multi-layer assessments; and, established a prototyping through non-traditional pathways outreach effort that facilitates better interactions with small, non-traditional companies developing innovative technologies.  In FY 2020, RRF continues to support the USD(R&E) and provides a hedge against technology risk by identifying and delivering near-term capabilities to support irregular warfare operations.  \n\nRecent success stories and significant transitions of note include:\n• Reduced Acoustic Signature Propellers prototyped and implemented quieter propellers for covert Unmanned Aerial System (UAS) mission sets.  The technology transitioned to U.S. Special Operations Command (USSOCOM) and U.S. Army Special Operations Command (USASOC).  \n• Passive Foliage Penetration developed novel data processing algorithms to image targets under foliage from airborne platform passive video.  The technology successfully transitioned to multiple partners including U.S. Indo-Pacific Command (USINDOPACOM) and U.S. Southern Command (USSOUTHCOM).  \n• Ordnance Threat\/Target Automated Recognition developed deep learning based algorithms to identify military ordnance.  This effort directly supports the joint explosive ordnance disposal (EOD) mission by increasing the technician’s confidence level and safety.  The technology transitioned to the Joint Service EOD Program."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Low Cost Innovative Projects (Projects less than one million dollars each)"
                                    },
                                    "Description": {
                                        "val": "Typical Rapid Reaction Fund (RRF) projects are completed with a single year of funding and at a cost less than $1.000 million to deliver conceptual prototypes for evaluation or assessment by warfighters and interagency users.  In FY 2019, RRF selected, executed, and transitioned multiple low cost projects, including:\n•  Compact Expendable Payload: A project that developed off-board expendable countermeasures for High Value Assets (HVA).  The resulting prototypes successfully transitioned to the U.S. Air Force’s Air Mobility Command and the U.S. Air National Guard. \n•  BiAS for Unmanned Underwater Vehicles (UUVs): UUV prototypes, which successfully transitioned to USINDOPACOM and U.S. Pacific Fleet.\n•  Modular Multi-Platform Intrusion Detection System (MMIDS): Government-owned open systems architecture that combats cyber threats in air and surface vehicles in addition to monitoring networks for malicious activities.  This technology transitioned to the U.S. Navy Exploratory Development Lab, the U.S. Army’s Next Generation Combat Vehicle (NGCV) program, and the U.S. Air Force Research Laboratory.  \n•  SPRINT: This technology provides a novel approach to enable detection and geolocation of targets of interest.  It successfully transitioned to USINDOPACOM and USEUCOM.  \n•  BANSHEE: A machine learning technique that provides improved topological models.  This product is transitioning successfully to end users.  \n•  Ion Electrospray Micro Propulsion: A novel nanoscale propulsion system that allows for high thrust, enabling needed agility in space.  This program successfully transitioned to multiple U.S. government agencies.  \n•  Pathfinder: A special purpose High Frequency Radar (HFR) to advance capabilities against targets of interest.  The capability is used by multiple CCMDs.  \n•  Quicksilver: A non-traditional technology application that provides capability to the warfighter against remote controlled improvised explosive device (RCIED).  This capability transitioned to Navy PMS-408, Unmanned Ground Vehicles.  \n•  Response for Tactical Logistics: A platform that uses weapon sensors to improve decision making and reduce logistic response times.  Further development is being performed by the U.S. Army Armament Research, Development, and Engineering Center.  \n•  Project 422: A technology application that provides the end user the ability to use alternate antenna and processing systems.  This project successfully transitioned to a classified U.S. government customer.  \n•  Impulsive:  A novel propellant additive, which drastically improves missile range.  The U.S. Air Force is currently using the system. \n•  Compact Microelectromechanical Systems (MEMS) Light Detection and Ranging (LiDAR): A compact MEMS switching LiDAR for all combat conditions.  This LiDAR successfully transitioned to the Joint Program Executive Office for Chemical Biological Defense (JPEO-CBD).\n•  Multi-Static Distributed Radar: A high-resolution target tracking system for Unmanned Aerial Systems (UAS) and manned aircraft.  The radar successfully transitioned to USSOUTHCOM.  \n•  SmartFog: Computing software that leverages existing sensors and provides advanced computing power at the battlefield edge.  This software transitioned to USSOCOM.  \n•  Differential Segmented Aperture: A new technology that provides full spectrum radio frequency (RF) capabilities and increased antenna efficiency.  This product transitioned to the U.S. Army Intelligence and Security Command.  \n•  Gray Zone Intelligence, Surveillance, and Reconnaissance (ISR): This cyber technology allows for the early detection, characterization, and warning of Gray Zone intelligence operations.  The cyber tool transitioned to the Joint Warfare Analysis Center (JWAC). \n•  Joint AVAA Workflows (JAWs) Phase 2: An autonomous solution designed to help analysts exploit motion imagery data.  Phase 2 focused on implementing changes based on user feedback.  JAWs is being used by the U.S. Africa Command, the National Geospatial Agency, and other agencies.  \n•  Virtual Raptor: A data fusion tool to generate timely visualizations using machine learning algorithms.  Virtual Raptor allow users to analyze and interact with seemingly unrelated data to extract vital mission information.  U.S. Special Operations Command is using this software.   \n•  Canine Head Mounted Display: A tactically relevant head mounted display (HMD) for military working dogs.  The Canine Head Mounted Display allows the handler to remotely and covertly identify objects of interest during covert operations.  This technology transitioned to Naval Special Warfare Command.\n•  Adaptive Precision Navigation and Timing (PNT) Hub: A novel precision timing hardware fusion engine that enables plug-and-play integration across a wide spectrum of electronics and PNT solutions.  This capability deployed to a classified transition partner.\n•  Modular Air Dropped Package (MAD PACK): A novel rotorcraft unmanned aerial system (UAS) that can be deployed from a common launch tube (CLT).  The technology transitioned to, and is in use by, the U.S. Air Force.\n•  Pebble: This project developed a wire free, unobtrusive mouthpiece communication device.  This technology is currently in use by U.S. Special Operations Command.    \n•  Single Tag: A data triage tool that uses classical data processing algorithms to rapidly clean, sort, and label data.  This technology enables convolutional neural networks (CNNs) to be trained much more quickly with minimal analyst input.  This technology is currently in use by the National Geospatial Agency.   \n•  Unmanned Aerial Systems (UAS) Discrimination: This LiDAR project provides the capability to quickly and accurately discriminate between biologicals and UAS.  This product is being used by multiple DoD installations.\n•  Digital EOD:  A project that used artificial intelligence\/machine learning (AI\/ML) to quickly deliver pertinent information regarding unexploded ordnance.  This project transitioned to Joint Service EOD. \n•  ARM-ANTS: A project that used the Advanced Anti-Radiation Guided Missile (AARGM) as a non-traditional sensor.  This project transitioned to the U.S. Air Force.\n•  High Performance Solid Rocket Propellant: A project that developed a novel aluminum-lithium (Al-Li) alloy fuel that, in addition to significantly increasing performance and munition range, removes a dangerous emission common in current state-of-the-art formulations.  This project successfully transitioned to the U.S. Army. \n•  ALICE:  This project demonstrated a software tool that can assess deficiencies in AI\/ML trained algorithms.  It provides a method to evaluate and efficiently re-train the performance of Convolutional Neural Networks (CNNs).  This project technology successfully transitioned to the Joint Artificial Intelligence Center (JAIC).\n•  HLX Drive:  The Helix crankshaft combined with variable power on demand (VPOD) allows for much greater power with reduced weight.  The HLX Drive project demonstrated a 3kW generator that weighs 80 percent less than the current generator while increasing power output by 33 percent.  This technology transitioned to the U.S. Marine Corps.\n•  RF Gatekeeper:  A system that automatically identifies and suppresses interference in congested radio frequency environments, maintaining performance of mission critical communication systems.   This technology transitioned to United States Special Operations Command.\n•  Intelligent Power Distribution System:  This project embeds AI\/ML capability into Intelligent Power Distribution Units (IPDUs), so that these units can react if there are signs of imminent system failure.  This project successfully transitioned to the U.S. Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.983"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Strategic Multi-Layered Assessment (SMA) Reach Back Cell"
                                    },
                                    "Description": {
                                        "val": "The SMA Cell supports senior leadership in the Combatant Commands (CCMDs) and at U.S. Government agencies with actionable assessments of complex operational and technical challenges.  The assessments help maintain our competitive advantage in an increasingly complex global environment.  The SMA Cell was established by the Joint Staff Deputy Director for Global Operations at the request of the Commander, U.S. Central Command (USCENTCOM).  SMA efforts leverage multi-agency, multi-disciplinary approaches to address requirements that are not within the customer organization's core competency.  SMA assessments are framed during the year of execution and are in response to specific tasking from senior leadership in the CCMDs.  The SMA Cell identifies options from across the U.S. Government, academia, and the private sector.  SMA efforts are facilitated by the Joint Chiefs of Staff\/J-3 Operations and are executed by the Office of the Under Secretary of Defense, Research and Engineering.  The SMA Cell provides USCENTCOM with population-based and regional expertise in support of ongoing operations in the USCENTCOM area of responsibility."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "SMA will continue to work with USCENTCOM via the Reach Back Cell to support ongoing operations in Iraq, Syria, and Afghanistan by responding to queries from senior leaders.  SMA was asked by the USCENTCOM Commander to pivot to South Asia to evaluate stability factors in Afghanistan; the influence of regional actors; and, prospects for reconciliation.  SMA will continue to develop the reach back concept to provide a short-term tool to assist in understanding actor relationships and conducting if\/then analyses."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "The SMA Cell will continue to actively work with the CCMDs and the Joint Staff to identify challenging problems that are not within the traditional areas of DoD expertise.  These problems will be in direct support of CCMD senior leadership."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2021, the SMA Cell will transition to PE 0603338D8Z Defense Modernization and Prototyping.  The realignment of the SMA Cell will not change the objective of providing support to the CCMDs or influencing acquisition programs resulting from identified needs."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Grade Inertial Measurement Unit (IMU)"
                                    },
                                    "Description": {
                                        "val": "Tactical Grade IMU develops a single chip, millimeter-scale, tactical grade IMU with a total power requirement of <150 µW and capability of surviving in a >20,000 g shock environment.  This represents a 1,000x reduction in volume and 10,000x reduction in power, and enables IMU guidance on small caliber munitions.  A mm-scale tactical grade IMU would improve navigation in GPS-contested environments for small caliber munitions such as the Army Precision Guidance Kit–Anti-Jam (PGK-AJ), XM1155, and Excalibur HTK, along with the Navy Moving Target Artillery Round (MTAR)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.530"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "In 2020, the IMU will be fabricated and integrated to transition partner specifications prior to testing on U.S. Army provided ranges.  The resulting IMU will transition to the U.S. Army Combat Capabilities Development Command (CCDC). The Government will maintain Government purpose rights for all intellectual property developed during this project."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Tactical Grade Inertial Measurement Unit will be completed in 2020 and transitioned to U.S. Army Futures Command."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prototyping Through Non-Traditional Pathways"
                                    },
                                    "Description": {
                                        "val": "Prototyping Through Non-Traditional Pathways leverages technologies and emerging products developed by small, innovative businesses in the commercial sector including information technologies; internet-of-things sensors and adaptive networks; bio-medical advances; emerging quantum applications; and, novel microelectronic\/microelectromechanical system innovations.  The project identifies ideas from non-traditional emerging technology companies that match DoD, CCMD, Service, and other government priorities.  Promising solutions are selected for further test and evaluation and, if successful, rapid prototyping or fielding to transition commercial ideas with military utility.  These efforts support the Department's objectives of leveraging commercial innovation to maintain technology superiority; increasing rate of technology maturation; exploring alternative and faster pathways for acquisition; and, fielding affordable and effective capabilities.  In FY 2019, Prototyping Through Non-Traditional Pathways conducted reviews focused on priorities of USSOCOM, Joint Improvised-Threat Defeat Organization, cyber community of interest, and Office of the Under Secretary of Defense, Research and Engineering."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Prototyping Through Non-Traditional Pathways anticipates three to five reviews in FY 2019, and 15 to 20 resulting evaluations with potential for future prototypes.  Each review focuses on identifying ideas in a specific topic area that can transition to meet joint operational needs through rapid prototyping.  These reviews will be executed with DoD users and interagency partners such as Service program offices, U.S. Special Operations Command science and technology community, the DoD-wide S&T communities of interest, the Joint Improvised-Threat Defeat Organization, the Defense Health Agency, and the Department of Homeland Security."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Prototyping Through Non-Traditional Pathways anticipates three to five reviews in FY 2020, and 15 to 20 resulting evaluations with potential for future prototypes.  Each review focuses on identifying ideas in a specific topic area that can transition to meet joint operational needs through rapid prototyping.  These reviews will be executed with DoD users and interagency partners such as Service program offices, the Joint Artificial Intelligence Center, Defense Threat Reduction Agency, and the Office of the Under Secretary of Defense, Research and Engineering."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2021, the portfolio will transition to PE 0603338D8Z Defense Modernization and Prototyping to increase coordination and streamline transition of promising capabilities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Disparate Data Fusion, Analysis, and Applications for Networked Systems Focus Area"
                                    },
                                    "Description": {
                                        "val": "Disparate Data Fusion, Analysis, and Applications for Networked Systems develops prototypes to validate new approaches for managing and capitalizing on the increase of data volume, variety, variability, and velocity from our networked communications and sensors.  Growth in social media, big data analytics, and large dynamic sensor networks require new tools for aggregation, processing, exploitation, and dissemination.  Projects include the development of capabilities, software, and tools to fuse, analyze, and infer information from a wide variety of structured or unstructured datasets from a broad spectrum of sources.  Where possible these projects will exploit advanced machine learning systems and commercial technologies to provide solutions to emerging challenges in tracking targets, big data analytics, and extracting indications and warnings.  Technologies developed within this focus area will reduce cost and analyst requirements to provide meaningful intelligence in support of areas such as counter-weapons of mass destruction, gray-zone near-peer competition, human terrain mapping applications, and operations in denied areas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Text": {
                                                "val": "The Rapid Reaction Fund (RRF) investment decisions are made during the execution years in response to DoD, Combatant Command, Service, and other government priorities and as new threats emerge or new opportunities are presented.  RRF will support development of prototypes and new disparate data fusion, analysis tools, and applications to provide a hedge against emerging, irregular, and asymmetric threats.  The program anticipates supporting six to eight projects in FY 2019.  Deliverables will leverage emerging technologies to exploit wide variety of information sources and reduce analyst requirements to provide actionable intelligence."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.045"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution year in response to DoD, CCMD, Service, and other government priorities and as new threats emerge or new opportunities are presented.  RRF supports development of prototypes and new disparate data fusion, analysis tools, and applications to provide a hedge against emerging, irregular, and asymmetric threats.  The program anticipates supporting six to eight projects in FY 2020.  Deliverables will leverage emerging technologies to exploit wide variety of information sources and reduce analyst requirements to provide actionable intelligence."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2021, the portfolio will transition to PE 0603338D8Z Defense Modernization and Prototyping to increase coordination and streamline transition of promising capabilities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Learning Systems and Behaviors Focus Area"
                                    },
                                    "Description": {
                                        "val": "Autonomous Learning Systems and Behaviors prototypes demonstrate capabilities to enhance the lethality of the joint force, reduce the time to make critical decisions, and protect warfighters through increased use of autonomous and human-machine collaborative systems.  Selected projects leverage advances in machine learning to transfer cognitive burden closer to the point of collection and action.  Example projects include agile computer vision systems; enhanced capabilities for multiple autonomous systems to cooperatively interact; autonomous task discrimination and prioritization; autonomous operation in complex terrain; optimization of autonomous supply delivery in contested environments; data preprocessing to improve ex-filtration from unmanned sensors; human-machine collaborative decision making; and, experiments to counter emerging unmanned threats from potential adversaries.  These projects will also examine common software platforms and modular open architecture systems to reduce development cost, increase collaboration among manned and unmanned vehicles, increase agility through rapid customization, and inform requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Text": {
                                                "val": "Rapid Reaction Fund (RRF) investment decisions for Autonomous Learning Systems and Behaviors are made during the execution years in response to DoD, Combatant Command (CCMD), Service, and other government priorities.  Selected projects will support development of components, payloads, and autonomous aerial, surface, and subsurface systems.  RRF anticipates supporting six to seven projects in FY 2019."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.488"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions for Autonomous Learning Systems and Behaviors are made during the execution year in response to DoD, CCMD, Service, and other government priorities.  Selected projects will support development of components, payloads, and autonomous aerial, surface, and subsurface systems.  RRF anticipates supporting six to seven projects in FY 2020."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2021, the portfolio will transition to PE 0603338D8Z Defense Modernization and Prototyping to increase coordination and streamline transition of promising capabilities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Lethality in the Contested Urban Environment Focus Areas"
                                    },
                                    "Description": {
                                        "val": "Future military operations will likely occur in a broad range of urban environments with complex radio frequency, topological complications, diminished situational awareness, and mobility challenges.  Enhanced Lethality in the Contested Urban Environment Focus Area prototypes will identify, analyze, and describe typical urban areas for modeling, simulation, and planning purposes.  These efforts will inform and enable development of intelligence, surveillance, and reconnaissance; electronic warfare; kinetic and non-kinetic effects; and, other capabilities needed for future military operations in a wide range of urban areas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Text": {
                                                "val": "The Rapid Reaction Fund (RRF) investment decisions for Enhanced Lethality in the Contested Urban Environment projects are made during the execution years in response to DoD, Combatant Command (CCMD), Service, and other government priorities.  As new threats emerge and new opportunities are presented, RRF will select projects to demonstrate capabilities for Urban Characterization.  RRF anticipates supporting four to five projects in FY 2019.  Deliverables will include conceptual prototypes, modeling, and simulations to support planning efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.154"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions for Enhanced Lethality in the Contested Urban Environment projects are made during the execution year in response to DoD, CCMD, Service, and other government priorities.  As new threats emerge and new opportunities are presented, RRF will select projects to demonstrate capabilities for Urban Characterization.  RRF anticipates supporting four to five projects in FY 2020.  Deliverables will include conceptual prototypes, modeling, and simulations to support planning efforts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2021, the portfolio will transition to PE 0603338D8Z Defense Modernization and Prototyping to increase coordination and streamline transition of promising capabilities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Prototyping for Systems and Applications of Interconnected Sensors and Command Networks Focus Area"
                                    },
                                    "Description": {
                                        "val": "Intelligence, surveillance, and reconnaissance (ISR) sensor networks are critical for providing asymmetric advantage against larger, near-peer adversaries.  Advances in distributed, interconnected sensors with fully networked command, control, and communications provide opportunities for new solutions to anti-access\/area denial and persistent surveillance challenges.  Efforts in this focus area will increase the speed of innovation and technology adoption for dynamic, inhomogeneous, fully networked sensors, and develop new tools to more effectively analyze or visualize ISR data.  Projects include improved sensor hardware; new capabilities enabled by networked sensor systems; sensor network protection and assured communications; validation of low-cost, robust persistent surveillance capabilities; and, establishment of more effective processing, exploitation, and dissemination capabilities.  RRF sponsored prototypes will facilitate integration of advanced ISR and communication capabilities into new and existing systems.  These prototypes will help increase the effectiveness of ISR architectures and reduce the human analyst requirement to produce actionable intelligence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Text": {
                                                "val": "RRF investment decisions for sensor network prototypes are made during the execution years in response to Department, Combatant Command (CCMD), Service, and other government priorities and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future capabilities.  RRF anticipates supporting five to seven projects in FY 2019.  Deliverables will include prototype systems, analytical capabilities, and software for a variety of platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.502"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions for sensor network prototypes are made during the execution year in response to DoD, CCMD, Service, and other government priorities and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future capabilities.  RRF anticipates supporting five to seven projects in FY 2020.  Deliverables will include prototype systems, analytical capabilities, and software for a variety of platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2021, the portfolio will transition to PE 0603338D8Z Defense Modernization and Prototyping to increase coordination and streamline transition of promising capabilities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Novel Manufacturing Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area will develop enabling capabilities and key prototypes required to advance and secure new manufacturing technologies including additive manufacturing, emerging microelectromechanical systems (MEMS), and tailored integrated circuit architectures to meet specific warfighter needs.  New manufacturing technologies are enabling revolutionary advances in existing capabilities such as hand held deoxyribonucleic acid (DNA) sequencing; advanced wearable devices; tailored metamaterials; advanced MEMS radio frequency circuits; and, integrated photonic devices.  Many novel manufacturing processes allow for rapid prototyping and iterative innovation, removing barriers for technology insertion.  These manufacturing technologies provide a unique capability for maintaining a U.S. competitive advantage through order of magnitude size, weight, and power reductions; increased speed from design to prototype; reduced cost; and, reduced waste.  This focus area will leverage swiftly-developing commercial innovation and emerging capabilities of the Federally Funded Research and Development Centers, government laboratories, and academia to develop conceptual prototypes focused on warfighter needs.  Projects will also investigate security of additive manufacturing technologies, digital schematics, MEMS devices, and custom integrated circuit architectures.  Deliverables inform enhancement decisions and concept of operations development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Text": {
                                                "val": "Rapid Reaction Fund (RRF) investment decisions are made during the execution years in response to Department, Combatant Commands (CCMD), Service, and other government priorities and as new threats emerge or new opportunities are presented.  For novel manufacturing projects this agility supports leveraging new capabilities developed by commercial industry.  Research and coordination with organizations throughout DoD and other government agencies will help identify needs that could be addressed by future capabilities within the additive manufacturing field.  RRF anticipates supporting five to seven projects in FY 2019."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.733"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution year in response to DoD, CCMD, Service, and other government priorities and as new threats emerge or new opportunities are presented.  For novel manufacturing projects, this agility supports leveraging new capabilities developed by commercial industry.  Research and coordination with organizations throughout DoD and other government agencies will help identify needs that could be addressed by future capabilities within the additive manufacturing field.  RRF anticipates supporting five to seven projects in FY 2020."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2021, the portfolio will transition to PE 0603338D8Z Defense Modernization and Prototyping to increase coordination and streamline transition of promising capabilities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prototyping Through Novel Reuse of Government\/Commercial-Off-the–Shelf (G\/COTS) Technologies Focus Area"
                                    },
                                    "Description": {
                                        "val": "This effort increases impact and responsiveness of prototyping efforts through the reuse and repurposing of existing commercial and governmental technologies.  Frequently, systems developed for a separate application provide a partial solution to new emerging challenges.  By building new prototypes around a core of proven technologies, this effort reduces development and adoption risk in addition to controlling cost.  This focus area provides RRF with agility by leveraging existing technologies to develop new prototypes and demonstrate new capabilities more quickly."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Text": {
                                                "val": "The Rapid Reaction Fund (RRF) investment decisions for G\/COTS-based prototypes are made during the execution years in response to Department, CCMD, Service, and other government organization priorities and as new threats emerge or new opportunities are presented.  Projects identified include efforts to repurpose commercial communication protocols into an electronic warfare capability, advances in microelectronic circuits, airport radar systems for bird alerts repurposed for counter-unmanned aircraft system (UAS), advances in quantum sensors and programming for quantum processers, and commercial network security platforms.  RRF anticipates supporting three to four projects in FY 2019."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.874"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions for G\/COTS-based prototypes are made during the execution year in response to DoD, CCMD, Service, and other government organization priorities and as new threats emerge or new opportunities are presented.  Projects identified include efforts to repurpose commercial communication protocols into an electronic warfare capability; novel techniques for efficient distribution of logistics; advances in microelectronic circuits; advances in quantum sensors and programming for quantum processers; and, commercial network security platforms.  RRF anticipates supporting three to four projects in FY 2020."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2021, the portfolio will transition to PE 0603338D8Z Defense Modernization and Prototyping to increase coordination and streamline transition of promising capabilities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Rapid Acquisition Cell (JRAC) Management Support"
                                    },
                                    "Description": {
                                        "val": "This funding is used to support the staff manning of the JRAC to enable management and tracking of CCMD identified and Joint Staff validated immediate warfighter needs. The funding enables management and tracking of Combatant Command (CCMD) identified and Joint Staff validated immediate warfighter needs.  The JRAC is responsible to: \n(1)  Coordinate review of validated Joint Urgent Operational Needs (JUON) and Joint Emergent Operational Needs (JEON) and assign responsibility to appropriate DoD Components for timely funding and resolution. \n(2)  Serve as the review and approval authority for the DoD Components’ strategy to fund and mitigate the identified JUON\/JEON capability gaps. \n(3)  Continually assess actions taken by the DoD Components to resolve JUONs\/JEONs and recommend to the Under Secretary of Defense for any changes determined appropriate to improve their responsiveness to JUONs\/JEONs.\n(4)  Provide periodic reports to the Secretary of Defense on new and outstanding JUONs\/JEONs.   \n(5)  In coordination with Under Secretary of Defense Comptroller (USD(C)), manage the Rapid Acquisition Fund (RAF) to allocate resources to priority unfunded JUONs\/JEONs.\n(6)  In coordination with the Office of the Chairman of the Joint Chiefs of Staff and the USD(C), make programmatic, budget, and acquisition recommendations for JUONs and identify capability gaps to the Secretary of Defense."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.669"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "RRF leverages the Services’ and Defense Agencies' most efficient and effective acquisition approach for rapid prototyping.  This includes using Other Transaction Authorities and new or existing contract vehicles."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "833"
                    },
                    "ProjectTitle": {
                        "val": "Strategic Multi-Layered Assessment (SMA) Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "13.005"
                        },
                        "PriorYear": {
                            "val": "2.323"
                        },
                        "CurrentYear": {
                            "val": "2.351"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "In FY 2021, the Strategic Multi-Layered Assessment (SMA) Support will transition to PE 0603338D8Z Defense Modernization and Prototyping.  The transition of SMA will enable continued support to senior Combatant Command (CCMD) leadership and Joint Force Commanders while ensuring that funding resources are properly allocated to meet rapidly evolving and emergent threats.    \n\nThe mission of SMA is to provide traditional and non-traditional planning and decision support to CCMDs and other U.S. Government departments and agencies on a case-by-case basis.  SMA products are designed to expand the Commanders' operational and strategic horizons and choices when facing complex environments by introducing the power of cognitive diversity from Subject Matter Experts (SMEs) and researchers employing varied paradigms and methodologies.  SMA frames options, but does not make specific policy or strategy recommendations.  SMA receives formal requests for support from the CCMDs at the senior Flag Officer level.  These requests are reviewed by Joint Staff J-39 Deputy Director for Global Operations (DDGO) and USD(R&E) for validation based on the following criteria: (1) The problem requires multi-agency, multi-disciplinary approaches; and (2) Expertise required for the assessment does not lie within the core competencies of a single command or agency but instead, requires the collective inputs from across the U.S. Government, academia, policy centers, and the private sector. SMA is also supported by the Rapid Reaction Fund (RRF)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Strategic Multi-Layered Assessment (SMA)"
                                    },
                                    "Description": {
                                        "val": "The SMA Cell supports the CCMDs and U.S. government agencies with actionable assessments of complex operational and technical challenges, to help maintain our competitive advantage in an increasingly complex global environment.  Challenges addressed with SMA efforts require multi-agency and multi-disciplinary approaches that are not within the customer organization’s core competency.  SMA started a strategic analysis effort at the request of the U.S. Security Coordinator for Israel and the Palestinian Authority.  The effort evaluated strategic risks and identified knowledge gaps to provide an increased understanding of potential security environments and their implications for Palestinian security sector reform.  U.S. European Command (USEUCOM) subsequently asked SMA to apply the same methodology to identify emerging Russian threats and opportunities in Eurasia.  SMA efforts are facilitated by the Joint Chiefs of Staff\/J-3 Operations and are executed by the Office of the Under Secretary of Defense, Research and Engineering."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.323"
                                            },
                                            "Text": {
                                                "val": "In support of U.S. Indo-Pacific Command and U.S. Army Pacific, SMA’s follow on Gray Zone effort, Strategic Outcomes in the Korea Peninsula, will continue to analyze near-term and long-term strategic outcomes resulting from alternative U.S. political-military options for addressing the nuclear and ballistic missile programs of the Democratic People’s Republic of Korea.  SMA will continue to actively work with the CCMDs and the Joint Chiefs of Staff to identify challenging problems that are not within the traditional areas of DoD expertise."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.351"
                                            },
                                            "Text": {
                                                "val": "SMA will actively work with the CCMDs and the Joint Chiefs of Staff to identify challenging problems within the scope described above.  These problems will be in direct support of CCMD senior leadership and may include areas such as: counter terrorism; transnational criminal organizations; counter weapons of mass destruction (state and non-state); counter global or regional social and cultural assessments; regional stability assessments; and, individual state or national level deterrence studies.  Specifically for FY 2020, SMA will conduct an assessment entitled \"Competition & Conflict Dynamics Incubator in the Eurasian Landmass.\"  SMA proposes to establish a testbed (or incubator) to study changing regional dynamics amidst increasing great power competition.  These include anticipated trajectories of state and non-state factors inherent to the region of concern as well as potential black swan scenarios that could greatly alter the balances of both hard and soft power in the Central Region in ways detrimental to key U.S. interests.\n\nTo accomplish this effort, SMA will leverage a highly effective and expansive virtual network of globally placed SMEs using relationships with numerous agencies and organizations, including Military Departments\/Services, DoD analysis centers, other U.S. Government departments and agencies, the private sector, academia, and partner nation governments.  Structured interviews, literature reviews, original research, modeling and simulation, and gaming are all ways that SMA gathers input for their products.  The input is then curated and goes through several rounds of coordination that includes a Senior Review Group (SRG) before completion."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2021, the SMA will transition to PE 0603338D8Z Defense Modernization and Prototyping.  The realignment of SMA will not change the objective of providing support to the CCMDs or influencing acquisition programs resulting from identified needs."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}