{
    "id": "2021-Army-PB-2040-JBOOK-7f1ee284016a103cbd6a4d63ea727aa617711f15268cf669f26149e7ae172ad5-25",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602624A"
        },
        "ProgramElementTitle": {
            "val": "Weapons and Munitions Technology"
        },
        "R1LineNumber": {
            "val": "31"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "379.833"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "379.833"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020, this Program Element (PE) is realigned with continuity of effort to the following PEs:\n* PE 0602141A Lethality Technology\n* PE 0602143A Soldier Lethality Technology\n* PE 0602145A Next Generation Combat Vehicle Technology\n* PE 0602147A Long Range Precision Fires Technology\n* PE 0602148A Future Vertical Lift Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE investigates, designs and evaluates enabling technologies to develop lethal weapons and munitions with increased performance and the potential for lower weight, reduced size, and improved affordability. Project H18 focuses on weapons and munitions development. Project H19 researches technologies to maintain and enhance weapons lethality. Project H28 evaluates munition components such as fuzes, power, warheads with tailorable effects, and munition energetic materials.\n \nWork in this PE is related to, and fully coordinated with, PE 0602303A (Missile Technology), PE 0602105A (Materials Technology), PE 0602618A (Ballistics Technology), PE 0602782A (Command, Control, Communications Technology), and PE 0603004A (Weapons and Munitions Advanced Technology). Beginning in FY20, work in this PE is related to, and fully coordinated with PE 0602147A (Long Range Precision Fires Technology), PE 0602145 (Next Generation Combat Vehicle Technology),PE 0602148 (Future Vertical Lift Technology), PE 0602143A (Soldier Lethality Technology), PE0602141A (Lethality Technology), and PE0602146A (Network C3I Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nThe work in this PE is performed by the United States Army Futures Command (AFC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "383.41"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "379.833"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.577"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.525"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.052"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "Funds reprogrammed out for higher priority Army requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H18"
                    },
                    "ProjectTitle": {
                        "val": "Weapons & Munitions Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.291"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "15.291"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project will realign to:\nProgram Element (PE) 0602145A Next Generation Combat Vehicle Technology \n* Project BK5 Adv Direct In-Direct Armament Sys (ADIDAS) Tech\nPE 0602147A Long Range Precision Fires Technology\n* Project AG4 Extended Range Artillery Munition Suite Technology\n* Project AG6 Energetic Materials and Advanced Processing Techno\n* Project BN5 Fuze and Power for Munitions\nPE 0602148A Future Vertical Lift Technology\n* Project AK6 Advanced Rotorcraft Armaments Protection System Te"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs, investigates, and evaluates component technologies to enable affordable precision munitions as well as provide increased lethality and performance with reduced logistics and advanced direct\/indirect fire capabilities for Soldier, ground vehicle and aviation platforms. \n\nEfforts in this Project support the Army Science and Technology Lethality Portfolio.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy\n\nFunds reprogrammed out for higher priority Army requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Novel Propulsion Technology for the Future"
                                    },
                                    "Description": {
                                        "val": "This effort explores propellant technologies such as powder coextrusion and grain coatings, while retaining insensitive properties, for employment in gun launch environments as well as directional thrusters including those that deliver a broad spectrum of effects. It also conducts experiments with these propellants to increase the range of artillery and mortar rocket assisted projectiles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.849"
                                            },
                                            "Text": {
                                                "val": "Investigated alternative processing methods amenable to achieving high-energy formulations in spheroidal and\/or pancake geometries in conjunction with development of high-energy propellant formulations; investigated processing methods, material synthesis and formulation to support development of encapsulated propellant, which could result in improved stability\/sensitivity and combustion profiles without sacrificing combustion performance; Validated the optimized electrode configuration and formulation for electrically controlled energetic materials (ECEM)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Affordable Precision Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates technologies that provide affordable precision capabilities for projectiles fired into Global Positioning System (GPS) denied environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.586"
                                            },
                                            "Text": {
                                                "val": "Investigated the optimal architecture for an Automatic Target Recognition (ATR) capable Precision Guided Munition (PGM); Included initial system trade studies, modeling of various seeker types on candidate indirect fire platform systems and experimental assessments of high risk critical components."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fuze and Power Technologies for Munitions"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs innovative fuze and power technologies for enhanced environment and target sensing\/classification, warhead initiation schemes and advanced fuze setting to provide enhanced lethality combined effects on targets and advanced initiation schemes for the next generation munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.029"
                                            },
                                            "Text": {
                                                "val": "Advanced the capability of state of the art in fuze proximity sensors to track targets in order to improve burst point accuracy and countermeasure robustness; maximized usage of all real time battlefield targeting data and integrate with fuze setters, fuze sensors, power sources, component protective technologies and unique fuze ignition schemes to design and develop extremely reliable and versatile fuzes; will investigate these new fuze designs to support hypersonics, autonomous fuzing for varied targets as well as Counter-Unmanned Aerial Systems. These technologies will continue to leverage the Office of the Secretary of Defense (OSD) Joint Munitions Program TCG - 5 and TCG-10 and the OSD Joint Fuze Technology Program."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cluster Munitions Replacement Acceleration"
                                    },
                                    "Description": {
                                        "val": "This effort will design and develop the critical components that will aid in the maturation of a materiel solution designed to replace 155mm dual purpose improved conventional munition (DPICM) artillery. The components will include the design, development and component testing of fuzing, warhead and stabilization technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.023"
                                            },
                                            "Text": {
                                                "val": "This effort began to validate the tactical designs for all concepts, and investigated incorporating additional features into the design of critical components; improved insensitive munitions (IM) performance as well as investigated and determined what other technologies could be incorporated into the materiel solutions as a potential improvements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Programmable Intelligent Collaborative Engagement Munition"
                                    },
                                    "Description": {
                                        "val": "This effort develops, matures and integrates a gun hardened suite of components (software, sensors, navigation and communications) that enable the application of distributed, cooperative and collaborative tactics for munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.463"
                                            },
                                            "Text": {
                                                "val": "Designed and developed hardware and mature algorithms and concepts validated in the prior year to a breadboard state; utilized hardware and software in the loop testbed to validate collaboration across multiple munitions in flight."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Rotorcraft Armaments Protection System"
                                    },
                                    "Description": {
                                        "val": "The Advanced Rotorcraft Armament and Protection System (ARAPS) effort designs and develops Future Vertical Lift (FVL) technologies for lightweight armament systems and multi-role munitions with enhanced lethality at extended ranges.  The effort investigates and determines the feasibility of a holistic fire control system that integrates all aspects of offensive and defensive capabilities for advanced protection and enhanced survivability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.953"
                                            },
                                            "Text": {
                                                "val": "Investigated integrated armament and advanced protection designs for FVL offensive and defensive applications; designed critical component technologies in order to develop advanced lethality and survivability capabilities in fire control, weapon systems, munitions and countermeasures; investigated system architecture solutions for an integrated armament and advanced protection system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radio Frequency Guided Munition"
                                    },
                                    "Description": {
                                        "val": "This effort investigates technologies that provide a Radio Frequency (RF) seeking capability for gun-launched projectiles to enable engagement of RF emitting sources and similar targets of interest."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.463"
                                            },
                                            "Text": {
                                                "val": "Investigated RF seeker component technologies with a focus on projectile payload performance, size, weight, power, and gun launch survivability; performed systems engineering and detailed performance analyses to determine the trade space when integrating these RF seeker technologies in gun-launched environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ARCHER"
                                    },
                                    "Description": {
                                        "val": "This effort designs and develops advanced fire control algorithms and a multirole warhead guided projectile for area defense against medium (Groups 2 and 3) sized unmanned aerial systems (UAS) and aerial rotary wing platforms, point defense against rocket propelled grenades (RPGs), anti-tank guided missiles (ATGMs), and rocket, artillery, and mortars threats as well as precision fires against dismounts in defilade."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.925"
                                            },
                                            "Text": {
                                                "val": "Investigated and matured command guided, medium caliber projectile designs on a tactical turret platform; researched and developed novel warhead and projectile stabilization architectures; conducted lab experiments to mature designs of projectile critical components; validated reliability, functionality and performance of various projectile component technologies; researched the target defeat effectiveness of material solutions for various concepts and develop algorithms based on armament system requirements."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H1A"
                    },
                    "ProjectTitle": {
                        "val": "WEAPONS & MUNITIONS TECH PROGRAM INITIATIVE (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "343"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "343.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Weapons and Munitions Technology applied research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "25"
                                        },
                                        "Text": {
                                            "val": "Program Increase"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended Range Cannon Artillery"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "20"
                                        },
                                        "Text": {
                                            "val": "Extended Range Cannon Artillery"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensor Fuzed Munition"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "20"
                                        },
                                        "Text": {
                                            "val": "Sensor Fuzed Munition"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Laser Weapons Accuracy"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "23"
                                        },
                                        "Text": {
                                            "val": "Laser Weapons Accuracy"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense Against Small UAS"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "30"
                                        },
                                        "Text": {
                                            "val": "Defense Against Small UAS"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "120 mm Cannon Fired Guided Missile"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "50"
                                        },
                                        "Text": {
                                            "val": "120 mm Cannon Fired Guided Missile"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Weapons Effectiveness in Urban Engagement"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "15"
                                        },
                                        "Text": {
                                            "val": "Weapons Effectiveness in Urban Engagement"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Armament Systems Integration"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "20"
                                        },
                                        "Text": {
                                            "val": "Armament Systems Integration"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Armament Systems Concepting"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "20"
                                        },
                                        "Text": {
                                            "val": "Armament Systems Concepting"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adv Processing of Insensitive Energ Mats"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "20"
                                        },
                                        "Text": {
                                            "val": "Adv Processing of Insensitive Energ Mats"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hybrid Projectile Tech"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Hybrid Projectile Tech"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Composite Barrel Tech"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Composite Barrel Tech"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Extended Range Artillery System"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "65.914"
                                        },
                                        "Text": {
                                            "val": "Enhanced Extended Range Artillery System"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Novel Printed Armaments Components"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "13"
                                        },
                                        "Text": {
                                            "val": "Novel Printed Armaments Components"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "1.086"
                                        },
                                        "Text": {
                                            "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H28"
                    },
                    "ProjectTitle": {
                        "val": "Warheads\/Energetics Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "21.542"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "21.542"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned to:\nProgram Element (PE) 0602141A Lethality Technology\n* Project AH9 Advanced Warheads Technology\nPE 0602147A Long Range Precision Fires Technology\n* Project AG6 Energetic Materials and Advanced Processing Techno\n* Project AG8 Advanced Energetics Technology\nPE 0602148A Future Vertical Lift Technology\n* Project AK2 Aviation Survivability Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and designs enabling warhead and energetic technologies such as new propellant techniques, and high-density explosives to produce smaller, lighter, more effective, multi-role warheads, flare and pyrotechnic countermeasures, and novel approaches for ammunition demilitarization and combat in complex environments.\n\nEfforts in this Project support the Army Science and Technology Lethality Portfolio.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Scalable Warhead Technology"
                                    },
                                    "Description": {
                                        "val": "This effort designs scalable and adaptive explosives and reactive materials technology for either gun or missile-launched weapons and munitions that can deliver a broad spectrum of effects with reduced collateral damage. In addition, this effort will facilitate the design and development of improved area clearance technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.83"
                                            },
                                            "Text": {
                                                "val": "Matured and down selected various warhead components (mini SC liners, mini explosively formed penetrator (EFPs) and multi-EFPs) for insertion into follow-on Advanced Technology Development efforts; validated effectiveness of selected concepts against simulated and actual threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Energetics"
                                    },
                                    "Description": {
                                        "val": "This effort develops advanced energetic materials and novel processing techniques for future explosives and propulsion applications that enable an increase in range, lethality, and utility of ammunitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.074"
                                            },
                                            "Text": {
                                                "val": "Matured technologies focused in nano-energetics designs for use in melt-cast formulations; matured the polymer kinetics for amorphous energetics; investigated next-generation melt-cast and cast-cure ingredients for higher energy formulations; investigated reaction kinetics for ingredient synthesis applicable to advanced flow reactors; designed and developed processing parameters necessary to produce energetic materials for additive manufacturing; developed novel modeling and simulation tools required to accurately predict energetic materials performance in novel and unique geometries."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tunable Pyrotechnics"
                                    },
                                    "Description": {
                                        "val": "This effort develops smoke and flare countermeasure for passive protection for ground and air combat platforms, and hand held signals for illumination and signaling. These capabilities will increase warfighter and aircraft survivability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.615"
                                            },
                                            "Text": {
                                                "val": "Developed an integrated solution for the Dazzler Counter Measure to include new pyrotechnic formulations; developed and modified ASCM formulations based on static and functional tests to assess viability of technology candidates; investigated new countermeasure designs in the electromagnetic (EM) spectrum to address emerging threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Warheads"
                                    },
                                    "Description": {
                                        "val": "This effort explores multiple pathways to enhance lethal efforts for future warheads against emerging peer\/near peer target sets. Investigates synergistic effects of novel micro warheads using advance materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.023"
                                            },
                                            "Text": {
                                                "val": "Characterized new family of materials for designs of novel micro warheads to achieve fragmentation, EFP and shaped charge effects; conducted parametric study to establish the performance and lethal effects of novel warhead designs."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}