{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-9035d21372bc28631c31031b85da2fbd962d290bf8d6ca6eecbc49021508de49-0",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601110D8Z"
        },
        "ProgramElementTitle": {
            "val": "Basic Research Initiatives"
        },
        "R1LineNumber": {
            "val": "3"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "39.051"
            },
            "PriorYear": {
                "val": "55.195"
            },
            "CurrentYear": {
                "val": "70.874"
            },
            "BudgetYearOne": {
                "val": "35.565"
            },
            "BudgetYearOneBase": {
                "val": "35.565"
            },
            "BudgetYearTwo": {
                "val": "36.382"
            },
            "BudgetYearThree": {
                "val": "36.988"
            },
            "BudgetYearFour": {
                "val": "38.007"
            },
            "BudgetYearFive": {
                "val": "38.794"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Basic research provides the Department of Defense (DoD) with a deep and broad awareness of current directions in areas of research important to U.S. military capabilities – including physics and the physical sciences, materials science, chemistry and chemical engineering, electrical engineering, mathematics, computer science, mechanical and aerodynamic engineering, ocean sciences, biological sciences, and the social sciences, among others.  Basic research sustains scientific and engineering communities as it generates the critical technical knowledge underpinnings of DoD capabilities.  Basic research allows exploration and discovery, yielding disruptive non-incremental advances that can improve or radically change military capabilities, strategy, and operations.\n\nThe Basic Research Initiatives program element (PE) supports the defense basic research enterprise in three critical areas:  Strategic Support for Basic Research (SSBR), the Minerva Research Initiative (MRI), and the Vannevar Bush Faculty Fellowship Program (VBFF)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "56.573"
                },
                "CurrentYear": {
                    "val": "48.874"
                },
                "BudgetYearOne": {
                    "val": "45.935"
                },
                "BudgetYearOneBase": {
                    "val": "45.935"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "55.195"
                },
                "CurrentYear": {
                    "val": "70.874"
                },
                "BudgetYearOne": {
                    "val": "35.565"
                },
                "BudgetYearOneBase": {
                    "val": "35.565"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.378"
                },
                "CurrentYear": {
                    "val": "22.000"
                },
                "BudgetYearOne": {
                    "val": "-10.370"
                },
                "BudgetYearOneBase": {
                    "val": "-10.370"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "22.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.368"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.010"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.375"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.375"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.048"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.048"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Re-alignment from PE 0601120D8Z"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "3.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Reduction for Defense Wide Review"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-12.947"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-12.947"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2021 internal program adjustments will support the Laboratory University Collaboration Initiative (LUCI) executed under Project 010.  Internal program adjustments are consistent with higher priority DoD requirements.\n\nDefense-Wide Review: The FY 2021 funding request was reduced by $12.947 million during DWR to account for the end of the Minerva Research Initiative in FY 2021."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "010"
                    },
                    "ProjectTitle": {
                        "val": "Basic Research Initiatives"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "11.960"
                        },
                        "PriorYear": {
                            "val": "26.195"
                        },
                        "CurrentYear": {
                            "val": "36.577"
                        },
                        "BudgetYearOne": {
                            "val": "3.966"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.966"
                        },
                        "BudgetYearTwo": {
                            "val": "4.110"
                        },
                        "BudgetYearThree": {
                            "val": "4.155"
                        },
                        "BudgetYearFour": {
                            "val": "4.328"
                        },
                        "BudgetYearFive": {
                            "val": "4.430"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Basic Research Initiatives project, P010, includes Strategic Support for Basic Research (SSBR) and the Minerva Research Initiative.\n\nSSBR supports oversight, policies, and initiatives to create conditions that allow defense basic research investments to producing high-payoff, transformative scientific breakthroughs for the Department.  SSBR initiatives support the five Basic Research Office strategic goals:  (1) support the 10 modernization priorities; (2) coordinate and conduct oversight of DoD basic research programs; (3) improve the science and engineering workforce and public outreach; (4) enhance university-industry collaboration; and (5) engage with the academic research community and international partners.\n\nThe Minerva Research Initiative, a Department of Defense basic research program in the social sciences directed by the Office of the Secretary of Defense (OSD), funded in partnership with Air Force and Navy University Research Initiatives and executed by the Office of Naval Research and the Air Force Office of Scientific Research, seeks to build a fundamental understanding of the sources of present and future conflict."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase for Minerva Research Initiative"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "1.960"
                                        },
                                        "Text": {
                                            "val": "Continue to support successful ongoing university-led research projects and execute 12-15 new projects based on input from DoD stakeholders. This includes additional projects aligned with recent Congressional interest, such as those on peer and near-peer statecraft, supported by the Congressional increase to the Minerva budget."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "2.000"
                                        },
                                        "Text": {
                                            "val": "The Minerva Research Initiative will use the FY 2020 congressional add to award foreign malign influence from the 2019 university-wide FOA."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense Experimental Program to Stimulate Competitive Research (DEPSCOR)"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "12.000"
                                        },
                                        "Text": {
                                            "val": "Defense Experimental Program to Stimulate Competitive Research (DEPSCoR) is a legislated program that helps build the national infrastructure for research and education by funding research activities in science and engineering (S&E) responsive to the needs of national defense. Participation in this program is limited to states that meet eligibility criteria as outlined in the authorizing language. The program is intended to increase the number of university researchers and improve the capabilities of institutions of higher education (IHEs) in eligible jurisdictions to perform competitive S&E research relevant to the Department. IHEs in eligible states will be invited to compete for awards in areas identified by the Department in broad agency announcements."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "12.000"
                                        },
                                        "Text": {
                                            "val": "DEPSCoR will build on the program started in FY19 to expand the DoD research landscape.  The program will include increasing funding for Service capacity building projects, outreach to research institutions that have less engagement with the DoD and a stand-alone DEPSCoR competition."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8.000"
                                        },
                                        "Text": {
                                            "val": "A multi-disciplinary research program will be initiated to conduct basic research in the resiliency and protection of cyber-networks and cyber physical systems in use defense-wide, or parts of a critical infrastructure to support military operations. The program will seek to explore on how to develop rigorous approaches for detection and attribution of attacks by:  (1) malicious agents and foreign powers; (2) automatic prevention and recovery of critical systems through a combination of mathematics; (3) computer science and artificial intelligence; and (4) prediction of human-cyber interactions."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Strategic Support for Basic Research (SSBR)"
                                    },
                                    "Description": {
                                        "val": "The SSBR program creates conditions for defense basic research investments capable of producing high-payoff, transformative scientific breakthroughs for the Department.  SSBR initiatives support the five Basic Research Office strategic goals:  (1) drive the direction of DoD basic research investments; (2) coordinate and conduct oversight of DoD basic research programs; (3) improve the science and engineering (S&E) workforce and public outreach; (4) enhance university-industry collaboration; and (5) engage with the academic research community and international partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Conduct four to six workshops for scientific situational awareness that were planned in previous fiscal years.  Convene national research leaders to provide expert perspectives on potential breakthroughs and barriers of advancement in rapidly evolving fields of basic research.  Establish a Dean’s Roundtable to provide a forum for university and DoD leaders to engage on cutting edge research topics, preventing research espionage, and promoting rapid innovation.  Continue studies of how past DoD investments and high priority basic research has led to advances in new technologies and new capabilities for the Nation.  As part of the USD(R&E) mission, continue to analyze university-related business practices for improvement and efficiency.  Continue support for scientific expertise to oversee science and engineering initiatives.  Evaluate effectiveness of Defense Enterprise Science Initiative (DESI) and I-Corps pilot programs.  Improve awareness of DoD basic research programs through outreach and site visits to performers in the national basic research enterprise, public events such as the Science, Technology, and Innovation Exchange (STIx) conference, and by overhauling public platforms such as the Basic Research Office website to improve information dissemination and access."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.163"
                                            },
                                            "Text": {
                                                "val": "Conduct workshops for scientific situational awareness.  Continue convening national research leaders to provide expert perspectives on potential breakthroughs and barriers of advancement in rapidly evolving fields of basic research including a second year of the Dean’s Roundtable.  Continue studies of the effectiveness of past DoD investments and high priority basic research in advancing new technologies and new capabilities for the Nation.  As part of the USD(R&E) mission, continue to analyze university-related business practices for efficiency and maintenance of research integrity. Organize and execute a competition for the I-Corps@DoD program, and conduct a review of I-Corps projects.  Continue to iteratively refine communication and outreach efforts, such as site visits and the STIx ‎conference to increase awareness of DoD basic research programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.966"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.966"
                                            },
                                            "Text": {
                                                "val": "Conduct workshops for scientific situational awareness.  Continue convening national research leaders to provide expert perspectives on potential breakthroughs and barriers of advancement in rapidly evolving fields of basic research including a third year of the Dean’s Roundtable.  Continue studies of the effectiveness of past DoD investments and high priority basic research in advancing new technologies and new capabilities for the Nation.  As part of the USD(R&E) mission, continue to analyze university-related business practices for improvement and efficiency and support for scientific expertise to oversee science and engineering initiatives.  Organize and execute a competition for the I-Corps@DoD program, and conduct a review of I-Corps projects.  Continue to iteratively refine communication and outreach efforts, such as site visits and the STIx ‎conference to increase awareness of DoD basic research programs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent between FY 2020 and FY 2021.  Small changes reflect Office of the Secretary of Defense (OSD) interest in basic research."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Minerva Research Initiative"
                                    },
                                    "Description": {
                                        "val": "The Minerva Research Initiative includes three primary components:  (1) a university-based social science basic research grant program, funded in partnership with Air Force and Navy University Research Initiatives; (2) the Defense Education and Civilian University Research (DECUR) Partnership program for the professional military education (PME) institutions; and (3) a collaboration with the Congressionally-established United States Institute of Peace to award research support to advanced graduate students and early career scholars working on security and peace.  All components contribute to Minerva's goals of revitalizing connections between DoD and academic social science communities and building cultural and foreign area knowledge on topics ranging from China-Russia great power competition, National Defense Strategy (NDS) strategic priorities, to geopolitical power projection strategies in a multi-polar world.  This deeper scientific understanding will provide a more informed basis to shape doctrine, analysis, and other strategic and operational decisions made by war planners and warfighters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.235"
                                            },
                                            "Text": {
                                                "val": "Continue to support successful ongoing university-led research projects and execute 12-14 new projects based on input from DoD stakeholders.  Encourage more partnerships between university-led and R-DEF projects.  Continue active engagement with operational community by providing subject matter expertise on request and through the annual Minerva Conference and outreach to DoD stakeholders.  Retain existing and generate new connections to policy and operational communities to facilitate the transition of Minerva research.  Effectively connect new social science discoveries and analytical methods to current and future defense leadership and to inform future security decisions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.414"
                                            },
                                            "Text": {
                                                "val": "All full proposal applicants from civilian universities and Professional Military Education institutions who applied to the 2019 Minerva Funding Opportunity Announcement (FOA) or the Defense Education Civilian University Research (DECUR) Partnership 2019 will be notified that no new awards will be made, except with congressional funds and Service contributions. Additionally, over 30 universities will be notified that all ongoing projects (23) who have received full awards will be terminated early.\n\nFull proposal applicants from civilian universities and Professional Military Education institutions who applied under the Defense Education Civilian University Research (DECUR) Partnership to the 2019 Minerva Funding Opportunity Announcement (FOA) will be notified of award selection. From the 2019 university FOA, awards will be made on peer\/near-peer competition and on foreign malign influence, using funds associated with the FY 2019 and FY 2020 congressional adds, respectively. New awards will not be made, except with congressional funds and Service contributions. \n\nOUSD(R&E) funding for the Minerva Research Initiative will end in FY 2021 resulting from the Defense Wide Review."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "DWR: Funding for the Minerva Research Initiative will end in FY 2021 resulting from the Defense Wide Review."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "060"
                    },
                    "ProjectTitle": {
                        "val": "Vannevar Bush Faculty Fellowship"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "27.091"
                        },
                        "PriorYear": {
                            "val": "29.000"
                        },
                        "CurrentYear": {
                            "val": "34.297"
                        },
                        "BudgetYearOne": {
                            "val": "31.599"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.599"
                        },
                        "BudgetYearTwo": {
                            "val": "32.272"
                        },
                        "BudgetYearThree": {
                            "val": "32.833"
                        },
                        "BudgetYearFour": {
                            "val": "33.679"
                        },
                        "BudgetYearFive": {
                            "val": "34.364"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Vannevar Bush Faculty Fellowship program supports world-class researchers in scientific areas of critical importance to DoD and ensures the cultivation of exceptional talent.  Fellows’ research spans a broad set of emerging scientific areas with transformative potential, including Quantum Information Science, Novel Engineered Materials, Cognitive Neuroscience, Engineering Biology, Applied Mathematics and Statistics, Manufacturing Science and others.  The program fosters close connections between academia and the defense science and engineering enterprise, a primary goal of SSBR efforts.  Fellows provide the Department the deep scientific expertise from today’s leading research universities and collaborate with defense scientists and engineers.  This program actively engages and coordinates basic research across the Department."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Vannevar Bush Faculty Fellowship (VBFF) Program"
                                    },
                                    "Description": {
                                        "val": "The Vannevar Bush Program ensures the DoD has a research portfolio that supports creative, innovative, and productive university researchers.  The objectives of the program are to:  (1) support scientific research that may lead to extraordinary outcomes; (2) educate and train student and post-doctoral researchers for the defense and national security workforce; (3) foster long-term relationships between university researchers and the Department; (4) familiarize select university researchers and their students with DoD's current and future challenges through research and engagement with DoD-employed scientists; and (5) increase the number of exceptionally talented technical experts that are contributing to DoD's mission."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.000"
                                            },
                                            "Text": {
                                                "val": "Support 55 Vannevar Bush Fellows and collaborative research efforts with 36 Laboratory University Collaboration Initiative (LUCI) Fellows from DoD Service Laboratories.  LUCI fellows engage in a three-year basic research collaboration between Vannevar Bush Fellows in fields of critical interest to the Department. Review and update program focus topic areas with input from DoD S&T community.  Organize and execute a competition to select a new class of Vannevar Bush Fellows.  Organize and conduct the Vannevar Bush annual meeting, including DoD laboratory tours.  Facilitate connections between new Fellows and DoD scientists and engineers.  Organize and conduct a program review and site visits to monitor the research progress by Vannevar Bush Fellows and their DoD collaborators.  Conduct review of LUCI projects in DoD laboratories and report the scientific progress and impacts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "34.297"
                                            },
                                            "Text": {
                                                "val": "Support 55 Vannevar Bush Fellows and collaborative research efforts with 25 Laboratory University Collaboration Initiative (LUCI) Fellows from DoD Service Laboratories.  LUCI fellows engage in a three-year basic research collaboration between Vannevar Bush Fellows in fields of critical interest to the Department. Review and update program focus topic areas with input from DoD S&T community.  Organize and execute a competition to select a new class of Vannevar Bush Fellows.  Organize and conduct the Vannevar Bush annual meeting, including DoD laboratory tours.  Facilitate connections between new Fellows and DoD scientists and engineers.  Organize and conduct a program review and site visits to monitor the research progress by Vannevar Bush Fellows and their DoD collaborators.  Organize and execute a competition for the LUCI program.  Conduct review of LUCI projects in DoD laboratories and report the scientific progress and impacts.  Organize a study group to introduce and educate Vannevar Bush Faculty Fellows to national security challenges."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "31.599"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "31.599"
                                            },
                                            "Text": {
                                                "val": "Support 55 Vannevar Bush Fellows and collaborative research efforts with 25 Laboratory University Collaboration Initiative (LUCI) Fellows from DoD Service Laboratories.  LUCI fellows engage in a three-year basic research collaboration between Vannevar Bush Fellows in fields of critical interest to the Department. Review and update program focus topic areas with input from DoD S&T community.  Organize and execute a competition to select a new class of Vannevar Bush Fellows.  Organize and conduct the Vannevar Bush annual meeting, including DoD laboratory tours.  Facilitate connections between new Fellows and DoD scientists and engineers.  Organize and conduct a program review and site visits to monitor the research progress by Vannevar Bush Fellows and their DoD collaborators.  Organize and execute a competition for the LUCI program.  Conduct review of LUCI projects in DoD laboratories and report the scientific progress and impacts.  Organize a study group to introduce and educate Vannevar Bush Faculty Fellows to national security challenges."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort decreases between FY 2020 and FY 2021 due to departmental prioritization."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}