{
    "id": "2021-Army-PB-2040-JBOOK-2ce7b76ca8f41dbc06183380f90728d4a8e40b9122c9effab5b4a02fdffb364e-25",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0606942A"
        },
        "ProgramElementTitle": {
            "val": "Assessments and Evaluations Cyber Vulnerabilities"
        },
        "R1LineNumber": {
            "val": "211"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "88.3"
            },
            "CurrentYear": {
                "val": "4.5"
            },
            "BudgetYearOne": {
                "val": "4.496"
            },
            "BudgetYearOneBase": {
                "val": "4.496"
            },
            "BudgetYearTwo": {
                "val": "4.496"
            },
            "BudgetYearThree": {
                "val": "4.496"
            },
            "BudgetYearFour": {
                "val": "4.676"
            },
            "BudgetYearFive": {
                "val": "4.723"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "115.687"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The National Defense Authorization Acts (NDAA), Fiscal Years (FY) 16 Section 1647, and FY 17 Section 1650, directs the office of the Secretary of Defense (OSD) to complete an evaluation of cyberspace vulnerabilities of select DoD weapon systems and critical infrastructures. For NDAA 1647, the Army was directed to assess and mitigate twenty-four weapon systems NLT December 31, 2019. For NDAA 1650, the Army was directed to assess and submit a mitigation strategy for twenty-five installations, NLT 31 December, 2020. To support this mandate, the HQDA G-3 directed DAMO-CY to evolve the two congressional mandates into two enduring Army programs: the Cyber Operational Resiliency Assessment-Platforms (CORA-P) to replace NDAA 1647, and the Cyber Operational Resiliency Assessment-Installations (CORA-I) to replace NDAA 1650. The aim of CORA-P\/I is to reduce the Army's risk to adversarial cyber intrusions or attacks that compromises the Army weapon and installation systems.  In compliance with the congressional mandates, DAMO-CY's performance objectives is to provide governance oversight over the execution of CORA-P\/I phased vulnerability assessments to support o the Planning, Programming, Budgeting and Execution (PPBE) cycle. These deliverables include identifying the means to mitigate CORA-P\/I vulnerabilities.\n\nThis Program Element (PE) funds cyber vulnerabilities evaluations of major weapon systems in alignment with Section 1647 of the National Defense Authorization Act (NDAA) for Fiscal Year (FY) 2016, and of critical infrastructure in alignment with Section 1650 of NDAA 2017. Efforts in this PE will: 1) identify, assess, and develop and identify non-recurring engineering (NRE) to mitigate operational risks from cyber vulnerabilities to critical Army weapon systems in an operational configuration; and 2) assure the confidentiality, availability, and integrity of the information and control systems that underpin Army facilities and critical infrastructure by inventorying and assessing Facility-Related Control Systems (FRCS).\n\nWeapon systems evaluations will assess and provide NRE recommendations to mitigate operational risks emanating from a peer or near-peer adversary profile in accordance with existing test\/lab requirements of through acquisition cycle. Where applicable, these evaluations will include tabletop exercises, lab assessments, and exercise\/operational assessments of Program Executive Officer Command, Control, Communications-Tactical (PEO C3T) and ground weapon systems. Cyber hardening efforts will be informed by the vulnerability assessments reports (VAR) generated through the assessment and prioritization process.  Prioritization will be based on mission criticality, impact to readiness, and threat. When applicable, this PE also provides for Red Team enhancement to support Combatant Command mission-level cyber vulnerability assessments. \n\nEvaluations of cyber vulnerabilities to critical infrastructure will focus on Task Critical Assets, Defense Critical Assets, and on units with high priority Quadrennial Defense Review missions and their supporting infrastructure. When necessary, this PE will provide for the training of teams to conduct cyber vulnerability evaluations on critical infrastructure. Once trained, these teams will conduct cooperative vulnerability and penetration assessments (Blue Teaming), adversarial assessments (Red Teaming), and assist with conducting assessments of cyber dependencies, vulnerabilities and threats in accordance with DoDI 8501.1 \"Risk Management Framework.\" Funding will also provide for Contractor subject matter expertise to conduct Security Control Assessments and Deep Cyber Resiliency Assessments."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "88.3"
                },
                "CurrentYear": {
                    "val": "4.5"
                },
                "BudgetYearOne": {
                    "val": "4.5"
                },
                "BudgetYearOneBase": {
                    "val": "4.5"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "88.3"
                },
                "CurrentYear": {
                    "val": "4.5"
                },
                "BudgetYearOne": {
                    "val": "4.496"
                },
                "BudgetYearOneBase": {
                    "val": "4.496"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-0.004"
                },
                "BudgetYearOneBase": {
                    "val": "-0.004"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.004"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.004"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "FL2"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Vulnerabilities Assessments and Evaluations"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "88.3"
                        },
                        "CurrentYear": {
                            "val": "4.5"
                        },
                        "BudgetYearOne": {
                            "val": "4.496"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.496"
                        },
                        "BudgetYearTwo": {
                            "val": "4.496"
                        },
                        "BudgetYearThree": {
                            "val": "4.496"
                        },
                        "BudgetYearFour": {
                            "val": "4.676"
                        },
                        "BudgetYearFive": {
                            "val": "4.723"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "115.687"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Program Element (PE) funds cyber vulnerabilities evaluations of major weapon systems in alignment with Section 1647 of the National Defense Authorization Act (NDAA) for Fiscal Year (FY) 2016, and of critical infrastructure in alignment with Section 1650 of NDAA 2017. Efforts in this PE will: 1) identify, assess, and develop and identify non-recurring engineering (NRE) to mitigate operational risks from cyber vulnerabilities to critical Army weapon systems in an operational configuration; and 2) assure the confidentiality, availability, and integrity of the information and control systems that underpin Army facilities and critical infrastructure by inventorying and assessing Facility-Related Control Systems (FRCS).\n\nWeapon systems evaluations will assess and provide NRE recommendations to mitigate operational risks emanating from  a peer or near-peer adversary profile in accordance with existing test\/lab requirements of through acquisition cycle. Where applicable, these evaluations will include tabletop exercises, lab assessments, and exercise\/operational assessments of Program Executive Officer Command, Control, Communications-Tactical (PEO C3T) and ground weapon systems. Cyber hardening efforts will be informed by the vulnerability assessments reports (VAR) generated through the assessment and prioritization process.  Prioritization will be based on mission criticality, impact to readiness, and threat. When applicable, this PE also provides for Red Team enhancement to support Combatant Command mission-level cyber vulnerability assessments.\n\nEvaluations of cyber vulnerabilities to critical infrastructure will focus on Task Critical Assets, Defense Critical Assets, and on units with high priority Quadrennial Defense Review missions and their supporting infrastructure. When necessary, this PE will provide for the training of teams to conduct cyber vulnerability evaluations on critical infrastructure. Once trained, these teams will conduct cooperative vulnerability and penetration assessments (Blue Teaming), adversarial assessments (Red Teaming), and assist with conducting assessments of cyber dependencies, vulnerabilities and threats in accordance with DoDI 8501.1 \"Risk Management Framework.\" Funding will also provide for Contractor subject matter expertise to conduct Security Control Assessments and Deep Cyber Resiliency Assessments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyberspace Operational Resiliency Assessment ? Platform (CORA-P)"
                                    },
                                    "Description": {
                                        "val": "CORA-P is the Army's response to Section 1647 of the 2016 National Defense Authorization Act (NDAA) which directed the Department of the Defense (DoD) to evaluate cyber vulnerabilities of major weapon systems. DAMO-CY will be the oversight governing body overseeing the assessments and NRE mitigations process to cyber vulnerabilities identified in the VAR."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "37.45"
                                            },
                                            "Text": {
                                                "val": "Funding provides for the completion of the eight critical weapon systems already in some stage of the evaluation process.  Additionally, provides for the 11 remaining Program Executive Officer Command, Control, Communications-Tactical (PEO C3T) and ground weapon systems identified as a part of the Section 1647 directive by conducting tabletop exercises, lab assessments, and exercise\/operational assessments (where applicable). Provides for the enhancement of existing red team elements and efforts attributed to Combatant Command (COCOM) mission level assessments. \n\nCyber hardening efforts will apply the knowledge from weapon systems vulnerability assessments (CORA-P) to identify the gaps, develop mitigation strategies to reduce operational risk and prioritize resources. Prioritization will be based on mission criticality, impact to readiness, and threat."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.25"
                                            },
                                            "Text": {
                                                "val": "The funding provides DAMO-CY the opportunity to complete evaluation of the 24 critical weapon systems and the 26 critical infrastructures for cyber vulnerabilities, identified by the DoD, in support of NDAAs 1647 and 1650. This includes lab assessments, tabletop exercises, and additional analytical, exercise, and or operational assessments. This funding provides DAMO-CY the ability to develop Red Team capacity to carry out Combatant Command (COCOM) mission level assessments. Cyber hardening efforts will be informed by the vulnerability assessments reports (VAR) generated through the assessment and prioritization process.  Prioritization will be based on mission criticality, impact to readiness, and threat analysis."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.248"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.248"
                                            },
                                            "Text": {
                                                "val": "The funding provides DAMO-CY the opportunity to complete evaluation of the 24 critical weapon systems and the 26 critical infrastructures for cyber vulnerabilities, identified by the DoD, in support of NDAAs 1647 and 1650. This includes lab assessments, tabletop exercises, and additional analytical, exercise, and or operational assessments. This funding provides DAMO-CY the ability to develop Red Team capacity to carry out Combatant Command (COCOM) mission level assessments. Cyber hardening efforts will be informed by the vulnerability assessments reports (VAR) generated through the assessment and prioritization process.  Prioritization will be based on mission criticality, impact to readiness, and threat analysis"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Nominal change in program."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyberspace Operational Resiliency Assessment ? Installation (CORA-I)"
                                    },
                                    "Description": {
                                        "val": "CORA-I is the Army's response to Section 1650 of the 2017 NDAA. Evaluations of cyber vulnerabilities to critical infrastructure will focus on Task Critical Assets, Defense Critical Assets, and on units with high priority Quadrennial Defense Review missions and their supporting infrastructure. When necessary, this PE will provide for the training of teams to conduct cyber vulnerability evaluations on critical infrastructure. Once trained, these teams will conduct cooperative vulnerability and penetration assessments (Blue Teaming), adversarial assessments (Red Teaming), and assist with conducting assessments of cyber dependencies, vulnerabilities and threats in accordance with DoDI 8501.1 \"Risk Management Framework.\" Funding will also provide for Contractor subject matter expertise to conduct Security Control Assessments and Deep Cyber Resiliency Assessments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "37.45"
                                            },
                                            "Text": {
                                                "val": "Funding provides for the training of teams to conduct cyber vulnerability assessments on critical infrastructure. Once trained these teams will conduct cooperative vulnerability and penetration assessments (Blue Teaming), adversarial assessments (Red Teaming), and assist with conducting assessments of cyber dependencies, vulnerabilities and threats in accordance with DoDI 8510.1 ?Risk Management Framework.? Funding also provides for Contractor subject matter expertise to conduct Security Control Assessments and Deep Cyber Resiliency Assessments.\n\nThe 2017 Army Cybersecurity Strategy for FRCS established the requirement to inventory and conduct Risk Management Framework on legacy systems.  Concurrently, the Unified Facility Criteria 4-010-06 established the requirement to design cybersecurity protections into FRCS within all new MILCON projects.  The cyber hardening efforts will apply the knowledge from critical installation vulnerability assessments (CORA-I) to identify the gaps, develop mitigation strategies to FRCS, and prioritize resources. Prioritization will be based on mission criticality, impact to readiness, and threat."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.25"
                                            },
                                            "Text": {
                                                "val": "Funding provides for the training of teams to conduct cyber vulnerability assessments on critical infrastructure. Once trained these teams will conduct cooperative vulnerability and penetration assessments (Blue Teaming), adversarial assessments (Red Teaming), and assist with conducting assessments of cyber dependencies, vulnerabilities and threats in accordance with DoDI 8510.1 \"Risk Management Framework.\" Funding also provides for Contractor subject matter expertise to conduct Security Control Assessments and Deep Cyber Resiliency Assessments. The 2017 Army Cybersecurity Strategy for FRCS further established the requirement to inventory and conduct Risk Management Framework on select-DoD legacy systems. The Unified Facility Criteria 4-010-06 also established the requirement to design cybersecurity protections into FRCS within all new MILCON projects. Cyber hardening efforts will be informed by the vulnerability assessments reports (VAR) generated through the assessment and prioritization process.  Prioritization will be based on mission criticality, impact to readiness, and threat."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.248"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.248"
                                            },
                                            "Text": {
                                                "val": "Funding provides for the completion of the select-DoD twenty-five critical infrastructures assessments already in some stage of the evaluation process, identified as part of the Section 1650 directive, executed through on-sight assessments. These assessments result in VAR in support of the PPBE cycle.  Funding also provides developing and maintaining a Red and Blue teams carry out on-site assessments. Cyber hardening efforts will be informed by the vulnerability assessments reports (VAR) generated through the assessment and prioritization process.  Prioritization will be based on mission criticality, impact to readiness, and threat."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Nominal change in program."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fiscal Year 2019 (FY19) Pending Recission"
                                    },
                                    "Description": {
                                        "val": "FY19 Pending Recission"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.4"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}