{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-9035d21372bc28631c31031b85da2fbd962d290bf8d6ca6eecbc49021508de49-68",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0604940D8Z"
        },
        "ProgramElementTitle": {
            "val": "Central Test and Evaluation Investment Program (CTEIP)"
        },
        "R1LineNumber": {
            "val": "148"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "1369.359"
            },
            "PriorYear": {
                "val": "264.179"
            },
            "CurrentYear": {
                "val": "390.692"
            },
            "BudgetYearOne": {
                "val": "422.451"
            },
            "BudgetYearOneBase": {
                "val": "422.451"
            },
            "BudgetYearTwo": {
                "val": "410.939"
            },
            "BudgetYearThree": {
                "val": "295.606"
            },
            "BudgetYearFour": {
                "val": "304.695"
            },
            "BudgetYearFive": {
                "val": "311.395"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "270.013"
                },
                "CurrentYear": {
                    "val": "260.267"
                },
                "BudgetYearOne": {
                    "val": "290.404"
                },
                "BudgetYearOneBase": {
                    "val": "290.404"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "264.179"
                },
                "CurrentYear": {
                    "val": "390.692"
                },
                "BudgetYearOne": {
                    "val": "422.451"
                },
                "BudgetYearOneBase": {
                    "val": "422.451"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.834"
                },
                "CurrentYear": {
                    "val": "130.425"
                },
                "BudgetYearOne": {
                    "val": "132.047"
                },
                "BudgetYearOneBase": {
                    "val": "132.047"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "130.425"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-5.788"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other DoD Priorities"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-4.277"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.277"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.046"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.276"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.276"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "DoD add for Electronic Warfare testing"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "136.600"
                                },
                                "BudgetYearOneBase": {
                                    "val": "136.600"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2020: Congressional adjustments include $20.000 million for Hypersonics Test Facilities, $45.625 million for Hypersonics Ground Testing, $7.000 million for Space Test Infrastructure, $12.500 million for Flight Test Infrastructure, $20.000 million for Directed Energy Infrastructure, $10.000 million for Cyber Infrastructure, $3.000 million for Cyber Resiliency, and $12.300 million for Defense Threat Center Excellence.\nFY 2021: Adjustments include an increase of $136.600 million for Electronic Warfare testing and a reduction of $4.277 million for other DoD priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "940"
                    },
                    "ProjectTitle": {
                        "val": "Central Test and Evaluation Investment Program (CTEIP)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "1369.359"
                        },
                        "PriorYear": {
                            "val": "264.179"
                        },
                        "CurrentYear": {
                            "val": "390.692"
                        },
                        "BudgetYearOne": {
                            "val": "422.451"
                        },
                        "BudgetYearOneBase": {
                            "val": "422.451"
                        },
                        "BudgetYearTwo": {
                            "val": "410.939"
                        },
                        "BudgetYearThree": {
                            "val": "295.606"
                        },
                        "BudgetYearFour": {
                            "val": "304.695"
                        },
                        "BudgetYearFive": {
                            "val": "311.395"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Since its inception in FY 1990, this program element (PE) funds the development of critically needed, high-priority Test and Evaluation (T&E) capabilities for joint\/multi-Service requirements. Projects under the CTEIP PE support the National Defense Strategy and align with the USD R&E priorities.  CTEIP funds projects in Hypersonics, Directed Energy, Cyber Security\/Electronic Warfare, Missile Defense, Nuclear Effects, Space Autonomy and Command\/Control and Communications.  Other Investments align with objectives in the Strategic Plan for DoD T&E Resources for high priority test needs and common range Infrastructure.  \n\nThe Central Test and Evaluation Investment Program (CTEIP) uses a corporate investment approach to combine Service, Defense, and other Government agencies T&E needs, maximize opportunities for joint efforts and avoid unwarranted duplication of test capabilities. CTEIP evaluates and selects for execution those proposed projects that best provide the greatest return on investment; make efficient use of limited test resources; leverage Service investment; and promote joint solutions to fill test capability gaps.  CTEIP provides enterprise solutions that benefit the Department as a whole.  The CTEIP PE supports two basic tasks: investments to improve and develop the test capabilities base (Joint Improvement and Modernization (JIM) projects) and development of near-term solutions to test capability shortfalls in support of ongoing operational test programs (Resource Enhancement Projects (REP).\n\nThe JIM funds critically needed T&E investments in the major areas across the USD R&E priorities and planned investments which continue to drive innovations on our Major Ranges and Test Facility Bases to increase efficiency and reduce the cost of testing.  Examples of Critical investments include infrastructure developments needed for testing hypersonic weapon systems, electronic warfare threat emulators long range airborne telemetry, mobile optical tracking, nuclear survivability and unmanned and autonomous systems. CTEIP continues to serve as the focal point for fostering common architectures throughout the test and training communities to enhance the sharing of resources and linkages between test and training ranges.  \n\nThe REP funds development of near-term solutions for critical ongoing operational tests supporting decisions on major, high-priority defense acquisition programs.  These unanticipated operational test (OT) capability requirements arise from several sources such as a new threat system identified during OT planning, acquisition of foreign military assets that are critical in determining weapon system operational effectiveness and emerging technologies and test requirements resulting from operational concept changes mandated by Congress or Director, Operational Test & Evaluation (DOT&E), or system-of-systems testing. Funding these activities under the CTEIP provides the opportunity to coordinate and integrate these near-term test requirements with the total DoD test and evaluation investment planning, and ensures their availability for other programs that may have similar testing requirements.\nThis Budget Activity 6 PE includes special studies, analyses, project improvements, quick reaction efforts and strategic planning related to test capabilities and infrastructure.  Additionally, this activity supports the development and application of proven technologies to provide major test and evaluation capabilities required to meet DoD testing requirements for component weapon systems.\n\nDetailed below is the description of the FY2021 CTEIP budget.  FY2021 includes increased investments in high-priority hypersonic ground and open air range test capability developments, for critically needed upgrades to DoD Threat Models and Simulations, investments in High Energy Laser testing, revitalization and improvements of the Nuclear Effects testing capability and efforts to test autonomous vehicles both virtually and live."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Central Test and Evaluation Investment Program"
                                    },
                                    "Description": {
                                        "val": "Joint Investment and Modernization Projects:\n- Continued development of the initial unit and integration with NEWEG project test capability of the  Advanced Dynamic Transmitter Array (ADTRA) project to provide a complex, dynamic radio frequency (RF) threat environment at the Benefield Anechoic Facility (BAF) to test advanced aircraft against EW threats. \n- Completed the preliminary and final design of the FLY-out System for the Advanced Range Tracking and Imaging System (ARTIS) project to provide an integrated next generation suite of optical tracking systems to increase performance, reduce costs and establish secure reliable optical tracking capability on DoD open-air ranges. \n-  Completed System Requirements Reviews for both systems of the Advanced Vehicle Durability Testing (AVDT) project that develops a multi-axle vehicle chassis simulator and a drive train simulator at Aberdeen Proving Grounds, MD in order to test 4 and 5 axle vehicle performance and reliability.\n-  Completed critical design review and risk reduction for the Advanced Weapons Effects Test Capability (AWETC) project to develop a capability to more accurately measure fragment characteristics of explosive weapons (2mm size and above) and more accurately estimate collateral damage distances. \n-  Completed Requirements and Project Planning for all subprojects and Preliminary Design for the Guardian subproject for the Autonomy, Integration and Teaming (AIT) project to develop the capability to safely operate Unmanned and Autonomous aerial vehicles in controlled airspace. \n- Completed requirements development and project planning for the Autonomous Systems Test Capability (ASTC) project that develops test capability for DoD autonomous ground systems.  \n- Completed development and Factory Acceptance Testing for CLPS unit #1 of the Closed Loop PESA Simulator (CLPS) project to develop a closed-loop radar system that will closely replicate the performance of a widely fielded Western Pacific (WESTPAC) long-range surface-to-air missile (SAM) system. \n- Finalized procurement and delivery of the G550 AEW aircraft and completed PDR #1 for the Commercial Derivative Aircraft Based Instrumentation Telemetry System (CBITS) project provides expanded telemetry support for aircraft and missile defense testing in inter-range and broad ocean area weapons testing.  Evaluations of the PDR design indicated the design would not satisfy the complete system specifications required to support the Concept of Operation Use Cases.\n- Completed work on upgrades focusing on correlation with Western Test Range open air systems for the Common Modeling and Simulation (M&S) Threat Environment Model for Long Range Strike (LRS) Family of Systems project which improves constructive mission-level models (Suppressor and ESAMS) to evaluate LRS Family of Systems survivability performance against a modern threat Integrated Air Defense System. \n- Continued site activation at 6 ranges for the completed F-22 configuration deliveries. Initiated software upgrade to Windows 10. Continued the Interim Contractor Support contract to provide initial support for the Common Range Integrated Instrumentation System (CRIIS) project that establishes a high dynamic, sub-meter, military standard (MILS) capable range instrumentation system.\n- Completed fielding at SPAWAR Systems Center Pacific, CA and supported USS Secure Serial 7 and 8 test events for the Cyber Test Analysis and Simulation Environment (Cyber TASE) project that provides the ability to test enterprise level IT systems against increasingly robust Cyber threats.\n- Provided support to Test and Evaluation\/Science and Technology (T&E\/S&T) Program efforts for the Dense Plasma Focus (DPF) project that that provides very short pulse neutron effects test capability for certification and survivability testing of new circuit card designs. \n- Completed risk reduction under the Enhanced Solutions Process (ESP) for the Direct Inject Electro-Optical-Infrared System (EO-IR). This proposal provides a test capability for high speed, coordinated EO\/IR sensor stimulation to ensure comprehensive testing of sensor fusion algorithms for aircraft and helicopters. \n- Contract awarded and System Requirements Review completed on the Direct Inject Jammer Common Operating Picture (DIJCOP) project that provides real-time awareness, data collection and analysis of DIJ health, status and geolocation information for both White and Red Cell operations at JRTC, Ft Polk, LA and JMRC, Hohenfels, Germany.  \n- Completed requirements development, risk reduction and preliminary design for key HEU elements. Completed test casting of a depleted uranium safety block to confirm production process prior to casting with HEU on the Fast Burst Reactor Upgrade (FBRU) project that replaces the Highly Enriched Uranium HHEU) fuel for the existing FBR with new fuel (seven rings and two safety blocks) to test missile components to required levels of short-pulse neutrons simulating Nuclear Weapons Effects.  \n- Completed initial prototype development finalizing design for the Global Position System Localized EW Emitter (GPS LEWE) project to provide low energy, vehicle mounted GPS jamming capability for testing of ground vehicle communications and navigation systems against GPS jamming. \n- Continued design activities on the G-Range Weather Effects project that upgrades the three inch G-range test track at AEDC to provide a small scale dust, rain, and snow erosion hypersonic test capability. \n-Continued the development of requirements and started design activities for the High Altitude LIDAR Atmospheric Sensing (HALAS) system that provides DOD launch and flight test ranges with improved ability to measure atmospheric conditions to reduce uncertainty and improve launch and recovery operations.  \n- Continued design work on the Holloman AFB High Speed Test Track (HHSTT) to provide a full scale rain erosion capability to validate vehicle structural designs and qualify hypersonic weapon systems for flight in an open air environment.\n- Continued design activities for the heater pit construction and initiated refractory brick procurement.  Source selection for the system integration contract completed and work started to complete component designs and start ordering long lead items for the Hypersonic Test Capability Improvement Project (Phoenix) to provide a clean air, variable Mach ground test capability for hypersonic system prototypes from Mach 4 to Mach 7.5 at Arnold Engineering Development (AEDC) Complex, TN. \n- Completed integration of five threat command posts at the Electronic Combat Range, China Lake, CA. for the Integrated Air Defense System (IADS) Enhancements project that fields high-priority, threat-representative Command Post (CP) models to open air test ranges. \n- Continued early operational capability fielding at NAS Patuxent River, MD and Edwards AFB, CA for the Integrated Network Enhanced Telemetry (iNET) Project Block I capability to develop a network-enhanced aeronautical telemetry capability for T&E ranges and facilities. \n- Completed analysis and designs required for supported EW projects on the Integrated Technical Evaluation and Analysis of Multiple Sources (ITEAMS) activities to provide detailed analysis and validation of threat system designs and operational techniques for integration into ongoing electronic warfare projects. \n- Completed EW investment roadmap on the Joint Electronic Warfare T&E Study (JETS) developed a high level follow-on investment strategy to the 2010 Tri-Service EW Test Capability Study (TEWTCS) to maintain and advance air superiority as a critical component of EW Air Dominance and the National Defense Strategy.  \n- Installed Knowledge Management capabilities at Edward AFB, CA. for the Joint Strike Fighter Knowledge Management, Big Data Analytics project establishes next-generation big data analytics and knowledge management capabilities utilizing the latest in virtualization technologies, methodologies, and best practices for efficient and effective use of T&E data. \n- Completed requirements development and project planning. Initiated development and testing of target boards for small UAVs and subsonic cruise missiles to support Service prototype testing on the Mobile High Energy Laser Measurement (MHELM) project to support testing of directed energy weapon systems. \n- Completed CDS network environment and multi-level desktop for the Multi-Level Secure Joint\/Coalition Network Environment (MLS-JCNE) project providing a DoD multi-level secure and cross-domain data management T&E network environment at the TRMC JMETC SYSCON, NAS Patuxent River and multilevel workstation for cross-domain data management at the Manned Flight Simulation Facility, NAS Patuxent River. . \n- Completed requirements development and project planning on the Mission System Test Capability (MSTC) project that develops the capability to support integration and interoperability testing of Multi-Function Advanced Data Link (MADL) in a ground test, simulation environment. \n- Completed development, initial assembly and test on the Mid-Pressure Arc Heater (MPAH) project that expands the H2 Hypersonic Test Facility at Arnold Engineering Development (AEDC) Complex, TN to provide higher enthalpy at the mid-pressure altitudes to enable ground materials testing of components of hypersonic systems.  \n- Continued development on the M&S for Weather Effects on Hypersonic Systems project that provides a database of realistic and relevant weather conditions as a basis for ground test requirements, and develops advanced material response models validated with improved ground test data to predict weather erosion in flight.\n- Provided NCWTEE servers to China Lake, CA for the Network Centric Weapon T&E Environment (NCWTEE) project that establishes the capability to test and evaluate network centric weapons in a distributed end-to-end simulation environment.  Completed Increment 2 Datalink development and continued development of digital scene generation capability. Supported Joint Tactical Attack Controller developmental testing from the NCWTEE Lab. \n- Completed Full Operational Capability at NAS Patuxent River, MD. Continued procurement and integration for NEWEG systems at the Electronics Combat simulation and Evaluation Laboratory (ECSEL), Pt Mugu, CA and the Benefield Anechoic Facility (BAF), Edwards AFB, CA. \nfor the Next Generation Electronic Warfare Environment Generator (NEWEG) Build B project that provides advanced electronic warfare simulation\/stimulation capabilities for testing future Electronic Attack and Electronic Support Measures systems at multiple DoD test facilities and reprogramming laboratories. \n- Continued work on projects for the Non-Internet Protocol Cyber Test Tools.  A portfolio of projects to provide cyber test tools required to evaluate cyber security of weapon systems components, data links, communications buses and other critical items.\n- Worked requirements for the Open-Air Multi-Spectral Data Collection (OAMSDC) which provides enhanced IR missile signature open air data collections processes; provides conduits for playback of observed IR missile shots to an open air missile plume simulator; provide multi-mode (RF + IR) threat missile presentations to systems under test; and a Joint Multispectral Target Board (JMTB).\n- Began requirements development for the Ordnance Evaluation Range, Detonation Chamber which provides the ability of measuring hypersonic components to survive varying temperatures, vibrations, and acoustic stresses. \n- Completed risk reduction under the Enhanced Solutions Process (ESP) Over Water Scoring System that provides persistent, relocatable range capability for open-ocean, high precision weapon scoring and range surveillance based on a “Waveglider” platform and processing software prototyped by the 96th Test Support Squadron, Eglin AFB. \n- Completed the Ka-Band radar upgrade and hardware PDR for the Advanced Dynamic Aircraft Measurement System (ADAMS-3) system at the Atlantic Test Range for the Radar Cross Section Range Relevance (RCSRR) project comprised of 11 subprojects that upgrade radar cross section (RCS) capabilities at both the National Radar Cross Section (RCS) Test Facility (NRTF), Holloman AFB, NM, and the Atlantic Test Range (ATR), NAS Patuxent River, MD to improve infrastructure to ensure test measurement capabilities and throughput capacities at both ranges are sufficient to measure and evaluate advanced low observable technologies. At the NRTF completed the new Command and Control system, calibration pit, new data signal processing software, new HF antenna, refurbished target support pylon. Initiated the new fiber optic network perimeter security subprojects at the NRTF. \n- Completed integration of 16 RSE and 5 classified threat devices at the Nevada Test and Training Range (NTTR), NV and Navy Land and Sea Ranges at China Lake and NAS Pt Magu, Supported F-35 IOT&E at NTTR, NV for the  Radar Signal Emulators (RSE) project that provides open-loop, transmit-only simulators representative of threat radar systems operating in the C and S radio frequency (RF) bands.\n- Completed preliminary design of the air-to-air and advanced signal blocks. Radar Air-to-Ground Environment (RAGE) project provides an installed test facility, ground test capability for testing advanced aircraft radars in high-density air-to-air environments.  The air-to-ground block is awaiting technology maturation as an entrance criterion.\n- Initiated funding for the RF and IR threat model development process in cooperation with the Test and Evaluation Threat Resource Activity (TETRA), for the Radio Frequency and Infrared Modeling and Simulation project develops at least 20 classified Intelligence Production Center-certified threat system models for use in DoD test and evaluation simulators. \n- Completed three efforts: Range Reference Atmosphere Update, Thresholds and Rationale in Defense of UAS Risk Criteria and IEEE-1588 Precision Time Protocol update for the Range Commander’s Council Technical Group projects. The RCC Technical Groups manage inter-range policies and procedures.\n- Initiated the Reconfigurable RF Target Simulator (RRFTS) project to upgrade an Eglin AFB facility to test prototype sensors in a simulated hypersonic target and scene environment.\n- Supported the development of the White House “Developing a Sustainable Spectrum Strategy for America’s Future” memorandum, reviewed proposed legislation (e.g. H.R. 471, Wireless Investment Now in 5G Act and S.2223, Advancing Innovation and Reinvigorating Widespread Access to Viable Electromagnetic Spectrum (AIRWAVES) Act), Evaluated 10 papers for the International Consortium for Telemetry Spectrum for the Spectrum Stewardship project that ensures DoD T&E spectrum concerns are addressed in domestic and international forums establishing policies related to issues such as spectrum management, frequency allocations, and spectrum interference that impact DoD test and evaluation ranges.\n- Completed Phase I and Phase II analysis of hypersonic platform flight safety parameters, flight path geographical safety data and individual DoD and Allied range data for the Study of Open Air Ranges for Hypersonic Test (SOAR-H) to determine an optimum range of solutions for the Open Air Range flight testing of hypersonic systems. \n- Demonstrated semi-autonomous control of HSMST, one operator controlling 8 HSMST, and ability of HSMST to dynamically change SWARM maneuver formations. Supported operational testing against representative surface swarming threats at the Pacific Missile Range Hawaii.  Completed prototype demonstrations UAS weapons impact scoring subproject capabilities and Eglin AFB, FL for the SWARM project that upgrades the Navy’s existing High-Speed Maneuverable Surface Target (HSMST) with semi-autonomous control and develops an overhead scoring capabilities for testing US Navy ship defense systems and US aircraft weapons against representative surface swarming threats. \n- Completed requirements development, project planning and initiated development for the Technology Development Acquisition Program Next Generation (TDAP NGEN) project that implements a new set of IT tools to support the T&E Board of Directors Reliance Process in order to receive, review and prioritize Service test and evaluation gaps and development proposals. \n- Completed a study of current adversarial, non-adversarial, and commercial capabilities utilizing Quantum Technologies. Initiated development of a proof of concept prototype system for Quantum Encryption Key Distribution (QKD) for the Threat Management Office Integrated Threat Force, Redstone Arsenal, MD. for the Threat Center of Excellence project that provides research, evaluate new technologies and methodologies to counter critical conventional threats posed by traditional and non-traditional adversaries focused initially on the Cyber, EW, and small UAS threats. \n- Continued development of the Transient Thermal Analysis Software (TTAS) project that provides improved capabilities for predicting aerothermal and ablation response to high speed, high temperature flow in flight test environments. \n- Continued development of the program for the Tunnel 9 High Mach Number project that develops a Mach 18 test capability at the AEDC White Oak, MD facility to support aero\/aero-thermodynamic modeling and simulation supporting intermediate range and strategic boost glide vehicle and maneuvering system concepts. \n- Continued the UAV Range (UAV Range) project development in coordination with associated T&E\/S&T Program efforts for the Unmanned Aerial Vehicle (UAV) Range project to provide Global Hawk UAVs equipped with telemetry, Light Detection and Ranging System (LIDAR) and optical tracking for inflight data collection of hypersonic systems. \n- Worked program requirements for the X-Ray Simulators for Test and Evaluation of Nuclear Survivability (XSTENS) project to replace or upgrade three X-ray simulators that measure the susceptibility of missile components to damage from high dose warm and cold x-rays experienced in space. \n\nResource Enhancement Projects:\n- Awarded contract and completed a System Requirements Review (SRR), and Preliminary Design Review (PDR) for the Advanced Communication Threat Testing Suites (ACTTS) Uplink project develops EW threat representative uplink jamming system to support test and evaluation of end-to-end satellite system responsiveness to threat systems operating in applicable bands. ACTTS-U will be the only upper band operationally relevant Super High Frequency (SHF) electronic attack capability available with Extremely High Frequency (EHF) low Probability of Intercept\/Low Probability of Detection (LPI\/LPD).  \n- Completed system integration Risk Reduction III (RR3) testing on the Airborne Early Warning Interoperability Simulator (AEIS) project develops the hardware and software necessary to generate a properly spaced, dense target and Electronic Counter Measure (ECM) environment for injection-mode Installed Systems Test Facility (ISTF) testing. \n- Completed System Requirements Reviews (SRR) for the Air Warfare Battle Shaping (AWBS) develops a capability connecting ranges\/assets and creates a Threat Integrated Air Defense System (IADS) coupled with the Live\/Virtual\/Constructive (LVS) Laboratory Electronic Attack (EA) effect. \n- Continued development, received all parts and assembled prototype on the Common Operational Test Vehicle and Engagement Real-Time Test Instrumentation (COVERT-I) will improve the data collection footprint in Abrams tanks and Bradley fighting vehicles by reducing from three unique data collectors to one modular, scalable data collector with increased storage capacity. \n- Completed Phase I feasibility study for the Dynamic DIADS Control of CEESIM (D2C2) develops a capability to have DIADS drive CEESIM radar engagements in real time vs static, script-based engagements. Adds Pilot-in-the-Loop dynamics to EW testing. \n- Completed Phase I, developed and accomplished in-water testing of the High Speed Quiet Propulsion System (HSQPS) for the General Threat Torpedo (GTT) that develops a threat torpedo surrogate with upgradable interchangeable segments, as an upgrade replacement for the current threat surrogate torpedo.  \n-Completed development, finalized integration, tested system, and delivered to Electronic Combat Range (ECR) to support the EA-18G Growler Operational Test (OT) events for the Integrated Digital Acquisition Radar Environment - Upgrade (IDARE-U) capability that upgraded two NAWCWD Electronic Combat Range OEM Radars’ analog output with digital upgrade for downstream digital messaging. \n- Continued development of the track mount and subassemblies and completed the Software Design Review of the background suppression software capability of the Joint Standard Instrumentation Suite (JSIS) Phase 2 capability that measures and collects missile attitude (6DOF) as well as signature, TSPI, and related data for a larger portion of the threat MANPADS trajectory at the required accuracies within a single firing to support evaluation of the missile\/hostile fire warning systems such as the Advance Threat Warning (ATW). \n- Initiated and completed the System Requirement Review (SRR), Project Management Plan (PMP) and a prototype of the Post Intercept Debris Simulation (PIDS) capability will enhance Navy Probability of Raid Annihilation simulator federation with realistic post-missile intercept debris. \n- Completed the emitter and radome performance specifications and awarded the contract for Phase 2 for the Pulsed Doppler Emitter Capability Payload for Aerial Targets (PDEC-163) develops kinematic threat representations and threat representative emissions to provide the DDG-1000 OT SUT with the ability to collect data necessary for COTF to accredit the DDG-1000’s fire control loop weapons system response to threat targets. \n- Initiated project and has awarded the Army Missile Plume Simulator (MPS) contract, completed a Critical Design Review (CDR), and assembled the first modulator cell of the Multi-Spectral Sea and Land Target Simulator (MSALTS) Emitter Upgrade that improves MSALTS and Joint Mobile Infrared Countermeasure Test System (JMITS) emitter bandwidth in order to keep up with emerging System Under Test (SUT).  \n- Completed the build, delivery, and launch of the 10x10x10cm free flying CubeSat with 2 and 4cm targets for the Space Fence Radar operational testing for the Space Fence Evaluation of Radar Effectiveness (SFERES) which developed a 3-axis stabilized CubeSat that released two spheres into orbit in order to support accurate evaluation of the Space Fence radar. \n- Completed Phase 1 of the ULB engineering design effort for a production ULB Emitter Generation Rack for the Ultra Low-band Time Difference Of Arrival (UT) which develops a capability for a time difference of arrival (TDOA) multi-aircraft test configuration to support three aircraft under test in both the Air Combat Environment Test and the Evaluation Facility (ACETEF) and Electronic Combat Simulation and Evaluation Lab (ECSEL). \n- Began requirements development for the Battlefield Awareness Testbed (BAT) which intends to develop a mobile communications laboratory intended to replicate the voice, data, and video environments of tomorrow’s battlefield, while also providing reach-back to legacy systems. \n- Developed requirements for a Program Management Plan for the Maritime Survivability Library (MSL) which plans to develop a weaponeering tool for timely planning and execution of surface warfare strike missions. The T&E community requires a tool to accurately evaluate the lethality of emerging anti-ship weapons for use in acquisition decisions. \n- Developed requirements for a Program Management Plan for the Non-IP Cybersecurity Suite (NICS) that proposes to develop a hardware and software framework to automatically connect to non-IP interfaces, decode non-IP communications protocols, and launch basic non-IP cyberattacks through a Graphical User Interface and a software Application Programming Interface to dramatically accelerates and expands non-IP cybersecurity testing.  \n- Developed requirements for a Program Management Plan for the Tactical Aerospace Laser Optical Simulator – High Altitude (TALOS HIGH) which intends to develop a dual laser threat simulation capability within a 2-story cryo-vacuum chamber to evaluate space-based ISR sensors against surrogate ground- and air-based laser threats within a simulated space environment. \n- Developed requirements for a Program Management Plan for the Towed Array Threat Emulator (TATE) that proposes to develop a modular towed array to support T&E needs.  The array will be designed to support receive and transmit nodes defined for the System Under Test (SUT).  Each transmit and receive node will deliver raw data to the array tow vehicle for processing and generation of an acoustic or tactical response."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "264.179"
                                            },
                                            "Text": {
                                                "val": "JIM Projects:\n- Award design contract and complete a prototype system for the Advanced Range Tracking and Imaging System (ARTIS) project to provide the next generation of optical tracking mounts on DoD open-air ranges.\n- Complete requirements and project planning, and initiate design and concept development for the Autonomous Systems Test Capability (ASTC) project that develops test capability for Service autonomous systems.\n- Complete requirements and project planning, and award design contract for the Advanced Durability Testing (AVDT) that develops a multi-axle vehicle chassis simulator and a drive train simulator at Aberdeen, MD.\n- Complete planning, prototype test, and fabrication of safety blocks for the Fast Burst Reactor Upgrade (FBRU) project.  Work includes development of an alumina coating process to reduce wear on the High Enriched Uranium (HEU) components and initiation of planning process for the fabrication of ring components.\n- Complete requirements and project planning, and initiate design and concept development for Mobile High Energy Laser Measurement (MHELM) project to support testing of directed energy weapon systems. \n- Complete design and initiate development for the Commercial Derivative Aircraft Based Instrumentation Telemetry System (CBITS) project that provides expanded telemetry support for aircraft and missile defense testing in inter-range and broad ocean area weapons testing.\n- Continue system development of the Cyber Test Analysis and Simulation Environment (CyberTASE) project that establishes the ability to test enterprise level IT systems against increasingly robust Cyber threats. \n- Complete development of the multi-level work station for cross-domain data management and continue development of a standardized, multi-level file transfer capability for the Multi-Level Secure Joint\/Coalition Network Environment (MLS-JCNE) project that provides an enterprise-level multi-level secure and cross-domain data management T&E network environment.\n- Complete requirements and project planning, and initiate design and concept development for the Mission System Test Capability (MSTC) project that develops the capability to support integration and interoperability testing for advanced 4th and 5th generation aircraft data links (MADL and TTNT) in a ground test, simulation environment.\n- Complete requirements and project planning, and initiate design and concept development for the Radar Air-to-Ground Environment (RAGE) project that develops an installed test facility, ground test capability for testing advanced aircraft radars in high density air-to-air and air-to-ground environments.\n- Complete development and initiate integration of the UAS based Scoring sub-project at Eglin AFB, FL and award development contract for semi-autonomous control High Speed Maneuverable Surface Targets (HSMST) for the Swarm Autonomy and Scoring project that upgrades HSMST with semi-autonomous control and establishes UAS overhead scoring capabilities for testing against representative surface swarming threats.\n- Complete requirements and project planning, and initiate design and concept development for the Unmanned Aircraft Systems Test and Evaluation Improvements (UAS-TEI) and integrated Autonomous System Test Tool Kits to develop the capability to safely operate Unmanned and Autonomous aerial vehicles in controlled airspace.\n- Continue development, fabrication, and testing of the Mid-Pressure Arc Heater (MPAH) system to expand the H2 Hypersonic Test Facility at Arnold Engineering Development Complex, TN to provide higher enthalpy at the mid-pressure altitudes to enable ground materials testing of components of hypersonic systems.\n- Continue design and fabrication activities for the Hypersonic Test Capability Improvement Project (Phoenix) to provide a clean air, variable Mach ground test capability for hypersonic system prototypes from Mach 4 to Mach 7.5. Heater pit construction and refractory brick procurement completed. Heater assembly and bottle procurement started. \n-Continue the UAV Range (UAV Range) project to provide Global Hawk UAVs equipped with Telemetry, LIDAR and Optical tracking for inflight data collection of hypersonic systems. \n- Complete installation and test, and achieve Initial Operational Capability of the Tunnel 9 High Mach Number project that develops a Mach 18 test capability at the AEDC White Oak, MD facility to support aero\/aerothermodynamic modeling and simulation to support intermediate range and strategic boost glide vehicle and maneuvering system concepts.\n- Complete the design and build stationary and transportable prototypes of the High Altitude LIDAR Atmospheric Sensing (HALAS) system that provides DOD launch and flight test ranges with improved ability to measure atmospheric conditions to reduce flight test evaluation uncertainty and improve launch and recovery operations.\n- Complete the design, fabrication, and achieve Initial Operational Capability of the Holloman AFB High Speed Test Track upgrade to provide full scale rain erosion capability to validate vehicle structural designs and qualify hypersonic weapon systems for flight in an open air environment.\n- Complete fabrication and test, and achieve Initial Operational Capability of the rain components of G-Range Weather Effects project that upgrades the 3 inch G-range test track at AEDC to provide a small scale dust, rain, and snow erosion test capability.  Start development of the 8 inch track capability\n- Continue development under the M&S for Weather Effects on Hypersonic Systems project that provides a database of realistic and relevant weather conditions as a basis for ground test requirements, and develops advanced material response models validated with improved ground test data to predict weather erosion in flight.\n- Continue the development of the Transient Thermal Analysis Software (TTAS) project that provides improved capabilities for predicting aerothermal and ablation response to high speed, high temperature flow in ground and flight test environments. Achieve Initial Operational Capability of Fluid Thermal Structural Interaction (PTSI) model #1 of three planned releases.\n- Continue development of the Reconfigurable RF Target Simulator (RRFTS) project to upgrade an Eglin AFB facility to test prototype sensors in a simulated hypersonic target and scene environment.\n- Initiate the Workforce Development project to improve the depth and breadth of DoD hypersonic workforce skills.\n- Initiate other hypersonic improvement projects based need and maturity of the technologies.\n- Complete procurement and integration of 5 classified threat devices for use with Radar Signal Emulators (RSE) at the Nevada Test and Training Range (NTTR), NV and Navy Land and Sea Ranges providing simulators that are representative of threat radar systems operating in the C and S radio frequency (RF) bands. \n- Complete manufacturing and integration for the first system of the Closed Loop PESA Simulator (CLPS) project that provides a closed-loop radar system that replicates the performance of a widely fielded Western Pacific (WESTPAC) long-range surface-to-air missile (SAM) system. Continue development and integration of the second system.\n- Continue development and integration of additional threat command posts at the Electronic Combat Range, China Lake, CA for the Integrated Air Defense System (IADS) Enhancements project that fields high-priority, threat-representative Command Post (CP) models to open-air test ranges.\n- Continue procurement and integration of the Next Generation Electronic Warfare Environment Generator (NEWEG) Build B project at NAS Patuxent River, MD, Pt Mugu, CA and Edwards AFB, CA to provide electronic warfare simulation capabilities for testing future Electronic Attack and Electronic Support Measures systems.\n- Complete unit 1 for integration testing. Continue development units 2 and 3 for the Advanced Dynamic Transmitter Array (ADTRA) project to provide a complex, dynamic radio frequency (RF) threat environment at the Benefield Anechoic Facility (BAF). Continue system development. \n- Continue Integrated Technical Evaluation and Analysis of Multiple Sources (ITEAMS) activities to provide detailed analysis and validation of threat system designs and operational techniques for integration into ongoing electronic warfare projects.\n- Complete the critical design and the start system demonstration and test phase of the Advanced Weapons Effects Test Capability (AWETC project to develop a capability to more accurately measure fragment characteristics of explosive weapons (2mm size and above) and more accurately estimate collateral damage distances.\n- Complete Lot 3 deliveries and the Windows 10 upgrade for the Common Range Integrated Instrumentation System (CRIIS) project that establishes high dynamic, sub-meter, MILS capable range instrumentation system. Continue sustainment.\n- Complete early operational capability fielding of the Integrated Network Enhanced Telemetry (iNET) Project Block I capability to develop a network-enhanced aeronautical telemetry capability for T&E ranges and facilities. \n- Continue system development of Increment 2 for the Network Centric Weapon (NCW) T&E Environment project that establishes the capability to test NCW in a distributed end-to-end simulation environment. \n- Complete preliminary design and continue development for the Atlantic Test Range next generation Advanced Dynamic Aircraft Measurement System (ADAMS-3). Complete the Digital Signal Processing development, Target Preparation upgrade and C2 System upgrade, and initiate development of the Semi-automated Target Rollover and Calibration Pit refurbishment for the National Radar Test Facility. The Radar Cross Section Range Relevance (RCSRR) project upgrades radar cross section measurement capabilities of advanced low observable technologies at the Atlantic Test Range, Patuxent River NAS, MD and the National RCS Test Facility, Holloman AFB, NM.\n- Initiate development of requirements and project planning for the Next Generation Turbine Engine (NGTE) Sea Level RAM project that upgrades turbine engine capability to test advanced, larger volume engines at Arnold Engineering Development Center, TN.\n- Continue the Joint Strike Fighter - Knowledge Management (KM) project to establish a next-generation KM capability that utilizes the latest in virtualization technologies, methodologies, and best practices for efficient and effective use of T&E data.  \n- Complete risk reduction activities under the Enhanced Solutions Process (ESP) for eight potential FY20 multi-Service T&E developments recommended by Service Test and Evaluation Executives.\n- Complete requirements development and project planning and initiate preliminary design for priority Radio Frequency and Infrared Modeling and Simulation development projects.\n- Continue threat system simulator, modeling and simulation development efforts to improve integration; reduce potential duplication and ensure that accurate, cost-effective representations of threat systems are available to support testing.\n\nResource Enhancement Projects:\n- Complete development of Airborne Early Warning Interoperability Simulator (AEIS) to develop the hardware and software necessary to generate a properly spaced, dense target and ECM environment for injection-mode Installed Systems Test Facility testing of the E-2D Hawkeye mission system.\n- Complete development of additional enhancements to Air Warfare Battle Shaping (AWBS) investments to improve air-to-air range infrastructure for NAWC-WD.\n- Complete development of Cognitive Electronic Warfare (Cognitive EW) Flight Test to evaluate an advanced EW system against emerging threat representations.\n- Complete development of Common Operational Test Vehicle and Engagement Real-Time Test Instrumentation (COVERT-I) to reduce the data collection footprint in Abrams tanks and Bradley fighting vehicles by reducing from three unique data collectors to one modular, scalable data collector with increased storage capacity. \n- Complete development of Integrated Digital Acquisition Radar Environment - Upgrade (IDARE-U) to upgrade two NAWCWD Electronic Combat Range OEM Radars’ analog output with digital upgrade for downstream digital messaging.\n- Complete development of Joint Standard Instrumentation Suite (JSIS) Phase 2 to measure and collect missile attitude (6DOF) as well as signature, TSPI, and related data for a larger portion of the threat man-portable air defense systems (MANPADS) trajectory at the required accuracies within a single firing to support evaluation of the missile\/hostile fire warning systems such as the Advance Threat Warning (ATW) system.\n- Complete development of the Medium Range Target Engagement Radar (MR-TER) Radar System Emulator (RSE) to develop and integrate TER waveform replication capability into C-Band RSEs.\n- Complete development of Space Fence Evaluation of Radar Effectiveness (SFERES) to fabricate a 3-axis stabilized CubeSat which will launch two spheres to support accurate evaluation of the Space Fence radar.\n- Complete development of Ultra Low-band Time Difference Of Arrival (UT) to develop the capability for a time difference of arrival (TDOA) multi-aircraft test configuration to support three aircraft under test in both the Air Combat Environment Test and the Evaluation Facility (ACETEF) and Electronic Combat Simulation and Evaluation Lab (ECSEL). \n- Continue development of Advanced Communication Threat Testing Suites (ACTTS) Uplink Capability to develop an electronic warfare (EW) threat representative uplink jamming system to support test and evaluation of end to end satellite system responsiveness to threat systems operating in applicable bands. \n- Continue development of General Threat Torpedo (GTT) to develop a threat torpedo surrogate with upgradable interchangeable segments as an upgrade replacement for the current threat surrogate torpedo.\n- Continue development of the Pulsed Doppler Emitter Capability Payload for Aerial Targets (PDEC-163) to develop kinematic threat representations and threat representative emissions to provide the DDG-1000 OT SUT with the ability to collect data necessary for COTF to accredit the DDG-1000’s fire control loop weapons system response to threat targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "390.692"
                                            },
                                            "Text": {
                                                "val": "JIM Projects:\n- Complete Factory Acceptance and Site Acceptance testing for unit 1, award the procurement contract for Units 2 through 7 for the Advanced Dynamic Transmitter Array (ADTRA) project that provides a complex, dynamic radio frequency (RF) threat environment at the Benefield Anechoic Facility (BAF). \n- Continue development of the Advanced Range Tracking and Imaging System (ARTIS) project to provide the next generation of optical tracking mounts on DoD open-air ranges. Continue Fly-out System development, start Close-in System development, and start Variable Metric Zoom Lens development.\n- Complete Preliminary and Critical Design Reviews and begin construction of required facilities and facility improvements for the Advanced Durability Testing (AVDT) that develops a multi-axle vehicle chassis simulator and a drive train simulator at Aberdeen, MD.\n- Complete IOC and FOC at three ranges for the Advanced Weapons Effects Test Capability (AWETC project to develop a capability to more accurately measure fragment characteristics of explosive weapons (2mm size and above) and more accurately estimate collateral damage distances.\n- Complete critical design for the Guardian subproject, complete preliminary design for the UAS Test Tools and Army subprojects, continue preliminary design of 2 other subprojects for the Autonomy, Integration and Teaming (AIT) project that develops the capability to operate Unmanned and Autonomous aerial vehicles safely in controlled airspace.\n- Start system design and development of Software Release 1 for the Autonomous Systems Test Capability (ASTC) Ground project that develops test capability for Service autonomous systems. Start development of the Safety Environment, Engagement and Response (SEER) sub-project to allow safety testing of full scale autonomous vehicles at Aberdeen Test Center, MD.  \n- Complete fielding of the first unit of the Closed Loop PESA Simulator (CLPS) project to NTTR, NV to provide a closed-loop radar system that replicates the performance of a widely fielded Western Pacific (WESTPAC) long-range surface-to-air missile (SAM) system. Continue manufacturing and integration of the second CLPS system.\n- Prime Contractor and the government are exploring technical options and will determine path forward for the Commercial Derivative Aircraft Based Instrumentation Telemetry System (CBITS) project that provides expanded telemetry support for aircraft and missile defense testing in inter-range and broad ocean area weapons testing.\n- Completes initial capability to deliver enhanced survivability evaluation in IC-projected peer and near-peer Integrated Air Defense systems for the Common Modeling and Simulation (M&S) Threat Environment Model for Long Range Strike (LRS) Family of systems. \n- Complete Lot 3 deliveries and the Windows 10 upgrade for the Common Range Integrated Instrumentation System (CRIIS) project that establishes high dynamic, sub-meter, MILS capable range instrumentation system. Award the Contractor Logistics Support contract CLIN for initial sustainment.\n- Provide support to Test & Evaluation\/Science and Technology (T&E\/S&T) Program efforts for the Dense Plasma Focus (DPRF) project that provides short pulse neutron effects test capability for certification and survivability testing of new circuit card designs.\n- Complete requirements development for the Direct Inject Electro-Optical-Infrared System (EO-IO) which provides test capability for high speed, coordinated EO\/IR sensor stimulation.\n- Conduct preliminary and critical design on the Direct Inject Jammer Common Operating Picture (DIJCOP) project that provides real-time awareness, data collection and analysis of DIJ health, status and geolocation information for both White and Red Cell operations at JRTC, Ft Polk, LA and JMRC, Hohenfels, Germany.  \n- Complete High Enriched Uranium (HEU) casting and aluminum coating of the safety blocks.  Deliver safety blocks to White Sands Missile Range and start development work on casting the first set of HEU rings for the Fst Burst Reactor Upgrade (FBRU) project that replaces the Highly Enriched Uranium HHEU) fuel for the existing FBR with new fuel (seven rings and two safety blocks) to test missile components to required levels of short-pulse neutrons simulating Nuclear Weapons Effects. \n- Field two low energy GPS jammer production units with Army procuring remaining units for use at Army Test and Training Centers. Complete design for high power, trailer mounted variant for the Global Position System Localized EW Emitter (GPS LEWE) project to provide low energy, vehicle mounted GPS jamming capability for testing of ground vehicle communications and navigation systems against GPS jamming. \n- Complete fabrication and test, and achieve Initial Operational Capability of the rain components for the G-Range Weather Effects project that upgrades the three inch G-range test track at AEDC to provide a small scale dust, rain, and snow erosion hypersonic test capability. \n- Complete the design of a Ground based High Altitude LIDAR Atmospheric Sensing (HALAS) system that provides DOD launch and flight test ranges with improved ability to measure atmospheric conditions to reduce evaluation uncertainty and improve launch and recovery operations.\n- Complete the design, fabrication, and achieve Initial Operational Capability of the Holloman AFB High Speed Test Track upgrade to provide full scale rain erosion capability to validate vehicle structural designs and qualify hypersonic weapon systems for flight in an open air environment.\n- Continue development fabrication and assembly. Heater pit construction and refractory brick procurement will be completed, and heater assembly and bottle procurement started on the Hypersonic Test Capability Improvement Project (Phoenix) to provide a clean air, variable Mach ground test capability for hypersonic system prototypes from Mach 4 to Mach 7.5 at Arnold Engineering Development (AEDC) Complex, TN. \n-  Complete fielding for IADS Enhancements project at the Electronic Combat Range, China Lake, CA for the Integrated Air Defense System (IADS) Enhancements project that fields high-priority, threat-representative Command Post (CP) models to open air test ranges.\n- Complete fielding for IADS Enhancements project at the Electronic Combat Range, China Lake, CA. for the Integrated Network Enhanced Telemetry (iNET) Project Block I capability to develop a network-enhanced aeronautical telemetry capability for T&E ranges and facilities. \n-  Initiate project to provide expanded telemetry and connectivity between DoD western sea and land ranges for airborne test or training for the Joint Electronic Warfare T&E Study (JETS) developed a high level follow-on investment strategy to the 2010 Tri-Service EW Test Capability Study (TEWTCS) to maintain and advance air superiority as a critical component of EW Air Dominance and the National Defense Strategy.  \n- Integration of Edwards KM capability and Nellis JSF data center, and enhanced JMETC-enabled Data Management Network for the Joint Strike Fighter Knowledge Management, Big Data Analytics project establishes next-generation big data analytics and knowledge management capabilities utilizing the latest in virtualization technologies, methodologies, and best practices for efficient and effective use of T&E data.\n- Continue development of Mobile High Energy Laser Measurement (MHELM) projects for target boards on small UAVs and subsonic cruise missile targets. Start development of sub-projects to measure reflected irradiance, measure HEL performance under range conditions, develop software tools, and measure laser irradiance on a surrogate supersonic target.\n- Complete renovation of TRMC JMETC SYSCON and Authority to Operate the multi-level desktop at the MFS Facility, NAS Patuxent River, MD for the Multi-Level Secure Joint\/Coalition Network Environment (MLS-JCNE) project providing a DoD multi-level secure and cross-domain data management T&E network environment at the TRMC JMETC SYSCON, NAS Patuxent River and multilevel workstation for cross-domain data management at the Manned Flight Simulation Facility, NAS Patuxent River. \n- Initiate design and concept development for the Mission System Test Capability (MSTC) project that develops the capability to support integration and interoperability testing for advanced 5th generation aircraft data links (MADL) in a ground test, simulation environment.\n- Complete assembly and testing of the Mid-Pressure Arc Heater (MPAH) system to expand the H2 Hypersonic Test Facility at Arnold Engineering Development Complex, TN to provide higher enthalpy at the mid-pressure altitudes to enable ground materials testing of components of hypersonic systems.  Start development of Increment 2 providing an additional power supply for longer run times and larger test articles to support thermal protection system testing of hypersonic boost glide vehicles and other systems.\n- Continue development under the M&S for Weather Effects on Hypersonic Systems project that provides a database of realistic and relevant weather conditions as a basis for ground test requirements, and develops advanced material response models validated with improved ground test data to predict weather erosion in flight.\n- Complete FOC at ECSEL and finalize procurement of NEWEG systems for the BAF for the Next Generation Electronic Warfare Environment Generator (NEWEG) Build B project that provides advanced electronic warfare simulation\/stimulation capabilities for testing future Electronic Attack and Electronic Support Measures systems at multiple DoD test facilities and reprogramming laboratories. \n- Start the development of the Open-Air Multi-Spectral Data Collection (OAMSDC) which will provide enhanced IR missile signature open air data collections processes; provide conduits for playback of observed IR missile shots to an open air missile plume simulator; provide multi-mode (RF + IR) threat missile presentations to systems under test; and a Joint Multispectral Target Board (JMTB).\n- Complete requirements development, project planning and initiate development of the Overwater Surveillance and Scoring (OWSS) project to provide unmanned, autonomous scoring of operationally relevant weapons tests and flexible range surveillance in remote water areas.\n- Complete software preliminary design and critical design for the Atlantic Test Range next generation Advanced Dynamic Aircraft Measurement System (ADAMS-3). Complete the Perimeter Security and Target Preparation Facility subprojects for the National Radar Test Facility. The Radar Cross Section Range Relevance (RCSRR) project upgrades radar cross section measurement capabilities of advanced low observable technologies at the Atlantic Test Range, Patuxent River NAS, MD and the National RCS Test Facility, Holloman AFB, NM.\n- Select prime contractors for the air-to-air and advanced signal capability blocks and conduct a Critical Design Review for the Radar Air-to-Ground Environment (RAGE) project. The air-to-ground block will initiate requirements development and project planning. The development project will provide an installed test facility, ground test capability for testing advanced aircraft radars in high-density environments.\n- Continue preliminary design for priority Radio Frequency and Infrared Modeling and Simulation development projects.\n- Will complete 2 efforts: the Compression & Metric Zoom TSPI Study and a Telemetry Networks Handbook and User’s Guide for Range Commander’s Council Technical Group projects. The RCC Technical Groups manage inter-range policies and procedures. \n- Continue development of the Reconfigurable RF Target Simulator (RRFTS) project to upgrade an Eglin AFB facility to test prototype sensors in a simulated hypersonic target and scene environment.\n- Continued participation in the Spectrum Incentives Working Group, International Consortium for Telemetry Spectrum, DoD and other spectrum groups for the Spectrum Stewardship project that ensures DoD T&E spectrum concerns are addressed in domestic and international forums establishing policies related to issues such as spectrum management, frequency allocations, and spectrum interference that impact DoD test and evaluation ranges. \n- Complete Phase III analysis of flight test options for specific classified platforms for the Study of Open Air Ranges for Hypersonic Test (SOAR-H) to determine an optimum range of solutions for the Open Air Range flight testing of hypersonic systems. \n- Complete Full Operational Capability (FOC) for both HSMST semi-autonomous and UAS based Weapon Impact Scoring for the SWARM project that upgrades the Navy’s existing High-Speed Maneuverable Surface Target (HSMST) with semi-autonomous control and develops an overhead scoring capabilities for testing US Navy ship defense systems and US aircraft weapons against representative surface swarming threats. \n- Field the initial system for Service trials of the Technology Development Acquisition Program Next Generation (TDAP NGEN) project that implements a new set of IT tools to support the T&E Board of Directors Reliance Process in order to receive, review and prioritize Service test and evaluation gaps and development proposals. \n- Complete proof of concept QKD prototype for the Threat Center of Excellence project that provides research, evaluate new technologies and methodologies to counter critical conventional threats posed by traditional and non-traditional adversaries focused initially on the Cyber, EW, and small UAS threats.\n- Continue development of the Transient Thermal Analysis Software (TTAS) project that provides improved capabilities for predicting aerothermal and ablation response to high speed, high temperature flow in ground and flight test environments. \n- Complete installation and test, and achieve Initial Operational Capability of the Tunnel 9 High Mach Number project that develops a Mach 18 test capability at the AEDC White Oak, MD facility to support aero\/aero thermodynamic modeling and simulation to support intermediate range and strategic boost glide vehicle and maneuvering system concepts.\n- Continue the UAV Range (UAV Range) project to provide Global Hawk UAVs equipped with Telemetry, LIDAR and Optical tracking for inflight data collection of hypersonic systems. \n- Start development of the X-Ray Simulators for Test and Evaluation of Nuclear Survivability (XSTENS) project to replace or upgrade three X-ray simulators that measure the susceptibility of missile components to damage from high dose warm and cold x-rays experienced in space.\n- Receive nominations and initiate risk reduction under the Enhanced Solutions Process (ESP) for multi-Service T&E CTEIP development proposals recommended by Service Test & Evaluation Executives.\n\nResource Enhancement Projects:\n- Will conduct a Critical Design Review (CDR) for the Advanced Communication Threat Testing Suites (ACTTS) Uplink Capability to develop an electronic warfare (EW) threat representative uplink jamming system to support test and evaluation of end to end satellite system responsiveness to threat systems operating in applicable bands. \n- Will deliver HW & SW in racks to Naval Air Station Patuxent River, MD for the Advanced Hawkeye Program (E2-D APY) operational test of the Airborne Early Warning Interoperability Simulator (AEIS).\n- Continue the development of additional enhancements to Air Warfare Battle Shaping (AWBS) investments to improve air-to-air range infrastructure for NAWC-WD.\n- Complete development of Common Operational Test Vehicle and Engagement Real-Time Test Instrumentation (COVERT-I) to reduce the data collection footprint in Abrams tanks and Bradley fighting vehicles by reducing from three unique data collectors to one modular, scalable data collector with increased storage capacity.\n- Study findings will be briefed and capability confirmed that system can meet performance requirements, cost, schedule and risk before Phase II full integration at HITL for the Dynamic DIADS Control of CEESIM (D2C2) to develop a capability to have DIADS drive CEESIM radar engagements in real time vs static, script-based engagements. Adds Pilot-in-the-Loop dynamics to Electronic Warfare (EW) testing.\n- Initiate Phase ii, developing the System Requirements Specifications (SRS), the cost\/benefits analysis design, the functional allocation and integration requirements for the General Threat Torpedo (GTT) to develop a threat torpedo surrogate with upgradable interchangeable segments as an upgrade replacement for the current threat surrogate torpedo.\n- Project completes for the development of Joint Standard Instrumentation Suite (JSIS) Phase 2 to measure and collect missile attitude (6DOF) as well as signature, TSPI, and related data for a larger portion of the threat man-portable air defense systems (MANPADS) trajectory at the required accuracies within a single firing to support evaluation of the missile\/hostile fire warning systems such as the Advance Threat Warning (ATW) system.\n- Continue work on the Post Intercept Debris Simulation (PIDS) capability that enhances Navy Probability of Raid Annihilation simulator federation with realistic post-missile intercept debris. \n- Complete development of the Pulsed Doppler Emitter Capability Payload for Aerial Targets (PDEC-163) to develop kinematic threat representations and threat representative emissions to provide the DDG-1000 OT SUT with the ability to collect data necessary for COTF to accredit the DDG-1000’s fire control loop weapons system response to threat targets.\n- Continue the development of Multi-Spectral Sea and Land Target Simulator (MSALTS) Emitter Upgrade to improve MSALTS and Joint Mobile Infrared Countermeasure Test System (JMITS) emitter bandwidth in order to keep up with emerging Systems Under Test (SUT).\n-  Continue the development of Ultra Low-band Time Difference Of Arrival (UT) to develop the capability for a time difference of arrival (TDOA) multi-aircraft test configuration to support three aircraft under test in both the Air Combat Environment Test and the Evaluation Facility (ACETEF) and Electronic Combat Simulation and Evaluation Lab (ECSEL). \n- Program Management Plan will be provided with technical and programmatic requirements, cost, schedule, and risk for approval of funds to initiate the Battlefield Awareness Testbed (BAT).  If approved, the BAT projects primary objective is to support the deployment of Phase I Interim Capability Release of F-35 Interim Full-Motion Video (FMV) test in FY 2020.\n- A Program Management Plan with technical and programmatic requirements, cost, schedule, and risk for approval of funds to initiate project will be provided for the Maritime Survivability Library (MSL) to develop a weaponeering tool for timely planning and execution of surface warfare strike missions. The T&E community requires a tool to accurately evaluate the lethality of emerging anti-ship weapons for use in acquisition decisions. \n- A Program Management Plan with technical and programmatic requirements, cost, schedule, and risk for approval of funds to initiate project will be provided for the Non-IP Cybersecurity Suite (NICS) proposes to develop a hardware and software framework to automatically connect to non-IP interfaces, decode non-IP communications protocols, and launch basic non-IP cyberattacks through a Graphical User Interface and a software Application Programming Interface to dramatically accelerates and expands non-IP cybersecurity testing.  \n- A Program Management Plan with technical and programmatic requirements, cost, schedule, and risk for approval of funds to initiate project will be provided for the Tactical Aerospace Laser Optical Simulator – High Altitude (TALOS HIGH). The program intends to develop a dual laser threat simulation capability within a 2-story cryo-vacuum chamber to evaluate space-based ISR sensors against surrogate ground- and air-based laser threats within a simulated space environment. \n- A Program Management Plan with technical and programmatic requirements, cost, schedule, and risk for approval of funds to initiate project will be delivered for the Towed Array Threat Emulator (TATE) which proposes to develop a modular towed array to support T&E needs.  The array will be designed to support receive and transmit nodes defined for the System Under Test (SUT).  Each transmit and receive node will deliver raw data to the array tow vehicle for processing and generation of an acoustic or tactical response.\n- FY20 Congressional Add projects resulting from a Joint DDR&E and DOT&E assessment of T&E infrastructure. Specific projects are identified but per Congressional direction cannot be initiated until briefed to Congressional Defense Committees. Projects are established to address critically needed test capabilities in the following areas.\n  -- Hypersonic Ground Test Infrastructure that develops new capabilities and modernizes existing ground test facilities to test advance materials, sensors, prototype systems and other items in a at hypersonic speeds and environmental conditions.  \n  -- Hypersonic Flight Test Infrastructure that develops new capabilities and modernizes existing capabilities that enable testing and coverage throughout the flight envelope of hypersonic systems. This includes areas such as the ground infrastructure to conduct and monitor systems in flight, flight termination systems, advanced telemetry, optical and radar tracking capabilities, impact location and data processing.  \n  -- Space Test Infrastructure to ensure T&E against realistic threats and environmental conditions in all segments of space systems including ground and control, orbital and spaceborne and user equipment.\n  -- Directed Energy Test Infrastructure to accurately measure energy on target, characterize beam performance of high energy lasers and high power microwave systems, and simulate representative threats for A-PNT, etc.\n  -- Cyber Test Infrastructure developments to evaluate ground and airborne platforms, internal avionics and data buses, C4ISR systems, and other critical infrastructure against cyber threats.\n  -- Threat Center of Excellence projects to develop, test, and evaluate new technologies and methodologies to counter critical conventional threats posed by traditional and non-traditional adversaries. Projects cover use of quantum technologies in encryption key and position, navigation and timing, ability to test ground systems in GPS denied environments, and development of small UAS threats and counter UAS capabilities to support testing in realistic threat representative battlefield conditions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "422.451"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "422.451"
                                            },
                                            "Text": {
                                                "val": "JIM Projects:\n- Initiate manufacturing for units 2 and 3 for the Advanced Dynamic Transmitter Array (ADTRA) project to provide a complex, dynamic radio frequency (RF) threat environment at the Benefield Anechoic Facility (BAF) to test advanced aircraft against EW threats.\n- Continue development of Fly-out System and begin development of the Close-in System and Variable Metric Zoom Lens for Advanced Range Tracking and Imaging System (ARTIS) project to provide the next generation of optical tracking mounts on DoD open-air ranges.\n- Deliver IOC for the Drivetrain Simulator for the Advanced Durability Testing (AVDT) project and continue manufacture of the multi-axle vehicle chassis simulator.\n- Complete an IOC for the Guardian subproject enabling safe control of UAS in mixed military airspace and IOC for the Navy Manned Unmanned subproject, complete critical design and IOC for the UAS Test Tools and Army Remote MUMT for the Autonomy, Integration and Teaming (AIT) project to develop the capability to safely operate Unmanned and Autonomous aerial vehicles in controlled airspace. \n- Complete Software Release 2 and continue development for the Autonomous Systems Test Capability (ASTC) DRIVE sub-project. Continue development of the SEER sub-project for the Autonomous Systems Test Capability (ASTC) project that develops test capability for DoD autonomous ground systems. \n- Complete integration and fielding for the second Closed Loop PESA Simulator (CLPS) at Eglin AFB, FL to provide closed-loop radar systems that replicates the performance of a widely fielded Western Pacific (WESTPAC) long-range surface-to-air missile (SAM) system.\n- Continue development of the Commercial Derivative Aircraft Based Instrumentation Telemetry System (CBITS) project to provide expanded capability and capacity telemetry support for aircraft and missile defense testing in inter-range and broad ocean area test scenarios.\n- Continue CLS sustainment for Common Range Integrated Instrumentation System (CRIIS) project that establishes a high dynamic, sub-meter, military standard (MILS) capable range instrumentation system. \n- Project will transition development from the T&E\/S&T Program to CTEIP for the Dense Plasma Focus (DPF) project that that provides very short pulse neutron effects test capability for certification and survivability testing of new circuit card designs. \n- Continue development of the Direct Inject Electro-Optical-Infrared System (EO-IR). This proposal provides a test capability for high speed, coordinated EO\/IR sensor stimulation to ensure comprehensive testing of sensor fusion algorithms for aircraft and helicopters.\n- Field capability for the Direct Inject Jammer Common Operating Picture (DIJCOP) project that provides real-time awareness, data collection and analysis of DIJ health, status and geolocation information for both White and Red Cell operations at JRTC, Ft Polk, LA and JMRC, Hohenfels, Germany.\n- Delivery of first set of HEU rings to White Sands Missile Range for the Fast Burst Reactor Upgrade (FBRU) project that replaces the Highly Enriched Uranium HHEU) fuel for the existing FBR with new fuel (seven rings and two safety blocks) to test missile components to required levels of short-pulse neutrons simulating Nuclear Weapons Effects. \n- Field a high power variant with Army procuring remaining units for the Global Position System Localized EW Emitter (GPS LEWE) project to provide low energy, vehicle mounted GPS jamming capability for testing of ground vehicle communications and navigation systems against GPS jamming. \n- Complete testing and achieve Final Operational Capability of the snow and ice components of G-Range Weather Effects project that upgrades the three inch test track at AEDC to provide a small scale dust, rain, and snow erosion test capability.  Continue development of the eight inch track capability.\n- Complete testing and achieve Final Operational Capability of the Holloman AFB High Speed Test Track upgrade to provide full scale rain erosion capability to validate vehicle structural designs and qualify hypersonic weapon systems for flight in an open air environment.\n- Continue fabrication and test activities for the Hypersonic Test Capability Improvement Project (Phoenix) to provide a clean air, variable Mach ground test capability for hypersonic system prototypes from Mach 4 to Mach 7.5. Complete installation on five of the six major subsystems. \n- Continue project and initiate follow-on development efforts for the Joint Electronic Warfare T&E Study (JETS) developed a high level follow-on investment strategy to the 2010 Tri-Service EW Test Capability Study (TEWTCS) to maintain and advance air superiority as a critical component of EW Air Dominance and the National Defense Strategy. \n- Enable future efficiencies for Edwards, Nellis and within the JSF program (which now includes a system at Patuxent River NAS) for the Joint Strike Fighter Knowledge Management, Big Data Analytics project establishes next-generation big data analytics and knowledge management capabilities utilizing the latest in virtualization technologies, methodologies, and best practices for efficient and effective use of T&E data.\n- Continue development of Mobile High Energy Laser Measurement (MHELM) sub-projects developing target boards for various surrogate threat vehicles, measuring reflected irradiance, and developing software tools.\n- Complete Critical Design Review for the Mission System Test Capability (MSTC) project that develops the capability to support integration and interoperability testing for advanced 5th generation aircraft data links in a ground test, simulation environment.\n- Complete assembly and testing for the Mid-Pressure Arc Heater (MPAH) project that expands the H2 Hypersonic Test Facility at Arnold Engineering Development (AEDC) Complex, TN to provide higher enthalpy at the mid-pressure altitudes to enable ground materials testing of components of hypersonic systems. Additionally start development of Increment 2 providing an additional power supply for longer run times and larger test articles to support thermal protection system testing of hypersonic boost glide vehicles and other systems.\n- Continue development of the M&S for Weather Effects on Hypersonic Systems project that provides a database of realistic and relevant weather conditions as a basis for ground test requirements, and develops advanced material response models validated with improved ground test data to predict weather erosion in flight. \n- Complete integration at the BAF for the Next Generation Electronic Warfare Environment Generator (NEWEG) Build B project that provides advanced electronic warfare simulation\/stimulation capabilities for testing future Electronic Attack and Electronic Support Measures systems at multiple DoD test facilities and reprogramming laboratories. \n- Complete FY2020 projects and initiate additional cyber developments for the Non-Internet Protocol Cyber Test Tools is a portfolio of projects to provide cyber test tools required to evaluate cyber security of weapon systems components, data links, communications buses and other critical items. \n- Complete design and continue development of the Open-Air Multi-Spectral Data Collection (OAMSDC) that provides enhanced IR missile signature open air data collections processes; provides conduits for playback of observed IR missile shots to an open air missile plume simulator; provide multi-mode (RF + IR) threat missile presentations to systems under test; and a Joint Multispectral Target Board (JMTB). \n- Continue development of the Ordnance Evaluation Range, Detonation Chamber to provide the ability of measuring hypersonic components to survive varying temperatures, vibrations, and acoustic stresses. \n- Continue development of the Over Water Scoring System that provides persistent, relocatable range capability for open-ocean, high precision weapon scoring and range surveillance based on a “Waveglider” platform and processing software prototyped by the 96th Test Support Squadron, Eglin AFB.\n- Continue development of the ADAMS-3 radar facility at ATR. Complete development of Semi-automated target rollover subproject that completes all capability upgrades at the NRTF for the Radar Cross Section Range Relevance (RCSRR) project comprised of 11 subprojects that upgrade radar cross section (RCS) capabilities at both the National Radar Cross Section (RCS) Test Facility (NRTF), Holloman AFB, NM, and the Atlantic Test Range (ATR), NAS Patuxent River, MD to improve infrastructure to ensure test measurement capabilities and throughput capacities at both ranges are sufficient to measure and evaluate advanced low observable technologies.\n- Continue development of the air-to-air and advanced signal blocks of the Radar Air-to-Ground Environment (RAGE) project. Complete design of the air-to-ground block.\n- Efforts determined in late FY2020 for FY2021 consideration for the Range Commander’s Council Technical Group projects. The RCC Technical Groups manage inter-range policies and procedures. \n- Continue development of the Reconfigurable RF Target Simulator (RRFTS) project to upgrade an Eglin AFB facility to test prototype sensors in a simulated hypersonic target and scene environment.\n- Continue participation in the Spectrum Incentives Working Group, International Consortium for Telemetry Spectrum, DoD and other spectrum groups for the Spectrum Stewardship project that ensures DoD T&E spectrum concerns are addressed in domestic and international forums establishing policies related to issues such as spectrum management, frequency allocations, and spectrum interference that impact DoD test and evaluation ranges. \n- Field the final IT system and transition to the Services for sustainment for the Technology Development Acquisition Program Next Generation (TDAP NGEN) project that implements a new set of IT tools to support the T&E Board of Directors Reliance Process in order to receive, review and prioritize Service test and evaluation gaps and development proposals. \n- Additional proposals will be considered for work for the Threat Center of Excellence project that provides research, evaluate new technologies and methodologies to counter critical conventional threats posed by traditional and non-traditional adversaries focused initially on the Cyber, EW, and small UAS threats.\n- Continue the development of the Transient Thermal Analysis Software (TTAS) project that provides improved capabilities for predicting aerothermal and ablation response to high speed, high temperature flow in ground and flight test environments. \n- Continue the UAV Range (UAV Range) project development in coordination with associated T&E\/S&T Program efforts for the Unmanned Aerial Vehicle (UAV) Range project to provide Global Hawk UAVs equipped with telemetry, Light Detection and Ranging System (LIDAR) and optical tracking for inflight data collection of hypersonic systems.\n- Continue the development completing design reviews and initiating construction for the X-Ray Simulators for Test and Evaluation of Nuclear Survivability (XSTENS) project to replace or upgrade three X-ray simulators that measure the susceptibility of missile components to damage from high dose warm and cold x-rays experienced in space. \n- Complete ESP resulting in specific nominations for FY2022 CTEIP New Start projects for CTEIP development proposals recommended by Service Test and Evaluation Executives. \n\nResource Enhancement Projects:\n- Complete development of Advanced Communication Threat Testing Suites (ACTTS) Uplink Capability to develop an electronic warfare (EW) threat representative uplink jamming system to support test and evaluation of end-to-end satellite system responsiveness to threat systems operating in applicable bands. \n- Completes and will deliver the capability to Naval Air Warfare Center Weapons Division (NAWCWD) for use in Verification & Validation DIADS and Airborne Electronic Attack (AEA) LVC testing. AWBS will improve air-to-air range infrastructure for NAWC-WD for the Airborne Early Warning Interoperability Simulator (AEIS) project develops the hardware and software necessary to generate a properly spaced, dense target and Electronic Counter Measure (ECM) environment for injection-mode Installed Systems Test Facility (ISTF) testing.  \n- Complete the development of additional enhancements to Air Warfare Battle Shaping (AWBS) investments to improve air-to-air range infrastructure for NAWC-WD.\n- Complete development of General Threat Torpedo (GTT) to develop a threat torpedo surrogate with upgradable interchangeable segments as an upgrade replacement for the current threat surrogate torpedo.\n- Complete development of Post Intercept Debris Simulation (PIDS) to enhances Navy Probability of Raid Annihilation simulator federation with realistic post-missile intercept debris.\n- Capability delivery to Pt. Mugu, CA to support the DDG-1000 OIT&E for the Pulsed Doppler Emitter Capability Payload for Aerial Targets (PDEC-163).\n- Complete the development of Multi-Spectral Sea and Land Target Simulator (MSALTS) Emitter Upgrade to improve MSALTS and Joint Mobile Infrared Countermeasure Test System (JMITS) emitter bandwidth in order to keep up with emerging System Under Test (SUT).\n- Complete the development of Ultra Low-band Time Difference Of Arrival (UT) to develop the capability for a time difference of arrival (TDOA) multi-aircraft test configuration to support three aircraft under test in both the Air Combat Environment Test and the Evaluation Facility (ACETEF) and Electronic Combat Simulation and Evaluation Lab (ECSEL)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Department Program Adjustments. Increased investments for high-priority hypersonic ground and open air range test capability developments and increased investments for critically needed upgrades to DoD Threat Models and Simulations.\nJoint Electronic Warfare Test Initiatives FY21-25 are projects on a DoD approved investment roadmap resulting from the JETS study that identified vital test capabilities needed in order to maintain and advance air superiority as a critical component of EW Air Dominance and the National Defense Strategy. Initial investment projects develop and field the RF threat emulation systems needed to keep up with evolving advanced, sophisticated threats to support planned MRTFB open air range test events. The investment roadmap also incorporates multi-year initiatives to provide expanded land range coverage enabling airborne participants to operate seamlessly across test or training ranges and initiatives to develop the aircraft and ground instrumentation, distributed LVC simulation environments, data collection and processing to enable interoperability across multiple ranges and platforms."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}