{
    "id": "2021-Army-PB-2040-JBOOK-8f7fdbb59cb85b132b0478715b87ff02c7eb359f73f79d73e48c9151ed5a28f2-3",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603004A"
        },
        "ProgramElementTitle": {
            "val": "Weapons and Munitions Advanced Technology"
        },
        "R1LineNumber": {
            "val": "46"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "240.862"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "240.862"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) is being eliminated, with continuity of effort realigned to the following PEs:\n?\t0603118A Soldier Lethality Advanced Technology \n?\t0603119A Ground Advanced Technology\n?\t0603462A Next Generation Combat Vehicle Advanced Technology\n?\t0603464A Long Range Precision Fires Advanced Technology\n?\t0603465A Future Vertical Lift Advanced Technology\n?\t0603466A High Energy Laser Tactical Vehicle Demonstrator Advanced Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE matures weapons and munitions components\/subsystems and demonstrates lethal weapons systems with potential to increase force application and force protection capabilities across the spectrum of operations. Project 232 focuses on affordable delivery of scalable effects for kinetic weapons and munitions including: artillery, mortars, medium caliber, tank fired, Soldier weapons and shoulder fired weapons. Project L96 matures and integrates critical high energy laser subsystems into mobile demonstrators to explore and validate system performance in relevant environments. Project L97 demonstrates performance of advanced obscurants and delivery of mechanisms and conducts forensic analysis of explosives and hazardous materials to enable detection.  \n\nWork in this PE is related to, and fully coordinated with, PE 0602120A (Sensors and Electronic Survivability), PE 0602307A (Advanced Weapons Technology), PE 0602618A (Ballistics Technology), PE 0602622A (Chemical, Smoke, and Equipment Defeating Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602782A (Command, Control, Communications Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), and PE 0603313A (Missile and Rocket Advanced Technology).  \n\nBeginning in FY20, work in this PE is related to and fully coordinated with PE 0603118A (Soldier Lethality Advanced Technology), PE 0603119A (Ground Advanced Technology), 0603462A (Next Generation Combat Vehicle Advanced Technology), 0603464A (Long Range Precision Fires Advanced Technology), 0603465A (Future Vertical Lift Advanced Technology), and PE 0603466A (Air and Missile Defense Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. All FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe work in this PE is performed by the United States Army Futures Command (AFC) and the United States Army Space and Missile Defense Command\/Army Forces Strategic Command (USASMDC\/ARSTRAT)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "241.581"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "240.862"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.719"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.5"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.219"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "232"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Lethality & Survivability Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "70.696"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "70.696"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nPE 0603118A Soldier Lethality Advanced Technology\n* Project AY7 Small Arms Fire Control Advanced Technology\nPE 0603462A Next Generation Combat Vehicle Advanced Technology\n* Project BF5 Adv Lethality & Accuracy Sys for Med Cal Adv Tech\n* Project BG5 Extended Line of Sight (ELOS) Advanced Technology\n* Project BI1 Protection for Autonomous Systems Adv Tech\n* Project BK4 Next Gen Intelligent Fire Control(NG-IFC) Adv Tech\n* Project BK6 Adv Direct InDirect Armament Sys (ADIDAS) Adv Tech\nPE 0603464A Long Range Precision Fires Advanced Technology\n* Project AE6 Strategic Long Range Cannon Advanced Technology\n* Project AG3 Extended Range Cannon Artillery (ERCA) Adv Tech\n* Project AG5 Extended Range Artillery Munition Suite Adv Tech\n* Project AG7 Energetic Materials and Adv Processing Adv Tech\n* Project BS3 Strategic Missile Advanced Technology\nPE 0603465A Future Vertical Lift Advanced Technology\n* Project AK7 Adv Rotorcraft Armaments Protection Sys Adv Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates technologies for affordable precision munitions including advanced energetic materials and munitions, novel fuze designs, penetrators, and scalable effects. \n\nEfforts in this Project support the Lethality and Ground Maneuver portfolios.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY20 realignments are due to financial restructuring in support of Army Modernization Priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cluster Munitions Replacement Acceleration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates ultra-high reliability fuzing, advanced kill mechanisms, and alternative dispensing technologies for 155mm artillery to provide increased battlefield lethality with reduced unexploded ordnance (UXO) compliant with the Department of Defense (DoD) cluster munitions policy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.748"
                                            },
                                            "Text": {
                                                "val": "Continued to conduct ballistic testing with the objective of a TRL6 demonstration at the end of FY 2019 to validate performance of critical components such as fuzing and warheads; optimized tests to capture as much pertinent data as possible to inform requirements generation; matured and demonstrated the performance of integrated components through ballistic testing to show improvements over legacy systems and serve as a down-select to a tactical design; generated documentation capturing the cluster munition effort relevant data to facilitate transition to PEO\/PM in support of the Cannon-Delivered Area Effects Munitions (C-DAEM) Program of Record."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medium Caliber Weapon Systems"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates advanced medium caliber ammunition, weapon, fire control, and Ammunition Handling Systems (AHS) optimized for remote operation. This effort demonstrates cannon-super high elevation engagement, high performance stabilization, remote ammunition loading, weapon safety and reliability, improved lethality, accuracy, ability to fire a suite of ammunition from non-lethal to lethal, and escalation of force capability in one system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.7"
                                            },
                                            "Text": {
                                                "val": "Matured fire control software to support 50mm weapon system integration; integrated complete weapon system into a test bed turret to mature and demonstrate test bed turret control systems and fire control ballistic solutions for optimized lethal performance; validated simulated system analysis data against various target sets and provide feedback into fire control solutions for integrated system optimization; completed an integrated (TRL 6) 50mm demonstration to validate the integrated system accuracy and lethal performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Scale-up of Energetic Materials"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates the performance and insensitivity of energetic materials ranging from 25mm medium caliber (direct fire) through 155mm large caliber (indirect fire) weapons."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.937"
                                            },
                                            "Text": {
                                                "val": "Continued to qualify energetic materials for complete material characterization; demonstrated high-energy, reduced sensitivity melt-pour formulations for enhanced fragmentation representative munitions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Protection Armament Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort supports the Army's Active Protection System (APS) program to mature and demonstrate APS technologies to reduce vehicle weight while reducing reliance on armor through the use of other means such as sensing, warning, hostile fire detection, and active countermeasures to achieve increased protection against current and emerging threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.358"
                                            },
                                            "Text": {
                                                "val": "Conducted demonstrations of mature Modular APS Framework (MAF)-compliant HKCM subsystems to validate modularity and performance optimization; provided mature technologies for integration in a MAF-compliant HKCM subsystem for a layered demonstration of combined Soft Kill and Hard Kill component technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Range Gun Technology"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates extended range artillery weapon system and projectile technologies that increase the range by 25% without an increase in platform weight."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.628"
                                            },
                                            "Text": {
                                                "val": "Optimized the design of secondary weapon subsystems such as scavenge systems, elevation, equilibration, automated breech operation, and thermal warning technologies; demonstrated compact automatic ammunition handling and loading systems with armaments using emerging charge and projectile technologies for improved range and rate of fire performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter-Unmanned Aviation System (C-UAS) Technology"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates C-UAS technologies designed to encompass the entire kill chain including detection, tracking, classification, and kinetic defeat of UAS for point defense and mobile applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.622"
                                            },
                                            "Text": {
                                                "val": "Demonstrated integrated small (0.50) caliber counter UAS technologies at a live fire event; demonstrated the ability to track outgoing rounds and incorporate data into fire control solution;  matured and demonstrated guided medium caliber armament system initially created through DARPA effort to search, identify, track and intercept maneuvering threats; improved fire control and guidance algorithms for C-UAS\/Air Defense scenarios; optimized kinetic armament system components design for integration on a ground vehicle platform."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Accelerated Extended Range Munition Suite"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates extended range artillery technologies including rocket and base bleed propulsion, hybrid lifting surfaces and guidance technologies which increase range and accuracy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.152"
                                            },
                                            "Text": {
                                                "val": "Matured and evaluated long range unitary artillery projectile components in the areas of precision, counter-measure, and payload technologies; conducted system modeling and simulation to assess improved projectile performance by these technologies when fired from Extended Range Cannon Artillery (ERCA) cannon tube; developed and tested integration concepts and algorithms and refined guidance and navigation system design concepts at extended ranges in GPS-denied environments; matured component development for cargo and effects munition compatible with legacy and ERCA in the following areas:   1) dispensing techniques and sensor for area effects to service precisely located targets ; 2) optimal formulations and characteristics for smoke and illumination payloads that maximize effectiveness ; and 3) survivability of cannon-launched terrain shaping munition for maximum area denial effects; conducted critical design review of component technologies; performed test and evaluation of key enabling component technologies; refined concepts for system integration; and matured modeling and simulation concepts for subsequent validation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fuze and Power Technology for Munitions"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates innovative fuze and power technologies for enhanced environment and target sensing\/classification, warhead initiation schemes, and advanced fuze setting. These technologies will provide enhanced lethality combined effects on targets and advanced initiation schemes for the next generation munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.36"
                                            },
                                            "Text": {
                                                "val": "Conducted live fire (Mann Barrel) demonstration of several 30x173mm or Light Weight 50mm airburst rounds that demonstrate an increase in range accuracy when rounds are corrected;  conducted live fire demonstration of a 40mm round using a pre-timed airburst function and low cost Electronic Safe and Arming (ESAD); conducted demo of the Precision Guided Kit in a 155mm projectile using the Next Gen Large Cal Setter; and conducted demo of the extended run time thermal battery."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended Range Armament and Fire Control Integration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates extended range Armament technologies including light weight Cannon and Mount structures, high efficiency recoil cylinders, common lower power fire control hardware, improved fire control software, and improved sensor to shooter communications which will increase range and accuracy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.447"
                                            },
                                            "Text": {
                                                "val": "Optimized enhanced light weight structures for cannon and mount components, integrated controls and ammunition handling system; exploited projectile tracking and guidance technologies to provide accuracy at extended ranges in global positioning system (GPS)-denied environments; continued to mature and demonstrate advanced and common fire control hardware and software to increase accuracy and reduce logistic burden."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aviation Armament System Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates armament solutions adaptable to current aviation and future vertical lift applications in small caliber, medium caliber, counter measure technologies with a focus on light lethal aerodynamic systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.433"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated a Technology Readiness Level (TRL) 6 airburst munition with a selectable proximity airburst - point detonation fuze for the Apache AH-64E; optimized critical ammunition technologies in areas of power generation, proximity sensor, and smart multi-mode fuzing to support the Apache AH-64E."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended Line of Site Munition (ELOS)"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates a 120mm Tank fired ELOS Munition that counters the growing Anti-Tank Guided Missile (ATGM) threat at extended line of sight ranges beyond current capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.811"
                                            },
                                            "Text": {
                                                "val": "Optimized an ELOS Munition Air Frame (projectile) design to include fin stabilization element, Seeker Unit, Guidance Electronics Unit (GEU), Canard Actuation System (CAS), Warhead, GNC (Guidance, Navigation, and Control) Software, Target Acquisition and Tracking Software, and Propulsion system; integrated these components to validate their performance through a preprogram maneuver cannon fired experiment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AI Test Bed"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.5"
                                            },
                                            "Text": {
                                                "val": "TBD"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "43A"
                    },
                    "ProjectTitle": {
                        "val": "ADV WEAPONRY TECH DEMO (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "139"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "139.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Advanced Weaponry Technology development."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase FY19 Appropriations Act"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "14"
                                        },
                                        "Text": {
                                            "val": "Program Increase FY19 Appropriations Act"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Increase FY19 Appropriations Act (CCDC)"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "28"
                                        },
                                        "Text": {
                                            "val": "Program Increase FY19 Appropriations Act (CCDC)"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program increase - advanced development of asset protection technologies"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Program increase - advanced development of asset protection technologies"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program increase - accelerate ERCA gun"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "12"
                                        },
                                        "Text": {
                                            "val": "Program increase - accelerate ERCA gun"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program increase - high energy laser"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "20"
                                        },
                                        "Text": {
                                            "val": "Program increase - high energy laser"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program increase - long range precision fires"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "34.821"
                                        },
                                        "Text": {
                                            "val": "Program increase - long range precision fires"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "hypersonic capability - transfer from line 71"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "25"
                                        },
                                        "Text": {
                                            "val": "hypersonic capability - transfer from line 71"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun (CCDC)"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.179"
                                        },
                                        "Text": {
                                            "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun (CCDC)"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L96"
                    },
                    "ProjectTitle": {
                        "val": "High Energy Laser Technology Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "25.37"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "25.370"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0603466A Air and Missile Defense Advanced Technology\n* Project AD1 High Energy Laser Tactical Vehicle Demo Adv Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates advanced technologies for future High Energy Laser (HEL) weapons technology. The major effort under this Project is the phased approach for mobile high power solid state laser (SSL) technology demonstrations that are traceable to the form, fit, and function requirements for a HEL weapon. SSL technology has demonstrated the potential to engage and defeat rockets, artillery and mortars (RAM), unmanned aerial vehicles (UAVs), cruise missiles, sensors, and optics at tactically relevant ranges. HELs are expected to complement conventional offensive and defensive weapons at a lower cost-per-shot than current systems and without the need to strategically, operationally, or tactically stockpile ordnance. This effort utilizes a modular building block approach with open systems architecture to ensure growth, interoperability, and opportunity for technology insertions for maturation of laser, beam control, sensor\/radar, integration of power and thermal management subsystems, as well as Battle Management Command, Control, and Computers (BMC3). \n \nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY20 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork is performed by the United States Army Space and Missile Defense Command\/Army Forces Strategic Command (SMDC\/ARSTRAT)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Laser System Ruggedization"
                                    },
                                    "Description": {
                                        "val": "This effort ruggedizes laser systems for integration on Army platforms.  Ruggedization includes modifications of the laser system to withstand vibration, temperature, and contamination environments expected on various Army platforms, while ensuring platform volume, weight, and interface specifications are met."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.494"
                                            },
                                            "Text": {
                                                "val": "Complete Critical Design Review (CDR) for the High Energy Laser Tactical Vehicle Demonstrator (HEL TVD). This review will complete the design of the system and includes details of the laser subsystems interfaces with the platform, a Family of Medium Tactical Vehicles (FMTV). Will begin ruggedizing and assembling thermal management, electrical power, and battle management subsystems for the HEL TVD based on designs of the laser and beam control system designs developed under PE 0602307A, Project 042."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Energy Laser Systems Integration and Mobile Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort integrates a 50 kW-class laser into the existing mobile laser demonstrator platform that includes the ruggedized Beam Control System (BCS) built under the HEL Technical Demonstration effort and other required subsystems to demonstrate weapon system performance. The goal is to demonstrate and evaluate performance of a complete mobile high energy laser system in a relevant environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.876"
                                            },
                                            "Text": {
                                                "val": "Complete analysis of the FY18 HELMTT 50 kW-class system risk reduction demonstration; consolidate lessons learned from HELMTT demonstration to apply to High Energy Laser Tactical Vehicle Demonstrator (HEL TVD); begin preliminary planning for HEL TVD demonstration and define target requirements for FY22 demonstration; initiate system demonstration performance prediction analysis based on HEL TVD predicted performance parameters."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L97"
                    },
                    "ProjectTitle": {
                        "val": "Smoke And Obscurants Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.796"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.796"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0603119A Ground Advanced Technology, Projects:\n*\tBL3 Explosives Forensics Advanced Technology\nPE 0603462A Next Generation Combat Vehicle Advanced Technology, Projects:\n*\tBG7 Ground Systems Active Defense (GSAD) Advanced Tech\n*\tBG9 Obscuration Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "The Project matures and demonstrates obscurant technologies with potential to enhance personnel\/platform survivability by degrading threat force surveillance sensors and defeating the enemy's target acquisition devices, missile guidance, and directed energy weapons. Dissemination systems for new and improved obscurants are developed with the goal of providing efficient and safe screening of deployed forces. This Project also matures and demonstrates improved detection of explosives and hazardous materials by Soldiers and Small Units.\n\nWork in this Project is related to, and fully coordinated with, PE 0602622A (Chemical, Smoke and Equipment Defeating Technology) \/ Project 552 (Smoke\/Novel Effect Mun) and PE 0603606A (Landmine Warfare and Barrier Advanced Technology \/ Project 608 (Countermine & Bar Dev).   \n\nThis Project sustains Army Science and Technology efforts supporting the Ground Maneuver portfolio.\n   \nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY20 realignments are due to financial restructuring in support of Army Modernization Priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Obscurant Enabling Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the dissemination of new and advanced obscurants. This effort will support Modular Active Protection System (MAPS) in PE 0603005A (Combat vehicle and Automotive Advanced Technology) \/ Project 221 (Combat Veh Survivablty)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.802"
                                            },
                                            "Text": {
                                                "val": "Assessed existing and emerging obscurants and their dissemination in vehicle protection grenades; initiated design efforts to integrate with MAPS system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Forensic Analysis of Explosives"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates improved point and stand-off detection of explosives and homemade explosive (HME) precursors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.065"
                                            },
                                            "Text": {
                                                "val": "Revised and developed 2nd Generation Chemical Fingerprint Imaging System (CFIS) prototype showing optimized detection performance including improved detection of trace explosive residues and other molecules on curved surfaces and detection algorithm for discrimination of target materials on complex backgrounds."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Detection Mechanisms for Contaminants"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates improved point and standoff detection of a wide range of hazardous materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.923"
                                            },
                                            "Text": {
                                                "val": "Investigated UV laser alternatives and spectrometer for trace explosives standoff detection system; conducted technology assessment of trace explosives sensors through a field trial to evaluate sensor sensitivity and technical performance analysis."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.006"
                                            },
                                            "Text": {
                                                "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}