{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-9035d21372bc28631c31031b85da2fbd962d290bf8d6ca6eecbc49021508de49-1",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0601120D8Z"
        },
        "ProgramElementTitle": {
            "val": "National Defense Education Program (NDEP)"
        },
        "R1LineNumber": {
            "val": "5"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "100.850"
            },
            "PriorYear": {
                "val": "132.743"
            },
            "CurrentYear": {
                "val": "144.074"
            },
            "BudgetYearOne": {
                "val": "100.241"
            },
            "BudgetYearOneBase": {
                "val": "100.241"
            },
            "BudgetYearTwo": {
                "val": "106.285"
            },
            "BudgetYearThree": {
                "val": "108.249"
            },
            "BudgetYearFour": {
                "val": "110.084"
            },
            "BudgetYearFive": {
                "val": "112.385"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "135.610"
                },
                "CurrentYear": {
                    "val": "92.074"
                },
                "BudgetYearOne": {
                    "val": "99.145"
                },
                "BudgetYearOneBase": {
                    "val": "99.145"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "132.743"
                },
                "CurrentYear": {
                    "val": "144.074"
                },
                "BudgetYearOne": {
                    "val": "100.241"
                },
                "BudgetYearOneBase": {
                    "val": "100.241"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.867"
                },
                "CurrentYear": {
                    "val": "52.000"
                },
                "BudgetYearOne": {
                    "val": "1.096"
                },
                "BudgetYearOneBase": {
                    "val": "1.096"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "52.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.844"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Increase for SMART Program and International Genetically Engineered Machine (iGEM)"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "5.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Re-alignment to PE 060110D8Z"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.094"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.094"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.023"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.810"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.810"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2020 $52.000 million increase:\n$15.000 million increase for Manufacturing Engineering Education Program (MEEP)\n$35.000 million increase for STEM education\n$2.000 million increase for civics education\n\nFY 2021 Realignment for Higher DoD priorities:\n$3.000 million adjustment to support the Laboratory University Collaboration Initiative (LUCI) and Multidisciplinary University Research Initiative (MURI) - re-aligned to PE 060110D8Z\n$3.000 million increase for SMART program\n$2.000 million for International Genetically Engineered Machine (iGEM) investment"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "120"
                    },
                    "ProjectTitle": {
                        "val": "National Defense Education Program (NDEP)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "100.850"
                        },
                        "PriorYear": {
                            "val": "132.743"
                        },
                        "CurrentYear": {
                            "val": "144.074"
                        },
                        "BudgetYearOne": {
                            "val": "100.241"
                        },
                        "BudgetYearOneBase": {
                            "val": "100.241"
                        },
                        "BudgetYearTwo": {
                            "val": "106.285"
                        },
                        "BudgetYearThree": {
                            "val": "108.249"
                        },
                        "BudgetYearFour": {
                            "val": "110.084"
                        },
                        "BudgetYearFive": {
                            "val": "112.385"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The National Defense Education Program (NDEP) fosters and enhances the Department of Defense’s (DoD) ability to access high-quality science, technology, engineering, and mathematics (STEM) talent vital to national defense now and in the future.  NDEP is executed by the Office of the Under Secretary of Defense for Research and Engineering (USD(R&E)).  NDEP’s portfolio includes workforce development programs, such as the Science, Mathematics, and Research for Transformation (SMART) program; Military family programs, such as the Military Child Program (MCP); STEM Education and Outreach; and the Manufacturing Engineering Education Program (MEEP).  These programs provide a pathway to the best and the brightest minds through a continuum of DoD workforce development approaches, which include:  (1) broadening STEM literacy in K through College continuum to prepare for postsecondary success in STEM disciplines and providing DoD and the Nation enduring access to talent needed to address ever-changing future defense workforce needs; (2) providing awareness of the Department as a STEM workplace of choice for scientists and engineers through programs and outreach; (3) leading the Departmental STEM strategic efforts to ensure alignment with the workforce and mission requirements; and (4) leveraging strategic partners with a shared mission in identifying innovative approaches to developing the Nation's current and future STEM talent.\n\nThe NDEP aligns to the National Defense Strategy and the DoD science and technology (S&T) priorities.  The program is also aligned to the 2018 Federal STEM Education Strategic Plan, and the DoD STEM Strategic Plan. NDEP components engage in assessment and evaluation practices as outlined by the Office of Management and Budget and the Government Accountability Office.\n\nThe SMART program awards highly competitive scholarships-for-service to undergraduate and graduate students in 21 STEM academic disciplines and hires the students, upon graduation, into DoD's workforce.  As part of the SMART experience, scholars engage in internships that allow for relevant hands-on research and work experiences in DoD facilities, thereby enhancing their educational experience. Since its inception as a pilot program in FY 2005, SMART has awarded approximately 3,000 scholarships to students ranging from undergraduate to doctoral studies.  To date, approximately 2,000 students have completed their academic pursuit and transitioned into DoD employment. Approximately 1,200 participants have successfully completed the program through their DoD Service commitment, of which 71 percent of those participants continue to be employed by DoD SMART ensures the Department has a steady infusion of high-quality technical talent, prepared in areas of critical importance to DoD, and ready to apply their technical knowledge, skills, and abilities to fulfill DoD’s mission.\n\nThe MCP provides dependents of members of the Armed Forces educational and outreach opportunities in STEM to prepare for pathways in STEM-related careers.  Additionally, MCP also provides assistance to STEM teachers at elementary or secondary schools at which a significant number of military dependents are enrolled.  Section 233 of the National Defense Authorization Act (NDAA) for FY 2015, and the Consolidated and Further Continuing Appropriations Act, 2015, authorized the establishment of this Pilot Program.  By FY 2021, the pilot program will be absorbed into the DoD STEM portfolio of program activities.\n\nSTEM Education and Outreach fosters activities to support and cultivate STEM talent with minds for innovation, diversity of thought, and the technical agility to sustain the Department’s competitive edge.  In order to build a workforce that brings in an expansion of ideas to solve national defense needs and challenges, the DoD recognizes the need for increased participation of underserved groups in STEM activities and education programs.  Initiatives include investing, promoting, and participating in national-level STEM programs and efforts, as well as providing authentic hands-on STEM experiences for students and teachers across the Nation.\n\nThe DoD is consistently looking for innovative scientific and technological solutions to address current and future military requirements.  The MEEP will enhance existing or establish new education programs that support manufacturing engineering."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Manufacturing Engineering Education Program (MEEP)"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "15.000"
                                        },
                                        "Text": {
                                            "val": "• Published a funding opportunity announcement with specific community college and academia initiatives within manufacturing engineering.\n• With support from DoD Components, issued a funding opportunity announcement for Manufacturing Engineering Education Pilot initiatives. \n• Awarded one MEEP award, with two pending."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "15.000"
                                        },
                                        "Text": {
                                            "val": "• Support regional fabrication and certification training labs."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "STEM Education Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "34.691"
                                        },
                                        "Text": {
                                            "val": "• Awarded a five year grant to support the Barry Goldwater Foundation Scholarships for DoD related STEM disciplines.  The funding provides an additional 240 scholarship awards annually."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "35.000"
                                        },
                                        "Text": {
                                            "val": "• Expand on existing STEM education, outreach and workforce development programs through a FOA.\n• Support DoD and Federal STEM Education Strategy in building strong foundations STEM for literacy, diversity and inclusion, and developing the future STEM workforce.\n• Ensure that efforts implement and execute effective program measures."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Civics Education"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "2.000"
                                        },
                                        "Text": {
                                            "val": "• Support civics education programs."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Workforce Development - Science, Mathematics, and Research for Transformation (SMART) Defense Education Program"
                                    },
                                    "Description": {
                                        "val": "Description: SMART is a scholarship-for-service program that provides support to high performing U.S. graduate and undergraduate students in 21 academic science, technology, engineering, and mathematics (STEM) disciplines identified as areas of future workforce priorities for the DoD.\n\nThe disciplines align with the Department’s Science and Technology (S&T) priorities and emerging scientific research areas such as:  Aeronautical and Astronautical Engineering; Biomedical Engineering; Biosciences; Chemical Engineering; Chemistry; Civil Engineering; Cognitive, Neural, and Behavioral Sciences; Computer Science; Electrical Engineering; Environmental Sciences; Geosciences; Industrial and Systems Engineering; Information Sciences; Materials Science and Engineering; Mathematics; Mechanical Engineering; Naval Architecture and Ocean Engineering; Nuclear Engineering; Oceanography; Operations Research; and Physics.  Upon completion of their degree, students fulfill a service commitment to the Department on a one-to-one payback per year of education funded.\n\nIn part, SMART's success is measured by participants that choose to remain in the DoD workforce beyond their required service commitment.  Approximately 1,200 participants have successfully completed the program through their DoD Service commitment, of which 71 percent of those participants continue to be employed by DoD.\n\nOversight of the SMART program falls under the Office of the Under Secretary of Defense for Research and Engineering (USD(R&E)).  Two types of individuals participate in the program: (1) retention scholars who are current DoD employees; and (2) recruitment scholars who are students enrolled in undergraduate and graduate programs and represent new technical expertise for the Department.  Internships provide SMART scholars with an opportunity to engage in the DoD science and technology enterprise through research and work experiences in defense laboratories, thereby enhancing their educational experience and understanding the relevance of DoD research priority areas.\n\nSince FY 2005, approximately 3,000 students have participated in the SMART program at approximately 190 sponsoring facilities.  As of October 2018, approximately 2,000 SMART scholars have transitioned into the service commitment phase.  To date, these scholars have transitioned as civilian employees into the Air Force, Army, Navy, and other DoD components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "64.991"
                                            },
                                            "Text": {
                                                "val": "• Allocate SMART awards to better meet the technical needs of the Department's STEM workforce.\n• Focus nine percent of the awards on disciplines supporting the advancement of Artificial Intelligence, Microelectronics, and Hypersonics within the DoD.\n• Implement a robust recruitment effort to ensure the Department continues to meet the increasing needs of the DoD STEM workforce.\n• Conduct a SMART Symposium to continually enhance inter-Service collaboration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "71.004"
                                            },
                                            "Text": {
                                                "val": "• Allocate SMART awards to better meet the technical needs of the Department's STEM workforce and sustain the scientific and technological superiority to enable unquestioned battlefield dominance.\n• Focus ten percent of the awards on disciplines supporting the advancement of Artificial Intelligence, Microelectronics, Biotechnologies, Hypersonics and the remaining DoD priority areas.\n• Implement a robust recruitment effort to ensure the Department continues to meet the increasing needs of the DoD STEM workforce.\n• Conduct a SMART Symposium to continually enhance inter-Service collaboration and provide a forum for scholars to network."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "77.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "77.100"
                                            },
                                            "Text": {
                                                "val": "• Continue to make SMART awards to meet the technical needs of the Department's STEM workforce and sustain the scientific and technological superiority to enable unquestioned battlefield dominance.\n• Implement a robust recruitment effort focusing on disciplines supporting the advancement of Artificial Intelligence, Microelectronics, Biotechnologies, Hypersonics, and the remaining DoD priority areas, within the DoD to ensure the Department continues to meet the increasing needs of the DoD STEM workforce.\n• Conduct a SMART Symposium to continually enhance inter-Service collaboration and provide scholars a networking forum."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Additional funding will support the continuing education of the current SMART scholars and award ~200-250 new scholarships to help meet the DoD's workforce needs."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Military Families - Pilot Program to Enhance the Preparation of Dependents of Members of the Armed Forces for Careers in STEM (Military Child Pilot Program or MCCP)"
                                    },
                                    "Description": {
                                        "val": "The MCPP was formally established by the FY 2015 National Defense Authorization Act (NDAA), Section 233, and the Consolidated and Further Continuing Appropriations Act, 2015.  The objectives of the program are to enhance the preparation of dependents of members of the armed forces for careers in STEM and to provide assistance to STEM teachers at elementary or secondary schools at which a significant number of military dependents are enrolled.  The Department currently provides in-classroom STEM program support to students and teachers in covered schools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.281"
                                            },
                                            "Text": {
                                                "val": "• The Department will target military-dependent students, their teachers, and their families through in-classroom and out-of-school programs to provide additional STEM resources, greater awareness of DoD STEM opportunities and careers, and reach a younger military child population.\n• In coordination with the DoD Components, complete the FY 2018 NDAA Section 553 report on educational opportunities in STEM for dependents of members of the Armed Forces."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.483"
                                            },
                                            "Text": {
                                                "val": "• Continue conducting targeted outreach to military-dependent students, their teachers, and their families through in-classroom and out-of- school programs and provide additional STEM resources, greater awareness of DoD STEM opportunities and careers, and reach a younger military child population.\n• Continue providing activities through a cooperative agreement award to a Consortium of partners from academia, industry, and not-for-profit organizations with a shared mission in developing future STEM talent."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "The Military Child Pilot Program Authority expires at the end of FY 2020.  The program will fully integrate into the STEM Education and Outreach task described below."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease in funding, $11.5M, from FY 2020 to FY 2021, due to transfer of MCPP from a standalone program to one that is integrated with the overall STEM Education and Outreach effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "STEM Education and Outreach"
                                    },
                                    "Description": {
                                        "val": "STEM Education and Outreach fosters activities to support and cultivate STEM talent with minds for innovation, diversity of thought, and the technical agility to sustain the Department’s competitive edge.  In order to build a workforce that brings in an expansion of ideas to solve national defense needs and challenges, the DoD recognizes the need for increased participation of underserved groups in STEM activities and education programs.  Investments are made to promote participation in national-level STEM programs and initiatives and provide authentic hands-on experiences for students and teachers across the globe.  STEM Education and Outreach manages activities, in support of the Department’s STEM Strategic Plan, to attract, inspire, and develop exceptional STEM talent across the education continuum that includes internships, robotics and math competitions, and mentoring through partnerships with industry."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.780"
                                            },
                                            "Text": {
                                                "val": "• Continue STEM Education and Outreach activities that provide authentic hands-on experiences to students and teachers and evaluate the effectiveness of the increased outreach.\n• Participate in inter- and intra-departmental collaboration with program partners to achieve federal and DoD STEM objectives.\n• Update the Department’s STEM Strategic Plan. \n• Implement joint framework to increase access to STEM program-level outcome data for oversight and evaluation of DoD-wide STEM programs and investments, making evidence-based adjustments and improvements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.587"
                                            },
                                            "Text": {
                                                "val": "• Continue STEM Education and Outreach activities that provide authentic hands-on experiences to students and teachers and evaluate the effectiveness of the increased outreach.\n• Participate in inter- and intra-departmental collaboration with stakeholders to achieve Federal and DoD STEM objectives.\n• Finalize the Department’s new STEM Strategic Plan."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.141"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.141"
                                            },
                                            "Text": {
                                                "val": "• Will continue to provide STEM Education and Outreach activities with emphasis on authentic hands-on experiences to students and teachers and evaluate the effectiveness of the increased outreach.\n• Will continue to participate in inter- and intra-departmental collaboration with stakeholders to achieve Federal and DoD STEM objectives.\n• Will finalize the Department’s new STEM Strategic Plan.\n• Will fully integrate Military Child Program into all STEM Education and Outreach efforts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in funding $11.5M from FY 2020 to FY 2021 due to transfer of the MCPP from a standalone program to one that is integrated with the overall STEM Education and Outreach effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "BIOTECH International Genetically Engineered Machine (iGEM) Competition"
                                    },
                                    "Description": {
                                        "val": "In order to build a BIOTECH workforce that brings in an expansion of ideas to solve national defense needs and challenges, the DoD recognizes the need to support domestic programs that motivate young people to pursue education and career opportunities in biotechnology. iGEM is an international biotechnology competition that attracts students from more than 40 countries around the globe by providing a mentor-based program that builds science and engineering skills to foster the next generation of BIOTECH leaders. Increasing U.S. participation in iGEM aligns with the Department’s BIOTECH roadmap, and will facilitate the development of the domestic biotechnology workforce."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "• Increase U.S. participation in iGEM to include teams from 30 states and 3 Service Academies. \n• Prioritize teams that include a DoD-supported scientist as mentor, and with teammates from underserved groups.\n• Communicate DoD’s support for U.S. BIOTECH workforce development."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "New effort in FY 2021 for International Genetically Engineered Machine (iGEM) investment."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}