{
    "id": "2021-AirForce-PB-3600-MJBOOK-3-0-4ccc939241b47239c36ee98d5519ce37a7e18b46d494a025321d2035cb3d38d7-38",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-AIRFORCE_V3B-U_RDTE_MasterJustificationBook_Air_Force_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0401119F"
        },
        "ProgramElementTitle": {
            "val": "C-5 Airlift Squadrons (IF)"
        },
        "R1LineNumber": {
            "val": "279"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "28.245"
            },
            "CurrentYear": {
                "val": "10.223"
            },
            "BudgetYearOne": {
                "val": "32.560"
            },
            "BudgetYearOneBase": {
                "val": "32.560"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "22.600"
            },
            "BudgetYearThree": {
                "val": "0.671"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "80.502"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "174.801"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The C-5M operates across the entire range of military operations. It is the only aircraft capable of carrying 100% of certified air-transportable cargo and includes a dedicated passenger compartment enabling commanders to have troops and their equipment arrive in an area of operation simultaneously when national security concerns demand fast force closure. C-5M missions include strategic airlift of cargo and passengers as well as emergency aeromedical evacuation (AE). The aircraft must perform these missions throughout the worldwide air traffic control environment with the proper equipment to operate in FAA\/ICAO controlled airspace. Additionally, C-5M aircraft must operate at night, in adverse weather conditions, and in Chemical, Biological, Radiological, Nuclear (excluding electromagnetic pulse in accordance with Joint Requirements Oversights Council (JROC) approved\/validated the C-5 RERP ORD 14 Aug 01, see Appendix B, Ref YY, page 11, para 4.3.1), and High Explosive (CBRNE) environments.\n\nC-5M communication, navigation, surveillance\/air traffic management (CNS\/ATM) program is a comprehensive effort to ensure appropriate CNS\/ATM system design architectures are developed and equipment is installed on the C-5M to allow aircraft operation in accordance with civil airspace access mandates for both the US national airspace system (NAS) and international civil airspace. Also, the program will add equipment to meet outstanding National Security Agency mandates for encryption of voice communications. The C-5M CNS\/ATM program ensures system standardization and interoperability with other DoD systems to the maximum extent possible and directly supports airworthiness certification of the C-5M. CNS\/ATM requirements include, but are not limited to, capabilities such as automatic dependence surveillance-broadcast out (ADS-B Out), identification friend or foe (IFF) mode 5, satellite communication equipment replacement, and beyond line-of-sight voice radio replacement. It is anticipated equipment will be predominately commercial off-the-shelf or non-developmental items.\n\nC-5M Replace Multi-function Controls and Displays (RMCD) program helps to maintain aircraft availability and increased situational awareness though a new Multi Function Display Unit (MFDU)replace the current 20+ year MFDU design; current equipment is experiencing severe diminishing manufacturing source (DMS) issues.  Additionally, there is a requirement to reduce Operational Flight Program (OFP) load times and improve load reliability and provide outlets for Mission Planning Equipment (MPE) to enhance operational mission support. The current generation of displays and controls supporting services used on the C-5M will no longer be repairable beginning in 4th Quarter, FY24 for MFDU. Without this modification, the C-5M will be unable to support the National Defense Strategy, AF Strategic Master Plan, Geographical Combatant Command Operational Plans.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver C-5 weapon system capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program element 0605831F.\n\nFunding to provide for program management & administration, studies and analysis, risk reduction efforts, Advisory and Assistance Services, change orders, and other government costs such as travel, directorate support, government furnished equipment (GFE), and over and above costs.  Funding may also be used to address Diminishing Manufacturing Sources (DMS) through studies and analysis, bridge buys, life-of-type buys, etc.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "25.071"
                },
                "CurrentYear": {
                    "val": "10.223"
                },
                "BudgetYearOne": {
                    "val": "36.288"
                },
                "BudgetYearOneBase": {
                    "val": "36.288"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "28.245"
                },
                "CurrentYear": {
                    "val": "10.223"
                },
                "BudgetYearOne": {
                    "val": "32.560"
                },
                "BudgetYearOneBase": {
                    "val": "32.560"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "3.174"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-3.728"
                },
                "BudgetYearOneBase": {
                    "val": "-3.728"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "4.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.826"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-3.728"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.728"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019 funding increased by $4.0M for a below threshold reprogramming action.\nFY 2021 funding request reduced by $3.728M due to availability of prior year execution balance."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "671307"
                    },
                    "ProjectTitle": {
                        "val": "C-5 REPLACE MULTIFUNCT CONTROL AND DISPLAY (RMCD)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "10.223"
                        },
                        "BudgetYearOne": {
                            "val": "32.560"
                        },
                        "BudgetYearOneBase": {
                            "val": "32.560"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "22.600"
                        },
                        "BudgetYearThree": {
                            "val": "0.671"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "80.502"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "146.556"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "C-5M Replace multi-function controls and display (RMCD) program is a comprehensive effort to ensure appropriate RMCD Line Replaceable Units (LRU) are developed and installed on the C-5M allowing aircraft operation in accordance with civil airspace access mandates for both US national airspace system (NAS) and international civil airspace. The C-5M RMCD program ensures system standardization and interoperability with other DoD systems to the maximum extent possible and directly supports airworthiness certification. The purpose of the program is to find a suitable replacement for the current multi-function display unit (MFDU) LRUs while maintaining existing interfaces to legacy equipment and providing for future growth opportunities.  Additionally, the replacement LRUs must have the Ethernet load capability to reduce Operational Flight Programs (OFP) load times, and the program will implement a power solution for Mission Planning Equipment (MPE). Operational Flight Programs (OFP) updates\/aggregation are required to support the latest aircraft display technologies and will be designed to ensure seamless integration into the platform.  Aircraft wiring will be replaced\/upgraded as required. Use of mixed displays (current and new) is not permissible due to human factors considerations. It is anticipated equipment will be predominately commercial off-the-shelf or non-developmental items.\n\nThe RMCD program is a comprehensive sustainment modification to mitigate the obsolescence of the current control and display units. This effort centers around modifying the current display units to obtain sufficient capacity\/capability to support integration of new system capabilities with margin for growth by upgrading displays and correcting any mission essential deficiencies identified during development, including additions of an Ethernet loading capability and a power solution for the MPE. This modification may include software non-recurring engineering (NRE), data, cyber security, testing, installation, spares, systems integration lab (SIL), Interim Contractor Support (ICS), program support, etc.\n\nThe modification helps to maintain aircraft availability as the new multifunctional controls and displays replaces the current controls and displays, which are experiencing severe diminishing manufacturing source (DMS) issues. Failure to upgrade the displays to support aircraft availability will create a significant operational impact to the support of Geographic Combatant Command (GCCs) and maintaining U.S. National objectives. Further, Diminishing Manufacturing Source (DMS) issues will be resolved to support continued operations through studies and analysis, risk reduction efforts, bridge buys, life-of-type buys, development, and redesign efforts.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver C-5M weapon system capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program element 0605831F.\n\nAvailable funds may be used for program management administration, studies and analysis, risk reduction efforts, Advisory and Assistance Services, change orders, and other government costs such as travel, directorate support, government furnished equipment (GFE), and over and above costs.  Funding may also be used to address Diminishing Manufacturing Sources (DMS) through studies and analysis, bridge buys, life-of-type buys, etc."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "C-5 Replace Multi-Functional Controls and Displays"
                                    },
                                    "Description": {
                                        "val": "Description: Replace Multi-Functional Controls and Displays replacement will enable the C-5M to achieve wartime mission requirements by maintaining fleet availability (mission capable rate) and program management administration (PMA)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.223"
                                            },
                                            "Text": {
                                                "val": "Award EMD Contract for hardware and software design, development, integration, data management, systems engineering, program management, and spares."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "32.560"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "32.560"
                                            },
                                            "Text": {
                                                "val": "RMCD system design supports replacement of multi-functional controls and displays. Efforts include hardware and software design, development, integration, systems engineering and program management for compatibility with C-5 existing systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase due to full year of development efforts to include but not limited to hardware and software design, development, integration, systems engineering and program management for compatibility with C-5 existing systems."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF 05 C00500"
                                    },
                                    "Title": {
                                        "val": "C-5"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "17.879"
                                        },
                                        "BudgetYearFour": {
                                            "val": "19.266"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "37.145"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 06 0401119F"
                                    },
                                    "Title": {
                                        "val": "C-5 Airlift Squadrons"
                                    },
                                    "Funding": {
                                        "BudgetYearThree": {
                                            "val": "1.971"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "1.971"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Program Office completed an Early Strategy & Issues Session (ESIS) in September 2019, with the Acquisition Strategy Plan (ASP) anticipated at the end of January 2020. The Program Office received approval to pursue an Other Transaction Authority to procure prototype hardware in December 2019. The overall strategy is to procure the display units and graphics processors, integrate and test those components, and install on two (2) EMD aircraft.  The Acquisition Strategy (AS) for the RMCD has not been determined\/approved as of Jan 2020.  \n\nProgram Office anticipates that the primary contract type will be that of Cost Plus Incentive Fee (CPIF) with some Firm Fixed Price (FFP) elements. The Other\nTransaction for Prototype is anticipated to be FFP. \n\nThe integration of hardware, displays and graphics processors, and the software may be required to be Sole Source (SS) to Lockheed Martin, who holds the Data Rights to critical software and software documentation. Access to these items may be required to acquire the platform certifications necessary to put the final system onto test aircraft.\n\nProgram office will consider the use of commercial components."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "RMCD hardware\/software design, development, integration, data management, technical data rights, systems engineering, program management, and spares"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "8.613"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "26.840"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "26.840"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "35.453"
                                                    },
                                                    "TargetValue": {
                                                        "val": "56.255"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Other Govt Test and SIL"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.805"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.609"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.609"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.414"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PMA"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.805"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.111"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.111"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Replacement Multifunctional Control and Display"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Program start"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "ASP"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "MS B"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "HW Contract Award"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Prototyping with Hardware"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "HW and SW Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Integration Contract"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "MS C"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Cyber Prototype Contract"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Cyber Integration Contract"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SIL Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Test Planning"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Production Begins"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675359"
                    },
                    "ProjectTitle": {
                        "val": "C-5M Communication, Navigation, Surveillance\/Air Traffic Management (CNS\/ATM)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "28.245"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "28.245"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "C-5M communication, navigation, surveillance\/air traffic management (CNS\/ATM) program is a comprehensive effort to ensure appropriate CNS\/ATM system design architectures are developed and equipment is installed on the C-5M to allow aircraft operation in accordance with civil airspace access mandates for both the US national airspace system (NAS) and international civil airspace. Also, the program will add equipment to meet outstanding National Security Agency mandates for encryption of voice communications. The C-5M CNS\/ATM program ensures system standardization and interoperability with other DoD systems to the maximum extent possible and directly supports airworthiness certification of the C-5M. CNS\/ATM requirements include, but are not limited to, capabilities such as automatic dependence surveillance-broadcast out (ADS-B Out), identification friend or foe (IFF) mode 5, satellite communication equipment replacement, and beyond line-of-sight voice radio replacement. It is anticipated equipment will be predominately commercial off-the-shelf or non-developmental items.\n\nThe current ARC-210 radio for VHF voice communications is facing diminishing manufacturing source (DMS) supply issues and additionally will no longer be capable of providing secure voice communications due to the development of new crypto algorithms. Addition of next generation ARC-210 radios with embedded Integrated Waveform (IW) and Second-generation Anti-jam Tactical UHF Radio for NATO (SATURN) and associated cryptologic equipment will enable the C-5M to meet NSA mandates for secure communications and allow aircrews to continue to communicate securely over VHF, UHF, HF, or MILSATCOM.\n\nThe current generation of satellites that support services used on the C-5M to provide oceanic controller\/pilot data link communications (CPDLCs) to air traffic control and aircraft communications addressing and reporting system (ACARS) beyond-line-of-sight command and control messages is no longer functional post 2016. The next generation of satellites will accommodate legacy C-5M SATCOM equipment for an interim period of time to allow for integration of upgraded SATCOM equipment compatible with this satellite constellation. Without this modification, the C-5M will be unable to fly oceanic tracks and will not be able to meet aircraft separation distance requirements for civil airspace access.\n\nAutomatic Dependent Surveillance-Broadcast Out (ADS-B Out) is a next generation surveillance technology that transitions key aspects of air traffic control from terrestrial based technologies to satellite enabled technologies to provide controllers a more accurate picture of aircraft positioning. ADS-B Out will allow aircraft to provide continuous broadcast of aircraft position to both controllers and other aircraft equipped with ADS-B In capable avionics. International mandates for ADS-B Out for civil airspace access call for equipage by 2020.\n\nAvailable funds will be used for program management administration, studies and analysis, risk reduction efforts, Advisory and Assistance Services, change orders, and other government costs such as travel, directorate support, government furnished equipment (GFE), and over and above costs.  Funding may also be used to address Diminishing Manufacturing Sources (DMS) through studies and analysis, bridge buys, life-of-type buys, etc.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver C-5M weapon system capability.  The use of such program funds would be in addition to the civilian pay expenses budgeted in program element 0605831F."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "C-5M CNS\/ATM"
                                    },
                                    "Description": {
                                        "val": "C-5M CNS\/ATM program will install multiple aircraft avionic equipment pieces to enable the C-5M to meet multiple NSA encryption and international\/national airspace access mandates while mitigating diminishing manufacturing source issues."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.245"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "C-5M CNS\/ATM program will install multiple aircraft avionic equipment pieces to enable the C-5M to meet multiple NSA encryption and international\/national airspace access mandates while mitigating diminishing manufacturing source issues."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "No funding Requested"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF 05 Line Item C00500"
                                    },
                                    "Title": {
                                        "val": "C-5"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "20.483"
                                        },
                                        "CurrentYear": {
                                            "val": "32.386"
                                        },
                                        "BudgetYearOne": {
                                            "val": "33.877"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "33.877"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "14.911"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.661"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "109.318"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 06 Line Item 000999"
                                    },
                                    "Title": {
                                        "val": "Initial Spares"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.386"
                                        },
                                        "CurrentYear": {
                                            "val": "2.053"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.409"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.409"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "6.848"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 07 Line Item 000075"
                                    },
                                    "Title": {
                                        "val": "Other Production"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.585"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.304"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.304"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.655"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "17.544"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "CNS\/ATM program:  Engineering and Manufacturing Development (EMD) for incorporation of the ARC-210 Gen V radio, SATCOM replacement equipment, ADS-B Out, and IFF mode 5 into the C-5M began in Dec 2016. The acquisition strategy for this program will consider every opportunity to use commercial components to modernize the C-5M CNS\/ATM equipment to meet CY2020 mandates for global civil airspace access. The strategy is for the prime contractor, Lockheed Martin Aero (LMA), to procure CNS\/ATM equipment, develop software, test and integrate those components, and install on two (2) EMD aircraft.  The equipment integration will require RDT&E funding for commercial off-the-shelf and non-developmental item proofing."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CNS\/ATM hardware\/software design, development, integration, data management, technical data rights, systems engineering, program management, and spares"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin Aero"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Marietta, GA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "19.325"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "19.325"
                                                    },
                                                    "TargetValue": {
                                                        "val": "86.532"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CNS\/ATM Other Government Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFLCMC\/WLS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.318"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.318"
                                                    },
                                                    "TargetValue": {
                                                        "val": "4.078"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CNS\/ATM Training"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin Aero"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Marietta, GA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.300"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CNS\/ATM Peculiar Support Equipment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin Aero"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Marietta, GA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.018"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CNS\/ATM Trainers & Simulators"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.120"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.120"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.221"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CNS\/ATM System Test\/Qual\/SIL"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin Aero"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Marietta, GA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.024"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.024"
                                                    },
                                                    "TargetValue": {
                                                        "val": "8.662"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CNS\/ATM System Test - Government"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Edwards AFB"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "CA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.123"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.123"
                                                    },
                                                    "TargetValue": {
                                                        "val": "4.250"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Management Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CNS\/ATM Program Management Administration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFLCMC\/WLS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.189"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.189"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.949"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CNS\/ATM Travel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFLCMC\/WLS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.146"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.146"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.213"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "675359 \/ C-5M Communication, Navigation, Surveillance\/Air Traffic Management (CNS\/ATM)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Operational Test and Evaluation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Milestone C"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "CNS\/ATM will support completion of formal qualification testing, installation and functional check of hardware, design and development of aircrew and maintenance training system modification, and developmental test and evaluation."
                        }
                    }
                }
            ]
        }
    }
}