{
    "id": "2021-Army-PB-2040-JBOOK-8f7fdbb59cb85b132b0478715b87ff02c7eb359f73f79d73e48c9151ed5a28f2-1",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603002A"
        },
        "ProgramElementTitle": {
            "val": "Medical Advanced Technology"
        },
        "R1LineNumber": {
            "val": "44"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "94.575"
            },
            "CurrentYear": {
                "val": "83.030"
            },
            "BudgetYearOne": {
                "val": "38.896"
            },
            "BudgetYearOneBase": {
                "val": "38.896"
            },
            "BudgetYearTwo": {
                "val": "41.136"
            },
            "BudgetYearThree": {
                "val": "38.778"
            },
            "BudgetYearFour": {
                "val": "37.247"
            },
            "BudgetYearFive": {
                "val": "36.747"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "370.409"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures and demonstrates advanced medical technologies including drugs, vaccines, medical diagnostic devices, measures for identification and vector control, and developing medical practices and procedures to effectively protect and improve the survivability of United States Forces across the entire spectrum of military operations. Tri-Service coordination and cooperative efforts are focused in four principal medical areas: Combat Casualty Care, Military Operational Medicine, Militarily Relevant Infectious Diseases, and Clinical and Rehabilitative Medicine.  Starting in Fiscal Year 2020 (FY20), the principal area of Clinical and Rehabilitative Medicine is replaced with the area of Medical Assist Support Technologies.\n\nPromising medical technologies are refined and validated through extensive testing, which is conducted in compliance with Food and Drug Administration (FDA) regulations for human medical products, and environmental protection agency (EPA) regulations for insect-control products that impact humans or the environment (e.g., repellents and insecticides). The FDA requires medical products to undergo extensive preclinical testing in animals and\/or other models to obtain preliminary effectiveness and safety information before they can be tested in human clinical trials. Clinical trials are conducted stepwise: first to prove the product is safe in humans, second to demonstrate the desired effectiveness and optimal dosage (amount to be administered) in a small group human study, and third to demonstrate effectiveness in large, diverse human populations. Each successive phase includes larger numbers of human subjects and requires FDA cognizance prior to proceeding. Work conducted in this PE primarily focuses on late stages of technology maturation activities required to conduct safety and effectiveness clinical trials. Some high-risk technologies may require additional maturation with FDA guidance prior to initiating these clinical trials. Such things as proof of product stability and purity are necessary to meet FDA standards before entering later stages of testing and prior to transitioning into a formal acquisition program where large pivotal trials in diverse populations will be conducted for licensure. Activities in this PE may include completion of preclinical animal studies and small safety and effectiveness studies involving humans according to FDA and EPA requirements. Promising medical technologies that are not regulated by the FDA or EPA are modeled, prototyped, and tested in relevant environments.\n\nBlast research and research into maturing field rations in this PE are fully coordinated with the United States Army Combat Capabilities Development Command Soldier Center. This coordination enables improved body armor design and rations for Soldiers. Additionally, the activities funded in this PE are externally peer reviewed and fully coordinated with all Services as well as other agencies through the Joint Technology Coordinating Groups of the Armed Services Biomedical Research Evaluation and Management (ASBREM) Community of Interest (COI). The ASBREM COI, formed under the authority of the Assistant Secretary of Defense for Research and Engineering, serves to facilitate coordination and prevent unnecessary duplication of effort within the Department of Defense's biomedical research and development community, as well as its associated enabling research areas.\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) Science and Technology (S&T) focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by: the U.S. Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "101.442"
                },
                "CurrentYear": {
                    "val": "42.03"
                },
                "BudgetYearOne": {
                    "val": "47.041"
                },
                "BudgetYearOneBase": {
                    "val": "47.041"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "94.575"
                },
                "CurrentYear": {
                    "val": "83.03"
                },
                "BudgetYearOne": {
                    "val": "38.896"
                },
                "BudgetYearOneBase": {
                    "val": "38.896"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-6.867"
                },
                "CurrentYear": {
                    "val": "41"
                },
                "BudgetYearOne": {
                    "val": "-8.145"
                },
                "BudgetYearOneBase": {
                    "val": "-8.145"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "41"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.621"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-5.819"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.669"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-8.145"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-8.145"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funds reprogrammed out for higher priority Army requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "810"
                    },
                    "ProjectTitle": {
                        "val": "Ind Base Id Vacc&Drug"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.359"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "15.359"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to the following Projects within this Program Element (PE):\n*\tMM9 Tech Base\/Enabling Rsrch for Infect Dis Adv Tech\n*\tMN8 Drugs to Prevent and Treat Malaria Advanced Tech\n*\tMO9 Vaccines to Prevent Dengue Fever Advanced Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project maturates and demonstrates United States (U.S.) Food and Drug Administration (FDA)-regulated medical countermeasures such as drugs, vaccines, and diagnostic (identification of the nature and cause of a particular disease) systems to naturally occurring infectious diseases that are threats to deployed United States military forces. The focus of the Project is on prevention, diagnosis, and treatment of diseases that can adversely impact military mobilization, deployment, and operational effectiveness. Prior to licensure of a new drug or vaccine to treat or prevent disease, the FDA requires testing in human subjects. Studies are conducted stepwise: first to prove the product is safe in humans, second to demonstrate the desired effectiveness and optimal dosage (amount to be administered) in a small study, and third to demonstrate effectiveness in large, diverse human populations. All test results are submitted to the FDA for evaluation to ultimately obtain approval (licensure) for medical use. This Project supports the studies for safety and effectiveness testing on small study groups after which they transition to the next phase of development for completion of expanded safety and initial studies for effectiveness in larger populations. If success is achieved for a product in this Project, the effort will transition into Advanced Development. The Project also supports testing of personal protective measures that can reduce disease transmission from arthropods to include products such as repellents and insecticides, which are regulated by the Environmental Protection Agency (EPA).\n\nResearch conducted in this Project focuses on the following four areas:\n\n(1)\tPrevention\/Treatment of Parasitic (organism living in or on another organism) Diseases\n(2)\tBacterial Disease Threats (diseases caused by bacteria)\n(3)\tViral Disease Threats (diseases caused by viruses)\n(4)\tDiagnostic Systems and Vector Identification and Control\n\nResearch is conducted in compliance with FDA regulations for medical products for human use and EPA regulations for insect-control products that impact humans or the environment (e.g., repellents and insecticides).\n\nWork is managed by the U.S. Army Medical Research and Development Command (USAMRDC) in coordination with the Naval Medical Research Center (NMRC). The Army is responsible for programming and funding all Department of Defense (DoD) naturally occurring infectious disease research requirements, thereby precluding duplication of effort within the Military Departments.\n\nPromising medical countermeasures identified in this Project are further matured under PE 0603807A (Medical Systems - Adv Dev), Project 808 (DoD Drug & Vacc Ad).\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) Science and Technology (S&T) focus areas and the Army Modernization Strategy. All FY20 adjustments align program resources to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by USAMRDC at Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Technology Research on drugs and vaccines against parasitic diseases"
                                    },
                                    "Description": {
                                        "val": "This effort selects promising anti-parasitic drug candidates for treating malaria and leishmaniasis for testing in humans, and prepares data packages required for FDA approval of testing in humans. Studies have shown that the malaria parasite can become resistant to existing drugs, which makes it necessary to continually develop new and more effective and safe treatments. This effort selects candidate vaccines for various types of malaria, including the severe form of malaria (Plasmodium falciparum) and the less severe but relapsing form (Plasmodium vivax), prepares technical data packages required for FDA approval of testing in humans, and conducts testing of promising malaria vaccine candidates in humans. A malaria vaccine would minimize the progression and impact of drug resistance and eliminate the need to take preventive anti-malarial drugs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.01"
                                            },
                                            "Text": {
                                                "val": "Initiated safety and analytic studies to assess natural break-down of candidate drugs within the human body to improve drug safety and effectiveness for treatment and prevention of malaria for selected triazine lead compound.  Continued studies to understand mechanism of action for triazine lead class compounds. Completed studies to address potential Tafenoquine combination drug with triazine."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Bacterial Disease Threats"
                                    },
                                    "Description": {
                                        "val": "This effort selects promising candidate vaccines against each of the three main bacterial causes of diarrhea (enterotoxigenic E. coli (ETEC), Campylobacter, and Shigella) that pose significant threat during initial deployments, for testing in human subjects. Data packages are prepared, as required for FDA approval, and testing is conducted in human subjects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.635"
                                            },
                                            "Text": {
                                                "val": "Continued to develop and advance multiple vaccine candidates for Shigella, ETEC and Campylobacter. Prepared data packages for the FDA to test suitable vaccine candidates in humans for safety and effectiveness. Tested the vaccine candidates in human clinical trials for safety and effectiveness for Shigella, ETEC and Campylobacter."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Viral Disease Threats"
                                    },
                                    "Description": {
                                        "val": "This effort progresses the most promising vaccine candidates against dengue fever (a severe debilitating disease caused by a virus and transmitted by a mosquito) and hantavirus (severe viral infection that causes internal bleeding and is contracted from close contact with rodents), conducts FDA-required nonclinical safety and protection testing (laboratory- based) in animals, prepares FDA investigational new drug technical data packages, and conducts clinical testing of candidate vaccines in humans."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.169"
                                            },
                                            "Text": {
                                                "val": "Continued to evaluate safety and initial effectiveness of commercial partner dengue vaccine candidates undergoing testing in South East Asia and Latin America. Completed vaccine immunogenicity (ability to provoke an immune response) testing followed by dengue human infection model challenge and effectiveness testing of human subjects immunized with combination inactivated and weakened forms of virus vaccines. Engaged commercial partner to pursue development of purified inactivated dengue virus vaccine alone or in combination with live attenuated product. Pursued an expanded Hemorrhagic Fever with Renal Syndrome DNA vaccine clinical trial using the Pharmajet device for vaccine delivery. Tested for safety and immunogenicity of the HFRS DNA vaccine.  A below threshold reprogramming of $137.69K was reprogrammed from PE0603002ET5 to PE0602787810."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Diagnostics and Disease Transmission Control"
                                    },
                                    "Description": {
                                        "val": "This effort provides detailed, scientifically-driven entomological intelligence upon which Command can make informed decisions to maintain force readiness and best protect the deployed Warfighter, in charted and uncharted theatres on the global stage."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.545"
                                            },
                                            "Text": {
                                                "val": "Produced Vector Hazard Reports to inform decision makers of hazardous vector-borne pathogen threats in AORs."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "814"
                    },
                    "ProjectTitle": {
                        "val": "NEUROFIBROMATOSIS (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15"
                        },
                        "CurrentYear": {
                            "val": "15"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "30.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional increase for Neurofibromatosis Research Program."
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Neurofibromatosis research.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Peer-reviewed Neurofibromatosis Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "15"
                                        },
                                        "Text": {
                                            "val": "Peer-reviewed Neurofibromatosis Research"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "15"
                                        },
                                        "Text": {
                                            "val": "Peer-reviewed Neurofibromatosis Research"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "840"
                    },
                    "ProjectTitle": {
                        "val": "Combat Injury Mgmt"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.565"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "17.565"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned to:\nProgram Element (PE) 0603002A Medical Advanced Technology\n*     Project MM5 Tech Base\/Enabling Res Combat Cas Care Adv Tech\n*     Project MN3 Immediate Cardiopulmonary Stabilization Adv Tech\n*     Project MN4 Advanced Life Support Advanced Technology\n*     Project MN5 Next Generation Blood Products Advanced Technology\n*     Project MO2 Traumatic Brain Injury (TBI) Treatment Adv Tech\n*     Project MO4 Burn Recovery Optimization Advanced Technology\n*     Project MO7 Improved Bone Repair Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures, demonstrates, and validates promising medical technologies and new clinical practices for control of severe bleeding, treatment for traumatic brain injury (TBI), resuscitation and stabilization of trauma patients, acute treatment of extremity (arms and legs) and facial injuries, treatment of severe burn wounds, treatment of single and multiple organ failures due to trauma, and predictive indicators and decision aids for life support systems. Emphasis is placed on provision of prolonged field care when evacuation to theater hospitals is delayed.\n\nResearch conducted in this Project focuses on combat casualty care in the following four areas:\n\n(1)\tDamage Control Resuscitation\n(2)\tCombat Trauma Therapies\n(3)\tTraumatic Brain Injury\n(4)\tCombat Critical Care Engineering\n\nAll research is conducted in compliance with Food and Drug Administration (FDA) requirements for licensure of medical products for human use.\n\nPromising efforts identified through Applied Research conducted under PE 0602787A (Medical Advanced Technology), Project 874 (Medical Advanced Technology), are further matured under this Project. Promising results identified under this Project are further matured under PE 0603807A (Medical Systems Advanced Development), Project 836 (Field Medical Systems Advanced Development).\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy. All FY20 adjustments align program resources to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by: the United States Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Damage Control Resuscitation"
                                    },
                                    "Description": {
                                        "val": "This effort supports work required to validate safety and effectiveness of drugs and medical procedures to control or stop bleeding, maintain metabolism (the chemical processes that are required to maintain life), minimize harmful inflammation after major trauma preserving tissue function, and prevent or minimize secondary organ failure (including brain and spinal cord injury)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.093"
                                            },
                                            "Text": {
                                                "val": "Began clinical trial to demonstrate safety of cold-stored platelets in human subjects. Assessed current bleeding control products under prolonged care scenarios (i.e., when medical evacuation is delayed or prolonged). Performed preclinical studies to determine physiological effects of endovascular (refers to device that is directly introduced into a major blood vessel) bleeding control product use on subsequent fluid resuscitation effectiveness. Evaluated combinations of blood products and drugs to determine which optimally mitigates the effects of inflammation and prolonged ischemia (inadequate or absent blood supply) produced in critical tissues by traumatic bleeding. Continued evaluation of methods to refrigerate whole blood that do not impair platelet function."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Trauma Therapies"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on work required to validate safety and effectiveness of drugs, biologics, and medical procedures intended to minimize immediate and long-term effects from battlefield injuries."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.659"
                                            },
                                            "Text": {
                                                "val": "Assessed path of healing in animal burn wounds and measure time to wound closure for various degrees of burn wounds. Continued retrospective analyses to identify clinical determinants of long-term disability in casualties with musculoskeletal injuries. Continued animal studies to determine optimal concentration of a commonly used antiseptic solution for initial wash-out of dismounted complex battlefield injuries. Continued studies in animals to evaluate effectiveness of products to combat wound infection, inflammation and scarring of delayed wound healing. Evaluated novel pain relieving drugs for use in patients with severe burns. Investigated impact of blood transfusion on skin graft rejection in burn patients."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Traumatic Brain Injury (TBI)"
                                    },
                                    "Description": {
                                        "val": "This effort supports work required to validate safety and effectiveness of drugs, biologics, and medical procedures intended to minimize immediate and long-term effects from TBI."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.598"
                                            },
                                            "Text": {
                                                "val": "Validated novel biomarkers of TBI using human serum samples.  Evaluated novel neuroprotective therapeutics for severe penetrating brain trauma."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Critical Care Engineering"
                                    },
                                    "Description": {
                                        "val": "This effort supports development of diagnostic and therapeutic medical devices, algorithms, software, and data- processing systems for resuscitation, stabilization and life support, and development of improved critical care nursing practices. The aim is to improve care of severely injured or ill casualties during transport and in theater hospitals, and to develop and evaluate technologies to treat vital organ failure caused by traumatic injury."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.215"
                                            },
                                            "Text": {
                                                "val": "Conducted safety\/effectiveness studies of miniaturized extracorporeal life support system in trauma burn patients with lung injury. Conducted large animal studies of an automated type of endovascular balloon occlusion of the aorta (used for control of intra- abdominal bleeding) to determine its safety and ability to prevent organ failure. Developed a model to predict wound closure rate and time to full closure in burn patients."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "945"
                    },
                    "ProjectTitle": {
                        "val": "BREAST CANCER STAMP PROCEEDS"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.621"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "0.621"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This Project receives funds as proceeds from the sale of Breast Cancer Stamps."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project receives funds as proceeds from the sale of Breast Cancer Stamps."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Breast Cancer Stamp Proceeds"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.621"
                                        },
                                        "Text": {
                                            "val": "Breast Cancer Stamp Proceeds"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "97T"
                    },
                    "ProjectTitle": {
                        "val": "NEUROTOXIN EXPOSURE TREATMENT (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16"
                        },
                        "CurrentYear": {
                            "val": "16"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "32.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional increase for Peer-Reviewed Neurotoxin Exposure Treatment Parkinson's Research Program."
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Neurotoxin Exposure Treatment.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Peer-reviewed Neurotoxin Exposure Treatment Parkinson's Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "16"
                                        },
                                        "Text": {
                                            "val": "Peer-reviewed Neurotoxin Exposure Treatment Parkinson's Research"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "16"
                                        },
                                        "Text": {
                                            "val": "Peer-reviewed Neurotoxin Exposure Treatment Parkinson's Research"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ET5"
                    },
                    "ProjectTitle": {
                        "val": "Adv Tech Dev in Clinical & Rehabilitative Medicine"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.083"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "7.083"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This Project ends in FY 2019."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project supports basic research on experimental models that are developed to support in-depth trauma research studies. This Project includes studies to understand the healing of burned or traumatically injured tissues including eye, bone, nerve, skin, muscle, organs and composite tissues. Such efforts will minimize lost duty time and provide military medical capabilities for post-evacuation restorative and rehabilitative care.\n\nResearch conducted in this Project focuses on clinical and rehabilitative medicine.\n\nWork in this Project complements and is fully coordinated with Program Element (PE) 0602787A (Medical Technology).\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Clinical and Rehabilitative Medicine"
                                    },
                                    "Description": {
                                        "val": "This effort supports clinical studies to advance treatment and restoration strategies of traumatically-injured tissues, to include skin, nerve, bone and ocular (eye) tissue to ultimately restore function and appearance. Areas of interest for regenerative medicine include healing without scarring, repair of compartment syndrome (muscle and nerve damage following reduced blood flow caused by swelling), replacement skin, facial reconstruction and vision restoration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.083"
                                            },
                                            "Text": {
                                                "val": "Conducted advanced pre-clinical trials to ensure the safety and effectiveness of an ocular bandage designed to rescue vision post-injury. Continued pre-clinical investigation of engineered skin substitutes for regeneration of functional skin without scarring. Conducted pre-clinical trials of devices for repairing traumatic injury to craniofacial and extremity tissues. Evaluated candidate biological therapies and drugs for reduced need of immunosuppressive (inhibition of the immune response) therapies following hand and face transplants. Down-selected identified candidate technologies and biologics that create a wound environment more conducive to bone healing. A below threshold reprogramming of $137.69K was reprogrammed from PE0603002ET5 to PE0602787810."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MG4"
                    },
                    "ProjectTitle": {
                        "val": "Tech Base\/Enabling Res in Mil Occup Med Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "8.144"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "8.144"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20) this Project was realigned from:\nProgram Element (PE) 0603002A Medical Advanced Technology\n* Project MM3 Warfighter Medical Protection & Performance\n\nIn FY21 this Project is realigned to:\nPE 0603002A  Medical Advanced Technology\n* Project MN7 Musculoskeletal Injury Screening Tool Adv Tech\n* Project MN9 Far Forward Behavioral Health Care Advanced Tech\n* Project MO3 Military Occupational Fitness Standards Adv Tech\n* Project MO8 Expeditionary Performance Nutrition Advanced Techn\n* Project MP3 Phys Chem Toxicity Assessment Sys Adv Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "Medical efforts support laboratory studies and field demonstrations of biomedical products designed to counteract diverse environmental, physiological and psychological stressors, as well as reduce the impacts of hazards encountered in training and operational environments. Initiatives will demonstrate and transition medical technologies to support Soldier\/squad survivability under demanding operational tempo in order to protect, optimize and enhance Soldier performance and sustain lethality across the diverse range of military operations.\n\nThe four main thrust areas are:\n(1)\tPhysiological Health,\n(2)\tEnvironmental Protection,\n(3)\tInjury Prevention and Reduction,\n(4)\tPsychological (mental) Health and Resilience.\n\nThe cited work is fully coordinated with Combat Capabilities Development command Soldier Center and with other Services in order to avoid duplication of effort. \n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy. All FY 2020 adjustments align program resources to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by: the U.S. Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Injury Prevention & Reduction"
                                    },
                                    "Description": {
                                        "val": "This effort supports and validates injury prediction tools and return-to-duty assessments for brain, spine, and chest injury from blast, blunt, and ballistic impact. These are all priorities for Program Executive Office (PEO)-Soldier and support various Maneuver Center of Excellence programs including Soldier Protection Systems (e.g., Integrated Head Protection Systems and Vital Torso Protection Systems). This effort also addresses need for validated aeromedical standards and strategies to enable aircrew to effectively fight, navigate, and land under a range of degraded visual environments and provide aeromedical return to duty guidelines after neurosensory injury (deficits in the nervous system control of vision, hearing, taste, smell, and touch). This supports Cross Functional Team (CFT) Future Vertical Lift."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.822"
                                            },
                                            "Text": {
                                                "val": "Will continue to validate musculoskeletal injury risk models and return-to-duty criteria from data collected from training and theater. Will continue to validate cervical spine injury risk (Head Supported Mass Criteria) criteria that will inform acquisition of new head mounted technologies the Army CFTs are pursuing. Will validate health hazard and medical requirements that will inform Army Aviation fitness for duty and Future Vertical Lift requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project MG4 ends in FY20.  Funding under this effort is realigned to Project MN6 (Blast & Head Impact Exposure Monitor Advanced Tech) and Project MN7 (Musculoskeletal Injury Screening Tool Adv Tech) in All Settings."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physiological Health & Performance"
                                    },
                                    "Description": {
                                        "val": "This effort supports and matures laboratory prototypes, evaluates nutritional formulations and interventions, and validates decision aids for the prediction of Soldier performance in high operational tempo military environments."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.502"
                                            },
                                            "Text": {
                                                "val": "Will evaluate impact of sleep on high operational tempo military performance. Will demonstrate the impact of sleep deprivation and caffeine on operationally relevant complex cognitive processes. Will validate time-restricted spectral analyses of standard polysomnography to predict future behavior and estimate previous sleep quality and quantity. Will evaluate low-current brain stimulation as a cognitive enhancer during periods of sleep loss. Will evaluate psychophysiological indicators of aviator flight performance under workload conditions. Will mature evidence-based algorithmic modelling of aircrew clinical risk. Will evaluate effects of refractive\/corrective eye surgery and corneal aberration on contrast sensitivity and flight safety. Will validate dining satisfaction and quality surveys at military dining facilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project MG4 (Tech Base\/Enabling Res in Mil Occup Med Adv Tech) ends in FY20.  Funding under this effort is realigned to Project MO8 (Expeditionary Performance Nutrition Advanced Techn)n in all Settings."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health & Resilience"
                                    },
                                    "Description": {
                                        "val": "This effort supports and validates neurocognitive (relating to or involving the central nervous system and cognitive abilities) assessment and brain injury detection methods, and validates tools and preclinical methods to treat post-traumatic stress disorder in a military population. This effort also supports validation of interventions in Warfighters for PTSD, validation of biomarkers of individual PTSD symptoms, validation of methods to follow effectiveness of PTSD treatments, validation of neuroprotective (protection of nerves and nervous system) interventions and validation of strategies to prevent neurocognitive deficits (reduced ability to learn and comprehend) and symptomatology associated with brain injury. This effort matures and validates early interventions to prevent and reduce military stressor and combat-related behavioral health problems, including symptoms of PTSD, depression, anger problems, anxiety, substance abuse, suicide, and other health risk behaviors. This effort matures and validates tools and interventions to enhance and sustain psychological resilience throughout Soldiers' careers."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.773"
                                            },
                                            "Text": {
                                                "val": "Will deliver a decision-making support tool to guide management of suicide-related events in garrison. Will conduct suicide prevention studies to evaluate effectiveness of Internet-delivered brief interventions to improve Service member mental health during transition periods. Will conduct studies to validate easy-to-use evidence-based interventions to improve behavioral health in units by leveraging individual, team and leader-specific behaviors at platoon and company levels. Will evaluate optimally tailored resilience training paradigm incorporating different resiliency readiness profiles matched to tailored resilience training. Will conduct studies to validate cognitive bias modification tools to improve behavioral health and performance. Will conduct clinical field trial of a repurposed Food and Drug Administration (FDA) approved drug for treating sleep problems in a deployed setting. Will deliver biologically based biomarkers for onset of stress disorders and for resilience to stress disorders. Will fund clinical trials evaluating effectiveness of provider tool-kit for behavioral health return to duty (RTD) decision making and clinical trials for brief far-forward interventions for behavioral health problems and accompanying provider training in their use."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project MG4 (Tech Base\/Enabling Res in Mil Occup Med Adv Tech) ends in FY20.  Funding under this effort is realigned to Project MN9 (Far Forward Behavioral Health Care Advanced Tech) and Project MO3 (Military Occupational Fitness Standards Adv Tech)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Health & Protection"
                                    },
                                    "Description": {
                                        "val": "This effort supports and maturates non-invasive technologies, decision-aid tools, and models to enhance Soldier protection and sustainment across the operational spectrum. The aim is to provide the scientific basis for developing focused heating and cooling solutions to maintain fine motor dexterity, core temperature, and optimized physical and cognitive performance during cold-weather and hot-humid operations. This effort tests a computational algorithm for identifying latent hepatic, renal, and cardiac injury after toxic metal and\/or toxic industrial chemical exposure during training and operations. This effort tests models to predict likelihood of neurologic and\/or physical injury as a result of hazardous exposure(s) in the operational environment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.87"
                                            },
                                            "Text": {
                                                "val": "Will provide validated tools that sustain lethality and optimize performance to prevent injuries related to multi-environmental stressors. Will provide a capability to improve performance and thermal comfort in hot environments using cooling technology with skin temperature feedback control.  Will provide a capability to increase finger and toe temperatures to improve manual dexterity and performance in cold weather operations. Will provide a capability a measure of cognitive fatigue due to sustained, effortful cognitive activity (workload) from exposure to stress and environmental extremes. Will provide accurate signal detection of toxic environmental hazards and physiological algorithms to detect degraded performance post-chemical exposure. Will provide a capability for mission planning and the documenting of toxic chemical or hazardous material exposures. Will provide risk management criteria for Commanders\/leaders to make decisions in real-time regarding the severity of the exposure and the likelihood of clinical manifestation of a toxic exposure."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project MG4 (Tech Base\/Enabling Res in Mil Occup Med Adv Tech) ends in FY20.  Funding under this effort is realigned to Project MP3 (Phys Chem Toxicity Assessment Sys Adv Tech)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.177"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MM2"
                    },
                    "ProjectTitle": {
                        "val": "MEDICAL ADVANCE TECHNOLOGY INITIATIVES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8"
                        },
                        "CurrentYear": {
                            "val": "10"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "18.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional increase for Peer-reviewed military burn research."
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Medical Advanced Technology Initiatives.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Peer-reviewed Military Burn Research Program"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8"
                                        },
                                        "Text": {
                                            "val": "Peer-reviewed Military Burn Research Program"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Peer-reviewed Military Burn Research Program"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MM3"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Medical Protection & Performance"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.947"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "14.947"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned to:\nProgram Element (PE) 0603002A Medical Advanced Technology, Projects:\n*     MG4 Tech Base\/Enabling Res in Mil Occup Med Adv Tech\n*     MN6 Blast & Head Impact Exposure Monitor Advanced Tech\n*     MN7 Musculoskeletal Injury Screening Tool Adv Tech\n*     MN9 Far Forward Behavioral Health Care Advanced Tech\n*     MO3 Military Occupational Fitness Standards Adv Tech\n*     MO8 Expeditionary Performance Nutrition Advanced Techn\n*     MP3 Phys Chem Toxicity Assessment Sys Adv Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project supports the medical and survivability technology areas of the future force with laboratory validation studies and field demonstrations of biomedical products designed to protect, sustain, and enhance Soldier performance in the face of myriad environmental and physiological (human physical and biochemical functions) stressors and materiel hazards encountered in training and operational environments. This effort focuses on demonstrating and transitioning technologies as well as validated tools associated with biomechanical-based health risks, injury assessment and prediction, Soldier survivability, and performance during continuous operations. \n\nThe four main thrust areas are:\n(1) Physiological Health, \n(2) Environmental Protection, \n(3) Injury Prevention and Reduction \n(4) Psychological (mental) Health and Resilience.\n\nThis Project contains no duplication with any effort within the Military Departments and includes direct participation by other Services. The cited work is fully coordinated with Combat Capabilities Development Command Soldier Center.\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy. All FY 2020 adjustments align program resources to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by: the U.S. Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Physiological Health"
                                    },
                                    "Description": {
                                        "val": "This effort supports and matures laboratory prototypes, nutritional formulations and interventions, and decision aids for the validation of physiological status and prediction of Soldier performance in extreme environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.347"
                                            },
                                            "Text": {
                                                "val": "Evaluated interventions to mitigate sleep loss and fatigue and improve individual and team performance in operational settings, including multi-domain battle scenarios. Demonstrated effectiveness of transcranial electrical stimulation of the prefrontal cortex for enhancing learning through the consolidation of emotional memories. Evaluated the utility and effectiveness of transcranial direct current electrical stimulation technologies as neurocognitive interventions for the enhancement of the recuperative sleep and the development of operationally relevant sleep strategies. Validated dietary interventions for promoting satisfaction and healthy eating in dining facilities to ensure optimal health and performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Health & Protection"
                                    },
                                    "Description": {
                                        "val": "This effort supports and maturates non-invasive technologies, decision-aid tools, and models to enhance Soldier protection and sustainment across the operational spectrum. The aim is to provide the scientific basis for developing focused heating and cooling solutions to maintain fine motor dexterity, core temperature, and optimized physical and cognitive performance during cold-weather and hot-humid operations. This effort tests a computational algorithm for identifying latent hepatic, renal, and cardiac injury after toxic metal and\/or toxic industrial chemical exposure during training and operations. This effort tests models to predict likelihood of neurologic and\/or physical injury as a result of hazardous exposure(s) in the operational environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.093"
                                            },
                                            "Text": {
                                                "val": "Provided evidence-based practice recommendations for protecting health and performance against combined environmental threats. Developed enhanced next generation of predictive algorithms for incorporation into wearable sensor systems. Transitioned the Cold Weather Ensemble Decision Aid (CWEDA) to PEO Soldier and US Army Alaska, for assessing and comparing different clothing ensembles for predicting cold weather endurance. Validated prototype focused heating capability to improve manual dexterity for individuals in cold weather operations. Transitioned prototypes such as the Heat Strain Decision Application (HSDApp) to JPEO-Chemical Biological Defense, PEO Soldier, and Army Public Health Center. Evaluated modeling paradigms which identify population subgroups at increased risk of military operational exposure-related health responses. Developed and enhanced a next generation of health, readiness and performance predictive algorithms for incorporation into wearable sensors systems. Validated assessment technologies\/tools for physical and\/or neurological health outcomes in operational environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction"
                                    },
                                    "Description": {
                                        "val": "This effort supports and validates injury prediction tools and return-to-duty assessments for brain, spine, and chest injury from blast, blunt, and ballistic impact. This effort also addresses need for validated aeromedical standards and strategies to enable aircrew to effectively fight, navigate, and land under a range of degraded visual environments and provide aeromedical return to duty guidelines after neurosensory injury (deficits in the nervous system control of vision, hearing, taste, smell, and touch)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.591"
                                            },
                                            "Text": {
                                                "val": "Used human head impact\/blast and clinical diagnosis of mild traumatic brain injuries (mTBIs) within the training environment (e.g., airborne operations, combatives) to improve and validate mTBI prediction algorithms that can be used for the development of improved head protection systems. Validated musculoskeletal injury risk models with data collected from training and theatre. Determined cervical spine injury risk (Head Supported Mass Criteria) leveraging methods used by personal protective equipment developers to measure impact of clothing and equipment such as the Army's Load Effects Assessment Program (LEAP). Evaluated and extended current auditory injury risk models to include auditory nerve damage and began to evaluate with advanced animal models. Improved current guidance using results from computational models and animal studies for protective eyewear against blast threats that will inform the Authorized Protective Eyewear List (APEL). Validated medical requirements that will inform Army Aviation fitness for duty requirements"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health and Resilience"
                                    },
                                    "Description": {
                                        "val": "This effort supports and validates neurocognitive (relating to or involving the central nervous system and cognitive abilities) assessment and brain injury detection methods, and validates tools and preclinical methods to treat post-traumatic stress disorder in a military population. This effort also supports validation of interventions in Warfighters for post-traumatic stress disorder (PTSD), validation of biomarkers of individual PTSD symptoms, validation of methods to follow effectiveness of PTSD treatments, validation of neuroprotective (protection of nerves and nervous system) interventions and validation of strategies to prevent neurocognitive deficits (reduced ability to learn and comprehend) and symptomatology associated with brain injury."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.916"
                                            },
                                            "Text": {
                                                "val": "Refined the Unit Behavioral Health Needs Assessment tool with metrics from combat operations, non-combat operations, and garrison. Evaluated an evidence-based, team-level intervention that positively influences Soldier outcomes related to behavioral health, resilience, and unit readiness through the regulation of small-team dynamics (e.g., group effect). Evaluated effectiveness of experimental compounds for PTSD symptom alleviation. Continued characterizations of PTSD subtyping and collection of treatment associated blood specimens for development of precision medicine approaches to PTSD treatment. Transitioned assessment tools to providers to augment return-to-duty decisions. Transitioned to behavioral health providers a web-based model for dissemination of research findings addressing evidence-based PTSD treatments."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MM5"
                    },
                    "ProjectTitle": {
                        "val": "Tech Base\/Enabling Res Combat Cas Care Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "2.408"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.408"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20) this Project was realigned from:\nProgram Element (PE) 0603002A Medical Advanced Technology\n* Project 840 Combat Injury Mgmt\n\nIn FY21 this Project is realigned to:\nPE 0603002A Medical Advanced Technology\n* Project MN3 Immediate Cardiopulmonary Stabilization Adv Tech\n* Project MN4 Advanced Life Support Advanced Technology\n* Project MN5 Next Generation Blood Products Advanced Technology\n* Project MO2 Traumatic Brain Injury (TBI) Treatment Adv Tech\n* Project MO4 Burn Recovery Optimization Advanced Technology\n* Project MO7 Improved Bone Repair Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "Preclinical and early clinical development, demonstration, and transition of new combat casualty care technologies that save lives and minimize permanent injury following combat-related traumatic injuries. Focus is identifying more effective critical care technologies and clinical practice guidelines to treat severe bleeding, traumatic brain injury, burns and other combat related traumatic injuries.\n\nAll research is conducted in compliance with Food and Drug Administration (FDA) requirements for licensure of medical products for human use.\n\nPromising efforts identified through applied research conducted under PE 0602787A (Medical Technology) Project 874 (Cbt Casualty Care Tech) are further matured under this Project. Promising results identified under this Project are further matured under PE 0603807A (Medical Systems Advanced Development) Project 836 (Field Medical Systems Advanced Development).\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy. All FY20 adjustments align program resources to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by: the United States Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Combat Trauma Therapies"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on work required to validate safety and effectiveness of drugs, biologics, and medical procedures intended to minimize immediate and long-term effects from battlefield injuries."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.03"
                                            },
                                            "Text": {
                                                "val": "Will continue studies in animals to evaluate effectiveness of products to combat wound infection, inflammation and scarring of delayed wound healing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project MM5 (Tech Base\/Enabling Res Combat Cas Care Adv Tech) is eliminated in FY21; funds are realigned for programmatic clarity to Projects MN3 (Immediate Cardiopulmonary Stabilization Adv Tech), MN4 (Advanced Life Support Advanced Technology), MN5 (Next Generation Blood Products Advanced Technology), MO2 (Traumatic Brain Injury (TBI) Treatment Adv Tech), MO4 (Burn Recovery Optimization Advanced Technology) and MO7 (Improved Bone Repair Advanced Technology)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pre-Hospital Tactical Combat Casualty Care"
                                    },
                                    "Description": {
                                        "val": "This effort supports demonstration and validation of materiel and knowledge products to advance the level of care that can be provided given the tactical, environmental, and patient factors inherent in the prehospital combat setting. Successful translation of research to the field will augment combat medic capabilities, thereby reducing death and serious injury in the battlefield space where the majority of preventable casualty deaths occur."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.455"
                                            },
                                            "Text": {
                                                "val": "Will begin clinical testing of an automated system for assessing injury severity."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project MM5 is eliminated in FY20; funds are realigned for programmatic clarity to Projects MN3 Immediate Cardiopulmonary Stabilization Advanced Technology, MN4 Advanced Life Support Advanced Technology, MN5 Next Generation Blood Products Advanced Technology, MO2 Traumatic Brain Injury (TBI) Treatment Advanced Technology, MO4 Burn Recovery Optimization Advanced Technology and MO7 Improved Bone Repair Advanced Technology."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Traumatic Brain Injury"
                                    },
                                    "Description": {
                                        "val": "This effort supports work required to validate safety and effectiveness of drugs, biologics, and medical procedures intended to minimize immediate and long-term effects from TBI."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.835"
                                            },
                                            "Text": {
                                                "val": "Will evaluate alternative therapies that promote brain-remodeling and restoration of function following severe TBI."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project MM5 (Tech Base\/Enabling Res Combat Cas Care Adv Tech) is eliminated in FY21; funds are realigned for programmatic clarity to Projects MN3 (Immediate Cardiopulmonary Stabilization Adv Tech), MN4 (Advanced Life Support Advanced Technology), MN5 (Next Generation Blood Products Advanced Technology), MO2 (Traumatic Brain Injury (TBI) Treatment Adv Tech), MO4 (Burn Recovery Optimization Advanced Technology) and MO7 (Improved Bone Repair Advanced Technology)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.088"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MM7"
                    },
                    "ProjectTitle": {
                        "val": "Enabling Med Cap to Support Dispersed OPS Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "1.819"
                        },
                        "BudgetYearOne": {
                            "val": "3.024"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.024"
                        },
                        "BudgetYearTwo": {
                            "val": "3.881"
                        },
                        "BudgetYearThree": {
                            "val": "4.569"
                        },
                        "BudgetYearFour": {
                            "val": "5.152"
                        },
                        "BudgetYearFive": {
                            "val": "6.162"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "24.607"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project will support a task area to develop a tool capable of providing actionable treatment recommendations for \"non-expert\" providers (such as combat lifesavers and combat medics) operating in resource constrained environments. This tool will use machine learning and predictive analytic techniques to infer the patient's condition based on diverse sources of information (e.g. sensor data, medic observations, etc.) and provide recommendations based on established care guidelines.  It will mature and demonstrate a tele-monitored and remote-controlled medical module to support medical resupply and casualty evacuation. The medical module will be optimized to be self-contained and provide a \"roll-on, roll-off\" medical capability to future multi-purpose Unmanned Aerial Systems (UAS).\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Combat Evacuation Mission Module"
                                    },
                                    "Description": {
                                        "val": "Research, design and develop a tele-monitored and remote-controlled Combat Evacuation Mission Module to support medical resupply and casualty evacuation using future multi-purpose vertical takeoff and landing (VTOL) UAS. Provides a self-contained medical module capability adaptable to various future multi-purpose VTOL UAS."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.736"
                                            },
                                            "Text": {
                                                "val": "Will complete vehicle flight instrumentation of the first generation Combat Evacuation Mission Module prototype for calibration and check out in preparation for flight testing.  Will complete flight test plans, procure test components, and prepare the Medical Module for transport to the flight test facility.\n\nWill construct a full-sized mock-up of the second generation Combat Evacuation Mission Module, based on current Objective vehicle UAS design, using rapid-prototyping capabilities to begin the determination of equipment configurations, placements, implementations, and interface requirements.  Will medically-equip the mock-up second generation Mission Module using conceptual representations\/ prototypes of emerging systems for remotely operated, or semi-autonomous\/closed-loop patient monitoring, diagnostic, and intervention that would either support an attending medic during en route care or provide a remote en route care capability if there is no medic available to attend during transport."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding within this Project realigned to Medical Robotic and Autonomous Systems effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medical Robotic and Autonomous Systems"
                                    },
                                    "Description": {
                                        "val": "This Task now incorporates the previous Combat Evacuation Mission Module Task. Research, design and develop a tele-monitored and remote-controlled Combat Evacuation Mission Module to support medical resupply and casualty evacuation using future multi-purpose VTOL UAS. Provides a self-contained medical module capability adaptable to various future multi-purpose VTOL UAS. Research, design, and prototype an intelligent decision-support capability that can be operated on an Army or Navy provided End User Device (EUD), such as the NETT Warrior system, to assist medics with patient assessment, triage, treatment, and disposition in a Prolonged Field Care (PFC) environment by assessing patient conditions to provide adaptive care guidelines."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.024"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.024"
                                            },
                                            "Text": {
                                                "val": "Will validate conceptual designs and physical prototypes for a Multi-Mission Vehicle Interface (MMVI) system for both manned and unmanned air and ground platforms. This MMVI will consist of a common vehicle floor and rail system for rapid configuration of the cabin space and installation of both autonomous and attended en route care systems and innovative patient handling systems. Will optimize design of the MMVI, targeting integration with an Army Future Vertical Lift (FVL) prototype or technology demonstrator vehicle and conduct final integration and demonstration of MMVI prototype. Will demonstrate vehicle options that may include 1) a FVL prototype or technology demonstrator vehicle, 2) the ?optionally-manned? variant of the UH-72 Lakota, or 3) the Squad Multipurpose Equipment Transport (SMET) Unmanned Ground Vehicle (UGV). Based on the previous applied research, and in collaboration with US Army Aeromedical Research Laboratory (USAARL) and Combat Capabilities Development Command Aviation and Missile Center, will prototype and demonstrate a mission-based flight control interface system integrating with a relevant (optionally-manned FVL variant or similar) UAS flight control system. Will demonstrate a proof-of-concept prototype implementation of a rule-based Decision Support System (DSS) knowledge base using published Tactical Combat Casualty Care (TCCC) guidelines for one or more typical use cases. Will demonstrate clinical knowledge authoring and knowledge base development techniques. Based on previous applied research, will demonstrate sensor fusion, signal processing, and analysis on acquired patient data to understand the context of the data and provide inputs to the Decision Support System. Will integrate the DSS with prototype closed loop technologies such as the Navy?s Autonomous Critical Care System (ACCS)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase due to new MedRAS investments in the Clinical Decision Support System for Combat Medic."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.083"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MM9"
                    },
                    "ProjectTitle": {
                        "val": "Tech Base\/Enabling Rsrch for Infect Dis Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "2.976"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.976"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20) this Project was realigned from:\nProgram Element (PE) 0603002A Medical Advanced Technology\n* Project 810 Ind Base Id Vacc & Drug\n\nIn FY21 this Project was realigned to:\nPE 0603002A Medical Advanced Technology\n* Project MO9 Vaccines to Prevent Dengue Fever Advanced Tech\nPE 0602787A Medical Technology\n* Project MM8 Infectious Diseases and Applied Rsch Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "Technology development, demonstration, and transition of Food and Drug Administration (FDA) - regulated medical countermeasures such as drugs and vaccines to naturally-occurring infectious diseases of military importance, as identified by worldwide medical surveillance and capability needs assessments.\n\nResearch is conducted in compliance with FDA regulations for medical products for human use.  \n\nWork is managed by the United States Army Medical Research and Development Command (USAMRDC) in coordination with the Naval Medical Research Center (NMRC). The Army is responsible for programming and funding all Department of Defense (DoD) naturally occurring infectious disease research requirements, thereby precluding duplication of effort within the Military Departments.\n\nPromising medical countermeasures identified in this Project are further matured under PE 0603807A (Medical Systems Advanced Development) Project 808 (DoD Drug & Vacc Ad).\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy. All FY20 adjustments align program resources to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the USAMRDC, Fort Detrick, MD.\n\nEfforts in this Project support the Soldier portfolio and the principal area of Military Relevant Infectious Diseases."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Technology Research on drugs and vaccines against parasitic diseases"
                                    },
                                    "Description": {
                                        "val": "Test lead drug candidates in healthy volunteers to determine drug pharmacology, safety, and effectiveness against malaria. Transition the lead anti-malarial drug with improved safety, effectiveness and less frequent dosing to advanced development. Perform small studies in healthy volunteers to test vaccine safety, effectiveness and immunogenicity against malaria with down-selection and transition of the vaccines to advanced development."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.399"
                                            },
                                            "Text": {
                                                "val": "Will initiate safety and analytic studies to assess natural break-down of candidate drugs within the human body to improve drug safety and effectiveness for treatment and prevention of malaria for selected triazine lead compound. Will complete clinical trials to assess performance of lead Plasmodium falciparum malaria vaccine candidates. These activities enable down- selection of a lead vaccine for transition to advanced development. Will validate laboratory-based immune measures of protection and correlate with protective effectiveness among candidate vaccines undergoing clinical trials."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project MM9 (Tech Base\/Enabling Rsrch for Infect Dis Adv Tech) ends in FY20; funds are realigned to Project MO9 (Vaccines to Prevent Dengue Fever Advanced Tech) and to PE 0602787 (Medical Technology) Project MM8 (Infectious Diseases and Applied Rsch Technology)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Viral Disease Threats"
                                    },
                                    "Description": {
                                        "val": "Perform small studies in healthy volunteers to test vaccine safety, effectiveness, and immunogenicity against Dengue and Hantaviruses infections so as to down-select and transition lead vaccine candidates to advanced development."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.56"
                                            },
                                            "Text": {
                                                "val": "Will continue to evaluate safety and initial effectiveness of commercial partner dengue vaccine candidates undergoing testing in Southeast Asia and Latin America.  Will continue to complete vaccine immunogenicity (ability to provoke an immune response) testing followed by dengue human infection model challenge and effectiveness testing of human subjects immunized with combination inactivated and weakened forms of virus vaccines. Will continue to engage commercial partner to pursue development of purified inactivated dengue virus in combination with live attenuated product. Will continue to pursue an expanded Hemorrhagic Fever with Renal Syndrome (HFRS) Deoxyribonucleic acid (DNA) vaccine clinical trial in a country\/region that has endemic HFRS cases. Will continue to test for safety and effectiveness of the HFRS DNA vaccine."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project MM9 (Tech Base\/Enabling Rsrch for Infect Dis Adv Tech) ends in FY20; funds are realigned to Project MO9 (Vaccines to Prevent Dengue Fever Advanced Tech) and to PE 0602787 (Medical Technology) Project MM8 (Infectious Diseases and Applied Rsch Technology)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.017"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MN3"
                    },
                    "ProjectTitle": {
                        "val": "Immediate Cardiopulmonary Stabilization Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "1.903"
                        },
                        "BudgetYearOne": {
                            "val": "2.109"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.109"
                        },
                        "BudgetYearTwo": {
                            "val": "2.047"
                        },
                        "BudgetYearThree": {
                            "val": "2.183"
                        },
                        "BudgetYearFour": {
                            "val": "2.476"
                        },
                        "BudgetYearFive": {
                            "val": "2.476"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "13.194"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603002A Medical Advanced Technology\n*     Project 840 Combat Injury Mgmt"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project covers development, pre-clinical and early-clinical demonstration, and transition of technologies for immediate pre-hospital hemorrhage detection and control and airway management. These technologies facilitate autonomous intubation and airway management in combat casualties with obstructed airways. This Project also demonstrates advanced technologies for use in forward areas to detect and control non-compressible internal bleeding, and demonstration of pain-relieving drugs that are safe for use during bleeding.\n\nPromising efforts identified through Applied Research conducted under PE 0602787A (Medical Technology) Project MM4 (Cbt Casualty Care Applied Rsch Technology) are further matured under this Project. Promising results identified under this Project are further matured under PE 0603807A (Medical Systems Advanced Development) Project 836 (Field Medical Systems Advanced Development).\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy. All FY20 adjustments align program resources to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the United States Army Medical Research Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Immediate Cardiopulmonary Stabilization Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "Development, preclinical and early-clinical demonstration, and transition of technologies that facilitate autonomous intubation and airway management in combat casualties with obstructed airways, as well as advanced hemostatic bandage candidates that augment the patient's blood clotting system and new tourniquet technologies suitable for prolonged use."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.903"
                                            },
                                            "Text": {
                                                "val": "Will conduct preclinical and early clinical evaluation of devices indicated for use to facilitate autonomous intubation and airway management in combat casualties with obstructed airways, advanced hemostatic dressings that are effective independent of the patient's blood clotting system, as well as new tourniquet technologies having prolonged effectiveness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.109"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.109"
                                            },
                                            "Text": {
                                                "val": "Will perform preclinical demonstration and clinical validation of sensor technology to aid medics performing endotracheal intubation (placement of a flexible plastic tube into the windpipe to maintain an open airway) and airway management; validate currently available pain relieving drugs in an animal model of hemorrhage with orthopedic trauma; demonstrate preclinical and clinical minimally invasive interventional technologies for control of non-compressible truncal hemorrhage; clinically demonstrate new technology to detect hemorrhage in trauma casualties through computer analysis of standard vital signs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to additional funding allocated for validation \/ demonstration of new, minimally invasive, interventional treatments for non-compressible hemorrhage."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MN4"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Life Support Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "3.801"
                        },
                        "BudgetYearOne": {
                            "val": "3.685"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.685"
                        },
                        "BudgetYearTwo": {
                            "val": "4.838"
                        },
                        "BudgetYearThree": {
                            "val": "5.509"
                        },
                        "BudgetYearFour": {
                            "val": "5.915"
                        },
                        "BudgetYearFive": {
                            "val": "5.916"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "29.664"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603002A Medical Advanced Technology\n*\tProject 840 Combat Injury Mgmt"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project covers development, demonstration, and transition of technologies that enable advanced life support under prolonged care scenarios, including life-support devices that provide lung and kidney functions in casualties with severe injuries and devices and clinical guidelines for the prevention of irreversible organ damage resulting from prolonged lack of blood circulation.\n\nAll research is conducted in compliance with Food and Drug Administration (FDA) requirements for licensure of medical products for human use.\n\nPromising efforts identified through Applied Research conducted under PE 0602787A (Medical Technology) Project MM4 (Cbt Casualty Care Applied Rsch Technology) are further matured under this Project. Promising results identified under this Project are further matured under PE 0603807A (Medical Systems Advanced Development) Project 836 (Field Medical Systems Advanced Development).\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy. All FY20 adjustments align program resources to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the United States Army Medical Research Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Battlefield Sustainment of Critical Organ Function Capability Set 1"
                                    },
                                    "Description": {
                                        "val": "Develop, demonstrate and transition technologies that enable advanced life support under prolonged field care scenarios: life-support devices that provide lung and kidney functions in casualties with severe injuries, and devices and clinical guidelines for the prevention of irreversible organ damage resulting from prolonged lack of blood circulation."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.7"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate devices indicated for use to control oxygen and carbon dioxide exchange in casualties with acute lung injury, and\/or to deliver blood purification in critically injured\/ill casualties with acute kidney injury.  Will demonstrate improved means to control bleeding within the chest and abdomen through use of a specialized catheter that maintains normal blood pressure within the brain, heart and lungs and minimizes lack of blood flow to other organs and lower body until definitive surgical care is available."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.685"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.685"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate lead candidate anti-blood clotting technologies for coating of extracorporeal life support (ECLS) circuitry vs standard of care in advanced animal injury models; validate prototype ECLS technologies with and without mechanical ventilation in simulated forward environments under prolonged field care conditions; begin demonstration of ECLS in combination with non-compressible hemorrhage control technologies, and modular ECLS systems for cardiorespiratory, kidney, and liver support."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease is a result of level of effort required."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.101"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MN5"
                    },
                    "ProjectTitle": {
                        "val": "Next Generation Blood Products Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "5.964"
                        },
                        "BudgetYearOne": {
                            "val": "6.854"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.854"
                        },
                        "BudgetYearTwo": {
                            "val": "6.964"
                        },
                        "BudgetYearThree": {
                            "val": "7.292"
                        },
                        "BudgetYearFour": {
                            "val": "7.625"
                        },
                        "BudgetYearFive": {
                            "val": "7.627"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "42.326"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603002A Medical Advanced Technology\n*     Project 840 Combat Injury Mgmt"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project covers technology development, pre-clinical and early-clinical demonstration, and transition of new blood products with increased shelf life and functionality. Cold-stored platelets, fibrinogen replacement technologies, and pharmaceuticals that protect and metabolically stabilize blood-deprived tissues and reverse impaired blood clotting subsequent to severe injury, will improve prompt hemorrhage control, mitigate effects of shock, and minimize sustainment requirements.\n\nAll research is conducted in compliance with Food and Drug Administration (FDA) requirements for licensure of medical products for human use.\n\nPromising efforts identified through Applied Research conducted under PE 0602787A (Medical Technology) Project MM4 (Cbt Casualty Care Applied Rsch Technology) are further matured under this Project. Promising results identified under this Project are further matured under PE 0603807A (Medical Systems Advanced Development) Project 836 (Field Medical Systems Advanced Development).\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy. All FY20 adjustments align program resources to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the United States Army Medical Research Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Next Generation Human-Derived Blood Replacement"
                                    },
                                    "Description": {
                                        "val": "Develop, demonstrate in pre-clinical and early-clinical studies, and transition new blood products with increased shelf life and functionality. Cold-stored platelets and biopharmaceutical technologies that stop life threatening bleeding, stabilize tissue metabolism, mitigate shock and restore normal blood clotting will improve prompt hemorrhage control and minimize sustainment requirements."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.701"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate preclinical and early clinical technologies to optimize shelf life and functionality of cold stored platelets, and pharmacologic replacement of fibrinogen to assist early hemorrhage control."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.854"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.854"
                                            },
                                            "Text": {
                                                "val": "Will perform preclinical validation of hypotensive (lower than normal blood pressure) resuscitation parameters in militarily-relevant trauma; optimize and validate low volume resuscitation algorithms; validate therapeutic approaches to inform new clinical practices using synthetic and animal models of acute coagulopathy (impaired blood clotting ability) of trauma; demonstrate candidate drugs in animal hemorrhage models to identify potential candidates with optimal hemostatic (refers to an agent that stops bleeding) and metabolic stabilizing effects; validate candidate hemostatic devices to improve hemorrhage control and survival of bleeding casualties under prolonged field care scenarios and during states of inhibited blood clotting ability; conduct preclinical and clinical demonstration of blood clotting capability when platelets are stored under novel conditions to prolong shelf life."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to additional funds allocated for validation \/ demonstration of multiple maturing products scheduled to transition to advanced development."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.263"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MN6"
                    },
                    "ProjectTitle": {
                        "val": "Blast & Head Impact Exposure Monitor Advanced Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "1.412"
                        },
                        "BudgetYearOne": {
                            "val": "1.949"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.949"
                        },
                        "BudgetYearTwo": {
                            "val": "1.86"
                        },
                        "BudgetYearThree": {
                            "val": "0.749"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.970"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603002A Medical Advanced Technology\n*     Project MM3 Warfighter Medical Protection & Performance"
                        },
                        "ProjectMissionDescription": {
                            "val": "This effort will validate injury risk assessment\/guidance\/criteria that will inform the development of technologies (i.e., personal protection equipment, vehicles) and strategies (i.e., health hazard assessments) to protect the Soldier against current and emerging operational threats (i.e., blast, blunt, ballistic, and accelerative).\n\nThe cited work is fully coordinated with PE 0602143A (Soldier Lethality Technology) and complimentary to PE 0603118A (Soldier Lethality Advanced Technology) and is fully coordinated with other Services in order to avoid duplication of effort.\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy. All FY21 adjustments align program resources to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the United States Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Blast & Head Impact Exposure Monitor"
                                    },
                                    "Description": {
                                        "val": "This effort will develop a prototype predictive tool that can provide the unit leader an indication of whether a potential mild traumatic brain injury event has occurred. This capability will provide the unit leader an additional objective tool to determine whether a Soldier can be safely exposed to more impacts without increased risk of injury."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.348"
                                            },
                                            "Text": {
                                                "val": "Will support the Environmental Sensors in Training (ESiT) program. Will support additional sites for data collection in high risk exposure communities: blast (heavy weapons training, breaching) and head impact (airborne)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort ends and FY21 funding is aligned to the effort \"Injury Criteria for Informing the Development of New Tactical Headborne Systems\", within this Project"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Criteria for Informing the Development of New Tactical Head borne Systems."
                                    },
                                    "Description": {
                                        "val": "This effort validates injury risk assessment\/guidance\/criteria that will inform the development of technologies (i.e., personal protection equipment, vehicles) and strategies (i.e., health hazard assessments) to protect the Soldier against current and emerging operational threats (i.e., blast, blunt, ballistic, and accelerative)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.949"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.949"
                                            },
                                            "Text": {
                                                "val": "Will expand the collection of field measurements of blast exposure and head impact data from heavy weapons training, breaching, and airborne communities in order to validate a blast and head impact exposure monitoring algorithm for a next generation head protection system. Will refine and validate cervical neck injury criteria for next generation head borne and protection systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The \"Blast & Head Impact Exposure Monitor\" within this Project"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.064"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MN7"
                    },
                    "ProjectTitle": {
                        "val": "Musculoskeletal Injury Screening Tool Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0.3"
                        },
                        "BudgetYearOne": {
                            "val": "3.398"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.398"
                        },
                        "BudgetYearTwo": {
                            "val": "4.298"
                        },
                        "BudgetYearThree": {
                            "val": "1.149"
                        },
                        "BudgetYearFour": {
                            "val": "0.649"
                        },
                        "BudgetYearFive": {
                            "val": "0.749"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.543"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603002A Medical Advanced Technology\n*     Project MM3 Warfighter Medical Protection & Performance"
                        },
                        "ProjectMissionDescription": {
                            "val": "This capability will deliver validated leader and medical provider tools that can provide objective assessments of bone stress fracture to aid in determining whether a Soldier can return to duty after musculoskeletal injury and reduce the risk of re-injury.\n\nThe cited work is fully coordinated with PE 0602143A (Soldier Lethality Technology) and complimentary to PE 0603118A (Soldier Lethality Advanced Technology), and is fully coordinated with  the Army Training and Doctrine Command (TRADOC) and other Services in order to avoid duplication of effort.\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy. All FY21 adjustments align program resources to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the United States Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Musculoskeletal Injury Screening Tool"
                                    },
                                    "Description": {
                                        "val": "This capability will deliver a prototype unit leader tool that can provide an objective assessment of musculoskeletal tissue integrity and provide fitness or return-to-duty recommendations."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.286"
                                            },
                                            "Text": {
                                                "val": "Will develop objective medical assessments of Return-to-Duty. Will support data collection in support of Center for Initial Military Training TRADOC (CIMT) led effort."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding realigned to the Leader and Medical effort within this Project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Leader and Medical Provider Tools to Prevent and Reduce Musculoskeletal Injury in All Settings"
                                    },
                                    "Description": {
                                        "val": "This capability will deliver validated leader and medical provider tools that can provide objective assessments of bone stress fracture that can aid in determining whether a Soldier can return to duty after musculoskeletal injury and can reduce the risk of re-injury."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.398"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.398"
                                            },
                                            "Text": {
                                                "val": "Will complete primary data collection and processing of established biomarkers for stress fracture from 1,500 participants; will provide initial bone biomarker and microstructure data for transition to the Training and Doctrine Command?s U.S. Army Center for Initial Military Training (TRADOC\/USACIMT) to inform strategies for reducing injury risk."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding realigned from the Musculoskeletal Injury Screening Tool effort within this Project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.014"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MN8"
                    },
                    "ProjectTitle": {
                        "val": "Drugs to Prevent and Treat Malaria Advanced Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "2.146"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.146"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20) this Project was realigned from:\nProgram Element (PE) 0603002A Medical Advanced Technology\n* Project 810 Ind Base Id Vacc & Drug\n\nIn FY21 this Project is realigned to:\nPE 06002787A Medical Technology\n* Project MM8 Infectious Diseases and Applied Rsch Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project covers technology development, demonstration, and transition of a candidate malaria prevention drug with weekly or less frequent dosing. The candidate drug may also be effective for the treatment of P. falciparum and P. vivax malaria. Infectious disease prevention sustains individual and unit readiness and reduces health services requirements and cost. Research is conducted in compliance with Food and Drug Administration (FDA) regulations for medical products for human use.\n\nWork is managed by the United States (U.S.) Army Medical Research and Development Command (USAMRDC) in coordination with the Naval Medical Research Center (NMRC). The Army is responsible for programming and funding all Department of Defense (DoD) naturally occurring infectious disease research requirements, thereby precluding duplication of effort within the Military Departments.\n\nPromising medical countermeasures identified in this Project are further matured under PE 0603807A (Medical Systems Advanced Development), Project 808 (DoD Drug & Vacc Ad).\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy. All FY20 adjustments align program resources to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by: the United States Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD.\n\nEfforts in this Project support the Soldier portfolio and the principal area of Military Relevant Infectious Diseases."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Drugs to Prevent and Treat Malaria Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "Test drugs in healthy volunteers to determine drug pharmacology, safety, and effectiveness against malaria.  Transition current lead anti-malarial prophylactic drug (triazine) with improved safety, effectiveness, and requiring less frequent dosing to Program Manager for Pharmaceutical (PM Pharm) in support of future FDA licensure."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.048"
                                            },
                                            "Text": {
                                                "val": "Will complete clinical trial study data analysis then identify a single lead for use in humans. Will optimize lead formulation and test safety and toxicity in animals. Will initiate activities to perform a clinical trial in a small number of healthy human volunteers to test drug safety and effectiveness against P. falciparum malaria using controlled human malaria infection."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding realigned to PE 0602787A (Medical Technology) Project MM8 (Infectious Diseases and Applied Rsch Technology) to support next lead candidate studies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.098"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MN9"
                    },
                    "ProjectTitle": {
                        "val": "Far Forward Behavioral Health Care Advanced Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0.266"
                        },
                        "BudgetYearOne": {
                            "val": "1.121"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.121"
                        },
                        "BudgetYearTwo": {
                            "val": "1.029"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.416"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603002A Medical Advanced Technology\n*     Project MM3 Warfighter Medical Protection & Performance"
                        },
                        "ProjectMissionDescription": {
                            "val": "This effort will deliver a tested delivery system for behavioral health interventions oriented to far forward settings that will ensure the psychological readiness of Soldiers and safeguard their far forward readiness and performance in austere operating environments, under high intensity operational stressors.\n\nThe cited work is fully coordinated with PE 0602143A (Soldier Lethality Technology) and complimentary to PE 0603118A (Soldier Lethality Advanced Technology), and is fully coordinated with other Services in order to avoid duplication of effort.\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy. All FY21 adjustments align program resources to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the United States Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Optimal Delivery of Far Forward Behavioral Health Care"
                                    },
                                    "Description": {
                                        "val": "The effort will deliver improved psychological treatment interventions to keep Soldiers in the fight under high intensity operational stressors."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.254"
                                            },
                                            "Text": {
                                                "val": "The most promising brief psychotherapy interventions, self-administered computer apps, and treatment protocols for use with Service members deployed far forward will be identified and adapted and ready for initial clinical trials.  An Food and Drug Administration (FDA) - approved drug will also be under clinical trial evaluation for use to address Service member?s sleep problems in a far-forward setting for improved physical and psychological readiness and performance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort ends in FY20; funds are aligned to effort \"Far Forward Behavioral Health Care\" within this Project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Far Forward Behavioral Health Care"
                                    },
                                    "Description": {
                                        "val": "This effort will deliver a tested delivery system for behavioral health interventions oriented to far-forward settings that will ensure the psychological readiness of Soldiers and safeguard their far-forward readiness and performance in austere operating environments, under high intensity operational stressors."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.121"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.121"
                                            },
                                            "Text": {
                                                "val": "Will validate interventions and technologies that promote rapid recovery from acute stress and other behavioral health problems in far-forward settings immediately following a traumatic battlefield event; field test content and products to deliver behavioral health stabilization services oriented to far-forward settings; provide team-based training (Team CORE) to boost social connection and reduce individual isolation, a major risk factor in behavioral health; mature components for enhancing behavioral health leadership skills and deliver new training."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The effort \"Optimal Delivery of Far Forward Behavioral Health Care\" ends in FY20; all Project funds are aligned to this effort starting FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.012"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MO2"
                    },
                    "ProjectTitle": {
                        "val": "Traumatic Brain Injury (TBI) Treatment Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "4.285"
                        },
                        "BudgetYearOne": {
                            "val": "4.825"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.825"
                        },
                        "BudgetYearTwo": {
                            "val": "4.875"
                        },
                        "BudgetYearThree": {
                            "val": "4.626"
                        },
                        "BudgetYearFour": {
                            "val": "1.832"
                        },
                        "BudgetYearFive": {
                            "val": "1.832"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "22.275"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603002A Medical Advanced Technology\n*     Project 840 Combat Injury Mgmt"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project covers development, demonstration, and transition of technologies for acute battlefield management of brain trauma. Efforts include pre-clinical demonstration of drug therapy and resuscitation strategies for treatment of acute brain injury in the pre-hospital setting, biomarkers, diagnostics, and devices, as well as novel drug delivery technologies to facilitate administration of pharmaceuticals at or near the point of injury to protect the injured brain from further damage.\n\nAll research is conducted in compliance with Food and Drug Administration (FDA) requirements for licensure of medical products for human use.\n\nPromising efforts identified through Applied Research conducted under PE 0602787A (Medical Technology) Project MM4 (Cbt Casualty Care Applied Rsch Technology) are further matured under this Project. Promising results identified under this Project are further matured under PE 0603807A (Medical Systems Advanced Development) Project 836 (Field Medical Systems Advanced Development).\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Medical Research Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Drugs to Prevent and Treat Brain Injury (TBI)"
                                    },
                                    "Description": {
                                        "val": "Develop, demonstrate, and transition technologies to treat combat-related brain injury. Technologies include drugs administered at or near the point of injury to treat combat-related brain injury while also stabilizing and protecting non-injured brain tissues, and novel drug delivery platforms that specifically target injured brain cells."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.09"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate stem cell transplantation as a strategy to repair and regenerate the injured brain.  Will have preclinical demonstration of a device that provides selective cooling of the brain, to protect the brain and reduce mortality in severe TBI while preventing the secondary adverse effects associated with whole body cooling."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.825"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.825"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate pre-clinically neuroprotective and anti-inflammatory effects of drugs and biologics delivered directly to brain cells via targeting nanoparticles; validate pre-clinical and clinical pre-hospital administered drugs to stabilize the blood clotting system in injured brain tissue; demonstrate pre-clinically drugs for stabilizing metabolic function in injured brain tissue and preserving function of brain cells after injury."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to allocation of additional funds for validation \/ demonstration of new drugs and drug delivery platforms."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.195"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MO3"
                    },
                    "ProjectTitle": {
                        "val": "Military Occupational Fitness Standards Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0.25"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "1.05"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.300"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20) this Project was realigned from:\nProgram Element (PE) 0603002A Medical Advanced Technology\n* Project MM3 Warfighter Medical Protection & Performance\n\nIn FY21 this Project is realigned to:\nPE 0303002A Medical Advanced Technology\n* Project MN7 Musculoskeletal Injury Screening Tool Adv Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This capability will provide the unit leader a validated toolkit of operationally relevant physical fitness assessments that can supplement clinical criteria to determine whether a Soldier can return to duty after musculoskeletal injury without the risk of re-injury.\n\nThe cited work is fully coordinated with Combat Capabilities Development Command Soldier Center and with other Services in order to avoid duplication of effort.\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy. All FY20 adjustments align program resources to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the United Stated Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Military Occupational Fitness Standards"
                                    },
                                    "Description": {
                                        "val": "This capability will provide the unit leader a validated toolkit of operationally relevant physical fitness assessments that can supplement clinical criteria to determine whether a Soldier can return to duty after musculoskeletal injury without the risk of re-injury."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.239"
                                            },
                                            "Text": {
                                                "val": "Will validate physical fitness standards and Return-to-Duty strategies, including the validation of Return-to-Duty during basic combat training."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding realigned to Project MN7 (Musculoskeletal Injury Screening Tool Adv Tech)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.011"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MO4"
                    },
                    "ProjectTitle": {
                        "val": "Burn Recovery Optimization Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "2.084"
                        },
                        "BudgetYearOne": {
                            "val": "3.405"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.405"
                        },
                        "BudgetYearTwo": {
                            "val": "2.438"
                        },
                        "BudgetYearThree": {
                            "val": "2.714"
                        },
                        "BudgetYearFour": {
                            "val": "3.082"
                        },
                        "BudgetYearFive": {
                            "val": "3.083"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "16.806"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603002A Medical Advanced Technology\n*     Project 840 Combat Injury Mgmt"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project covers technology development, demonstration, and transition of burn recovery optimization technologies, including diagnostic technology to predict skin graft success or failure, technologies to measure and predict burn wound healing rate and assess burn treatment effectiveness, and novel dressings that protect severe burn wounds from further injury and prevent inflammation and infection until definitive surgical burn care is available.\n\nAll research is conducted in compliance with Food and Drug Administration (FDA) requirements for licensure of medical products for human use.\n\nPromising efforts identified through Applied Research conducted under PE 0602787A (Medical Technology) Project MM4 (Cbt Casualty Care Applied Rsch Technology) are further matured under this Project. Promising results identified under this Project are further matured under PE 0603807A (Medical Systems Advanced Development), Project 836 (Field Medical Systems Advanced Development).\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy. All FY20 adjustments align program resources to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the United States Army Medical Research Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Rapid Burn Injury Treatment and Return to Duty Capability Set 1"
                                    },
                                    "Description": {
                                        "val": "Develop, demonstrate, and transition burn recovery optimization technologies. These include diagnostic technology to predict skin graft success or failure, and advanced dressings that contain anti-infective and anti-inflammatory agents for prehospital use to protect severe burn wounds from further injury, infection and inflammation for prolonged periods until definitive surgical wound care is provided."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.04"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate biomarkers to identify skin graft success or failure, and to identify which patients are at heightened risk for scarring.  Will develop and demonstrate treatments using mesenchymal stem cells (these are human cells that can, under the right conditions, transform into multiple cell types having ability to repair damaged tissue) to decrease inflammation and limit systemic organ injury following severe burn injury."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.405"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.405"
                                            },
                                            "Text": {
                                                "val": "Will provide initial development of burn wound healing indices and predictive models by initiating a preclinical severe burn animal model study; demonstrate anti-infective, protective bandage for severe burn wounds in an animal model of delayed surgical burn care as would be experienced under prolonged field care conditions; validate nitric oxide-releasing wound dressing in an animal model of infected deep partial thickness burn. As part of continuing work on burn wound biomarkers, will provide a large animal burn model in which to test burn treatments and grafting."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase to allocation of additional funding for validation \/ demonstration of multiple maturing products scheduled to transition to advanced development."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.044"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MO7"
                    },
                    "ProjectTitle": {
                        "val": "Improved Bone Repair Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "1.539"
                        },
                        "BudgetYearOne": {
                            "val": "1.623"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.623"
                        },
                        "BudgetYearTwo": {
                            "val": "1.519"
                        },
                        "BudgetYearThree": {
                            "val": "1.666"
                        },
                        "BudgetYearFour": {
                            "val": "2.033"
                        },
                        "BudgetYearFive": {
                            "val": "2.033"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.413"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from: Program Element (PE) 0603002A (Medical Advanced Technology)\n*Project 840 Combat Injury Mgmt"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures, demonstrates, and validates promising medical technologies and new clinical practices to improve outcomes following severe limb injuries involving complex bone fractures and injured surrounding soft tissues.\n\nAll research is conducted in compliance with Food and Drug Administration (FDA) requirements for licensure of medical products for human use.\n\nPromising efforts identified through Applied Research conducted under PE 0602787A (Medical Technology), Project 874 (Cbt Casualty Care Tech), are further matured under this Project. Promising results identified under this Project are further matured under PE 0603807A (Medical Systems Advanced Development), Project 836 (Field Medical Systems Advanced Development).\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy. All FY20 adjustments align program resources to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the United States Army Medical Research Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Limb Function Repair and Return to Combat Duty & Field Stabilization on Bone in Preparation for Evac"
                                    },
                                    "Description": {
                                        "val": "Development, demonstration, and transition of technologies that improve outcomes, mobility and return to duty following severe limb injuries involving complex bone fractures and injured soft tissues."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.469"
                                            },
                                            "Text": {
                                                "val": "Will develop technologies to repair deleterious complications that prevent bone union and healing in severe extremity fractures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.623"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.623"
                                            },
                                            "Text": {
                                                "val": "Will provide retrospective epidemiological analysis of extremity compartment syndrome (condition characterized by increased pressure within a confined space, such as a muscle compartment, resulting in reduced blood flow, pain, and, if untreated, tissue death and functional impairment) to identify means to improve monitoring, assessment, and diagnosis of casualties at risk for developing extremity compartment syndrome; validate candidate anti-infective agents in animal infected open fracture model under prolonged field care conditions; demonstrate preclinical efficacy of candidate drugs for restoring normal immune response to injury in order to promote normal healing in severe extremity fractures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Additional funds allocated for validation \/ demonstration of extremity compartment syndrome diagnostic and monitoring technologies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.07"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MO8"
                    },
                    "ProjectTitle": {
                        "val": "Expeditionary Performance Nutrition Advanced Techn"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0.2"
                        },
                        "BudgetYearOne": {
                            "val": "2.141"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.141"
                        },
                        "BudgetYearTwo": {
                            "val": "2.275"
                        },
                        "BudgetYearThree": {
                            "val": "2.361"
                        },
                        "BudgetYearFour": {
                            "val": "1.907"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "8.884"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from: Program Element (PE) 0603002A (Medical Advanced Technology)\n*Project MM3 Warfighter Medical Protection & Performance"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project covers the development of strategies and interventions to support sustainment of Soldier readiness and performance in the complex operating environment. These include demonstration and maturation of nutritionally-optimized food products prototypes that allow Soldiers to eat-on-the-go with minimal logistical footprint while ensuring maximal physiological and cognitive performance and interventions to sustain Soldier alertness and performance in all settings.\n\nThe cited work is fully coordinated with PE 0602143A (Soldier Lethality Technology) and complimentary to PE 0603118A (Soldier Lethality Advanced Technology), and  is fully coordinated with other Services in order to avoid duplication of effort.\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy. All FY20 adjustments align program resources to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the United States Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Performance Nutrition for an Expeditionary Force"
                                    },
                                    "Description": {
                                        "val": "Development of nutritionally-optimized food products prototypes that will allow Soldiers to eat-on-the-go with minimal logistical footprint while ensuring maximal physiological and cognitive performance."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.191"
                                            },
                                            "Text": {
                                                "val": "Will evaluate and provide components of food prototypes that are nutritionally optimized for cognitive and physical performance, configured for eating-on-the-go and compatible with multiple ration platforms (e.g., Meal-Ready-to-Eat [MRE], First Strike Ration [FSR]), tailorable for mission requirements, e.g., high\/low physical or cognitive demand, formulated to enhance immune function and promote readiness and lighter weight with reduced logistical footprint."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Medical Strategies to Sustain Soldier Alertness and Performance in All Settings."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medical Strategies to Sustain Soldier Alertness and Performance in All Settings"
                                    },
                                    "Description": {
                                        "val": "Development of nutritionally-optimized food products prototypes that will allow Soldiers to eat-on-the-go with minimal logistical footprint while ensuring maximal physiological and cognitive performance."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.141"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.141"
                                            },
                                            "Text": {
                                                "val": "Will validate interventions to mitigate sleep loss and fatigue and improve individual and team performance in operational settings, including multi-domain battle scenarios; demonstrate the utility and effectiveness of electrical stimulation technologies that provide direct current to the brain as neurocognitive interventions for the enhancement of recuperative sleep and the development of operationally relevant sleep strategies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding realigned from Project MO8 (Expeditionary Performance Nutrition Advanced Techn)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.009"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MO9"
                    },
                    "ProjectTitle": {
                        "val": "Vaccines to Prevent Dengue Fever Advanced Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "2.533"
                        },
                        "BudgetYearOne": {
                            "val": "2.074"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.074"
                        },
                        "BudgetYearTwo": {
                            "val": "2.357"
                        },
                        "BudgetYearThree": {
                            "val": "4.025"
                        },
                        "BudgetYearFour": {
                            "val": "4.701"
                        },
                        "BudgetYearFive": {
                            "val": "4.701"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "20.391"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from: Program Element (PE) 0603002A (Medical Advanced Technology)\n*Project 810 Ind Base Id Vacc & Drug"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project covers technology development, demonstration and transition of a candidate vaccine for the prevention of Dengue fever caused by any of the four Dengue virus serotypes. The vaccine is intended to be effective in people with and without a prior history of Dengue infection.  Research is conducted in compliance with FDA regulations for medical products for human use.\n\nPromising medical countermeasures identified in this Project are further matured under Program Element 0603807A (Medical Systems Advanced Development), Project 808 (DoD Drug & Vacc Ad).\n\nThe cited work is consistent with the Under Secretary of Defense (Research and Engineering) science and technology focus areas and the Army Modernization Strategy. All FY20 adjustments align program resources to Army Modernization Priorities in support of the National Defense Strategy.  \n\nWork is managed by the United States Army Medical Research and Development Command (USAMRDC) in coordination with the Naval Medical Research Center (NMRC). The Army is responsible for programming and funding all Department of Defense (DoD) naturally occurring infectious disease research requirements, thereby precluding duplication of effort within the Military Departments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Vaccines to Prevent Dengue Fever Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "Perform Good Manufacturing Practice (GMP) manufacture of Dengue vaccine candidate.  Demonstrate Dengue vaccine candidate safety, effectiveness, and pharmacokinetics in humans. Transition the Dengue vaccine candidate to product developer."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.467"
                                            },
                                            "Text": {
                                                "val": "Will perform clinical trial where optimized vaccine regimen is tested for safety and immunogenicity in humans.  Will perform clinical trial to test for additional safety, immunogenicity and effectiveness against a Dengue challenge model against Dengue serotypes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.074"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.074"
                                            },
                                            "Text": {
                                                "val": "Will continue clinical trial to determine safety and immune response in humans of the optimized vaccine regimen; continue Dengue fever controlled human infection model clinical trial to determine additional safety, appropriate immune response, and effectiveness against all Dengue strains."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease in funding reflecting level of effort required."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.066"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MP3"
                    },
                    "ProjectTitle": {
                        "val": "Phys Chem Toxicity Assessment Sys Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "2.688"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.688"
                        },
                        "BudgetYearTwo": {
                            "val": "2.755"
                        },
                        "BudgetYearThree": {
                            "val": "1.935"
                        },
                        "BudgetYearFour": {
                            "val": "1.875"
                        },
                        "BudgetYearFive": {
                            "val": "1.118"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.371"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This is a new start in FY2021.\n\nThis Project is a New Start for Fiscal Year 2021 (FY21)."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project covers the development of products and solutions that will protect Soldiers from current and emerging environmental threats, ensuring a medically ready, fighting force to conduct semi-independent operations in complex and potentially hazardous environments.  This effort supports and matures non-invasive technologies, decision-aid tools, and models to enhance Soldier protection and sustainment across the operational spectrum. The aim is to provide the scientific basis to prevent Soldier performance degradation from current and emerging environmental threats through countermeasures to ensure greater than 90% medical readiness and to predict unit-level illness\/injury risks from environmental exposures, enabling leaders to implement control measures in the training environment and\/or during operations to maintain health, fitness & readiness.\n\nThis Project contains no duplication with any effort within the Military Departments and includes direct participation by other Services. The cited work is fully coordinated with PE 0602143A (Soldier Lethality Technology) and complimentary to PE 0603118A (Soldier Lethality Advanced Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Medical Research and Development Command (USAMRDC), Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Solutions to Sustain Warfighter Performance in Extreme Environments"
                                    },
                                    "Description": {
                                        "val": "The validation of host response signatures of performance decrements to exposure to toxic environmental hazards will provide physiologically based algorithms that predict and detect organ and system toxicity post-exposure.  This enables the creation of a risk management tool allowing Commanders to make informed decisions in real-time regarding the risk of exposure to toxic industrial chemicals and materials. The p-Product will ensure sustained Soldier physiological and cognitive performance and improved capacity to be lethal under environmentally challenging operational conditions, such as dense urban environments and subterranean spaces."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.688"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.688"
                                            },
                                            "Text": {
                                                "val": "Will provide validated tools that sustain lethality and optimize performance to prevent injuries related to multi-environmental stressors; provide scientific-based evidence of the impact of these stressors on medical readiness by leveraging commercial and emerging technologies for knowledge and materiel solutions that optimize physiological and cognitive performance across the spectrum of multi-domain operations; provide predictive models to prevent injury and illness, validated physiological sensor systems, and assessment tools to optimize performance and improve lethality; demonstrate a capability for improved performance and thermal comfort in hot environments using cooling technology with skin temperature feedback control; demonstrate a capability to increase finger and toe temperatures for improved manual dexterity and performance in cold weather operations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Project is a New Start for FY21."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}