{
    "id": "2021-DefenseInformationSystemsAgency-PB-0400-MJBOOK-0-3-7785e498f08da31904e836881ba7711c1e6b2127a147e20d7386b2865869377d-4",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-VOL5_ALL-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Defense Information Systems Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0903235K"
        },
        "ProgramElementTitle": {
            "val": "Joint Service Provider"
        },
        "R1LineNumber": {
            "val": "197"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Information Systems Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "4.309"
            },
            "PriorYear": {
                "val": "4.884"
            },
            "CurrentYear": {
                "val": "3.090"
            },
            "BudgetYearOne": {
                "val": "3.138"
            },
            "BudgetYearOneBase": {
                "val": "3.138"
            },
            "BudgetYearTwo": {
                "val": "2.992"
            },
            "BudgetYearThree": {
                "val": "2.989"
            },
            "BudgetYearFour": {
                "val": "3.007"
            },
            "BudgetYearFive": {
                "val": "3.070"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Service Provider (JSP) provides Information Technology (IT) infrastructure and office automation systems, components, supporting software, and IT support services for the Office of the Secretary of Defense (OSD), Joint Staff, Headquarters Department of the Army (HQDA), Washington Headquarters Services (WHS), Pentagon Force Protection Agency (PFPA), DoD Consolidated Adjudication Facility (DoD CAF), and other JSP-supported 4th Estate users and communities supported within the Pentagon Reservation and other areas in the National Capitol Region (NCR).  RDT&E provides for the test, pilot, and development of new integrated business tools to enhance the JSP business processes and improve the delivery of IT services and capabilities.  This activity executes JSP’s testing environment to allow insertion of commercial off-the-shelf and government-managed software for all supported JSP services to include network transport, storage, compute, defensive cyber operations, Pentagon Installation Processing Node (IPN), and other components of the NCR's core network infrastructure.  These efforts also provide mobile classified computing and communications platforms technology test and development for the immediate Office of the Secretary of Defense, enabling secured computing at residence, temporary and mobile locations around the world."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.104"
                },
                "CurrentYear": {
                    "val": "3.090"
                },
                "BudgetYearOne": {
                    "val": "3.140"
                },
                "BudgetYearOneBase": {
                    "val": "3.140"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.884"
                },
                "CurrentYear": {
                    "val": "3.090"
                },
                "BudgetYearOne": {
                    "val": "3.138"
                },
                "BudgetYearOneBase": {
                    "val": "3.138"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.220"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.002"
                },
                "BudgetYearOneBase": {
                    "val": "-0.002"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.034"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.186"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "General Reductions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.002"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.002"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease of -$0.186 in FY 2019 is due to the transfer to Small Business Innovation Research (SBIR) and Small Business Technology Transfer (STTR) programs and -$0.034 decrease in contract support.\n\nDecrease of -$0.002 in FY 2021 is due to reduction in technical contract support."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "JSP"
                    },
                    "ProjectTitle": {
                        "val": "Joint Service Provider"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "4.309"
                        },
                        "PriorYear": {
                            "val": "4.884"
                        },
                        "CurrentYear": {
                            "val": "3.090"
                        },
                        "BudgetYearOne": {
                            "val": "3.138"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.138"
                        },
                        "BudgetYearTwo": {
                            "val": "2.992"
                        },
                        "BudgetYearThree": {
                            "val": "2.989"
                        },
                        "BudgetYearFour": {
                            "val": "3.007"
                        },
                        "BudgetYearFive": {
                            "val": "3.070"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Joint Service Provider (JSP) provides mobile classified computing and communications platforms technology test and development for the immediate Office of the Secretary of Defense, enabling secured computing at residence, temporary and mobile locations around the world."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Pentagon\/National Captiol Region (NCR) Core Enterprise Services"
                                    },
                                    "Description": {
                                        "val": "Provides development, test, and pre-deployment for JSP-supported services to include network transport, network security, computer network defense, intrusion detection, Pentagon Installation Processing Node (IPN), and other components of the Pentagon's core network infrastructure."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.166"
                                            },
                                            "Text": {
                                                "val": "Develop, test, and  pre-deploy JSP-supported services to include network transport, network security, computer network defense, intrusion detection, Pentagon Installation Processing Node (IPN), and other components of the Pentagon's core network infrastructure."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SECDEF Communications"
                                    },
                                    "Description": {
                                        "val": "Provides mobile classified computing and communications platforms technology test and development for the immediate Office of the Secretary of Defense, enabling secured computing at residence, temporary and mobile locations around the world."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.103"
                                            },
                                            "Text": {
                                                "val": "To develop better mobile classified computing and communications platforms for all customers to have secure computing at residences and temporary and mobile locations around the world."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.105"
                                            },
                                            "Text": {
                                                "val": "Provide mobile classified computing and communications platforms technology test and development for the immediate Office of the Secretary of Defense, enabling secured computing at residence, temporary and mobile locations around the world."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.107"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.107"
                                            },
                                            "Text": {
                                                "val": "Continue to provide mobile classified computing and communications platforms technology test and development for the immediate Office of the Secretary of Defense, enabling secured computing at residence, temporary and mobile locations around the world."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase of +$0.002 from FY 2020 to FY 2021 is attributed to an increase to the Federally Funded Research and Development Center (FFRDC) MITRE\/Johns Hopkins University Applied Physics Laboratory (JHU APL) contract support."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Business Solutions - Enterprise Services"
                                    },
                                    "Description": {
                                        "val": "Provides development, testing, piloting, and pre-deployment support for integrated business tools that will enhance JSP-supported enterprise mission application environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.615"
                                            },
                                            "Text": {
                                                "val": "Develop and test tools that will improve the delivery of IT services and capabilities for all JSP users.  JSP will continue to expand the engineering, testing, and development networks for NIPR and SIPR."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enterprise Initiative Test & Development"
                                    },
                                    "Description": {
                                        "val": "This activity executes JSP's testing environment to allow insertion of commercial off the shelf and government managed software for all supported JSP services to include network transport, storage, compute, defensive cyber operations, Pentagon Installation Processing Node (IPN), and other components of the NCR’s core network infrastructure.  This effort allows informed investment in cyber defense, resilience, and the continued integration of cyber capabilities into the full spectrum of military operational needs required by the JSP supported user base and prioritize developing capabilities enabling a more resilient and survivable Department of Defense Information Network (DODIN) in the face of a dynamic and increasingly sophisticated threat environment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.985"
                                            },
                                            "Text": {
                                                "val": "Develop, pilot, and test integrated capabilities and solutions to support the operational requirements of the JSP user base. Supports such efforts as adaptive security architecture, threat intelligence machine learning, runtime application self protection and Desktop as a Service.  Improve delivery of IT services and capabilities of an increasingly mobile, application centric knowledge workforce JSP supports in a dynamic environment with advanced persistent cyber threats targeting DoD information networks (DODIN)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.031"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.031"
                                            },
                                            "Text": {
                                                "val": "Develop, pilot, and test integrated capabilities and solutions to support the operational requirements of the JSP user base. Supports such efforts as adaptive security architecture, threat intelligence machine learning, runtime application self protection and Desktop as a Service.  Improve delivery of IT services and capabilities of an increasingly mobile, application centric knowledge workforce JSP supports in a dynamic environment with advanced persistent cyber threats targeting DoD information networks (DODIN)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase of +$0.046 from FY 2020 to FY 2021 is attributed to increased costs for FFRDC MITRE\/JHU APL contract support."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}