{
    "id": "2021-Army-PB-2040-JBOOK-2ce7b76ca8f41dbc06183380f90728d4a8e40b9122c9effab5b4a02fdffb364e-9",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605606A"
        },
        "ProgramElementTitle": {
            "val": "Aircraft Certification"
        },
        "R1LineNumber": {
            "val": "195"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "3.796"
            },
            "CurrentYear": {
                "val": "3.461"
            },
            "BudgetYearOne": {
                "val": "2.736"
            },
            "BudgetYearOneBase": {
                "val": "2.736"
            },
            "BudgetYearTwo": {
                "val": "2.726"
            },
            "BudgetYearThree": {
                "val": "2.715"
            },
            "BudgetYearFour": {
                "val": "2.702"
            },
            "BudgetYearFive": {
                "val": "2.239"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Airworthiness Certification Program Element (PE) assures safe flight operation of Army aircraft and aviation systems by means of technical design approval and qualification of systems to appropriate airworthiness standards. This PE supports independent airworthiness qualification for all assigned developmental and in-production Army aircraft, both manned and unmanned, as required by Army Regulation (AR) 70-62 (\"Airworthiness of Aircraft Systems\"), and is essential for assuring the safe operation of Army aircraft. This PE performs engineering functions (design, analysis, testing, demonstrations, and system specification compliance) essential for certifying the airworthiness of nearly 20,000 assigned Army aircraft. This PE also supports: management\/execution of the Army's Aeronautical Design Standards (ADS) program; management\/execution of airworthiness approval for new systems and materiel changes for all assigned Army aircraft systems; airworthiness engineering support for major development\/modification and future systems\/ subsystems requirements of the Program Executive Officer for Aviation (PEO AVN) and U.S. Army Special Operations Command's Technology Applications Program Office (TAPO); and management of test and evaluation processes in support of the airworthiness qualification process. The Airworthiness Certification PE also performs general research and development in support of aircraft qualification and overarching airworthiness projects that involve multiple aircraft models, and supports the application of other critical aviation subsystems onto Army aircraft. \n\nThis PE also supports: airworthiness certification for military-use civil derivative aircraft technical qualification through the Federal Aviation Administration's Military Certification Office; development of airworthiness procedures, specifications, critical standards, and other design and qualification documents; participation in senior leadership mandated airworthiness tri-service activities (e.g., National Airworthiness Council) and international airworthiness related activities mandated by treaty (e.g., Flight Into Non-segregated Airspace (FINAS)); and early airworthiness involvement in Technology Transition projects such as the Future Attack Reconnaissance Aircraft, Future Long Range Assault Aircraft, Advanced Unmanned Aircraft Systems, Modular Open System Architecture, and other Office of the Secretary of Defense (OSD) initiatives."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "3.936"
                },
                "CurrentYear": {
                    "val": "3.461"
                },
                "BudgetYearOne": {
                    "val": "2.738"
                },
                "BudgetYearOneBase": {
                    "val": "2.738"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.796"
                },
                "CurrentYear": {
                    "val": "3.461"
                },
                "BudgetYearOne": {
                    "val": "2.736"
                },
                "BudgetYearOneBase": {
                    "val": "2.736"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.14"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-0.002"
                },
                "BudgetYearOneBase": {
                    "val": "-0.002"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.14"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.002"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.002"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "092"
                    },
                    "ProjectTitle": {
                        "val": "Aircraft Certification"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.796"
                        },
                        "CurrentYear": {
                            "val": "3.461"
                        },
                        "BudgetYearOne": {
                            "val": "2.736"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.736"
                        },
                        "BudgetYearTwo": {
                            "val": "2.726"
                        },
                        "BudgetYearThree": {
                            "val": "2.715"
                        },
                        "BudgetYearFour": {
                            "val": "2.702"
                        },
                        "BudgetYearFive": {
                            "val": "2.239"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Airworthiness Certification Project assures safe flight operation of Army aircraft and aviation systems by means of technical design approval and qualification of systems to appropriate airworthiness standards. This Project supports independent airworthiness qualification for all assigned developmental and in-production Army aircraft, both manned and unmanned, as required by Army Regulation (AR) 70-62 (\"Airworthiness of Aircraft Systems\"), and is essential for assuring the safe operation of Army aircraft. This Project performs engineering functions (design, analysis, testing, demonstrations, and system specification compliance) essential for certifying the airworthiness of nearly 20,000 assigned Army aircraft. This Project also supports: management\/execution of the Army's Aeronautical Design Standards (ADS) program; management\/execution of airworthiness approval for new systems and materiel changes for all assigned Army aircraft systems; airworthiness engineering support for major development\/modification and future systems\/ subsystems requirements of the Program Executive Officer for Aviation (PEO AVN) and U.S. Army Special Operations Command's Technology Applications Program Office (TAPO); and management of test and evaluation processes in support of the airworthiness qualification process. The Airworthiness Certification Project also performs general research and development in support of aircraft qualification and overarching airworthiness projects that involve multiple aircraft models, and supports the application of other critical aviation subsystems onto Army aircraft. \n\nThis Project also supports: airworthiness certification for military-use civil derivative aircraft technical qualification through the Federal Aviation Administration's Military Certification Office; development of airworthiness procedures, specifications, critical standards, and other design and qualification documents; participation in senior leadership mandated airworthiness tri-service activities (e.g., National Airworthiness Council) and international airworthiness related activities mandated by treaty (e.g. Flight Into Non-segregated Airspace (FINAS)); and early airworthiness involvement in Technology Transition projects such as the Future Attack Reconnaissance Aircraft, Future Long Range Assault Aircraft, Advanced Unmanned Aircraft Systems, Modular Open System Architecture, and other Office of the Secretary of Defense (OSD) initiatives.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Certification Assessments and Studies Force Modernization Aircraft"
                                    },
                                    "Description": {
                                        "val": "Perform assessments and studies in support of Force Modernization Aircraft Systems"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.042"
                                            },
                                            "Text": {
                                                "val": "Conducted technical and airworthiness qualification assessments and studies to demonstrate airworthiness and system performance for Army force modernization aircraft systems or multi-system programs (e.g. AH-64E, UH-60M, MH-47G, MH-60M, etc)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.011"
                                            },
                                            "Text": {
                                                "val": "Will conduct technical and airworthiness qualification assessments and studies to demonstrate airworthiness and system performance for Army force modernization aircraft systems or multi-system programs (e.g. AH-64E, UH-60M, MH-47G, MH-60M, etc)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding requirements change due to consolidation of this item within the Certification Requirements and Studies item below."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Certification Requirements and Studies for Force Modernization Aircraft, Future Aircraft, and Advanced Aircraft Technologies"
                                    },
                                    "Description": {
                                        "val": "Perform studies to support airworthiness certification requirements for Force Modernization and Future Aircraft Systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.512"
                                            },
                                            "Text": {
                                                "val": "Conducted studies of Airworthiness Certification requirements for future aircraft systems and other technology transition programs (e.g. Future Vertical Lift Aircraft, Improved Turbine Engine Program). Published baseline version of Army Military Airworthiness Certification Criteria (AMACC) document."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.419"
                                            },
                                            "Text": {
                                                "val": "Will conduct studies of Airworthiness Certification requirements for future aircraft systems and other technology transition programs (e.g. Joint Multi-Role Technology Demonstrator Aircraft, Future Vertical Lift Aircraft, Improved Turbine Engine Program)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.815"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.815"
                                            },
                                            "Text": {
                                                "val": "Will refine AMACC document.  Will conduct technical and airworthiness qualification assessments, projects, and studies to demonstrate airworthiness and system performance for Army force modernization aircraft systems and multi-system programs (e.g. AH-64E, UH-60M, MH-47G, MH-60M, etc). Will conduct studies of Airworthiness Certification requirements for future aircraft systems and other advanced technology transition programs (e.g. Future Attack Reconnaissance Aircraft, Future Long Range Assault Aircraft, Advanced Unmanned Aircraft Systems, Modular Open System Architecture). These efforts will include extensive, multi-faceted interactions and collaborations with government RDTE Centers, academia, US industry, professional aerospace technical societies, and international partners to fully understand advanced aviation technologies and proposed airworthiness certification criteria, standards, and methods of compliance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change due to the consolidation of the Certification Assessments and Studies Force Modernization Aircraft effort and  the Certification Assessments of Technology Upgrades effort into this item - Certification Requirements and Studies for Force Modernization Aircraft, Future Aircraft, and Aircraft Technologies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Design Standards"
                                    },
                                    "Description": {
                                        "val": "Support the development, implementation and maintenance of Army Aeronautical Design Standards, airworthiness procedures and tools, and overarching Airworthiness qualification documentation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.023"
                                            },
                                            "Text": {
                                                "val": "Supported the development, implementation and maintenance of Army Aeronautical Design Standards, airworthiness procedures and tools, and overarching Airworthiness qualification documentation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.891"
                                            },
                                            "Text": {
                                                "val": "Will develop, implement, and maintain Army Aeronautical Design Standards, airworthiness procedures and tools, and overarching airworthiness qualification documentation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.437"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.437"
                                            },
                                            "Text": {
                                                "val": "Will develop, implement, and maintain Army Aeronautical Design Standards, airworthiness procedures and tools, and overarching airworthiness qualification documentation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding realigned within project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Certification Assessments of Technology Upgrades"
                                    },
                                    "Description": {
                                        "val": "Perform certification assessments of technology upgrades."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.042"
                                            },
                                            "Text": {
                                                "val": "Conducted technical and airworthiness certification assessments of technology upgrades to Army force modernization aircraft systems or programs (e.g. Advanced Threat Infrared Countermeasures integration, Common Missile Warning System integration, Common Sensor integration)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.011"
                                            },
                                            "Text": {
                                                "val": "Will conduct technical and airworthiness certification assessments of technology upgrades to Army force modernization aircraft systems or programs (e.g. Advanced Threat Infrared Countermeasures integration, Common Missile Warning System integration, Common Sensor integration)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding and requirements change due to consolidation of this item within the Certification Requirements and Studies item above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Commercial Derivative Aircraft"
                                    },
                                    "Description": {
                                        "val": "Technical and airworthiness qualification for Commercial Derivative Aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.37"
                                            },
                                            "Text": {
                                                "val": "Provided technical and airworthiness qualification for Commercial Derivative Aircraft through the Federal Aviation Administration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.296"
                                            },
                                            "Text": {
                                                "val": "Will provide technical and airworthiness qualification for Commercial Derivative Aircraft through the Federal Aviation Administration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.242"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.242"
                                            },
                                            "Text": {
                                                "val": "Will provide technical and airworthiness qualification for Commercial Derivative Aircraft through the Federal Aviation Administration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding realigned within the project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft Fleet Airworthiness Certification Advancement and Synchronization"
                                    },
                                    "Description": {
                                        "val": "Support efforts to establish and maintain aircraft safety for a fleet of aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.807"
                                            },
                                            "Text": {
                                                "val": "Led and participated in national and international airworthiness certification committees, conferences and working groups responsible for establishing, maintaining, and synchronizing aircraft safety for fleets of aircraft (e.g. National Airworthiness Council, Joint Propulsion Coordinating Committee, NATO Airworthiness working groups, Air Forces Interoperability Council Airworthiness working groups, and Global Air Traffic Management working groups.)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.676"
                                            },
                                            "Text": {
                                                "val": "Will lead and participate in national and international airworthiness certification committees, conferences and working groups responsible for establishing and maintaining aircraft safety for a fleet of aircraft (e.g. National Airworthiness Council, Joint Aeronautical Commanders Group, Joint Propulsion Coordinating Committee, NATO Airworthiness working groups, ASIC Airworthiness Working Groups, and Global Air Traffic Management working groups.)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.242"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.242"
                                            },
                                            "Text": {
                                                "val": "Will lead and participate in national and international airworthiness certification committees, conferences and working groups responsible for establishing, maintaining, and synchronizing aircraft safety for fleets of aircraft (e.g. National Airworthiness Council, Joint Propulsion Coordinating Committee, NATO Airworthiness working groups, AFIC Airworthiness working groups, and Global Air Traffic Management working groups.)"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding redistributed within the project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.157"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}