{
    "id": "2021-Army-PB-2040-JBOOK-38817b19843ccf99356f5d9ba89c5f3ce0667d7b832b6ff0b583beb9488c2c99-15",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA4-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603827A"
        },
        "ProgramElementTitle": {
            "val": "Soldier Systems - Advanced Development"
        },
        "R1LineNumber": {
            "val": "93"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "30.384"
            },
            "CurrentYear": {
                "val": "26.113"
            },
            "BudgetYearOne": {
                "val": "26.138"
            },
            "BudgetYearOneBase": {
                "val": "26.138"
            },
            "BudgetYearTwo": {
                "val": "30.945"
            },
            "BudgetYearThree": {
                "val": "33.961"
            },
            "BudgetYearFour": {
                "val": "28.535"
            },
            "BudgetYearFive": {
                "val": "32.332"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE), Advanced Component Development and Prototypes, manages the Soldier as a system to increase combat effectiveness, test and deliver tangible products that save Soldiers lives and improve combat capability.  The PE provides funding for evaluating, developing, and testing emerging technologies and critical Soldier support systems to reduce technology risk.\n\nCF2\nThe Integrated Squad effort includes the completion of the Adaptive Squad Architecture (ASA) and Squad Performance Model (SPM) programs.  Both of these efforts are Program Executive Office-Soldier (PEO-S) led and will develop a full system architecture for the Soldier and the Squad.  This will be accomplished by developing Interface Control Documents (ICDs) in order to provide common established interfaces for internal and external stakeholders who will interface on or with the Soldier platform.  A critical part of this effort is development of the \"Squad as an Integrated Platform\" vision based on threat, operational environment and collaboration with internal and external stakeholders to inform investment decisions out to FY 2050.  The ASA will develop a metric-based approach that will include live, virtual and constructive evaluations and tools across the Department of Defense (DoD), academia and industry which will be used for senior leaders to make deliberate decisions based on the analysis of Soldier\/ Squad performance\n\nET8\nPersonnel Airdrop System supports efforts to improve Low Altitude and High Altitude personnel parachutes and associated equipment to include canopy improvement based on integration of new technology with the goal of enhancing the insertion capability and safety of the airborne Soldier and increasing the performance, reliability, and durability of personnel airdrop equipment.\n\nS53\nThis Project supports efforts to evaluate and integrate technologies and representative or prototype systems that help expedite Soldier Clothing and Individual Equipment technology transition from the laboratory to operational use. Efforts focus on proving out commonality across as broad a spectrum of users as possible to provide a modular, integrated uniform\/clothing system from skin out and head-to-toe. It funds efforts to transition new technologies and domestically available fabrics with Flame Resistant (FR), moisture wicking, insect protection and camouflage technologies, including integration of fabrics appropriate for uniforms and equipment used in jungle\/tropical and arctic environments. New technologies are indentified to monitor health and improve Soldier survivability, reduce weight, and improve affordability, mobility and comfort in combat and training\/administrative environments. Includes integration and interface on the Soldier system.\n\nS54\nThe Small Arms Improvement Advanced Component Development and Prototypes (ACD&P) program provides funds to mature, demonstrate, test and evaluate emerging technology from Budget Activity (BA) 3 Program Element 0603607A Joint Service Small Arms Program (JSSAP) Project 627 Defense Advanced Research Projects Agency (DARPA), Department of Energy National Laboratories, Research Development & Engineering Centers (RDECs) and other domestic and foreign sources for small arms weapon systems and technology. Small arm weapon systems include weapons ranging up to 40 millimeter in caliber. Current and future efforts focus on improvements designed to enhance lethality, target acquisition and tracking, fire control, usability, training effectiveness and reliability of weapons to include ammunition when developing and\/or evaluating standard and non-standard weapons. Focus areas include the maturing of technology through testing and evaluation of sub-system or system prototypes which demonstrates light weight materials, wear resistant\/protective\/anti-reflective coatings, observation\/situational awareness improvements, human-systems integration, robotic armament capability, non-lethal capability, and equipment enhancements.  Benefits include continuous improvements to small arms weapon systems, fire control equipment, optics, gun barrels, training devices, suppressors, component mounts, weapon mounts, and weapon\/ammunition interface. Includes costs associated with efforts for integration and interface of products on Soldiers' head, body and weapons.\n\nVS4\nThis Project supports efforts to evaluate integrated technologies and representative or prototype systems that help expedite Personal Protective Equipment (PPE) technology transition from the laboratory to operational use."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "31.022"
                },
                "CurrentYear": {
                    "val": "22.113"
                },
                "BudgetYearOne": {
                    "val": "26.161"
                },
                "BudgetYearOneBase": {
                    "val": "26.161"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "30.384"
                },
                "CurrentYear": {
                    "val": "26.113"
                },
                "BudgetYearOne": {
                    "val": "26.138"
                },
                "BudgetYearOneBase": {
                    "val": "26.138"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.638"
                },
                "CurrentYear": {
                    "val": "4"
                },
                "BudgetYearOne": {
                    "val": "-0.023"
                },
                "BudgetYearOneBase": {
                    "val": "-0.023"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "4"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.638"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.023"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.023"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CF2"
                    },
                    "ProjectTitle": {
                        "val": "Integrated Soldier Systems Prototyping (SL CFT)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "1.959"
                        },
                        "BudgetYearOne": {
                            "val": "2.541"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.541"
                        },
                        "BudgetYearTwo": {
                            "val": "3.149"
                        },
                        "BudgetYearThree": {
                            "val": "3.771"
                        },
                        "BudgetYearFour": {
                            "val": "3.843"
                        },
                        "BudgetYearFive": {
                            "val": "3.881"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "19.144"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Verify and maintain tools that provide Systems Engineering, Configuration Management, and Evaluations in a virtual and physical environment. Verify and maintain the Adaptive Squad Architecture (ASA) and Squad Performance Model (SPM) with emphasis on development of ICDs, specifically to support the rapid integration of the Soldier Lethality Cross Functional Team (SL CFT) priority programs with all other equipment the dismounted Soldier will use. Provide prototyping of capabilities for evaluation and integration. Execute evaluation of new measurements and methodologies from the S&T community, execute system level evaluation environments, and support Soldier system modeling.  Funding for this project aligns with the Army's priorities in support of the National Defense Strategy and is a priority of the Soldier Lethality Cross Functional Team.  FY 2020 RDTE funding in the amount of $1.959M will finalize an initial ASA and SPM, consisting of 3 critical products: the Configuration Database (CD), the Architectural Assessment Tool (AAT) and the SPM."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Integrated Soldier Systems Prototyping"
                                    },
                                    "Description": {
                                        "val": "Verify and maintain tools that provide Systems Engineering, Configuration Management, and Evaluations in a virtual and physical environment. Verify and maintain the ASA and SPM with emphasis on development of ICDs, specifically to support the rapid integration of the Soldier Lethality Cross Functional Team (SL CFT) priority programs with all other equipment the dismounted Soldier will use. Provide prototyping of capabilities for evaluation and integration.  Execute evaluation of new measurements and methodologies from the S&T community, execute system level evaluation environments, and support Soldier system modeling.  Funding for this project aligns with the Army's priorities in support of the National Defense Strategy and is a priority of the Soldier Lethality Cross Functional Team"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.87"
                                            },
                                            "Text": {
                                                "val": "FY 2020 Plans:\nFinalize operational version of ASA and SPM"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.541"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.541"
                                            },
                                            "Text": {
                                                "val": "Accelerate the development of components, algorithms, and demonstrations in support of Squad as an Integrated Combat Platform"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 to FY 2021 increase in required funding due to increased trade-off analysis of technology integration with Soldiers' personal protection, electronics connectivity, power and energy, user interfaces, and display content."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.089"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CF3"
                                    },
                                    "Title": {
                                        "val": "Integrated Soldier Systems (SL CFT)"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "4.504"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.597"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.597"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.425"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.498"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.58"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.626"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "27.230"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Develop and validate the verification and operation of the ASA tools (Configuration Database (CD), Architectural Assessment Tool (AAT), Squad Performance Model\n(SPM)) under full and open competition. Attempt to utilize one vendor for, at a minimum, maintenance of the CD and AAT. Conduct evaluations to support the SPM,\nwith the Government acting as the lead developer."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.089"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.089"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Adaptive Soldier Architecture (ASA) Squad Performance Model (SPM)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.455"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.5"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.5"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "ASA\/SPM Test & Eval"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.415"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.041"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.041"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "4_CF2_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "ASA SPM Implementation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ET8"
                    },
                    "ProjectTitle": {
                        "val": "Personnel Airdrop System Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.396"
                        },
                        "CurrentYear": {
                            "val": "0.297"
                        },
                        "BudgetYearOne": {
                            "val": "1.266"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.266"
                        },
                        "BudgetYearTwo": {
                            "val": "1.264"
                        },
                        "BudgetYearThree": {
                            "val": "1.811"
                        },
                        "BudgetYearFour": {
                            "val": "0.999"
                        },
                        "BudgetYearFive": {
                            "val": "0.999"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Funding in this project supports the Army's Cross Functional Teams (CFT) initiatives.  Project ET8, Personnel Airdrop System, supports efforts to improve Low Altitude and High Altitude personnel parachutes and associated equipment to include canopy improvement based on integration of new technology with the goal of enhancing the insertion capability and safety of the airborne Soldier and increasing the performance, reliability, and durability of personnel airdrop equipment.  This project will transition capabilities from our Science and Technology partners to increase performance and safety of Soldier clothing and equipment.  It will continue to support cross-service initiatives to improve commonality."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Personnel Airdrop System Development"
                                    },
                                    "Description": {
                                        "val": "Improve Low Altitude and High Altitude personnel parachutes and associated equipment to include canopy improvements based on integration of new technology with the goal of enhancing the insertion and safety of the airborne soldier and increasing the performance, reliability, and durability of personnel airdrop equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.396"
                                            },
                                            "Text": {
                                                "val": "Continue to investigate and initiate improvements to address reduced signature of parachute systems for high altitude operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.283"
                                            },
                                            "Text": {
                                                "val": "Evaluate Low Altitude Static Line Automatic Activation Devices as well as Universal Static Line smart snap hook and Jumper Recovery Systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.266"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.266"
                                            },
                                            "Text": {
                                                "val": "Continue evaluation of Low Altitude Static Line Automatic Activation Devices (now called T11 RAAD or T11 Reserve Automatic Activation Device (T-11R AAD)) and begin evaluation of Smart Universal Static Line Snap Hook (SUSH)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase in Personnel Airdrop System Development portfolio is due to the continued development of the T-11 Reserve Automatic Activation Device (T-11R AAD) and the initial evaluation of the Smart Universal Static Line Snap Hook (SUSH) technology."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.014"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "ES9"
                                    },
                                    "Title": {
                                        "val": "Advanced Tactical Parachute System"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.457"
                                        },
                                        "CurrentYear": {
                                            "val": "6.617"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.827"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.827"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.962"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.961"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.997"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.996"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "27.817"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MA7801"
                                    },
                                    "Title": {
                                        "val": "Advanced Tactical Parachute System"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "41.104"
                                        },
                                        "CurrentYear": {
                                            "val": "42.622"
                                        },
                                        "BudgetYearOne": {
                                            "val": "53.021"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "53.021"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "47.755"
                                        },
                                        "BudgetYearThree": {
                                            "val": "39.808"
                                        },
                                        "BudgetYearFour": {
                                            "val": "38.978"
                                        },
                                        "BudgetYearFive": {
                                            "val": "25.11"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "288.398"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Programs pursue technology maturation and prototype development, culminating in the transition of mature technologies (Technology Readiness Level (TRL) 6-7) to system development and demonstration (SDD)."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.014"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.014"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Developmental Contracts"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.093"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.727"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.727"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "2.588"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.408"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CCDC Natick, MA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.46"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.096"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.096"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.1"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.1"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.827"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.579"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM SCIE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Belvoir"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.245"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.1"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.094"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.1"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.1"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.811"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.350"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.435"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.2"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.339"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.339"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.782"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.756"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "4_ET8_0.png"
                                }
                            }
                        ],
                        "ScheduleProfileNote": {
                            "val": "High Altitude Insertion Enhancements includes the following: Glide Augmentation, Situational Awareness Aids, GPS Denied Navigation Aid and High Altitude Combo Drops."
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Low Observable (Signature Reduction)  Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Evaluate Component and Subsystem Technologies"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Static Line T-11 RAAD Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop T-11 Light Weight Canopy"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop Smart Universal Static line Hook (SUSH)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "High Altitude Insertion  Enhancements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S53"
                    },
                    "ProjectTitle": {
                        "val": "Clothing And Equipment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.765"
                        },
                        "CurrentYear": {
                            "val": "6.466"
                        },
                        "BudgetYearOne": {
                            "val": "1.808"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.808"
                        },
                        "BudgetYearTwo": {
                            "val": "2.414"
                        },
                        "BudgetYearThree": {
                            "val": "4.474"
                        },
                        "BudgetYearFour": {
                            "val": "5.073"
                        },
                        "BudgetYearFive": {
                            "val": "8.726"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Funding in this project supports the Army's Cross Functional Teams (CFT) initiatives.  This Project supports efforts to evaluate and integrate technologies and representative or prototype systems that help expedite Soldier Clothing and Individual Equipment technology transition from the laboratory to operational use. Efforts focus on proving out commonality across a broad spectrum of users to provide a modular, integrated uniform\/clothing system from skin out and head-to-toe. It funds efforts to transition new technologies and domestically available fabrics with Flame Resistant (FR), moisture wicking, insect protection and camouflage technologies, including integration of fabrics appropriate for uniforms and equipment used in all environments such as jungle\/tropical and arctic environments. New technologies are indentified to monitor health and improve Soldier survivability, reduce weight, and improve affordability, mobility and comfort in combat and training\/administrative environments. Includes integration and interface on the Soldier system.  This project will transition capabilities from our Science and Technology partners to increase performance and safety of Soldier clothing and equipment.  It will continue to support cross-service initiatives to increase commonality."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Cold Weather Clothing"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4"
                                        },
                                        "Text": {
                                            "val": "Cold Weather Clothing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier Uniforms and Clothing"
                                    },
                                    "Description": {
                                        "val": "Develop superior and sustainable integrated clothing for the Soldier in a rapidly changing global environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.765"
                                            },
                                            "Text": {
                                                "val": "Develop improved Boot Water Absorption test methodology. Evaluate improved lighter weight textiles which incorporate improved vector protection, FR protection, and environmental protection while providing comfort, utility, and functionality.  Evaluate materials to support extreme cold temperature protection for military free fall parachutists.  Standardize test methodology for cold weather glove system.  Improve Hot Weather Combat Uniform Female (IHWCU-F) Pattern adjustment for creation of female sizes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.472"
                                            },
                                            "Text": {
                                                "val": "Continue Flame Resistant clothing upgrades.  Continue Signature Management evaluation in Camouflage equipment.  Continue to evaluate improved lighter weight textiles which incorporate improved vector protection, FR protection, and environmental protection while providing comfort, utility, and functionality.  Also, continue to evaluate materials to support extreme cold temperature protection for military free fall parachutists.  The S&T transition for environmental cold\/wet protection clothing system is planned."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.419"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.419"
                                            },
                                            "Text": {
                                                "val": "Continue Flame Resistant clothing upgrades.  Analyze Flame Resistant garment upgrades and review\/improve testing protocols.  Continue Signature Management efforts in Camouflage Flame Resistant clothing and equipment.  Develop enhanced OCIE capabilities for Soldiers operating in cold and extreme cold environments.  Continue testing novel materials and processes to improve clothing and equipment for extreme climates. Improve size standardization for all individually sized items."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY20 $4M Congressional Add for Cold Weather Clothing. Funding increase between FY 2020 and FY 2021 due to anticipated requirements changes."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Individual Equipment"
                                    },
                                    "Description": {
                                        "val": "Develop and provide superior and sustainable integrated individual equipment for the Soldier in a rapidly changing global environment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.994"
                                            },
                                            "Text": {
                                                "val": "Develop process and procedures for the Dyeing of Aramid Blends, used in environmental clothing. Develop and evaluate hydration devices items like cold weather canteens, individual water treatment devices, and multi purpose hydration systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.389"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.389"
                                            },
                                            "Text": {
                                                "val": "Analyze Flame Resistant garment upgrades and review\/improve testing protocols.  Begin development of a Toxic Industrial Chemicals\/Toxic Industrial Materials (TIC\/TIM) filtration capability for the Individual Water Treatment Device (IWTD).  Evaluate current load carriage equipment to asses its ability to support the modernization of current individual weapons and situational awareness capabilities. Optimize the capability of Load Carriage items to support modernization for weapons and tactical gear."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decrease from FY 2020 to FY 2021 due to anticipated changes in requirements."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "S60"
                                    },
                                    "Title": {
                                        "val": "Clothing & Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.152"
                                        },
                                        "CurrentYear": {
                                            "val": "6.453"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.717"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.717"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.01"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.846"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.697"
                                        },
                                        "BudgetYearFive": {
                                            "val": "6.814"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "41.689"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Programs pursue technology maturation and prototype development, culminating in the transition of mature technologies (Technology Readiness Level (TRL) 6-7) to Systems Development and Demonstration.  This Project continues to exercise competitively awarded contracts using best value source selection procedures."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM SPIE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Belvoir, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "15.495"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.285"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.296"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.29"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.29"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSRDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "16.338"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.327"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.441"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.347"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.347"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Development Contracts"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "34.449"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.355"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.588"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.374"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.374"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2019 SBIR \/STTR Transfer\/FFRDC"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.060"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program OfficeSupport Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Natick,MA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.402"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.302"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.296"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.322"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.322"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Testing Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "26.914"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.436"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.845"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.475"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.475"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "4_S53_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "UNIFORM CLOTHING"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Flame Resistant Clothing Upgrades"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Improve Signature Mgmt (IR) Eval & Camo in Clothing & Eqpt"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CW\/ECW Clothing Improvements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CW\/ECW Handwear"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "INDIVIDUAL EQUIPMENT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Multi-purpose Personal Hydration System (MPHS) Shelf-life Extension Eval"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop TIC\/TIM Capability for the Individual Water Treatment Device (IWTD)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop Cold Weather Canteen"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S54"
                    },
                    "ProjectTitle": {
                        "val": "Small Arms Improvement"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.395"
                        },
                        "CurrentYear": {
                            "val": "14.555"
                        },
                        "BudgetYearOne": {
                            "val": "16.082"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.082"
                        },
                        "BudgetYearTwo": {
                            "val": "19.213"
                        },
                        "BudgetYearThree": {
                            "val": "17.423"
                        },
                        "BudgetYearFour": {
                            "val": "10.477"
                        },
                        "BudgetYearFive": {
                            "val": "10.583"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "95.728"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Small Arms Improvement Advanced Component Development and Prototypes (ACD&P) program provides funds to mature, demonstrate, test and evaluate emerging technology from Budget Activity (BA) 3 Program Element (PE) 0603607A Joint Service Small Arms Program (JSSAP) Project 627 Defense Advanced Research Projects Agency (DARPA), Department of Energy National Laboratories, Research Development & Engineering Centers (RDECs) and other domestic and foreign sources for small arms weapon systems and technology. Small arm weapon systems include weapons ranging up to 40 millimeter in caliber. Current and future efforts focus on improvements designed to enhance lethality, target acquisition and tracking, fire control, usability, training effectiveness and reliability of weapons to include ammunition when developing and\/or evaluating standard and non-standard weapons. Focus areas include the maturing of technology through testing and evaluation of sub-system or system prototypes which demonstrates light weight materials, wear resistant\/protective\/anti-reflective coatings, observation\/situational awareness improvements, human-systems integration, robotic armament capability, non-lethal capability, and equipment enhancements.  Benefits include continuous improvements to small arms weapon systems, fire control equipment, optics, gun barrels, training devices, suppressors, component mounts, weapon mounts, and weapon\/ammunition interface. Includes costs associated with efforts for integration and interface of products on Soldiers' head, body and weapons."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "New Weapon Systems"
                                    },
                                    "Description": {
                                        "val": "Development of new small arms weapon systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.8"
                                            },
                                            "Text": {
                                                "val": "Next Generation Squad Automatic Rifle (NGSAR):  Transition of technologies from Program Element 0603827A, Project S54 to Program Element 0604601A, Project EW4. Coordinating and developing the Capability Development Document (CDD), Acquisition Strategy, Capability Production Document (CPD), and provide data from various technologies to better inform stakeholders. Beginning EMD phase for the Next Generation Squad Automatic Rifle.\n\nExternally Powered Mounted Machine Gun renamed to Externally Powered Weapon (EPW).  Continuing to support the development of the Capability Development Document (CDD) with Maneuver Center of Excellence and Maneuver Support Center of Excellence. Intent is to leverage information gathered from prototype testing and develop a demonstrator to better evaluate and inform the CDD and the various platforms that may include the EPW as their Armament System. \n\nNew Weapons Evaluations and Assessments:  Continuing to perform initial evaluation and assessment of new weapons."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.505"
                                            },
                                            "Text": {
                                                "val": "Externally Powered Weapon (EPW):  Continued to support the development of the Capability Development Document (CDD) with Maneuver Center of Excellence and Maneuver Support Center of Excellence. Intended to leverage information gathered from prototype testing and developed a demonstrator to better evaluate and inform the CDD and the various platforms that may include the EPW as their Armament System. Initiated the intelligence\/networking and weapons design and functions for a man-in-the-loop, small caliber defensive armaments system on an unmanned ground vehicle including the Warfighter\/Robot interface.\n\nNew Weapon Systems Evaluations and Assessments:  Continued to perform initial evaluation and assessment of new weapon systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.59"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.59"
                                            },
                                            "Text": {
                                                "val": "Next Generation Weapons will begin to support technology development for future Next Generation Weapon variants addressing operational force needs for increased lethality, increased probability of hit, increased solider acceptance, decreased signature, reduced recoil, reduced soldier aim error, and reduced engagement time.  New weapons may be variants or enhancements of the NGSW-R and NGSW-AR or new weapon platforms to fulfill other roles such as machine guns, sniper rifles, and others.\n\nEPW will complete maturation and upgrade of prototype system based on test and experimentation results.  Will continue with integration of intelligence\/networking\/remote operation capabilities.  Will continue to work with Maneuver and Maneuver Support Capabilities Development and Integration Directorate (M-CDID and MS-CDID) Futures and Concepts Centers regarding the Capability Development Document.\n\nNew Weapons Systems Evaluations and Assessments:  Will continue to perform initial and follow-on evaluations, assessments and integration of new weapons to include various new weapon system platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase in funding required for development and testing of New Weapon Systems."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Arms Weapon Systems Enhancements"
                                    },
                                    "Description": {
                                        "val": "Enhancements and development of small arms weapon systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.34"
                                            },
                                            "Text": {
                                                "val": "Recoil Reduction Mechanisms:  Continuing to assess and evaluate selected Recoil Reduction Mechanisms prototypes to be fabricated and tested for both individual and crew served weapons.\n\nArmaments for Robots:  Continuing to initiate the intelligence\/networking and weapons design and functions for a man-in-the-loop, small caliber defensive armaments system on an unmanned ground vehicle including the Warfighter\/Robot interface.\n\nIncreased Barrel Life\/Replace Chrome:  Continuing test and evaluation of prototype barrels delivered in FY 2017 to pursue barrel and liner designs that can withstand higher pressures per the Small Arms Ammunition Configuration Study outputs.  Further investigate and mature additive manufacturing and cold spray methodology for barrels.\n\nNon-Standard Weapons Assessments:  Continuing to conduct baseline testing of commercial weapon systems and perform capability analysis of unique weapon characteristics.   Continuing to utilize test information to conduct trade off assessments of Non-Developmental Item solutions for pending requirements as well as establish safety parameters for the training mission of Regionally Aligned Forces and establish a sustainment strategy for long term support of weapons procured to support the Regionally Aligned Forces training mission.  Continuing to conduct market research of commercially available weapon systems.\n\nSmall Business Innovative Research Enhancements:  Continuing to focus on improvements designed to enhance lethality, target acquisition and tracking, fire control, training effectiveness and reliability of weapons.\n\nProtective Weapons Coatings: (includes Adaptive Lubricious Coatings):    Continuing to develop manufacturing technology to support production of super hydrophobic and other coatings in support of Small Arms Weapons. Assessed and evaluated current manufacturing process studies and assessments to adapt the coating technology into weapon Original Equipment Manufacturer manufacturing processes.\n\nWeapon Upgrades and Accessories wontinuing to test, evaluate and analyze ongoing and new activities to enhance small arms weapons."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.65"
                                            },
                                            "Text": {
                                                "val": "Current and Legacy Weapon Improvements assessed and evaluated selected capabilities and improvements for all current and legacy weapon systems.\n\nSolid State Active Denial System worked to complete maturation of design, continued to monitor status of Capability Development Document and provided input into programmatic documents as necessary.\n\nIndividual Non-Lethal System worked to complete maturation of design and got it ready for prove out test at Government facility in support of Milestone B.  Previously funded in Fiscal Year (FY) 2017.\n\nNon-Standard Weapons Assessments continued to conduct baseline testing of commercial weapon systems and perform capability analysis of unique weapon characteristics. Continued to utilize test information to conduct trade off assessments of Non-Developmental Item solutions for pending requirements as well as established safety parameters for the training mission of Regionally Aligned Forces and established a sustainment strategy for long term support of weapons procured to support the Regionally Aligned Forces training mission. Continued to conduct market research of commercially available weapon systems.  \n\nSmall Business Innovative Research Enhancements continued future efforts to focus on improvements designed to enhance lethality, target acquisition and tracking, fire control, training effectiveness and reliability of weapons."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.645"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.645"
                                            },
                                            "Text": {
                                                "val": "Next Generation Defeat will design, develop, and prototype fabrication of advanced technologies to incorporate into Soldier employable system that will be capable of on-target effects against multiple types of targets (i.e. targets behind cover, targets that are exposed, thin skin vehicles, unmanned aerial systems)\n\nNext Generation Weapons\/Enhancements will begin to support technology development for future Next Generation Weapon variants addressing operational force needs for increased lethality, increased probability of hit, increased solider acceptance, decreased signature, reduced recoil, reduced soldier aim error, and reduced engagement time.  New weapons may be variants or enhancements of the Next Generation Squad Weapon Rifle (NGSW-R) and Next Generation Squad Automatic Rifle (NGSAR) or new weapon platforms to fulfill other roles such as machine guns, sniper rifles, and others.\n\nNon-Standard Weapons Assessments will continue to conduct baseline testing of commercial weapon systems and perform capability analysis of unique weapon characteristics. Continue to utilize test information to conduct trade off assessments of Non-Developmental Item solutions for pending requirements as well as establish safety parameters for the training mission of Regionally Aligned Forces and other non Department of Defense (DOD) customers.  Will continue to establish a sustainment strategy for long term support of weapons procured to support the Regionally Aligned Forces training mission.  Will conduct safety assessments of limited distribution materiel systems considered for Table of Organization and Equipment (TOE) and Common Table of Allowances (CTA) approvals. Continue to conduct market research of commercially available weapon systems.\n\nProtective Weapons Coatings\/Low Plasticity Burnishing will continue to develop manufacturing technology to support production of super hydrophobic and other coatings in support of preserving barrel and bolt life of small arms weapons while improving readiness. Continue to assess and evaluate current manufacturing process studies and assessments to adapt the coating technology into weapon Original Equipment Manufacturer manufacturing processes.\n\nSolid State Active Denial System will continue to monitor status of Capability Development Document and provide input into other programmatic documents as necessary. Will continue work to complete maturation of design.\n\nIndividual Non-Lethal System will mature and complete prototype design for integration into a full system.  Will prepare for proof of concept and design test efforts at Government facility in support of Milestone B.  New Start in FY 2020.\n\nArmaments for Robots will continue intelligence\/networking and weapons design and functions for a man-in-the-loop, small caliber defensive armaments system on an unmanned ground vehicle including the Warfighter\/Robot interface. \n\nRecoil Reduction Mechanisms will continue to assess and evaluate selected Recoil Reduction Mechanisms prototypes to be fabricated and tested for both individual and crew served weapons.\n\nCurrent and Legacy Weapon Improvements will continue to assess and evaluate selected capabilities and improvements for all current and legacy weapon systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase in funds required to reduce technology risk and to determine the appropriate set of technologies required to complete Next Generation Weapons technology development phase."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ammunition"
                                    },
                                    "Description": {
                                        "val": "Small arms ammunition improvement."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.13"
                                            },
                                            "Text": {
                                                "val": "Ammunition Upgrades:  Continuing to evaluate the effect of new ammunition on small arms weapons."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.1"
                                            },
                                            "Text": {
                                                "val": "Ammunition Upgrades:  Continued to evaluate the effect of new ammunition on small arms weapon systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease in funding due to a lack of Ammo requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Optics"
                                    },
                                    "Description": {
                                        "val": "Improvement of small arms combat optics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.137"
                                            },
                                            "Text": {
                                                "val": "Optics Upgrades:  Continuing to evaluate state of the art advances in optical component technologies for inclusion in future products, including Mounted Machinegun Optic Capability Production Document, Fire Control Capability Development Document, and its associated annexes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.1"
                                            },
                                            "Text": {
                                                "val": "FY 2020 New Start: Next Generation Optics:  Integrated current and emerging target acquisition component technologies into a variable magnification spotting scope and into binoculars."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.1"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.1"
                                            },
                                            "Text": {
                                                "val": "Next Generation Optics: Will continue to integrate current and emerging target acquisition component technologies into binoculars and variable magnification spotting scopes. Will continue to evaluate state of the art advances in optical component technologies for inclusion in future combat optic products."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fire Control"
                                    },
                                    "Description": {
                                        "val": "Small arms fire control."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.721"
                                            },
                                            "Text": {
                                                "val": "FY 2019 New start:  Next Generation Fire Control (Crew Served and Squad) Technology Enhancements:  Continuing support and oversight for exploring future fire control applications for Next Generation Squad Weapons objective requirements, Small Business innovation Research, and digital enhancements. Future applications specifically address aim augmentation, target tracking and handoff, automatic target detection\/identification\/recognition, integrated day\/night capability, integrated wind sensor, secure wireless transmission, environmental sensing, and optical enhancements.\n\nSniper Missed Distance Corrective Offset:  Continuing to assess and evaluate from a sniper team (shooter's) location, tracks sniper's bullet trace to target to derive a missed distance correct offset for a follow-on shot.\n\nNext Generation Fire Control:  Continuing to conduct prototyping activities to advance fire control technologies on carbine and rifle weapon platforms. Will address Size, Weight, and Power trade space challenges associated with fire control on the individual squad weapons.  Transitioning to Program Element 0604601A Project FF2 Small Arms Fire Control.\n\nSmall Arms Fire Control-Precision\/Enhancements:  Continuing to support and explore future precision fire control enhancements which includes: target detection to improve battlefield reconnaissance and intelligence gathering capabilities, improve target acquisitions at extended ranges in all battlefield conditions, improve anti-reflection (AR) coating  to minimize scope glints, and counter optical augmentation that can disclose soldiers? location, target tracking, down range wind sensing technology, bullet tracking, weapon bore sensor, automated muzzle velocity tracker to improve fire control accuracy, far-target location, battlefield networking, and augmented reality. To provide support to Small Business Innovative Research efforts that will explore the feasibility, scientific merit, research and development, and commercialization of future Precision fire control system.\n\nFire Control Upgrades:  Continuing to test advanced fire control systems for small arms platforms to define the acquisition strategy in support of the Capability Development Document consisting of individual weapons, sniper\/precision, crew served weapons, low and high velocity 40mm."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4"
                                            },
                                            "Text": {
                                                "val": "Next Generation Fire Control Technology Enhancements continued to support technology integration with Next Generation Squad Weapons, and specifically address decrease soldier aim error, decrease engagement time and increase probability of hit.  Prototype demonstrations had application in individual and crew served weapons to enhance and upgrade Fire Control."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4"
                                            },
                                            "Text": {
                                                "val": "Next Generation Fire Control Technology Enhancements will continue to support technology integration with Next Generation Weapons addressing soldier aim error, engagement time, probability of hit, situational awareness, lethality, and soldier acceptance. Iterative prototyping will be utilized to develop component technologies to support future variants of the Next Generation Squad Weapon. Technology may include enhanced camera based technology, target tracking, automatic target detection, increased networked lethality, reduced signature, increased user acceptance, along with other emerging weapon, ammunition, and fire control technologies that will increase the lethality of the next generation squad weapons.\n\nSmall Arms Fire Control Enhancements will continue research test and evaluation efforts on laser based wind sensors, proof-of-concept devices, and other optical designs for prototypes that incorporate fire control sensors and ballistic solver software and integration of sensor input and communication with ammunition for all small arms weapon platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Research and Analysis"
                                    },
                                    "Description": {
                                        "val": "Research and analysis of small arms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.267"
                                            },
                                            "Text": {
                                                "val": "Continuing to initiate Market Research and Benefit Analysis of 360 degree situational awareness, active stabilization, advanced kinetic weapons, low flying drone engagement, and other small arms research."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.2"
                                            },
                                            "Text": {
                                                "val": "Continued to initiate Market Research and Benefit Analysis of 360 degree situational awareness, active stabilization, advanced kinetic weapons, low flying drone engagement, and other small arms research."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.747"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.747"
                                            },
                                            "Text": {
                                                "val": "Plan to continue Market Research and Benefit Analysis of 360 degree situational awareness, active stabilization, advanced kinetic weapons, low flying drone engagement, and other small arms research to include new technologies in emerging robotic and aerial armaments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase in funds required to explore emerging technologies in robotic and aerial armaments."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "EW4"
                                    },
                                    "Title": {
                                        "val": "Crew Served Weapons Engineering Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "25.058"
                                        },
                                        "CurrentYear": {
                                            "val": "4.089"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.263"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.263"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.285"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.423"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.525"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.498"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "51.141"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "FF2"
                                    },
                                    "Title": {
                                        "val": "Small Arms Fire Control"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.094"
                                        },
                                        "CurrentYear": {
                                            "val": "14.7"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.153"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.153"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "11.244"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.993"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.991"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.992"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "68.167"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "FI2"
                                    },
                                    "Title": {
                                        "val": "Lightweight 30mm Cannon"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "1.384"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "1.384"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "FM4"
                                    },
                                    "Title": {
                                        "val": "Next Generation Squad Weapons"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "33.08"
                                        },
                                        "BudgetYearOne": {
                                            "val": "44.837"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "44.837"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.767"
                                        },
                                        "BudgetYearThree": {
                                            "val": "15.456"
                                        },
                                        "BudgetYearFour": {
                                            "val": "16.045"
                                        },
                                        "BudgetYearFive": {
                                            "val": "10.991"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "134.176"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "S63"
                                    },
                                    "Title": {
                                        "val": "Individual Weapons Engineering Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "12.454"
                                        },
                                        "CurrentYear": {
                                            "val": "2.697"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.374"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.374"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.214"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.28"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.27"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.216"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "36.505"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "FL4"
                                    },
                                    "Title": {
                                        "val": "Small Caliber Ammo for Next Gen Squad Weapons"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "18.18"
                                        },
                                        "BudgetYearOne": {
                                            "val": "30.6"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "30.6"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "28.723"
                                        },
                                        "BudgetYearThree": {
                                            "val": "24.976"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.739"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11.858"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "126.076"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "627"
                                    },
                                    "Title": {
                                        "val": "Jt Svc Sa Prog (JSSAP)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.708"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "5.708"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "E06002"
                                    },
                                    "Title": {
                                        "val": "NEXT GENERATION COMBAT ROUND"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "11.988"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11.988"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "20.519"
                                        },
                                        "BudgetYearThree": {
                                            "val": "60.88"
                                        },
                                        "BudgetYearFour": {
                                            "val": "187.813"
                                        },
                                        "BudgetYearFive": {
                                            "val": "189.692"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "470.892"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "In support of Small Arms Initial Capability and Capability Development Requirements, advanced technology of small arms weapon systems is transitioned from Joint Service Small Arms Program (JSSAP), Project 627, Program Element 0603607A, (Budget Activity 3) to Small Arms Improvement, Project S54, Program Element 0603827A, (Budget Activity 4).  After the technology is demonstrated and\/or validated, the program transitions to Infantry Support Weapons, Program Element 0604601A, (Budget Activity 5) for engineering and manufacturing development."
                        },
                        "AcquisitionStrategy": {
                            "val": "Primary strategy is to study, develop, demonstrate and evaluate emerging technologies that ultimately lead to modernizing, enhancing and\/or improving the small arms inventory."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM Soldier Weapons,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.904"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.582"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.59"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.56"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.56"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY2019 SBIR \/ STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "FFRDC"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Budget Office"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pentagon, Washington DC"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.282"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Hardware Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Research Development Engineering Centers,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "33.723"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.68"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "9.755"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "10.505"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "10.505"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Research Development Engineering Centers,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "27.051"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.162"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.24"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.24"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.24"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Developmental Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Test and Evaluation Centers,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "15.008"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.689"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.97"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.777"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.777"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "4_S54_0.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "4_S54_1.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "NEW WEAPON SYSTEMS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Next Generation Automatic-Rifle"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Next Generation Squad Weapon-Rifle"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Externally Powered Weapon (EPW)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "New Weapon Systems Evaluations and Assessments"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMALL ARMS WEAPON SYSTEMS ENHANCEMENTS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Next Generation Defeat"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Current and Legacy Weapon Improvements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Individual Non-Lethal System"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Non-Standard Weapon Assessments"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Small Business Innovative Research"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Protective Weapons Coatings (Low Plasticity Burnishing)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Weapons Upgrades and Accessories"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AMMUNITION"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Ammunition Upgrades"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "COMBAT OPTICS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Next Generation Optics"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Optics Upgrades"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FIRE CONTROL"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Next Generation Fire Control Technology Enhancements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Next Generation Fire Control"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Small Arms Fire Control Enhancements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Small Arms Fire Control Upgrades"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RESEARCH AND ANALYSIS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Research and Analysis of Small Arms"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VS4"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Protective Equipment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.828"
                        },
                        "CurrentYear": {
                            "val": "2.836"
                        },
                        "BudgetYearOne": {
                            "val": "4.441"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.441"
                        },
                        "BudgetYearTwo": {
                            "val": "4.905"
                        },
                        "BudgetYearThree": {
                            "val": "6.482"
                        },
                        "BudgetYearFour": {
                            "val": "8.143"
                        },
                        "BudgetYearFive": {
                            "val": "8.143"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Funding in this project supports the Army's Cross Functional Teams' (CFT) initiatives.  This Project supports efforts to evaluate integrated technologies and representative or prototype systems that help expedite Personal Protective Equipment (PPE) technology transition from the laboratory to operational use.  This project will transition capabilities from our Science and Technology partners to increase performance and safety of Soldier clothing and protective equipment.  It will continue to support cross-service initiatives to increase commonality."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier Protective Equipment (SPE)"
                                    },
                                    "Description": {
                                        "val": "Effort to increase Warfighter survivability and mobility by optimizing Soldier protection while effectively managing all life cycle aspects of Personal Protective Equipment (PPE)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.828"
                                            },
                                            "Text": {
                                                "val": "Continued Technology\/Maturation and Risk Reduction efforts across the PPE portfolio to support the Soldier Protection System (SPS) requirements for lighter-weight ballistic materials with improved performance and manufacturing\/testing process improvements. Initiated proof-of-principle demonstrations on promising new and advanced materials, and in simulated and instrumented field exercises, evaluate upgrades and inform stakeholders of new operational capabilities. Continued efforts to characterize and increase durability, shelf life, and functional service life of existing personal protective systems at the subsystem\/component level. Continued the development of improved measurement processes for existing systems and emerging requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.836"
                                            },
                                            "Text": {
                                                "val": "This project executing at a reduced level of effort from FY19, will continue Technology\/Maturation and Risk Reduction efforts across the PPE portfolio: Torso and Extremity Protection (TEP); Vital Torso Protection (VTP); Integrated Head Protection System (IHPS); and Transition Combat Eye Protection (TCEP) to support SPS requirements for lighter-weight ballistic materials with improved performance and manufacturing\/ testing process improvements. As new materials are ready, the Product Management Office will evaluate upgrades and inform stakeholders of new operational capabilities and then incorporate them into SPS designs as appropriate. Continue efforts to characterize and increase durability, shelf life, and functional service life of existing personal protective systems at the subsystem\/component level. Continue the development of improved measurement processes for existing systems and emerging requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.441"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.441"
                                            },
                                            "Text": {
                                                "val": "Project will continue Technology\/Maturation and Risk Reduction efforts across the PPE portfolio: Torso and Extremity Protection (TEP); Vital Torso Protection (VTP); Integrated Head Protection System (IHPS); and Military Combat Eye Protection (MCEP) to support SPS requirements for lighter-weight ballistic materials with improved performance and manufacturing\/ testing process improvements. If new materials are ready, the Product Management Office will evaluate upgrades and inform stakeholders of new operational capabilities and then incorporate them into SPS designs as appropriate. Continue efforts to characterize and increase durability, shelf life, and functional service life of existing personal protective systems at the subsystem\/component level. Continue the development of improved measurement processes for existing systems and emerging requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change in Soldier Protective Equipment portfolio is due to anticipated requirement changes in FY 2020 and FY 2021 that result in a increase level of effort to address emerging threats."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "VS5"
                                    },
                                    "Title": {
                                        "val": "Soldier Protective Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.667"
                                        },
                                        "CurrentYear": {
                                            "val": "6.627"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.319"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.319"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.656"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.48"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.498"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.063"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "56.310"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "121017"
                                    },
                                    "Title": {
                                        "val": "Central Issue Facilities\/Initial Issue: Organization\/Clothing\/Equipment"
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Programs pursue technology transition from science and technology, maturation, and prototype development, culminating in the transition of mature technologies (Technology Readiness Levels (TRL) 6-7) to Engineering and Manufacturing Development. This Project continues to exercise competitively awarded contracts using best value source selection procedures where applicable."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM SPIE Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.212"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.934"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.4"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.782"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.782"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Dev\/Sys Engineering Spt"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.502"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.4"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.75"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.5"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.5"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dev\/Integ Contracts"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "60.168"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "17.609"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.509"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.509"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2019 FFRDC \/ SBIR \/ STTR"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.308"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.308"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Misc Support Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.757"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.664"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.2"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Ballistic\/Blast\/Nonballistic Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.782"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.913"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.486"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.65"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.65"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "4_VS4_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "SPS Technology Upgrade Insertion"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TCEP Authorized Protective Eyewear (APEL) Update"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "VTP LRIP Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "VTP FRP Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "VTP Technology Upgrade Insertion"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TEP Technology Upgrade Insertion"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Helmet Technology Upgrade Insertion"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Next Gen IHPS Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Next Gen IHPS Deliveries"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MCEP Improvement"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}