{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-855515f7cbe1443b1cc76e32ff869263061a887974718017fcc8f688288c6578-80",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605797D8Z"
        },
        "ProgramElementTitle": {
            "val": "Maintaining Technology Advantage"
        },
        "R1LineNumber": {
            "val": "168"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "20.936"
            },
            "BudgetYearOne": {
                "val": "29.566"
            },
            "BudgetYearOneBase": {
                "val": "29.566"
            },
            "BudgetYearTwo": {
                "val": "29.149"
            },
            "BudgetYearThree": {
                "val": "29.379"
            },
            "BudgetYearFour": {
                "val": "29.772"
            },
            "BudgetYearFive": {
                "val": "30.174"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "This continuity of effort is being transferred from the Defense Technical Analysis PE 0605798D8Z and the Systems Engineering PE 0605142D8Z beginning in FY 2020 to more appropriately align the efforts within the current Office of the Under Secretary of Defense for Research and Engineering (OUSD(R&E)) organization."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element provides funding to support efforts to maintain DoD's technology advantage.  The targeting of U.S. capabilities by our strategic competitors create the potential to degrade core U.S. military technological advantages through unwanted technology transfer.  The technology transfer, primarily unclassified technology, threatens DoD's ability to maintain the technology advantage required to support the lethality and survivability of the Joint Force.  DoD is executing a campaign plan to maintain DoD's technology advantage.  First, DoD is promoting strategic technology investment to provide DoD access to new and innovative technology.  These investments are required to create breakthroughs in key areas of basic research, foster transition and decrease time to market of applied research to economically viable companies, and harvest U.S. innovation or with likeminded allies.  \n\nSecondly, DoD must ensure its strategic technology investments are protected against unwanted technology transfer by developing and maintaining the tools and techniques that enable the U.S. engage in technology transfer at the time, place, and parties of our choosing.  \n\nThirdly, DoD must combat adversaries' attempts to thwart U.S. technology security mechanisms to control technology transfer.  The Department will support these three efforts by developing the appropriate suite of analytic tools, a data acquisition strategy, and utilize program protection activities to address the threat over the long term.  Program Protection Planning includes protection of critical program information, critical components and mission functions, and integrates high level security policies and practical expertise to specific RDA practices, systems engineering activities, and risk reduction activities.  Through this initiative the Department is maturing system security engineering methodologies to protect controlled unclassified information, to include controlled technical information on contractor networks; improve mitigation of supply chain risk management risks, improve integration of cybersecurity into the engineering processes, mature processes to identify Critical Program Information integration of defense exportability features and improve program protection planning."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "19.936"
                },
                "BudgetYearOne": {
                    "val": "19.748"
                },
                "BudgetYearOneBase": {
                    "val": "19.748"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "20.936"
                },
                "BudgetYearOne": {
                    "val": "29.566"
                },
                "BudgetYearOneBase": {
                    "val": "29.566"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "1.000"
                },
                "BudgetYearOne": {
                    "val": "9.818"
                },
                "BudgetYearOneBase": {
                    "val": "9.818"
                }
            },
            "AdjustmentDetails": {
                "CongressionalRescissions": {
                    "CurrentYear": {
                        "val": "-2.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "3.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.162"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.162"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Internal Re-alignment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "10.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "10.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.020"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.020"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "This continuity of effort is being transferred from the Defense Technical Analysis PE 0605798D8Z and the Systems Engineering PE 0605142D8Z beginning in FY 2020 to more appropriately align the efforts within the current OUSD(R&E) organization.\n\nFY 2020:\n-$2.000 million decease for excess growth\n$3.000 million increase for Securing American Science and Technology\n\nFY 2021 Internal Realignment for Higher Priorities includes:\n$10.000 million adjustment to support DoD priorities"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "138"
                    },
                    "ProjectTitle": {
                        "val": "S&T Protection"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "10.344"
                        },
                        "BudgetYearOne": {
                            "val": "9.345"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.345"
                        },
                        "BudgetYearTwo": {
                            "val": "7.210"
                        },
                        "BudgetYearThree": {
                            "val": "7.005"
                        },
                        "BudgetYearFour": {
                            "val": "7.228"
                        },
                        "BudgetYearFive": {
                            "val": "7.406"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "As the Department develops advanced technologies, it must use a rigorous, repeatable methodology to protect technology advantage beyond current Program Protection Planning policy. The production of Technology Area Protection Plans (TAPPs) will generate consistent and balanced protection of critical technology, provide foundational guidance for communicating about the technology to particular audiences, and inform protection and controls for the technology. This will encompass the lifecycle of basic and applied research, advanced technology development, prototyping, and technology transition to programs.  The Department will establish policy to protect critical technology in S&T investments through program protection. The implementation of these policies and TAPPs will have broad impacts across DoD and interagency-wide activities associated with critical technologies, including export controls, Committee on Foreign Investment in the United States (CFIUS) mitigations, Foreign Investment Risk Review Modernization Act (FIRRMA) decisions, international agreements, counterintelligence and law enforcement priorities, and development of protection practices with DoD research performers (e.g., DoD and national laboratories, academia, small businesses, and the broader innovation base)."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Securing American Science and Technology"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "3.000"
                                        },
                                        "Text": {
                                            "val": "This FY 2020 congressional add:\n- Initiates engagement with Academic community and development of education and training activities for S&T Protection. \n- Initiates S&T protection policy review.\n- Initiates assessments of potential consequences that any proposed practices would have on international collaboration and United States leadership in science and technology."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Science and Technology (S&T) Protection"
                                    },
                                    "Description": {
                                        "val": "This project supports efforts to maintain DoD’s technology advantage by establishing activities to promote and ensure accountability for mitigating adversary exploitation of technologies critical to national security objectives.  This project will develop and oversee S&T policy and practices for informed horizontal protection of emerging and critical technology areas."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.344"
                                            },
                                            "Text": {
                                                "val": "The program continues to collect and integrate proactive protection efforts focused on the S&T community. \n\n- Generates Technology Area Protection Plan (TAPP) framework, develops communication procedures, and initiates data gathering for modernization initiatives and critical technology areas.\n- Develops\/updates Controlled Technical Information (CTI) threshold determinations to inform grants, OTAs, contracted activities.\n- Initiates consistent, horizontal security classification in each modernization initiative\/critical technology areas by developing and maintaining a single Security Classification Guide for each modernization initiative\/technology area.\n- Initiates S&T protection curriculum development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.345"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.345"
                                            },
                                            "Text": {
                                                "val": "The program will continue efforts to address S&T protection activities:\n- Establish\/oversee S&T protection policy guidance.\n- Produce, deploy and maintain TAPPs for each modernization initiative\/critical technology area.\n- Deliver\/deploy S&T protection curriculum to S&T\/Acq program and Protection (IC\/CI\/Security) work force.\n- Engage Universities, UARCs, DoD Laboratories and develop\/deploy tailored S&T protection practices and lessons learned."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is decreases in FY 2020 due to congressional reduction.  Level of effort remains consistent starting in FY 2021."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "139"
                    },
                    "ProjectTitle": {
                        "val": "Joint Acquisition Protection Exploitation Cell (JAPEC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "5.592"
                        },
                        "BudgetYearOne": {
                            "val": "7.157"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.157"
                        },
                        "BudgetYearTwo": {
                            "val": "7.295"
                        },
                        "BudgetYearThree": {
                            "val": "7.400"
                        },
                        "BudgetYearFour": {
                            "val": "7.548"
                        },
                        "BudgetYearFive": {
                            "val": "7.671"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "DoD established a joint analysis capability (Joint Acquisition Program and Exploitation Cell (JAPEC)) to conduct comprehensive assessments of controlled unclassified technical information losses, and engage acquisition and intelligence sources, to determine consequences and appropriate preventative\/mitigation actions.  The JAPEC requires the ability to detect and characterize past technology losses, conduct damage assessments of lost information, and provide various insights with predictive value. Together with supporting organizations, the JAPEC enables comprehensive, detailed assessments of U.S. military technological vulnerability, as well as inform the development and application of effective policies, countermeasures, and enforcement actions to preserve U.S. technical superiority in all warfighting domains.\n\nJAPEC, and supporting organizations, require an analytic capability to synchronize, integrate, coordinate and inform DoD efforts in order to protect the acquisition and investment in sensitive U.S. technologies from adversaries and better exploit opportunities to deter, deny and disrupt adversary activities. JAPEC will conduct trend analysis of protection efforts for the Department's critical acquisition programs and technologies, incorporate findings into protection processes and activities, and analyze losses, to determine consequences and appropriate requirements, acquisition, programmatic, and strategic courses of action to include deterring our strategic competitors and identifying opportunities to promote our innovation base."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Acquisition Protection Exploitation Cell (JAPEC)"
                                    },
                                    "Description": {
                                        "val": "Integrate controlled unclassified information, to include Controlled Technical Information (CTI) protection efforts across DoD to proactively mitigate losses and exploit opportunities to deter, deny, and disrupt adversaries that may threaten U.S. military advantage."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.592"
                                            },
                                            "Text": {
                                                "val": "- Identify critical acquisition programs and technologies requiring elevated protection.\n- Support proactive protection actions for critical programs and technologies.\n- Support specialized protection activities to combat strategic competitor illicit transfer of technology.\n- Provide protection analysis in support of international partner agreements\n- Identify threats and recommend advanced protection mechanisms within and across DoD programs\/technologies.\n- Support assessment of vulnerabilities associated with known losses.\n- Support specialized protection activities to combat strategic competitor illicit transfer of technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.157"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.157"
                                            },
                                            "Text": {
                                                "val": "- Partner and develop international (bilateral\/multilateral) protection practices with select allies.\n- Develop and coordinate operationalization of critical program and technology enhanced protection.\n- Scale National Cyber Incident Joint Task Force (NCIJTF)\/MDCO\/national law enforcement to provide targeted engagements.\n- Develop and implement uniform Critical Program Information (CPI) Identification and Protection.\n- Scale specialized protection activities to combat strategic competitor illicit transfer of technology."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort increase reflects DoD priority to identify and scale specialized protection activities to combat strategic competitor illicit transfer of technology."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "158"
                    },
                    "ProjectTitle": {
                        "val": "Program and Technology Protection"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "5.000"
                        },
                        "BudgetYearOne": {
                            "val": "6.354"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.354"
                        },
                        "BudgetYearTwo": {
                            "val": "6.480"
                        },
                        "BudgetYearThree": {
                            "val": "6.361"
                        },
                        "BudgetYearFour": {
                            "val": "4.996"
                        },
                        "BudgetYearFive": {
                            "val": "5.097"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department of Defense (DoD) must address cybersecurity and supply chain risks to DoD networks, weapons systems, and information stored and processed on both DoD and Defense Industrial Base (DIB) unclassified contractor information networks that support DoD programs.  Increased reliance on the internet as a vehicle for sharing information, globalization of the supply chain, and advanced persistent threats (APTs) that can evade commercially available security tools and defeat generic security best practices, drives the need for diligent program protection planning and execution.  Program Protection Planning includes protection of classified and unclassified controlled technical information, critical program information, critical components and critical mission functions, and integrates high level security policies and practical expertise to specific acquisition and S&T practices, systems engineering activities, and risk reduction activities.  Through this initiative the Department is maturing system security engineering methodologies to protect controlled unclassified information, to include controlled technical information on contractor information networks; improve mitigation and management of supply chain risk management risks, improve integration of cybersecurity into the engineering processes, improve software assurance practices, mature processes to identify and protect Critical Program Information and improve program protection planning.  Activities carried out, support implementation of DoD Instruction 5200.44 Trusted Systems and Networks with the use of proven mitigation techniques and tools, the ongoing refinement of risk management processes, and creation of needed technology; implementation of DoD Instruction 5200.39  Critical Program Information (CPI) Identification and Protection Within Research, Development, Test, and Evaluation (RDT&E) to identify and protect Critical Program Information; and implementation of DoD Instruction 8582.01 Security of Unclassified DoD Information on Non-DoD Information Systems for Safeguarding Controlled Unclassified Information on contractor owned networks."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program and Technology Protection"
                                    },
                                    "Description": {
                                        "val": "The project provides system security engineering policy, guidance and objective assessments to reduce risks in sharing and storing Controlled Technical Information, improve mitigation of supply chain risk management risks, improve integration of cybersecurity into the engineering processes, integrate defense exportability and anti-tamper practices, mature processes to identify Critical Program Information and improve program protection planning.  Activities carried out support implementation of DoD Instruction 5200.44 Trusted Systems and Networks with the use of proven mitigation techniques and tools, the ongoing refinement of risk management processes; implementation of DoD Instruction 5200.39  Critical Program Information (CPI) Identification and Protection Within Research, Development, Test, and Evaluation (RDT&E) to identify and protect Critical Program Information; and implementation of DoD Instruction 8582.01 Security of Unclassified DoD Information on Non-DoD Information Systems for Safeguarding Controlled Unclassified Information on contractor owned networks."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Provide support to Independent Technical Review Assessment and Cyber Vulnerability Review Assessment teams in conduct of broad program protection planning activities to assess:\n   - Conduct of criticality analyses to determine capability, systems and technology vulnerabilities.\n   - Conduct of Critical Program Information analysis to determine capability, systems and technology anti-tamper protections.\n   - Conduct Program Protection planning activities, and track progress to verify protection of capability, systems and technologies. \n• Advance the state of the practice of systems security engineering:\n   - Continue development of methodology to identify and mitigate system security risk, to include cybersecurity and supply chain risk.\n   - Continue to develop courseware, refine guidance, provide training, and outreach with government and industry.\n- Refine guidance, tools and mitigation approaches to mitigate capability, system and technology risks.\n• Safeguard Controlled Unclassified Information, including Controlled Technical Information:\n   -  Refine implementation and guidance of marking and dissemination of distribution of technical information.\n   -  Refine safeguarding information protection methods for contractor unclassified information networks.\n• Safeguard Critical Program Information:\n   -  Refine implementation, guidance and tools to identify Critical Program Information.\n   -  Develop and refine Anti-Tamper protections methods to safeguard Critical Program Information. \n• Defense exportability features integration:\n   -  Mature processes, methods and guidance for defense exportability features integration.\n   - Develop and refine defense exportability protection methods to improve planning for the exportability of U.S. Defense systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.354"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.354"
                                            },
                                            "Text": {
                                                "val": "Continue to:\nProvide support to Independent Technical Review Assessment and Cyber Vulnerability Review Assessment teams in conduct of broad program protection planning activities to assess:\n   - Conduct of criticality analyses to determine capability, systems and technology vulnerabilities.\n   - Conduct of Critical Program Information analysis to determine capability, systems and technology anti-tamper protections.\n   - Conduct Program Protection planning activities, and track progress to verify protection of capability, systems and technologies. \n• Advance the state of the practice of systems security engineering:\n   - Continue development of methodology to identify and mitigate system security risk, to include cybersecurity and supply chain risk.\n   - Continue to develop courseware, refine guidance, provide training, and outreach with government and industry.\n- Refine guidance, tools and mitigation approaches to mitigate capability, system and technology risks.\n• Safeguard Controlled Unclassified Information, including Controlled Technical Information:\n   -  Refine implementation and guidance of marking and dissemination of distribution of technical information.\n   -  Refine safeguarding information protection methods for contractor unclassified information networks.\n• Safeguard Critical Program Information:\n   -  Refine implementation, guidance and tools to identify Critical Program Information.\n   -  Develop and refine Anti-Tamper protections methods to safeguard Critical Program Information. \n• Defense exportability features integration:\n   -  Mature processes, methods and guidance for defense exportability features integration.\n   - Develop and refine defense exportability protection methods to improve planning for the exportability of U.S. Defense systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort increase reflects DoD priority to identify Cyber resiliency standards to engineer secure, resilient, survivable weapon systems in response to contested cyberspace and to conduct ITRA Program Protection\/Cyber assessments."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "043"
                    },
                    "ProjectTitle": {
                        "val": "Technology Innovation Base"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "6.710"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.710"
                        },
                        "BudgetYearTwo": {
                            "val": "8.164"
                        },
                        "BudgetYearThree": {
                            "val": "8.613"
                        },
                        "BudgetYearFour": {
                            "val": "10.000"
                        },
                        "BudgetYearFive": {
                            "val": "10.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Technology Innovation Base (TIB) effort develops long-term strategies and employs mechanisms to retain the U.S. advantage in current and emerging modernization technology priorities and the innovation base developing, testing, manufacturing, and sustaining them.  This project provides support to technology priority leaders in identifying innovation base needs; characterizing and assessing priority technology areas, identifying and mitigating risks impacting the innovation base, and exploiting opportunities to advance technology development, testing, and manufacturing.  One of TIB’s main objectives is to create balance between promotion of the innovation base while protecting the technology from interference or exploitation by competitors..  This balance will aid the Department’s advancing critical and emergent technologies ahead of competitor nations and actors while sustaining a healthy, resilient, and globally competitive innovation base.  This portfolio of activity extends efforts initiated in response to FY19 NDAA Section 1793.\n\nThis project uses a three-step approach: (1) Assess, (2) Protect\/Promote; and (3) Monitor.  In the first step, TIB uses emerging technology assessments to translate technology requirements to manufacturing and innovation base requirements in order to identify innovation base issues, risks, and opportunities.  TIB created an assessment methodology that incorporates four types of studies to provide a full overview of the technology from a manufacturing and innovation base point of view.  The results of the assessments are used to create technology and innovation base protection and promotion strategies (second step of the approach). TIB leverages DoD and Federal Government tools and initiatives to implement the strategies.   In the third step, TIB uses data analytics to measure the success of mitigation and exploitation strategies, establish trends in the markets, and identify the need for additional assessments or changes in the strategies.  For technology protection, TIB manages the OUSD(R&E) responsibilities for the Committee on Foreign Investment in the United States (CFIUS) reviews.  TIB does the initial screening of all CFIUS cases to determine R&E equities and request R&E subject matter experts review in foreign acquisition transactions with a potential negative impact to national security.  TIB is the focal point for all R&E stakeholders and the link between the organization and the rest of the DoD stakeholders."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Technology Innovation Base"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.710"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.710"
                                            },
                                            "Text": {
                                                "val": "• Create and implement short-term and long-term strategies to protect and maintain U.S. technology advantage by growing and retaining critical technologies and the innovation base supporting their development, test, manufacturing, and sustainment. \n• Assess, promote, protect, and monitor critical technologies and their supply chain.\n• Manage technology innovation base assessments performed by other DoD and USG Agencies, Federally Funded Research and Development Centers (FFRDCs), University Affiliated Research Center (UARCs), or industry.\n• Conduct deep dive studies to identify and address national security innovation base risks,issues, and opportunities related to DoDto include but not limited to:\n  - Tools, technologies or techniques associated with development, testing, or manufacturing\n  - Financial health of key industrial partners and suppliers\n  - Workforce need for scientists, engineers, technicians\n  - Sensitivies to single source materials, critical pockets of expertise, impacts to environmental events, exploitation by foreign actors to secure or deter critical elements of the innovation base\n• Manage R&E Committee on Foreign Investment in U.S. transaction reviews.\n• Monitor the defense innovation base and the performance of the protect\/promote activities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increase reflects DoD priority to identify and address new, emerging manufacturing capabilities and technology base gaps that are critical to fielding modernization priorities, including workforce, engineering and prototyping infrastructure and facilities."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}