{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-9035d21372bc28631c31031b85da2fbd962d290bf8d6ca6eecbc49021508de49-47",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604294D8Z"
        },
        "ProgramElementTitle": {
            "val": "Trusted and Assured Microelectronics"
        },
        "R1LineNumber": {
            "val": "100"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "147.481"
            },
            "PriorYear": {
                "val": "517.356"
            },
            "CurrentYear": {
                "val": "547.421"
            },
            "BudgetYearOne": {
                "val": "489.076"
            },
            "BudgetYearOneBase": {
                "val": "489.076"
            },
            "BudgetYearTwo": {
                "val": "519.140"
            },
            "BudgetYearThree": {
                "val": "344.311"
            },
            "BudgetYearFour": {
                "val": "250.567"
            },
            "BudgetYearFive": {
                "val": "255.659"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) supports microelectronics modernization activities that enable defense systems to keep pace with commercial microelectronics technological advances, reduce reliance on obsolete microelectronics, and mitigate the Department’s reliance on sole source foundries for assured state-of-the-art (SOTA) microelectronics.  It addresses the challenges of 1) having enduring access to a multiplicity of modern manufacturing processes that require commercial volumes to maintain long term viability and 2) protecting the intellectual property (IP) of the microelectronic parts that are manufactured.\n\nThis PE supports the 2018 National Defense Strategy’s (NDS) line of effort to build a more lethal force through modernization of key capabilities, the NDS defense objective of establishing an unmatched twenty-first century National Security Innovation Base that effectively supports Department operations and sustains security and solvency, and the NDS strategic approach of reforming the Department’s business practices by simultaneously increasing performance and affordability while still minimizing risk.\n\nThis PE supports the OUSD(R&E) Microelectronics Modernization Roadmap.  The primary areas of focus of this roadmap include the following:  access to advanced packaging and test; quantifiable assurance and secure design; foundry access; verification and validation; policies, standards, and Joint Federated Assurance Center (JFAC) governing body; access to radiation hardened microelectronics; access to non-complementary metal oxide semiconductor (CMOS) state-of-the-art (SOTA) microelectronics; disruptive research and development; education and workforce development; trusted foundry and obsolescence; and supply chain awareness and security.\n\nRecognizing that an assured supply of microelectronics is a U.S. Government (USG)-wide concern, this activity will interface with interagency partners to take into account interagency requirements, opportunities for collaboration, and strategic decisions that can be made to limit the overall cost of these requirements to the USG. \n\nThis activity is being led by the Under Secretary of Defense for Research and Engineering."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "522.950"
                },
                "CurrentYear": {
                    "val": "542.421"
                },
                "BudgetYearOne": {
                    "val": "232.447"
                },
                "BudgetYearOneBase": {
                    "val": "232.447"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "517.356"
                },
                "CurrentYear": {
                    "val": "547.421"
                },
                "BudgetYearOne": {
                    "val": "489.076"
                },
                "BudgetYearOneBase": {
                    "val": "489.076"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.594"
                },
                "CurrentYear": {
                    "val": "5.000"
                },
                "BudgetYearOne": {
                    "val": "256.629"
                },
                "BudgetYearOneBase": {
                    "val": "256.629"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "5.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-5.503"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.091"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.899"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.899"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.222"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.222"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Increase for Access to SOTA Quantifiably Assured Microelectronics"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "258.750"
                                },
                                "BudgetYearOneBase": {
                                    "val": "258.750"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY 2021 Program Element (PE) funding for Project 291 – “Joint Federated Assurance Center”, Project 645 – “Verification and Validation Capabilities and Standards for Trust”, Project 646 – “New Trust Approach Development”, and Project 647 -“Microelectronics Innovation for National Security and Economic Competitiveness (MINSEC)” will realign under four new project codes to correctly align PE funding in support of a zero-trust philosophy and reflective of current priorities. The new project codes are:  (1) P907 Access to State-of-the-Art (SOTA) Microelectronics - Development; (2) P908 Access to Advanced Packaging and Testing - Development; (3) P911 Address DoD Unique Needs Especially Radiation Hardening - Development; and (4) P912 Create a Resilient and Robust Microelectronics Pipeline - Development.\n\nProject codes P291, P645, P646, and P647 are being realigned in FY 2021 to the four new project codes to refocus the PE and provide traceability to the current enhancement priorities of SOTA access, heterogeneous packaging, quantifiable assurance, DoD unique needs, and enhanced U.S. microelectronics dominance.\n\nFY 2019 funding in the amount of $291.000 million was added by Congress to support acceleration efforts for MINSEC, Joint Federated Assurance Center (JFAC), and strategic radiation-hardening activities.  In FY 2020, $302.000 million was added to accelerate activities for providing access and assurance to domestic SOTA and advanced packaging microelectronics production capabilities under Project 647.  FY 2020 funding in the amount of $5.000 million was added by Congress to support supply chain risk management (SCRM) efforts under Project 645."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "291"
                    },
                    "ProjectTitle": {
                        "val": "Joint Federated Assurance Center"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "12.000"
                        },
                        "CurrentYear": {
                            "val": "5.887"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds the operation software and hardware assurance(SwA and HwA) support to DoD programs and organizations of the Joint Federated Assurance Center (JFAC), established in National Defense Authorization Act (NDAA) Sec 937, to increase DoD’s SwA and HwA by providing engineering tools, technical services, best-practices, innovative technologies and other assistance to programs to detect, assess, prioritize, and mitigate vulnerabilities from malicious software and hardware attacks and assurance against supply chain exploitation vulnerabilities.  The JFAC will provide capabilities for programs to keep assessment findings throughout the life cycle of their systems for data mining (e.g., documentation on rationale for previous mitigation decisions).  The collaboration between the JFAC and program offices will help mitigate existing and emerging critical threats and vulnerabilities in software and hardware available to all DoD programs."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Joint Federated Assurance Center"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "• Expanded JFAC capabilities to more effectively identify and mitigate software and hardware cyber security vulnerabilities in DoD weapons systems and networks.\n• Enabled JFAC to develop offense-defense interaction analytical capabilities to investigate a variety of threat capabilities and assess resulting system and network vulnerabilities.\n• In a joint Service context, enabled JFAC to conduct advanced scientific research to identify and mitigate cyber threats to software and hardware in DoD weapons systems and networks."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Federated Assurance Center (JFAC)"
                                    },
                                    "Description": {
                                        "val": "This project’s activities will enhance the use of software, hardware, and firmware assurance tools, techniques, and procedures directly with programs and organizations, throughout the life cycle.  JFAC provides a common forum in DoD for assurance best practices, community dialog on assurance, access to new technology and tools usable by programs throughout their life cycle for maintaining quantifiable assurance data."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "• Mature JFAC tools, technology and talent capabilities and capacity. \n• Maintain infrastructure services and staff for the JFAC-CC, enabling the centralized assurance repository, assurance contract language, metrics, SwA tool license distribution, help-desk, and hard problem analysis and provide to all DoD programs and organizations at no cost.\n• Incorporate S&T, DARPA, IARPA, DIU, and SEI products into the JFAC website for direct access by programs.\n• Develop best practices, and relationships with industry."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.887"
                                            },
                                            "Text": {
                                                "val": "• Maintain JFAC service infrastructure enabling the centralized assurance repository, assurance contract language, metrics, software assurance tool license distribution, help-desk, hard problem analysis for all DoD programs and organizations.\n• Incorporate Science & Technology, Defense Advanced Research Projects Agency, Intelligence Advanced Research Projects Activity, Defense Innovation Unit, and Software Engineering Institute products for direct access by programs.\n• Develop best practices and relationships with industry."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funds transferred from this Project code (Pcode) to the new Pcode for “P907: Access to State-of-the-Art (SOTA) Microelectronics Development”."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "O&M (CIVPAY)"
                                    },
                                    "Title": {
                                        "val": "0303140D8Z"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "1.113"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Joint Federated Assurance Center"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army, Navy, Air Force"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "12.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.887"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Joint Federated Assurance Center"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Mature JFAC tools, technology and talent capabilities and capacity"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Maintain infrastructure services and staff"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Incorporate science and technology, advanced technology solutions into the JFAC website"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Develop best practices, and relationships with industry"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "645"
                    },
                    "ProjectTitle": {
                        "val": "Verification & Validation (V&V) Capabilities and Standards for Trust"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "147.481"
                        },
                        "PriorYear": {
                            "val": "41.355"
                        },
                        "CurrentYear": {
                            "val": "44.117"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project improves microelectronics test and verification methodologies in support of quantifying and verifying the trust and assurance of parts and develops standards and practices to foster commercial development of secure, trusted and assured parts.  Verification and test technologies are required to provide direct program support for microelectronics assurance verification.  Out-year demands will require an increase in capacity, which will take the form of additional personnel and\/or equipment to permit scaling of microelectronics assessment capabilities.  Challenges have been identified, to include the ability to analyze leading-edge technology nodes (<32 nanometers (nm)), throughput\/time required for analysis, ability to analyze third-party intellectual property (IP) contained in microelectronic components, and analysis of non-application specific integrated circuit (ASIC) components that are increasingly being used for agility, e.g., Field-Programmable Gate Arrays (FPGAs).  This project addresses these gaps in current technical capabilities as required to meet the realized and projected out-year demand for core Trusted & Assured Microelectronics laboratory services.  Three capability areas core to microelectronics analysis and verification will be improved:\n\n• Physical verification, i.e., destructive analysis of integrated circuits and printed circuit boards. \n• Functional analysis, i.e., non-destructive screening\/verification of select, critical parts.\n• Design verification, i.e., verification\/assurance of designs, IP, netlists, bitstreams, firmware, etc.\n\nThese improvements address two primary attributes: (1) technical capability including laboratory equipment, IP, analysis tools, such as imaging software, and highly skilled tradecraft, and (2) the capacity to perform microelectronics assessments and quantify assurance.\n\nThis project develops and matures assurance mitigations, quantitatively evaluates the effectiveness of protections of IP in support of confidentiality and integrity, and develops and validates obfuscation and disaggregation technologies.  The project will address physical validation tool and capability development, design software validation tool development, counterfeit detection and imaging techniques, system vulnerability assessments, testbeds, and distributed data source availability to demonstrate and operationalize full lifecycle data driven quantifiable assurance.\n\nThis project also develops standards and practices in support of assured designs, supply chains and formal relationships with industry."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Supply Chain Risk Management"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "•  Align DoD Instruction 5200.44 (Protection of Mission Critical Functions to Achieve Trusted Systems and Networks (TSN)), and other related policies and guidance, with other USG, e.g., National Institute of Standards and Technology (NIST) 800-161 (Supply Chain Risk Management Practices for Federal Information Systems and Organizations).\n•  Develop industry standards identifying and addressing gaps in definition and criteria, and establish accepted levels of supplier and part assurance and operational security per FY 2020 NDAA committee report Section 224."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Verification & Validation (V&V) Capabilities and Standards for Trust"
                                    },
                                    "Description": {
                                        "val": "The JFAC DoD core Trusted and Assured Microelectronics (T&AM) laboratories and industry partners will (1) improve microelectronics test and verification methodologies in support of data driven verification of confidentiality, integrity, and authenticity of parts and (2) develop standards\/practices to foster commercial development of quantifiably assured parts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "41.355"
                                            },
                                            "Text": {
                                                "val": "Verification and test technologies activities will include:\n• Improvements to the core JFAC’s (1) technical capability, through the procurement of laboratory equipment, IP, analysis tools, such as imaging software, and highly skilled tradecraft, and (2) capacity to perform microelectronics assessments.  FY 2019 and out-year demands will require an increase in capacity supporting weapon system program engagement, which will take the form of additional personnel and\/or equipment to permit scaling of assessment capabilities.\n• Testing in support of radiation hardened by design (RHBD) and radiation hardened by process (RHBP) initiatives.\n• Strategic radiation hardened electronics council (SRHEC) coordination.\n• Strategic radiation support of radio frequency and optoelectronic devices. \n• Enhancement of automation and standard processes needed to increase the throughput of information produced by individual JFAC laboratory tools as well as to facilitate information sharing across the families of tools used for analysis and testing.\n• Research into qualification concerns regarding strategic radiation hardened parts from state of the art (SOTA) and state of the practice (SOTP) foundries.\n• Development of common subject matter expert (SME) training and protocols based on the existing tool base, to include both commercial and USG-developed tools.\n• Funding for additional SME support in each core laboratory in support of the microelectronics trust verification and other JFAC-related work.\n• Increased direct program support focused on addressing technical gaps and assurance-related findings.\n\nStandards and practices activities will include:\n• Development of standards and best practices, and relationships with industry, to foster commercial development of secure, trusted and assured parts.\n• Establishment of formal relationships with FPGA vendors and other key commercial suppliers to improve device and IP security.\n• Acquisition of USG access to proprietary designs, software, development, and quality assurance processes and test procedures to develop design practices that minimize security flaws and facilitate verification. \n• Establishment of USG and industry working groups to develop test procedures to validate the assurance of designs.\n• Documentation and promulgation of security-enhancing design practices across the USG, industry, and academia.\n• Development of industry-wide standards and practices to establish a common understanding of what constitutes assured hardware, software, and firmware at both the component and system level.\n• Development of a common lexicon for secure hardware, software, and firmware in collaboration with the Committee for National Security Systems, National Institute of Standards and Technology, and the broader USG, industry, and academia.\n• Definition of supply chain controls for assured chain of custody for critical and other microelectronics devices and IP.\n• Development of security training and education of USG and industry system security engineers and material managers on supply chain and life-cycle management best practices using agreed-upon language, standards, and practices.\n• Alignment of DoD Instruction 5200.44 (Protection of Mission Critical Functions to Achieve Trusted Systems and Networks (TSN)), and other related policies and guidance, with other USG, e.g., National Institute of Standards and Technology (NIST) 800-161 (Supply Chain Risk Management Practices for Federal Information Systems and Organizations), and industry standards identifying and addressing gaps in definition and criteria and establishing accepted levels of supplier and part assurance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "39.117"
                                            },
                                            "Text": {
                                                "val": "Continuation of FY 2019 verification and test technologies activities including:\n• Improvements to core laboratories (1) technical capability, through the procurement of equipment, intellectual property (IP), analysis tools, such as imaging software, and highly skilled tradecraft, and (2) capacity to perform microelectronics assessments.  FY 2019 and out-year demands will require an increase in capacity supporting weapon system program engagement, which will take the form of additional personnel and\/or equipment to permit scaling of assessment capabilities.\n• Testing in support of radiation hardened by design (RHBD) and radiation hardened by process (RHBP) initiatives.\n• Enhancement of automation and standard processes needed to increase the throughput of information produced by individual laboratory tools as well as to facilitate information sharing across the families of tools used for analysis and testing.\n• Research into qualification concerns regarding access to DoD unique needs from state-of-the-art (SOTA) and state of the practice (SOTP) foundries.\n• Development of industry standards identifying and addressing gaps in definition and criteria, and establishing accepted levels of supplier and part assurance and operational security per FY 2020 NDAA committee report Section 224. \n\nContinuation of FY 2019 standards and practices activities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project Code (Pcode) 645 funds will transfer from this Pcode to two new Pcodes for “Access to SOTA Microelectronics” and “Create a Resilient and Robust Microelectronics Pipeline” to properly align PE funding in support of the zero-trust philosophy and reflect current priorities.  Total funding between the two years will decrease from $44.117 million to $33.686 million with $31.686 million transferring to Access to SOTA and $2.000 million transferring to Create a Resilient and Robust Microelectronics Pipeline."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "NA"
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "NA"
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "V&V Capabilities and Standards for Trust"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various (Air Force, Army, Navy, National Security Agency)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "147.481"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "41.355"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "44.117"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "V&V Capabilities and Standards for Trust"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Joint Federated Assurance Center (JFAC) Hardware Assurance (HwA) Technical Working Group Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "JFAC Capability Enhancement (equipment and intellectual property procurement)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "JFAC Subject Matter Expert (SME) Training and Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "JFAC Direct Program Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Radiation Training in Support of Radiation Hardened by Design and Radiation Hardened by Process Initiatives"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Strategic Radiation Hardened Electronics council (SRHEC) Coordination"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Strategic Radiation Support of Rapid Fielding Optoelectronic Devices"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Microelectronics Assurance and Supply Chain Standards and Best Practices Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "U.S. Government and Industry Engagement for demonstration of data driven quantifiable assurance tools, techniques, and risk based metrics"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Microelectronics Assurance and Supply Chain Training for U.S. Government and Industry"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Microelectronics Assurance and Supply Chain Policy and Guidance Development\/Update"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Management\/Technical Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "646"
                    },
                    "ProjectTitle": {
                        "val": "New Trust Approach Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "40.023"
                        },
                        "CurrentYear": {
                            "val": "38.247"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds a program of research to develop the next generation, technology data-driven approach to microelectronics assurance, to include state-of-the-art (SOTA) microelectronics, to ensure continued access to SOTA microelectronic technologies while maintaining the required level of assurance in all environments.  DoD’s ability to access commercial technology for its custom, secure, and assured needs is diminishing as SOTA suppliers become fewer and more focused on serving the global commercial market.  DoD’s technology needs are broad, and relying on a single source supplier is not feasible.  Alternative, advanced manufacturing methods, technologies, and design tools are needed to produce secure and assured SOTA parts from commercial sources and to preserve access to these advanced nodes while protecting DoD and Defense Industrial Base intellectual property (IP) from exploitation.  It is also intended to dramatically improve the capabilities of core Trusted & Assured Microelectronics laboratories with regard to verification and validation of SOTA microelectronics assurance.\n\nThis program of research will develop, demonstrate, and implement quantitative and innovative design, manufacturing, imaging, tagging, and control and assessment approaches for protecting DoD’s microelectronics supply chain and IP, including alternatives for trusted and assured strategic radiation-hardened electronics in advanced technology nodes for next-generation strategic systems, obfuscation and disaggregation technology development, and other assurance mitigations.  It will develop, demonstrate, and implement advanced imaging technologies and forensics, Design for Assurance techniques, active hardware assurance controls, electronic component markers, and a data and analysis capability to enable auditing, provenance and traceability, and independent verification and validation of commercial and specialized DoD designs.  It will also develop, demonstrate, and implement concepts for the cost-effective production of custom microelectronics in low volumes and protection of sensitive IP from exploitation.\n\nAssurance technologies that can be applied in a broad range of trusted and commercial environments can mitigate the risk associated with sole-source suppliers and increase the Government’s ability to leverage commercial capabilities.  The suite of developed technologies, e.g., alternative manufacturing methods and design tools, will enable DoD to obfuscate the purpose of sensitive devices, verify their origin and function, and protect sensitive IP from exploitation even while using the global supply chain for most hardware.  In cases in which the risk involved precludes that level of commercial collaboration, low-volume manufacturing technologies developed under this project would permit DoD to more cheaply produce low volumes of sensitive microelectronics in secure environments.  The project would also support using a repository of vetted third-party IP and electronic data automation (EDA) tools to expedite circuit design and transition promising technologies to use.\n\nThis project initially received additional funding in FY 2019 to support Microelectronics Innovation for National Security and Economic Competitiveness (MINSEC) efforts in the following focus areas:  capture and secure microelectronics R&D; new microelectronics development; radiation hardening by process (RHBP) and radiation hardening by design (RHBD); and radio frequency (RF) and optoelectronics.  In FY 2019, funding for those MINSEC activities was reallocated from projects P-646 to P-647."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "New Trust Approach Development"
                                    },
                                    "Description": {
                                        "val": "This project’s activities will mature and evaluate quantifiable assurance technologies and techniques through efforts that may include the conduct of studies and Broad Agency Announcements (BAAs) and other efforts to coordinate research programs across USG R&D organizations, academia, and industry.\n\nIn addition, the core Trusted & Assured Microelectronics laboratories will initiate the conduct of identified acquisition program pilots and technology development in coordination with research programs across government R&D organizations, academia and industry."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "40.023"
                                            },
                                            "Text": {
                                                "val": "This project will engage early on with potential stakeholders to identify potential transition issues and aid in transition through joint collaboration between research teams and stakeholders with a focus on evaluations of prototypes, test articles and beta versions of tools, IP, techniques, methods, etc. and their use in operationally-realistic scenarios.\n\nPrimary efforts will include the following:\n\n• Reducing-to-practice technologies enabling assured (1) design, (2) access, (3) component integrity and (4) IP protection.\n• Assured design demonstration and evaluation.\n• Systems security analysis for assurance of microelectronics in DoD missions.\n• Analog test chip fabrication.\n• Advanced chip interconnection development to eliminate wire bonding and improve functional performance.\n• Printed circuit board (PrCB) design confirmation tool development.\n• Application-specific integrated circuit (ASIC) netlist analysis capability development.\n• Field programmable gate array (FPGA) analyses tool development.\n• Identification of non-invasive measurement techniques at the die\/wafer level to provide increased hardware assurance.\n\nPrimary activities in FY 2019 will continue the development of these technologies, followed by transition of these capabilities to new programs in the fiscal years that follow under PE 0605294D8Z."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "38.247"
                                            },
                                            "Text": {
                                                "val": "• Continuation of FY 2019 activities including the following:\n• Reducing-to-practice technologies enabling assured (1) design, (2) access, (3) component integrity, and (4) intellectual property (IP) protection.\n• Assured design development.\n• Systems security analysis for assurance of microelectronics in DoD missions.\n• Analog test chip fabrication.\n• Advanced chip interconnection development to eliminate wire bonding and improve functional performance.\n• Printed circuit board (PrCB) design confirmation tool development.\n• Application-specific integrated circuit (ASIC) netlist analysis capability development.\n• Field programmable gate array (FPGA) analyses tool development.\n• Identification of non-invasive measurement techniques at the die\/wafer level to provide increased hardware assurance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project Code (Pcode) 646 funds will transfer from this Pcode to the new Pcodes for “Access to State-of-the-Art (SOTA) Microelectronics - Development” to properly align funding in support of the zero-trust philosophy and reflect current enhancement priorities.  Total funding between the two years will decrease from $38.247 million to $32.870 million with $32.870million transferring to Access to SOTA."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "NA"
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "New Trust Approach Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various (Defense Advanced Research Projects Agency, Air Force, Army, Navy, National Security Agency)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "40.023"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "38.247"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "New Trust Approach Development"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Third Party Intellectual Property (IP) and electronic data automation (EDA) tool repository development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Application Specific Integrated Circuit (ASIC) netlist analysis capability development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Field programmable gate array (FPGA) analyses tool development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Microelectronics assurance and supply chain technology maturation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Assured design demonstration and evaluation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "U.S. Government and Industry Engagement for development of data driven quantifiable assurance tools, techniques, and risk based metrics"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Microelectronics assurance and supply chain policy and guidance development\/update"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Management\/Technical Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "647"
                    },
                    "ProjectTitle": {
                        "val": "Microelectronics Innovation for National Security and Economic Competitiveness (MINSEC) Innovation and Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "423.978"
                        },
                        "CurrentYear": {
                            "val": "459.170"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports the DoD microelectronics strategy by ensuring the availability of and access to advanced, assured microelectronics that are critical for DoD and national security systems.  It will support the development and delivery of tools to protect the intellectual property (IP) confidentiality and integrity across the full microelectronics life cycle for a broad range of systems and missions and will provide a path for the production of these articles.  \n\nIt will allow DoD to:\n1) provide multiple options for programs and the defense industrial base to rapidly modernize state-of-the-art (SOTA) microelectronic components; \n2) promote access to all needed current and future semiconductor technologies, including design, fabrication, packaging, and testing, from a robust base of commercially sustainable suppliers;  \n3) maintain technological leadership and a secure domestic microelectronics ecosystem to  create a competitive industrial base of microelectronics suppliers that can rapidly adjust to the dynamics of the industry including the initiation of modernization pilots with DoD programs and industry to prototype and demonstrate new capabilities; and  \n4) provide DoD’s captive specialty needs suppliers and dedicated facilities with cost-effective upgrade capabilities and resources so they can deliver advanced  technologies.\n\nThis project supports a broader national strategy to focus resources, policies, and incentives to enhance current and next generation defense capability by:\n1) maintaining access to U.S. domestic production of SOTA technology;  \n2) enhancing state-of-the-practice (SOTP) foundries in the U.S. to produce more advanced technologies to better serve low-volume customers in the aerospace and defense community; \n3) investing in research and development (R&D) for the next generation of microelectronics for new materials, devices, architectures, and designs in coordination with the Defense Advanced Research Projects Agency (DARPA) Electronics Resurgence Initiative (ERI); \n4) promoting threat awareness, proactive protection, and supply chain security to ensure these investments continue to benefit the U.S.; \n5) exploring incentives for market growth through dual-use technologies, piloting acquisition reforms, partnering with industry, and providing incentives for cooperative R&D and trade; and \n6) establishing innovation hub pilots with industry. \n\nMINSEC activities are categorized into the following focus areas:  access to specialized SOTA and dual use microelectronics technology, collection and analysis of data for metrics driven quantifiable assurance, maintaining and enhancing U.S capability though development, capture and secure, and transition of next generation microelectronics technology insertion; microelectronics-focused workforce development; radiation hardening by process (RHBP) and radiation hardening by design (RHBD); and radio frequency (RF) and optoelectronic (OE) microelectronics. \n\nThis project in FY 2020 funds the following focus areas: SOTA access through secure design, packaging, and enhanced foundry access; development and maturation of commercially viable quantifiable assurance technologies; capture and secure microelectronics R&D; new microelectronics development and capability insertion; RHBP and RHBD; and RF and OE microelectronics."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Next Generation Microelectronics"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "281.000"
                                        },
                                        "Text": {
                                            "val": "This Congressional  Add funding in FY 2019 to supported the following MINSEC activities:\n\n• Development of an advanced technology center for next-generation artificial intelligence systems.\n• Modernization enhancements for 90 nanometer (nm) to 65nm\/45nm radiation-hardened semiconductor fabrication.\n• Provided robust access to advanced node foundry production and R&D processes and fully leverage the multiple domestic R&D facilities for DoD and national needs. \n• Delivered multiple secure design environments into industry, academia, and government to capture intellectual property (IP) and architectures and IP sharing and re-use.\n• Accelerated radiation-hardened processor design.\n• Continued development and expand deployment of a secure cloud environment and secure supply chain life cycle ecosystem."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Microelectronics Innovation for National Security and Economic Competitiveness (MINSEC)"
                                    },
                                    "Description": {
                                        "val": "This project’s activities will mature and evaluate microelectronics access and assurance technologies and techniques through efforts that may include the conduct of studies and Broad Agency Announcements (BAAs) and other efforts to coordinate research programs across USG R&D organizations, academia, and industry."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "142.978"
                                            },
                                            "Text": {
                                                "val": "This project will initiate and support R&D activities in each of the following technical focus areas:\n\n• Capture and secure microelectronics R&D, including support and enhanced manufacturing at SOTP foundries.   \n• New microelectronics development, demonstration, and capability insertion including supporting public\/private co-development of new COTS programmable devices that address USG needs during their development by industry when it is the most cost-effective to do so.\n• RHBP and RHBD including supporting secure design of RHBD IP in all major domestic foundries and fabrication of SOTA test articles for evaluation and qualification. \n• RF and optoelectronics including supporting secure design of IP and access to SOTP government and commercial facilities for RF and optical devices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "459.170"
                                            },
                                            "Text": {
                                                "val": "This project will continue FY 2019 R&D activities in each of the following technical focus areas:\n• Develop secure, accessible and cost effective state-of-the-art (SOTA) heterogeneous integration design, assembly and test capability.  Establish State-of-the-art Heterogeneous Integrated Prototype Packaging sources for SOTA Digital and SOTA radio frequency (RF) applications. \n• Capture and secure microelectronics R&D, including support and enhanced manufacturing at state-of-the-practice (SOTP) foundries.\n• Develop new microelectronics.  Support capability insertion and public\/private co-development of new commercial off the shelf (COTS) programmable devices that address USG needs during their development by industry when it is the most cost-effective to do so.\n• Develop secure radiation hardened by process and radiation hardened by design design intellectual property (IP) in all major domestic foundries and fabrication of SOTA test articles for evaluation and qualification.\n• Develop secure RF and optoelectronic (OE) microelectronics design IP, increased availability of advanced non-complementary metal oxide semiconductor foundry processes, improved access and access to RF and OE SOTP technology and facilities, SOTP government and commercial facilities for RF and OE devices and development of SOTA IP and test articles for next generation next generation advanced sensors and communications.\n\nEstablish partnerships with industry for the following activities:\n• Support joint development of assured fifth-generation (5G) and internet of things (IoT) networks, sensors, processors, accelerators, modems, transceivers, radios, programmable logic, and end-user devices using assured design and fabrication processes; \n• Promote assured access to commercial foundry capabilities and products using assured design and fabrication processes and standards; \n• Jointly develop assured processes and access to domestic assured memory with co-development of processing near-memory architectures and 3D integration for artificial intelligence and vision processing applications; and\n• Pilot a state-of-the-art foundry with new assurance standards and methods to allow processing of U.S. government and critical commercial wafers in an assured commercial flow. \n\nThis project will engage early on with potential stakeholders to identify potential transition issues and aid in transition through joint collaboration between research teams and stakeholders with a focus on evaluations of prototypes, test articles, and beta versions of tools, intellectual property (IP), techniques, methods, etc. and their use in operationally-realistic scenarios.\n\nCommercial Partnerships: Establish partnerships with industry for the following activities:\n• Joint development of assured fifth-generation (5G) and internet of things (IoT) networks, sensors, processors, accelerators, modems, transceivers, radios, programmable logic and end-user devices using assured design and fabrication processes;\n• Assured access to commercial foundry capabilities and products using assured design and fabrication processes and standards; \n• Joint development of assured processes and access to domestic assured memory with co-development of processing near-memory architectures and 3D integration for artificial intelligence and vision processing applications;\n• Assurance pilot with SOTA foundry to adopt new assurance standards and methods to allow processing of U.S. government and critical commercial wafers in an assured commercial flow; and\n• Establish DoD’s ability to safely leverage and to protect commercial mobile wireless systems, including 5G networks."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funds transferred from this Project code (Pcode) Pcode to new Pcodes for “Access to State-of-the-Art (SOTA) Microelectronics Development”, “Access to Advanced Packaging and Test Development”, “Address DoD Unique Needs Especially Radiation Hardening”, and “Create a Resilient and Robust Microelectronics Pipeline” to properly align funding in support of the zero-trust philosophy and reflect current priorities.  Total funding will decrease between the two years from $459.170 million to $415.932 million with $281.594 million transferring to SOTA Access, $81.438 million transferring to Advanced Packaging Access,$50.500 transferring to Unique Needs, and $73.766 million transferring to Create a Resilient and Robust Microelectronics Pipeline."
                                        }
                                    }
                                }
                            ]
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Microelectronics Innovation for National Security and Economic Competitiveness (MINSEC) Innovation and Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Defense Advanced Research Projects Agency, Air Force, Army, Navy, National Security Agency"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "423.978"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "459.170"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "MINSEC Innovation and Development"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Access to state-of-the-art (SOTA) commercial microelectronics technology through design and integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Capture and secure microelectronics lifecycle data and new R&D"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "New microelectronics development, demonstration, and capability insertion"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Radiation hardening by process and radiation hardening by design development activities"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Radio frequency (RF) and optoelectronics development activities"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Government and industry engagement to development and demonstrate of data driven quantifiable assurance and maintain U.S. microelectronics technology dominance"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Microelectronics assurance and supply chain policy and guidance development\/update"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Management\/Technical Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "907"
                    },
                    "ProjectTitle": {
                        "val": "Access to State-of-the-Art (SOTA) Microelectronics - Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "281.594"
                        },
                        "BudgetYearOneBase": {
                            "val": "281.594"
                        },
                        "BudgetYearTwo": {
                            "val": "294.701"
                        },
                        "BudgetYearThree": {
                            "val": "183.024"
                        },
                        "BudgetYearFour": {
                            "val": "120.543"
                        },
                        "BudgetYearFive": {
                            "val": "122.989"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "In 2021, this project incorporates portions of projects P291, P645 and P646.  It will continue Joint Federated Assurance Center (JFAC) strategic partnerships and establish new strategic partnerships with existing commercial state-of-the-art (SOTA) domestic foundries to develop a data-driven, risk-based approach to supply chain protection and develop the assured access, secure design, and manufacture of advanced microelectronics technology and electronic components.\n\nThis project will develop a new data driven quantifiable assurance paradigm for supply chain protection.  It will strengthen security while improving access, exposing no sensitive intellectual property (IP) to the foundry and requiring post-manufacture validation of foundry products. The enhancement will develop quantifiably assured design concepts in manufactured systems, enabling a formal risk-based approach to protection techniques. Manufactured microelectronics will be tested to ensure that IP protections meet or exceed current National Security Agency standards for IP protection, and to develop DoD’s ability to detect certain malicious supply chain attacks on DoD microelectronics. \n\nSuccessful implementation will transition these technologies to use in DoD programs, obtain access to multiple commercial microelectronics facilities, establish secure design capabilities, and solidify a data-driven approach to supply chain protection.  It also includes keeping pace with the rapid advancements in microelectronics technology and the globalization of this industry sector. It will provide the basics for updating and strengthening DoD assurance policy and includes collaborating with industry to develop data driven quantifiable standards."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Federated Assurance Center (JFAC)"
                                    },
                                    "Description": {
                                        "val": "This project’s activities will enhance the use of software, hardware, and firmware assurance tools, techniques, and procedures directly with programs and organizations, throughout the life cycle.  JFAC provides a common forum in DoD for assurance best practices, community dialog on assurance, access to new technology and tools usable by programs throughout their life cycle for maintaining quantifiable assurance data."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.810"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.810"
                                            },
                                            "Text": {
                                                "val": "• Procure select quantities of high-priority software and hardware assurance(SwA and HwA) tools; evaluate high payoff commercial off the shelf (COTS) components to determine exploitable vulnerabilities; map vulnerabilities and threats to SwA and HwA tool capabilities to assess how well SwA and HwA tools and techniques function.\n• Conduct rapid acquisition pilots for enterprise procurement SwA and HwA tool enterprise license procurement models.\n• Expand JFAC infrastructure to deploy tools & capabilities.\n• Develop and distribute high priority acquisition workforce program and technical implementation guidance and training packages."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Transfer from Project code (Pcode) 291 in FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Design"
                                    },
                                    "Description": {
                                        "val": "The enhancement will develop quantifiably assured design concepts in manufactured systems, access to advanced state-of-the-art technology through secure design centers, enabling a formal risk-based approach to protection techniques. Manufactured microelectronics will be tested to ensure that intellectual property (IP) protections meet or exceed current National Security Agency standards for IP protection, and to demonstrate DoD’s ability to detect certain malicious supply chain attacks on DoD microelectronics."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "42.625"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "42.625"
                                            },
                                            "Text": {
                                                "val": "Successful implementation will transition these technologies to use in DoD programs, obtain access to multiple (2) commercial microelectronics facilities, and solidify a data-driven approach to supply chain protection.\n\nPlanned activities transitioning from projects P-291, P-645, P-646 and P-647 as follows:\n• Establish vetted IP and electronic data automation (EDA) Repository, which is available for DoD use, and distribute assured tools via cloud services.\n• Enhance secure design and cloud capability with new tools\/techniques.\n• Align stakeholders with common concerns to develop assurance enabled SOTA fabrication technologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Previous efforts supported in P645, P646, and P647 re-aligned to this new project code starting in FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Foundry"
                                    },
                                    "Description": {
                                        "val": "This activity will implement multiple foundries process design kit (PDK) environments ensuring the government is not dependent on one single source for critical components."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "44.338"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "44.338"
                                            },
                                            "Text": {
                                                "val": "Commercial foundries generate enormous amounts of data on their processes as a best practice for quality assurance to improve reliability and increase yield.  It will collect and utilize this data to generate and allow quantitative comparison of performance and security metrics in the design and test stage of the microelectronics lifecycle, thereby mitigating risk.\n\nPlanned activities transitioning from projects P-645, P-646 and P-647 as follows:\n• Pilot assured access to multiple SOTA domestic fabrication sources. \n• Continued build-out of secured design environments and persistent expertise."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Previous efforts supported in P645, P646 and P647. Realign to this new P-code starting in FY2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data Driven Quantifiable Assurance Development"
                                    },
                                    "Description": {
                                        "val": "This activity includes verifying the ability to fabricate classified and\/or export-controlled designs in on-shore commercial foundries– funding will establish multiple strategic partnerships with existing commercial domestic foundries to develop a data-driven, risk-based approach to supply chain protection and demonstrate the assured manufacture of advanced electronic components."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "187.821"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "187.821"
                                            },
                                            "Text": {
                                                "val": "The project will develop the technical means for protecting intellectual property (IP) and obfuscating the final user function from the supply chain will be realized using personalization, programmability and software, following application specific integrated circuit (ASIC) manufacturing. Efforts are on-going to update International Traffic in Arms Regulations and Export Administration Regulations policy in this area. Funding will support activities to enhance the export control regime so that it maintains or strengthens current protections while enabling access to commercial capabilities, products, and IP.\n\nPlanned activities transitioning from projects P-645, P-646 and P-647 as follows:\n• Enhance design, physical, and functional test and verification infrastructure, tools, and capabilities in order to generate quantifiable assurance data at state-of-the-art (SOTA). \n• Improved logical and functional nondestructive analysis for SOTA field programmable gate arrays (FPGAs), System on Chips (SoCs), and ASICs.  \n• Increased throughput and decreased data collection time for destructive physical analysis and inspection at SOTA. \n• Acquire verification equipment to compare measured test data to design information.\n• Scale simulation and emulation environment to compare design tool and IP artifacts to measure data.\n• Continuation of 2020 verification and test technologies refinement activities including: (1) technical capability, through the procurement of laboratory equipment, IP, analysis tools, such as imaging software, and highly skilled tradecraft, (2) capacity to perform microelectronics assessments.\n• Conduct game theoretic based risk assessment for fabrication and design.\n• Instantiate authentication and protection workflows for design assurance.\n• Conduct enhanced IP analysis; data driven risk assessments utilizing independent verification and validation, data captures, intelligence reports, probability of detection and false alarm rates, and game theoretics; and authentication and protection workflows.\n• Align program to provide persistent expertise delivery for application specific risk; compare design features to enhance verification and validation.\n• Develop a scalable classification system for design and verification ecosystem.\n• Analyze quantitative assurance data from pilot risk assessment demonstration.\n• In collaboration with industry standard bodies (Society of Automotive Engineers 32), promulgate new hardware assurance policy, best practices, and guidance via a navigable public library portal."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Previous efforts supported in P645, P646 and P647. Realign to this new P-code starting in FY2021."
                                        }
                                    }
                                }
                            ]
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Access to SOTA Microelectronics - Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Defense Advanced Research Projects Agency, Air Force, Army, Navy, National Security Agency"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "281.594"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "281.594"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Access to State-of-the-Art (SOTA) Microelectronics – Development"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Third Party Intellectual Property (IP) and electronic data automation (EDA) tool repository development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Access to SOTA commercial microelectronics technology through design and integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "New microelectronics capability development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Pilot assured access to multiple SOTA domestic fabrication sources"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Build-out of secured design environments and persistent expertise"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Gain access to multiple SOTA commercial foundry process design kit’s (PDK’s)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Compare SOTA performance and security metrics in design and test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Microelectronics Assurance and Supply Chain Standards and Best Practices Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "U.S. Government and Industry Engagement for demonstration of data driven quantifiable assurance tools, techniques, and risk based metrics"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Microelectronics Assurance and Supply Chain Training for U.S. Government and Industry"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "DoD Microelectronics Assurance and Supply Chain Policy and Guidance Development\/Update"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Application Specific Integrated Circuit (ASIC) netlist analysis capability development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Field programmable gate array (FPGA) analyses tool development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Microelectronics assurance and supply chain technology maturation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Assured design development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Capture and secure microelectronics lifecycle data and new R&D"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Government and industry engagement to develop data driven quantifiable assurance"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Management\/Technical Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "908"
                    },
                    "ProjectTitle": {
                        "val": "Access to Advanced Packaging and Testing - Demonstration"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "81.438"
                        },
                        "BudgetYearOneBase": {
                            "val": "81.438"
                        },
                        "BudgetYearTwo": {
                            "val": "98.075"
                        },
                        "BudgetYearThree": {
                            "val": "29.702"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project will leverage existing commercially available expertise and capability to deliver self-sustaining digital and Radio Frequency (RF) state-of-the-art (SOTA) heterogeneous integrated packaging (SHIP), assembly, and test capability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Access to Advanced Packaging and Testing - Development"
                                    },
                                    "Description": {
                                        "val": "This project will utilize specialized DoD chiplets (small specialized die) in a heterogeneous integrated (HI) assembly, allowing the DoD to accelerate adoption of the most advanced microelectronics available.  Working with world-class industrial partners will provide early access to proprietary information related to these technologies, giving DoD an asymmetrical advantage."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "81.438"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "81.438"
                                            },
                                            "Text": {
                                                "val": "This project will deliver an on-shore SHIP, assembly, and test capability. It will provide access to, personalization of, and customization for supporting DoD programs.  It will enable a revolutionary leap in system performance that will greatly reduce size, weight and power (SWaP) by incorporating the immense advances in SOTA commercial off the shelf (COTS) processing technologies, such as field programmable gate arrays (FPGAs), microprocessors, and Graphic Processing Units (GPUs).\n\nPlanned activities transitioning from projects P-645, P-646 and P-647 as follows:\n• Enhance secure design and packaging capability with new tools\/techniques.\n• Qualify advanced heterogeneous packaging technology.\n• Continued development of secure, accessible, and cost effective SOTA heterogeneous integration design, assembly and test capability.  Establish a SOTA prototype packaging secure assembly and test source for SOTA digital and RF applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Previous effort transferred from P645, P646, and P647, to this new project code starting in FY 2021."
                                        }
                                    }
                                }
                            ]
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Access to Advanced Packaging and Testing - Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Defense Advanced Research Projects Agency, Air Force, Army, Navy, National Security Agency"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "81.438"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "81.438"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Access to Advanced Packaging and Testing - Development"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Develop specialized DoD chiplets in a heterogeneous integrated (HI) assembly"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Qualify and adopt advanced microelectronics packaging and test capabilities"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Engage with world-class industrial partners to gain access to proprietary packaging technologies"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Enhance secure design and packaging capability with new tools\/techniques"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Develop secure, accessible, and cost effective SOTA heterogeneous integration design, assembly and test capability"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Establish a SOTA prototype packaging secure assembly and test source for SOTA digital and RF applications"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Reduce DoD program packaging size, weight, and power requirements"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Incorporate packaging advances in SOTA commercial off the shelf (COTS) processing technologies"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Management\/Technical Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "911"
                    },
                    "ProjectTitle": {
                        "val": "Address DoD Unique Needs Especially Radiation Hardening - Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "50.500"
                        },
                        "BudgetYearOneBase": {
                            "val": "50.500"
                        },
                        "BudgetYearTwo": {
                            "val": "47.000"
                        },
                        "BudgetYearThree": {
                            "val": "61.000"
                        },
                        "BudgetYearFour": {
                            "val": "57.000"
                        },
                        "BudgetYearFive": {
                            "val": "58.160"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project addresses the dual problems of commanding only a small market share while requiring an expansive range of unique microelectronics needs, from boutique and legacy components to state-of-the-art (SOTA) technologies.  The Government must sustain specialty suppliers, given their criticality to national security.  In particular, DoD needs access to a diverse microelectronics ecosystem to develop and acquire the application specific integrated circuits (ASICs) and personalized commercial off the shelf (COTS) components required for military radiation hardened and radio frequency (RF) and optoelectronic (OE) needs.  \n\nThe Department frequently relies on commercial suppliers to optimize performance and reduce costs for sophisticated weapon system and secure network functionality.  It is critical to have DoD reliability access to subject matter expertise, technology, and manufacturing."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Address DoD Unique Needs Especially Radiation Hardening - Development"
                                    },
                                    "Description": {
                                        "val": "Government-unique trusted design and manufacturing flows have been developed to enable a tier of trust for select ASIC parts; however, this approach addresses only a small subset of DoD microelectronics requirements (e.g., processors, memory, microcontrollers, field programmable gate arrays (FPGAs), and radiation-tolerant processors)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "50.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "50.500"
                                            },
                                            "Text": {
                                                "val": "DoD will partner with the intelligence community, the Department of Energy, and the National Aeronautics and Space Administration to develop radiation hardened components that permit systems to operate in space and other harsh environments. state-of-the-practice (SOTP) and state-of-the-art (SOTA) technologies will be characterized and developed in support of Radiation Hardened By Process (RHBP) and Radiation Hardened By Design (RHBD) activities in support DoD modernization programs with radiation hardened requirements.   A similar situation exists for radio frequency and optical applications.  These two applications reflect only a small market with unique costs and specifications, which does not inherently create incentive for industrial investment.\n\nPlanned activities transitioning from projects P-645, P-646 and P-647 as follows:\n\n• Establish assurance foundations for radio frequency (RF) designs.\n• Establish foundations of assurance for RF applications; deliverables include expansion into other discipline areas: RF, optoelectronic (OE), and Additive Manufacturing.\n• Continue to qualify sources for radiation hardened (RH) electronics to transition developed radiation hardened capabilities. \n• Finalize qualification of additional strategic RH sources; qualify RH memories and system on chip; demonstrate up to TRL 7 of strategic Radiation Hardened By Design (RHBD) in at least 3 SOTA technology nodes; confirm additional sources for digital Radiation Hardened By Process (RHBP) capability.\n• Deliverables: Demonstrate strategic RHBD in at least 2 SOTA technologies with validated PDKs.\n• Major Milestone:  Establish 2nd source for strategic RHBP state-of-the-practice (SOTP) partially depleted silicon on insulator source in support of nuclear modernization.\n• Qualify new, SOTP and SOTA, sources (foundry process) for radiation hardened microelectronics.\n• Develop and enhance DoD Lab test and evaluation infrastructure required for verification and validation of radiation hardened microelectronics, technology characterization, and device modeling and simulation.\n• Provide coordination and subject matter expertise in support of the Strategic Radiation Hardened Electronics Council (SRHEC) for the identification of technology gaps, technology roadmap development, and inform future investments.\n• Develop and demonstrate RF and OE microelectronics using secured design environments, advanced non-complementary metal oxide semiconductor substrates, and optimized SOTA intellectual property (IP) and test articles for next generation advanced sensors and communications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Previous effort transferred from P645, P646, and P647, to this new project code starting in FY 2021."
                                        }
                                    }
                                }
                            ]
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Address DoD Unique Needs - Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Defense Advanced Research Projects Agency, Air Force, Army, Navy, National Security Agency"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "50.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "50.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Address DoD Unique Needs - Development"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Radiation Training in Support of Radiation Hardened by Design (RHBD) and Radiation Hardened by Process (RHBP) Initiatives"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Strategic Radiation Hardened Electronics council (SRHEC) Coordination"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Strategic Radiation Support of Rapid Fielding Optoelectronic Devices"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Radiation hardening by process and radiation hardening by design development activities"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Radio frequency (RF) and optoelectronics (OE) development activities for assurance"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Qualify new state-of-the-art (SOTA) and state-of-the-practice (SOTP) sources for radiation hardened (RH) electronics to transition developed radiation hardened capabilities"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Establish 2nd source for strategic RHBP SOTP partially depleted silicon on insulator source"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Develop RF and OE microelectronics using secured design environments, advanced non-complementary metal oxide semiconductor substrates, and optimized SOTA intellectual property (IP) and test articles"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Management\/Technical Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "912"
                    },
                    "ProjectTitle": {
                        "val": "Create a Resilient and Robust Microelectronics Pipeline"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "75.544"
                        },
                        "BudgetYearOneBase": {
                            "val": "75.544"
                        },
                        "BudgetYearTwo": {
                            "val": "79.364"
                        },
                        "BudgetYearThree": {
                            "val": "70.585"
                        },
                        "BudgetYearFour": {
                            "val": "73.024"
                        },
                        "BudgetYearFive": {
                            "val": "74.510"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Microelectronics are critical technologies that drive the modern economy and enable the defense systems that allow warfighters to accomplish their missions.  Other nations recognize the need to control the microelectronics supply chain and indigenous state-of-the-art (SOTA) manufacturing.  Aggressive investments and licit and illicit actions by peer nations threaten U.S. leadership.  China alone purports investment of $150 billion and a national strategy to achieve dominance in all major areas of microelectronics by 2030.  Russia and China have publicly stated that advanced microelectronics, AI, and machine learning (ML) are the keys to economic and military dominance.\n\nThis project will promote microelectronics innovation and create resilient and robust Microelectronics pipeline including supplier chain, next generation technology and workforce. It will slow and in the long-term reverse offshoring trends by fostering commercial and Government alliances to preserve the U.S. ecosystem, lower barriers to innovation and adoption, strengthen workforce expertise, lead the next generation of advanced technology, and maintain the United States as the global source for high-end, secure, and reliable microelectronics components."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Create a Resilient and Robust Microelectronics Pipeline - Development"
                                    },
                                    "Description": {
                                        "val": "DoD is investing in next-generation disruptive technology, leveraging U.S. innovation, and transitioning materials, architectures, and designs into prototype capabilities for use by multiple industrial sectors.  This and additional targeted investments in workforce will begin to address long-term talent needs.  In addition, the Department will continue to enhance its partnership with industry to mitigate supply chain risks."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "75.544"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "75.544"
                                            },
                                            "Text": {
                                                "val": "Significant increases in assurance and protection of DoD technical data and components will be achieved through improvements in design practices, modern commercial security practices, and advanced packaging and chain of custody technologies.  \n\nThis activity, along with continued engagements and partnerships with industry will foster necessary security features in commercial products and infrastructure that will facilitate long-term assured access for the U.S. Government to commercial advanced SOTA technology providers.\n\nPlanned activities transitioning from projects P-645, P-646 and P-647 as follows:\n• Align stakeholder prototype demonstrators using assurance enabled SOTA fabrication.\n• Prototype modernization of existing systems with state of the art fabrication technologies with enhanced assurance techniques.\n• Continue established industry partnerships for assured technology co-development and prototype development.  Perform modernization prototype demonstrations with DoD acquisition programs.\n• Demonstrate limited defensive measures for the protection of commercial wireless systems; \n• Initiate development of a tactical radio prototype, leveraging commercial and DoD-developed hardware and software;\n• Formalize a sustainable manufacturing model for leading-edge DoD application specific integrated circuits (ASICs), following the demonstration of commercially-manufactured academic and DoD designs; [Domestic Foundries]\n• Demonstrate rapid transition of DoD-relevant field programmable gate array-based capabilities to structured ASICs, with security capabilities to protect DoD intellectual property (IP) during manufacture;  \n• Demonstrate advanced negative capacitance non-volatile memory devices, supporting the growing energy-efficient computational needs for many DoD applications.\n• Establish expertise, and build close connections within the U.S. Semiconductor industry to report on and mitigate supply chain threats.\n• Development of tools to trace parts through their supply chain and track the health of the U.S. semiconductor segments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Previous effort transferred from P645, P646, and P647, to this new project code starting in FY 2021."
                                        }
                                    }
                                }
                            ]
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Create a Resilient and Robust Microelectronics Pipeline"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Defense Advanced Research Projects Agency, Air Force, Army, Navy, National Security Agency"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "75.544"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "75.544"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Create a Resilient and Robust Microelectronics Pipeline"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Develop best practices, and relationships with industry"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Government and industry engagement to develop and demonstrate U.S. microelectronics technology dominance"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Establish industry partnerships and innovation accelerators for assured technology co-development and prototype development with DoD acquisition programs"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Develop limited defensive measures for the protection of commercial wireless systems including tactical radio prototypes using commercial off the shelf (COTS)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Formalize a commercially acceptable manufacturing model for leading-edge DoD application specific integrated circuits (ASICs)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Adopt commercially-manufactured academic and DoD designs; [Domestic Foundries] for ASICs and field programmable gate arrays (FPGAs)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Transition DoD-relevant FPGA-based capabilities to structured ASICs, with security capabilities to protect DoD intellectual property (IP) during manufacture"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Adopt advanced negative capacitance non-volatile COTS memory devices for DoD applications"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Build connections with the U.S. Semiconductor industry to mitigate supply chain threats"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Develop tools to analyze the health of the supply chain and track the health of the U.S. industry"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Management\/Technical Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}