{
    "id": "2021-Army-PB-2040-JBOOK-2ce7b76ca8f41dbc06183380f90728d4a8e40b9122c9effab5b4a02fdffb364e-1",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604258A"
        },
        "ProgramElementTitle": {
            "val": "Target Systems Development"
        },
        "R1LineNumber": {
            "val": "186"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "31.286"
            },
            "CurrentYear": {
                "val": "28.327"
            },
            "BudgetYearOne": {
                "val": "10.668"
            },
            "BudgetYearOneBase": {
                "val": "10.668"
            },
            "BudgetYearTwo": {
                "val": "11.452"
            },
            "BudgetYearThree": {
                "val": "12.992"
            },
            "BudgetYearFour": {
                "val": "11.196"
            },
            "BudgetYearFive": {
                "val": "10.774"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element funds aerial and ground target hardware and software development, maintenance, and upgrades. The overall objective is to ensure validation of weapon system accuracy and reliability by developing aerial and ground targets essential for test and evaluation (T&E). These targets are economical and expendable, remotely controlled or stationary, and often destroyed in use. The Army is the Tri-Service lead under the Secretariat Reliance panel for providing rotary wing, mobile ground, towed, and designated targets for T&E. The Army executes development of some service-peculiar target requirements in support of quality assurance, lot acceptance, and training and continues development of service-peculiar and on-going target materiel upgrades to maintain continuity with current weapons technology and trends in modern and evolving Army weapons."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "32.12"
                },
                "CurrentYear": {
                    "val": "8.327"
                },
                "BudgetYearOne": {
                    "val": "9.08"
                },
                "BudgetYearOneBase": {
                    "val": "9.08"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "31.286"
                },
                "CurrentYear": {
                    "val": "28.327"
                },
                "BudgetYearOne": {
                    "val": "10.668"
                },
                "BudgetYearOneBase": {
                    "val": "10.668"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.834"
                },
                "CurrentYear": {
                    "val": "20"
                },
                "BudgetYearOne": {
                    "val": "1.588"
                },
                "BudgetYearOneBase": {
                    "val": "1.588"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "20"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.834"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "1.588"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.588"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "238"
                    },
                    "ProjectTitle": {
                        "val": "Aerial Targets"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "29.24"
                        },
                        "CurrentYear": {
                            "val": "26.506"
                        },
                        "BudgetYearOne": {
                            "val": "7.546"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.546"
                        },
                        "BudgetYearTwo": {
                            "val": "7.955"
                        },
                        "BudgetYearThree": {
                            "val": "9.829"
                        },
                        "BudgetYearFour": {
                            "val": "8.199"
                        },
                        "BudgetYearFive": {
                            "val": "8.199"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Aerial Targets Project supports Army readiness through development, acquisition, operation and modernization of aerial targets. Multi-spectral Aerial Targets include realistic surrogates, actual high performance threat aircraft, and virtual target computer models. Current and emerging weapons systems require test, evaluation, and training using threat representative aerial targets to assess weapons systems effectiveness in the operational environment. This project encompasses a portfolio of full-scale, miniature, and subscale fixed wing\/rotary wing targets, virtual targets, ancillary devices, and associated control systems. For accurate threat portrayal that properly stresses weapons systems during test and evaluation, aerial targets must exhibit the flight characteristics, threat signatures, and other performance factors to represent or emulate relevant and validated threats. This Project funds: the long-range planning necessary to determine future target needs and development of coordinated requirements; the management of target research, development, test and evaluation, production, and modernization; execution of the validation process to ensure that aerial targets accurately represent the threat; as well as storage and repair parts. The Army is the Test Enterprise Reliance lead for Rotary Wing Targets and Towed Target development and the Tri-Service lead for procurement and enhancement of the MQM-107 fixed wing High Speed Aerial Target."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Cyber Virtualization Center"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "20"
                                        },
                                        "Text": {
                                            "val": "Cyber Virtualization Center"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "UAS Swarm Threat and Mitigation"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "20"
                                        },
                                        "Text": {
                                            "val": "UAS Swarm Threat and Mitigation"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Towed Targets\/Ancillary devices."
                                    },
                                    "Description": {
                                        "val": "Engineering & Manufacturing Development (EMD) phase activities for Towed Targets\/Ancillary devices."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.469"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for Towed Targets\/Ancillary devices, to include development, enhancement, maintenance, and sustainment for towed targets and ancillary devices as needed. Continued development and testing of Low Cost Towed target systems (Sphere Tow and the Glide Tow Target) emulating current threats at a very low cost to Lower Tier Project Office (LTPO), Indirect Fires Protection Capability (IFPC), United States Army Center for Countermeasures\/Office of the Secretary of Defense (CCM\/OSD), and classified customers. Signature modification and performance enhancement efforts for these targets is ongoing. Investigated and tested other cost-saving towed systems (Glide-Tow, Cruise Missile Tow Target, Towed Spheres, and Tow Test Bed) for Air Defense Weapons System customers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.266"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for Towed Targets\/Ancillary devices, to include development, enhancement, maintenance, and sustainment for towed targets and ancillary devices as needed. Continued development and testing of Low Cost Towed target systems (Sphere Tow and the Glide Tow Target) emulating current threats at a very low cost to Lower Tier Project Office (LTPO), Indirect Fires Protection Capability (IFPC), United States Army Center for Countermeasures\/Office of the Secretary of Defense (CCM\/OSD), and classified customers. Signature modification and performance enhancement efforts for these targets is ongoing. Investigates and tests other cost-saving towed systems (Glide-Tow, Cruise Missile Tow Target, Towed Spheres, and Tow Test Bed) for Air Defense Weapons System customers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.377"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.377"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for Towed Targets\/Ancillary devices, to include development, enhancement, maintenance, and sustainment for towed targets and ancillary devices as needed. Continued development and testing of Low Cost Towed target systems (Sphere Tow and the Glide Tow Target) emulating current threats at a very low cost to (LTPO), (IFPC), (CCM\/OSD), and classified customers. Signature modification and performance enhancement efforts for these targets is ongoing. Investigates and tests other cost-saving towed systems (Glide-Tow, Cruise Missile Tow Target, Towed Spheres, and Tow Test Bed) for Air Defense Weapons System customers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase aligns program requirements to Army Modernization priorities in support of the National Defense Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aerial Virtual Targets."
                                    },
                                    "Description": {
                                        "val": "EMD phase activities for Aerial Virtual Targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.784"
                                            },
                                            "Text": {
                                                "val": "Continued engineering and manufacturing for Aerial Virtual Targets for evolving Army and DoD simulation standards and evolving implementation techniques; focuses on simulation target models of airplanes, helicopters, missiles, unmanned aerial vehicles, and aerial targets in commonly used formats to support visualization, infrared analysis, and radar analysis simulations; supported verification and validation of models, will provide archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities. Simulation target models are employed to facilitate simulations for DT and OT test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions. These models will be used by multiple DoD agencies and multiple weapon systems such as, but not limited to CCWS, Unmanned Aerial Systems, and Lower Tier Program offices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.462"
                                            },
                                            "Text": {
                                                "val": "Will continue engineering and manufacturing for Aerial Virtual Targets for evolving Army and Department of Defense simulation standards and evolving implementation techniques; focuses on simulation target models of airplanes, helicopters, missiles, unmanned aerial vehicles, and aerial targets in commonly used formats to support visualization, infrared analysis, and radar analysis simulations; will support verification and validation of models, will provide archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities. Simulation target models are employed to facilitate simulations for Developmental Test (DT) and Operational Test (OT) planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions. These models will be used by multiple DoD agencies and multiple weapon systems such as, but not limited to Close Combat Weapon System, Unmanned Aerial Systems, and Lower Tier Program offices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.603"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.603"
                                            },
                                            "Text": {
                                                "val": "Will continue engineering and manufacturing for Aerial Virtual Targets for evolving Army and DoD simulation standards and evolving implementation techniques; focuses on simulation target models of airplanes, helicopters, missiles, unmanned aerial vehicles, and aerial targets in commonly used formats to support visualization, infrared analysis, and radar analysis simulations; will support verification and validation of models, will provide archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities. Simulation target models are employed to facilitate simulations for (DT) and (OT) planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions. These models will be used by multiple DoD agencies and multiple weapon systems such as, but not limited to Close Combat Weapon Systems, Unmanned Aerial Systems, and Lower Tier Program offices."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase aligns program requirements to Army Modernization priorities in support of the National Defense Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Ground Aerial Target Control System (AGATCS)."
                                    },
                                    "Description": {
                                        "val": "EMD phase activities for the AGATCS in support of a modern current technology target control system for control of subscale and full scale aerial, surface (ground\/seaborne), Small Unmanned Aerial System (SUAS) and rotary wing targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.275"
                                            },
                                            "Text": {
                                                "val": "AGATCS engineering and manufacturing to provided remote control of aerial (fixed wing, rotary wing, and simulated unmanned aerial systems (SUAS)), ground (heavy, medium, and light vehicles), and seaborne targets with a single control system in support of live fire testing necessary for lethality evaluation and sensor package testing for evaluation of suitability and effectiveness. Complied with DODI 8510.01 mandate \/ DOD Risk Management Framework on all target control systems to ensure a secure operating posture. Met surface target testing requirements to include formation, collision avoidance, and swarming capabilities for U.S. Army test ranges. Provided Test Centers and the T&E community with a versatile seaborne and rotary wing resource for use in conducting tests to include live fire testing, observation, signal repeater and cargo transportation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.348"
                                            },
                                            "Text": {
                                                "val": "AGATCS engineering and manufacturing to provide remote control of aerial (fixed wing, rotary wing, and simulated unmanned aerial systems (SUAS)), ground (heavy, medium, and light vehicles), and seaborne targets with a single control system in support of live fire testing necessary for lethality evaluation and sensor package testing for evaluation of suitability and effectiveness. Complies with DODI 8510.01 mandate \/ DOD Risk Management Framework on all target control systems to ensure a secure operating posture. Meets surface target testing requirements to include formation, collision avoidance, and swarming capabilities for United States Army test ranges. Provides Test Centers and the T&E community with a versatile seaborne and rotary wing resource for use in conducting tests to include live fire testing, observation, signal repeater and cargo transportation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.793"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.793"
                                            },
                                            "Text": {
                                                "val": "AGATCS engineering and manufacturing to provide remote control of aerial (fixed wing, rotary wing, and simulated unmanned aerial systems (SUAS)), ground (heavy, medium, and light vehicles), and seaborne targets with a single control system in support of live fire testing necessary for lethality evaluation and sensor package testing for evaluation of suitability and effectiveness. Complies with DODI 8510.01 mandate \/ DOD Risk Management Framework on all target control systems to ensure a secure operating posture. Meets surface target testing requirements to include formation, collision avoidance, and swarming capabilities for U.S. Army test ranges. Provides Test Centers and the T&E community with a versatile seaborne and rotary wing resource for use in conducting tests to include live fire testing, observation, signal repeater and cargo transportation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase aligns program requirements to Army Modernization priorities in support of the National Defense Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unmanned Aerial System - Target (UAS-T)."
                                    },
                                    "Description": {
                                        "val": "Technical updates and life cycle management activities for the UAS-T to provide Threat representative support for test and experimentation missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.374"
                                            },
                                            "Text": {
                                                "val": "Technical and life cycle management for the UAS-T to operate and maintain a generic, tactical class unmanned aircraft system target to support a variety of test requirements by providing a generic threat representative aerial target to support test and experimentation missions. Projects supported include the Space and Missile Defense Command and the Joint Integration Air and Missile Defense Organization live fire testing. This activity continued to require technical support for investigation, demonstration, and integration of a more economical target, to include technical oversight of the targets' acquisition and ground support equipment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.201"
                                            },
                                            "Text": {
                                                "val": "Technical and life cycle management for the UAS-T to operate and maintain a generic, tactical class unmanned aircraft system target to support a variety of test requirements by providing a generic threat representative aerial target to support test and experimentation missions. Projects to be supported include the Space and Missile Defense Command and the Joint Integration Air and Missile Defense Organization live fire testing. This activity will continue to require technical support for investigation, demonstration, and integration of a more economical target, to include technical oversight of the targets' acquisition and ground support equipment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.056"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.056"
                                            },
                                            "Text": {
                                                "val": "Technical and life cycle management for the UAS-T to operate and maintain a generic, tactical class unmanned aircraft system target to support a variety of test requirements by providing a generic threat representative aerial target to support test and experimentation missions. Projects to be supported include the Space and Missile Defense Command and the Joint Integration Air and Missile Defense Organization live fire testing. This activity will continue to require technical support for investigation, demonstration, and integration of a more economical target, to include technical oversight of the targets' acquisition and ground support equipment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase aligns program requirements to Army Modernization priorities in support of the National Defense Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Speed Aerial Target (HSAT)."
                                    },
                                    "Description": {
                                        "val": "Funds the EMD phase for the replacement of the aging MQM-107 with the new BQM-167A to provide a realistic aerial target capable of simulating the performance of enemy aircraft; technical and life cycle management activities for equipment, to include engineering change proposals, technology obsolescence, and safety and system data documentation for the HSAT Target. Program requires technical support for investigation, demonstration, and integration of a more economical target. Technical oversight of the replacement targets' acquisition along with Ground Support Equipment (GSE) and other activities related to getting it operational is essential; provides a realistic aerial target capable of simulating the performance of enemy aircraft to aid in the research, development, test, and evaluation of weapons systems and aid in training operational units employing production missile systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.338"
                                            },
                                            "Text": {
                                                "val": "The U.S Army Targets Management Office provided Aerial Targets to customers for threat realism required by law in Title 10 U.S.C., Section 2366 (Live Fire Test & Evaluation) for the testing of ACT I\/II major munitions, missile programs, or product improvements of these programs\nThis line is the technical sustainment of all HSATs.  This funding covered the engineering, integration, safety, cyber security, technology obsolescence, safety and system data documentation, AWR development, and flight waivers for the entire enterprise, as well as, NRE for software\/firmware updates, and minor product upgrades.  This includes the MQM-107, MQM-178, BQM-34, and the new BQM-167. These HSATs continued to support T&E programs such as Patriot, Stinger, IAMD, Sentinel Radar, CMDS and classified programs for Army and Tri-Service customers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.934"
                                            },
                                            "Text": {
                                                "val": "Funds the technical sustainment of all HSATs.  This funding covers the engineering, integration, safety, cyber security, technology obsolescence, safety and system data documentation, Air Worthiness Release development, and flight waivers for the entire enterprise, as well as, non-recurring engineering for software\/firmware updates, and minor product upgrades.  This includes the MQM-107, MQM-178, BQM-34, and the new BQM-167. These HSATs will continue to support T&E programs such as Patriot, Stinger, Integrated Air and Missile Defense, Sentinel Radar, Cruise Missile Defense System, and classified programs for Army and Tri-Service customers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.717"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.717"
                                            },
                                            "Text": {
                                                "val": "The U.S Army Targets Management Office provides Aerial Targets to customers for threat realism required by law in Title 10 U.S.C., Section 2366 (Live Fire Test & Evaluation) for the testing of ACAT I\/II major munitions, missile programs, or product improvements of these programs. This line is the technical sustainment of all HSATs.  This funding covers the engineering, integration, safety, cyber security, technology obsolescence, safety and system data documentation, Air Worthiness Release development, and flight waivers for the entire enterprise, as well as, non-recurring engineering for software\/firmware updates, and minor product upgrades.  This includes the MQM-107, MQM-178, BQM-34, and the new BQM-167. These HSATs will continue to support T&E programs such as Patriot, Stinger, Integrated Air and Missile Defense, Sentinel Radar, Cruise Missile Defense System, and classified programs for Army and Tri-Service customers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease aligns program requirements to Army Modernization priorities in support of the National Defense Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.295"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "459"
                    },
                    "ProjectTitle": {
                        "val": "Ground Targets"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.046"
                        },
                        "CurrentYear": {
                            "val": "1.821"
                        },
                        "BudgetYearOne": {
                            "val": "3.122"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.122"
                        },
                        "BudgetYearTwo": {
                            "val": "3.497"
                        },
                        "BudgetYearThree": {
                            "val": "3.163"
                        },
                        "BudgetYearFour": {
                            "val": "2.997"
                        },
                        "BudgetYearFive": {
                            "val": "2.575"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds Army efforts to support test and evaluation (T&E) of advanced weapon systems and supports Army Modernization and Tri-Service readiness by developing ground target surrogates, acquiring foreign equipment, and developing virtual target computer models of ground vehicle targets. These products are required to adequately stress weapon systems undergoing (T&E). The United States Army is the Tri-Service lead for providing mobile ground targets for (T&E). This tasking includes long-range planning to determine future target needs and development of coordinated requirement documents; the centralized management of the ground target research, development, test and evaluation processes; execution of the validation process; acquisition of foreign equipment; and continuing maintenance, storage, and development\/enhancement\/update via engineering services of developed and acquired targets to ensure availability for (T&E) customers. This Project also manages use of current assets and operates a centralized spare parts program."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mobile Ground Target Operations (MGTO)"
                                    },
                                    "Description": {
                                        "val": "MGTO provides oversight of five Primary Operating Centers to include operation, storage, maintenance, repair, safety and configuration management.  The objective of the MGTO effort is to support the testing community as fully, efficiently and effectively as possible. The MGTO centrally manages a fleet of foreign threat ground vehicles while maintaining the foreign integrity of the assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.152"
                                            },
                                            "Text": {
                                                "val": "Maintained a fleet of reusable ground targets emulating relevant, current, and emerging threats which provides cost effective solutions for T&E. Managed a fleet of foreign threat ground vehicles while maintaining the foreign integrity of the assets.  Provided support and oversight for actual threat foreign ground vehicles and mobile ground target surrogate vehicles for use as threat targets by the T&E community for destructive and non-destructive scenarios. Efforts supported users such as Apache 64E, JAGM, Javelin, Extended Range Guided Multiple Launch Rocket System, Army Tactical Missile System, Cruise Missile Defense System, Precision Fires, Counter-Rocket Artillery and Missile (C-RAM), Close Combat Weapon Systems and other research, prototyping, and operational users."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.002"
                                            },
                                            "Text": {
                                                "val": "Will maintain a fleet of reusable ground targets emulating relevant, current, and emerging threats which provides cost effective solutions for T&E. The MGTO will provide support and oversight for actual threat foreign ground vehicles and mobile ground target surrogate vehicles for use as threat targets by the T&E community for destructive and non-destructive scenarios. Efforts will support users such as, but not limited to Apache 64E, Joint Air to Ground Missile, Javelin, Extended Range Guided Multiple Launch Rocket System, Army Tactical Missile System, Cruise Missile Defense System, Precision Fires, Counter Rocket Artillery and Missile (C-RAM), Close Combat Weapon System, and other research, prototyping, and operational users."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.56"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.56"
                                            },
                                            "Text": {
                                                "val": "Will maintain a fleet of reusable ground targets emulating relevant, current, and emerging threats which provides cost effective solutions for T&E. The (MGTO) will centrally manage a fleet of foreign threat ground vehicles while maintaining the foreign integrity of the assets. The MGTO will provide support and oversight for actual threat foreign ground vehicles and mobile ground target surrogate vehicles for use as threat targets by the T&E community for destructive and non-destructive scenarios. Efforts will support users such as, but not limited to Apache 64E, Joint Air to Ground Missile, Javelin, Extended Range Guided Multiple Launch Rocket System, Army Tactical Missile System, Cruise Missile Defense System, Precision Fires, Counter Rocket Artillery and Missile, Close Combat Weapon System, and other research, prototyping, and operational users."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase aligns program requirements to Army Modernization priorities in support of the National Defense Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Ground Targets Hardware (MGTH)"
                                    },
                                    "Description": {
                                        "val": "MGTH provides a mix of actual threat assets and surrogate targets to support Army T&E events."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.459"
                                            },
                                            "Text": {
                                                "val": "Continued to provide ground targets to meet the functionality and signature fidelity requirements of the objective force. Continued to initiate analysis and design efforts to address specific capability shortfalls and the ability to develop surrogates."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.37"
                                            },
                                            "Text": {
                                                "val": "Will provide cost effective and highly threat representative surface targets (consisting of actual foreign equipment as well as surrogates) for T&E of multiple Weapon System developers.  Will continue to provide surface targets to meet the functionality and signature fidelity requirements of the objective force. Will acquire actual foreign equipment, to include insurgent vehicles, to meet known Weapon System target shortfalls. Will continue to initiate analysis and design efforts to address specific capability shortfalls and the ability to develop threat representative surrogates."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.737"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.737"
                                            },
                                            "Text": {
                                                "val": "Will provide cost effective and highly threat representative surface targets (consisting of actual foreign equipment as well as surrogates) for T&E of multiple Weapon System developers.  Will continue to provide surface targets to meet the functionality and signature fidelity requirements of the objective force. Will acquire actual foreign equipment, to include insurgent vehicles, to meet known Weapon System target shortfalls. Will continue to initiate analysis and design efforts to address specific capability shortfalls and the ability to develop threat representative surrogates."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase aligns program requirements to Army Modernization priorities in support of the National Defense Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Virtual Targets"
                                    },
                                    "Description": {
                                        "val": "Government System (T&E) to support the research and development of Ground Virtual Targets. Virtual Targets are employed by multiple Department of Defense agencies and weapon systems to facilitate simulations for Developmental and Operational Test planning, rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.435"
                                            },
                                            "Text": {
                                                "val": "Supported verification and validation of models, and provides archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities. Simulation target models continued to be employed to facilitate simulations for both developmental and operational testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.366"
                                            },
                                            "Text": {
                                                "val": "Will continue engineering and manufacturing for Ground Virtual Targets for evolving Army and DoD simulation standards and evolving implementation techniques. Will focus on simulation target models of armored assets, air defense systems, small - unmanned aerial systems vehicles, maritime systems and other surface targets in commonly used formats to support visualization, infrared analysis, and radar analysis simulations. Will support verification and validation of models and provide archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.825"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.825"
                                            },
                                            "Text": {
                                                "val": "Will continue engineering and manufacturing for Ground Virtual Targets for evolving Army and DoD simulation standards and evolving implementation techniques. Will focus on simulation target models of armored assets, air defense systems, small - unmanned aerial systems vehicles, maritime systems and other surface targets in commonly used formats to support visualization, infrared analysis, and radar analysis simulations. Will support verification and validation of models and provide archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase aligns program requirements to Army Modernization priorities in support of the National Defense Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.083"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}