{
    "id": "2021-Army-PB-2040-JBOOK-24fcf105afc7c7d31f1382e71fbd0800d20c4793885e75717bfd3bc5bfb4138f-35",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA7-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0303141A"
        },
        "ProgramElementTitle": {
            "val": "Global Combat Support System"
        },
        "R1LineNumber": {
            "val": "250"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "51.415"
            },
            "CurrentYear": {
                "val": "60.076"
            },
            "BudgetYearOne": {
                "val": "86.908"
            },
            "BudgetYearOneBase": {
                "val": "86.908"
            },
            "BudgetYearTwo": {
                "val": "32.518"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "230.917"
            }
        },
        "ProgramElementNote": {
            "val": "Effective February 2, 2017, the Department of Defense Instruction (DODI) 5000.75 was issued to establish policy for use of Business Capability Acquisition Cycle for Defense Business Systems.  The DODI 5000.75 supersedes DODI 5000.02, improving the alignment of business systems to commercial best practices as well as optimizing efficiencies and effectiveness across the DOD for the acquisition of business systems.  Decisions rendered by the Milestone Decision Authority, as outlined in the DODI 5000.75, are referred to as \"Authority To Proceed\" and replace DODI 5000.02 \"Milestones.\""
        },
        "ProgramElementMissionDescription": {
            "val": "GCSS-Army Increment 1 gives combat forces a decisive edge by providing soldiers a seamless flow of timely, accurate, accessible, and secure logistics information to get combat power at the right place, at the right time.  The GCSS-Army program is an information and communications technology investment that provides key enabling support to the transformation of the Army into a network-centric, knowledge-based future force.    GCSS-Army implements best business practices to streamline supply, accountability, maintenance, distribution, and reporting procedures in support of the future force transition path of The Army Campaign Plan.  \n\nGCSS-Army Increment 2 builds on the current foundation by providing auditable Army Enterprise Aviation maintenance, enhanced Business Intelligence\/Business Warehouse (BI\/BW) and Army Pre-Positioned Stock (APS) functional capabilities and will sunset legacy systems:  the Aircraft Notebook and Army War Reserve Deployment System (AWRDS).   Increment 2 will deliver greater efficiencies to Aviation Logistics warfighters and improved information flow and accuracy in real time to decision makers, helping them make better decisions faster on the battlefield.   The APS capabilities directly impact the speed at which a deploying unit can draw combat equipment.\n\nThe FY 2020 funding provides for the engineering, design, development, and integration of GCSS-Army Increment 2 into the Increment 1 baseline.  It also supports critical change requests, coming from the warfighter and prioritized by the Combat Developer, for the baseline system.\n\nThe FY 2021 funding provides for the continuation of engineering, design, development, integration, and testing of the GCSS-Army Increment 2.  The funding also builds edge software for disconnected supply, maintenance and accountability, leveraging the Increment 2 architecture and revised technical approach approved in FY 2019.  The FY 2021 funding also supports trade studies, analysis and market research for SAP based ERP integration, consolidation and efficiencies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "53.855"
                },
                "CurrentYear": {
                    "val": "68.976"
                },
                "BudgetYearOne": {
                    "val": "67.974"
                },
                "BudgetYearOneBase": {
                    "val": "67.974"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "51.415"
                },
                "CurrentYear": {
                    "val": "60.076"
                },
                "BudgetYearOne": {
                    "val": "86.908"
                },
                "BudgetYearOneBase": {
                    "val": "86.908"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.44"
                },
                "CurrentYear": {
                    "val": "-8.9"
                },
                "BudgetYearOne": {
                    "val": "18.934"
                },
                "BudgetYearOneBase": {
                    "val": "18.934"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-8.9"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.44"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "18.934"
                                },
                                "BudgetYearOneBase": {
                                    "val": "18.934"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2021 Increment 1 funding was increased above FY 2020 level to fund disconnected operations development. RDTE funds are needed for first year of a two year development effort to cover all design, development, test and evaluation efforts to develop a disconnected operations solution for GCSS-Army.\n\nGCSS-Army INC2-  On 4 June 2019 the Army Acquisition Executive approved a modification in strategy to an SAP Agile Deployment Operations (ADO) technical solution which shifted RDTE requirements and fielding schedules, resulting in changes to funding requirements and plans to Wave 1 (Enterprise Aviation) in FY20 and FY21. This also affected plans for Wave 2 (Business Intelligence\/Business Warehouse) and Wave 3 (Army Prepositioned Stock-APS)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "083"
                    },
                    "ProjectTitle": {
                        "val": "Global Combat Support Sys - Army"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.255"
                        },
                        "CurrentYear": {
                            "val": "6.109"
                        },
                        "BudgetYearOne": {
                            "val": "21.675"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.675"
                        },
                        "BudgetYearTwo": {
                            "val": "17.59"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "46.629"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "GCSS-Army Increment 1 provides critical Army sustainment support to the soldier with a seamless flow of timely, accurate, accessible, and secure information management that gives combat forces a decisive edge and is essential for combat readiness. GCSS-Army implements best business practices to streamline supply, accountability, maintenance, distribution, and reporting procedures in support of the future force transition path of The Army Campaign Plan.  GCSS-Army is financially compliant and is a key component for the Army Enterprise Strategy to be financially auditable.  \nThe FY 2021 funding builds edge software for disconnected supply, maintenance and accountability, leveraging the Increment 2 architecture and revised technical approach approved in FY 2019.  The Army requires a single disconnected operations architecture for GCSS-Army to support the ground and aviation missions.  Currently the Army has battlefield gaps without network connectivity:  inability to maintain or regenerate combat power, order\/process spare parts, track battle losses, or conduct maintenance.  The disconnected operations architecture, using FY 2021 RDTE funding, will alleviate these problems when there are disruptions in communications or cyber-attacks.  The FY 2019 and FY 2020 funding also supports critical change requests, coming from the warfighter and prioritized by the Combat Developer, for the baseline system."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Product Development"
                                    },
                                    "Description": {
                                        "val": "The funds in the GCSS-Army Increment 1 RDT&E line are for building the edge software for disconnected supply, maintenance and accountability, leveraging the Increment 2 architecture and revised technical approach approved in FY 2019.  The Army requires a single disconnected operations architecture for GCSS-Army to support ground and aviation mission. The funds in FY 2019 and FY 2020 are for critical change requests, coming from the warfighter and prioritized by the Combat Developer.  In FY 2021 the Army will commence design, development and build of disconnected operations capability to support ground operations, leveraging Increment 2 architecture."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.255"
                                            },
                                            "Text": {
                                                "val": "CR 3670 \"Capability to leverage the current GCSS-Army Total Package Fielding process to allow DPAS the ability to send serialized and non-serialized equipment and UII data to GCSS-Army.  This is an interim manual process to be used until LMP provides a fully functioning process for all Program\nManagers\".  This was deployed in Release 15.1 (August 2019)\nCR 3683 \"Capability to conduct realignment of open orders when units are reassigned, deployed, or redeployed to mitigate de-obligation and loss of prior-year funds.  Capability is currently in Test Phase to be deployed in Release 15.1.1."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.831"
                                            },
                                            "Text": {
                                                "val": "After transition to capability support, RDT&E funding will be used to execute critical change requests to enhance capability support activities, improve readiness, system usability, automated accountability, auditability, and calculations of total cost of ownership. Implementation of critical change requests enhance functional capabilities and improve system effectiveness by synchronizing system data and utilizing enterprise interface tools to eliminate input errors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.675"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.675"
                                            },
                                            "Text": {
                                                "val": "Currently the Army has battlefield gaps without network connectivity:  inability to maintain or regenerate combat power, order\/process spare parts, track battle losses, or conduct maintenance.  The FY 2021 funding builds edge software for disconnected supply, maintenance and accountability, leveraging the Increment 2 architecture and revised technical approach approved in FY 2019.   The disconnected operations architecture, using FY 2021 RDTE funding, will alleviate these problems when there are disruptions in communications or cyber-attacks."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 funding was increased above the FY 2020 level to fund the first year of a two year development effort for disconnected ground operations.  FY 2021 funding will cover all design and development efforts to develop the edge software and front end user interface screens to allow soldiers to operate disconnected.   This is a critical requirement validated by Army in order to regenerate combat power, order\/process spare parts, track battle losses, or conduct maintenance when there are disruptions in communications or cyber-attacks."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.278"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "W00800"
                                    },
                                    "Title": {
                                        "val": "GCSS-A Increment 1"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.085"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "GCSS-Army will design and develop the edge software for disconnected ground operations tapping into the technical architecture that is being developed in Increment 2, Army Enterprise Aviation.  The program will design and build user screens for disconnected supply, maintenance and accountability, leveraging the core framework that will already be established in another part of the program.  The Army will use a single disconnected operations architecture for GCSS-Army to support the ground and aviation missions.  \n\nThe program office (INC 2) will award a base year contract with 3 option years in FY 2020, using a Department of Defense Enterprise Software Initiative (DoD ESI) contract, to design and\ndevelop the core architecture that will be used for disconnected ground and aviation operations. In FY21, utilizing the DoD ESI contract, the program will start to design and develop the core architecture that will be used for disconnected ground operations leveraging aviation architecture. \n\nGCSS-Army will also leverage the partnership with the U.S. Army Communications-Electronics Command, and supplement the design and development team with architecture and engineering support from the existing support contract."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "1 .  PM GCSS-Army- PMO Operations"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM GCSS-Army"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fort Lee, VA 23805"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "103.931"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "103.931"
                                                    },
                                                    "TargetValue": {
                                                        "val": "62.385"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.278"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.278"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Enterprise Resource Planning (ERP) design and development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Information Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Chester, VA 23836"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "465.845"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.213"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "467.058"
                                                    },
                                                    "TargetValue": {
                                                        "val": "457.056"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Government Developer Subject Matter Experts"
                                                },
                                                "FundingVehicle": {
                                                    "val": "IA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ASA (FM&C), CASCOM and GFEBS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "22.315"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "22.315"
                                                    },
                                                    "TargetValue": {
                                                        "val": "19.730"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2019 SBIR \/ STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.042"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.042"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Disconnected Ground Operations"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DOD ESI Multi Vendor"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington VA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "21.675"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "21.675"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "19.218"
                                                    },
                                                    "TotalCost": {
                                                        "val": "40.893"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Continuous Enhancements"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.831"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "6.182"
                                                    },
                                                    "TotalCost": {
                                                        "val": "12.013"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "1. PM Support - Independent Verification and Validation (IV&V)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CAP Gemini"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "2250 Corporate Park Dr, Herndon, VA 20171"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.031"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.031"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.031"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "2.  PM Support - Program Management Support Services A"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Engility Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "3750 Centerview Drive Chantilly, VA 20151"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.386"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.386"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "3. PM Support - Program Management Support Services B"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Logistics Management Institue"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colonial Heights, VA 23834"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "42.101"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "42.101"
                                                    },
                                                    "TargetValue": {
                                                        "val": "42.101"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "1. Test and Evaluation -  Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "McLean VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "39.95"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "39.950"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "7_083_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Seg 2 Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 1 - Acquisition Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 1\/Segment 1 Operational Assessment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 1 - Milestone B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 1\/Release 1.1  DTOE"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GCSS-Army Release 1.1 Design, Build, Test & Stabilize"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 1 - Milestone C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Release 1.1 Intial Operational Test and Evaluation (IOT&E)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Release 1.1 Stabilization"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Lead Site Verification"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Release 1.1 Full Deployment Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Field Wave 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GCSS-Army Release 1.2 (Wave 2) Plan, Analyze, Design, Build & Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Release 1.2 (Wave 2) Lead Site Verification Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Release 1.2 (Wave 2) In Progress Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Field Release 1.2 (Wave 2)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Continuous Enhancements (Design and Development)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Disconnected Ground Operations (Development  Testong and Deployment)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EK2"
                    },
                    "ProjectTitle": {
                        "val": "GCSS-A Increment 2"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "50.16"
                        },
                        "CurrentYear": {
                            "val": "53.967"
                        },
                        "BudgetYearOne": {
                            "val": "65.233"
                        },
                        "BudgetYearOneBase": {
                            "val": "65.233"
                        },
                        "BudgetYearTwo": {
                            "val": "14.928"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "184.288"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "GCSS-Army Increment 1 gives combat forces a decisive edge by providing soldiers a seamless flow of timely, accurate, accessible, and secure logistics information to get combat power at the right place, at the right time.  The GCSS-Army program is an information and communications technology investment that provides key enabling support to the transformation of the Army into a network-centric, knowledge-based future force. GCSS-Army implements best business practices to streamline supply, accountability, maintenance, distribution, and reporting procedures in support of the future force transition path of The Army Campaign Plan.  \n\nGCSS-Army Increment 2 builds on the current foundation by providing auditable Army Enterprise Aviation maintenance, enhanced Business Intelligence\/Business Warehouse (BI\/BW) and Army Pre-Positioned Stock (APS) functional capabilities and will sunset legacy systems:  the Aircraft Notebook and Army War Reserve Deployment System (AWRDS).  Increment 2 will deliver greater efficiencies to Aviation Logistics warfighters and improve information flow and accuracy in real time to decision makers, helping them make better decisions faster on the battlefield.   \n\nIn FY 2019, the AAE approved a new technical approach for Enterprise Aviation, which will utilize a commercial disconnected architecture capability from SAP, called Agile Deployed Operations (ADO).  ADO will allow the Army to extend the fully integrated Enterprise Aviation capability to a disconnected platform and will provide timely and accurate visibility and accountability of materiel down to the unit level. ADO developed under the Enterprise Aviation effort will also serve as the foundation for disconnected ground operations.  Enterprise Aviation will replace a legacy standalone client server architecture and integrate its functionalities into an enterprise system. \n\nImplementation of the BI\/BW capabilities provide enhancements in materiel and supply chain readiness analytics that are critical to inform commanders' understanding of weapons systems readiness, helping them make better decisions faster on the battlefield. \n\nThe APS capabilities directly impacts the speed at which a deploying unit can draw combat equipment while reducing the burden of the day-to-day maintenance and accountability of APS stock.  \nThe FY 2021 funding will continue design, development, and incremental testing for Enterprise Aviation capability in the GCSS-Army baseline software; will continue to develop the SAP disconnected operations technical architecture; and will begin development to re-platform the Aircraft Notebook in order to sunset this legacy system.  FY 2021 RDTE funds will also allow the Army to develop critical maintenance, supply and financial reports that will be used for Enterprise Aviation and key functional areas in order to improve readiness reporting.  Finally, FY 2021 funding will address the requirements to allow units to quickly draw APS stocks."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "System Design, Develop and Build"
                                    },
                                    "Description": {
                                        "val": "The purpose of this phase is to begin the system development for an incremental capability that is affordable and executable to satisfy the Key Performance Parameters and Key System Attributes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "49.535"
                                            },
                                            "Text": {
                                                "val": "Wave 1 EAVN ? Conducted Middleware Engineering Analysis (risk reduction) to determine optimal technical approach for EAVN program. Briefed the evaluation results to stakeholders and Army Senior Leadership. On 4 June 2019, the AAE approved the Revised Technical Approach to the GCSS-Army Aviation Logistics program - rather than a middleware capability to bridge the gap between SAP and Microsoft software languages, the program will pursue a pure SAP development approach along with the SAP Agile Deployed Operations solution for Disconnected Operations. The Program Office initiated execution of the revised technical approach (technical deep-dive complete and Blueprinting ongoing) \nWave1 EAVN ? Successful completion of Release 1A development, integrator testing, Government testing, and Production Readiness Review; Release 1A includes management of Aviation Master Data in AESIP Hub. The Release 1A software code was incorporated into GCSS-Army Baseline August 2019.\nWave1 EAVN ? Successful completion of Release 1B development (includes DA Form 2410 Equipment Records, Notification Management, and Work Order Management in GCSS-Army).\nWave 1 EAVN ? Conducted Army Overarching Integrated Product Team (AOIPT) and Cost Review Board."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "50.798"
                                            },
                                            "Text": {
                                                "val": "Enterprise Aviation (EAVN): PM will field Release 1 to 2,000 new users in addition to the existing Aviation GCSS-Army users for recording off-platform tracked equipment repairs. Release 1 also delivers Master Data capabilities ACN platform. The PM will demonstrate that production\/deployment design is stable, the design will meet stated and derived requirements based on acceptable performance in developmental test events, provide mature software capability consistent with the software development schedule, incur no significant production risks, and demonstrate interoperability and operational supportability. Release 1 will complete full deployment  in early FY 2021. The PM will develop EAVN Release 2 primarily focusing on the disconnected Agile Deployed Operations (ADO) capability that Army Aviation requires. PM will finalize designs for product support elements and integrate them into a comprehensive product support package ready for production and deployment.\n\nBI\/BW elements related to data visualization, reporting and data analytics will complete software development. PM will finalize designs for product support elements and integrate them into a comprehensive product support package ready for production and deployment in early FY 2021.\n\nAdditional BI\/BW capabilities associated with realizing further enhancements in business intelligence, common operating picture and data analytics across the Army logistics enterprise will begin software development to include system design and a series of design reviews prior to test article fabrication and\/or software build or coding."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "64.378"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "64.378"
                                            },
                                            "Text": {
                                                "val": "After FY 2020 contract award, in FY 2021 the program will continue design, development, and incremental testing for Enterprise Aviation software Release 2, which includes 1) required changes in the GCSS-Army baseline and the AESIP Enterprise Hub to accommodate the development and integration of the Enterprise Aviation solution; 2) continued development of the SAP Agile Deployed Operations (ADO) technical architecture solution into FY21, which will also serve as a required foundation for GCSS-Army disconnected ground capabilities; and 3) initiation of the development effort to re-platform the Aircraft Notebook (ACN) functionality into an integrated user edge device. Re-platforming will allow the Army to sunset the ACN legacy system and its standalone client server architecture. \n\nImplementation of GCSS-Army Wave 2 BI\/BW reporting capabilities will provide enhancements to materiel and supply chain readiness with an additional capability to perform self-service analytics. The analyses will provide critical information to commanders' on weapons systems readiness enabling them to make quick decisions on the battlefield. BI\/BW reporting will provide visibility and associated costs of materials and equipment, at the tactical and national levels, for Supply, Maintenance, Property Book functions, helping to improve lifecycle management and auditability. \n\nAs directed, following an FY 2020 gap analysis, APS development will include integration of worldwide APS business processes to include conduct of operational assessment of APS in order to operationalize logistics management of APS overseas to improve readiness posture."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "RDTE funding increased in FY 2021 to accommodate an approved new technical solution. The new technical solution involves leveraging the SAP deployed operations technical architecture, known as Agile Deployed Operations (ADO), and the re-platforming effort to integrate Aircraft Notebook functionality into GCSS Army.  The revised technical approach involves increased development effort for FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Government System Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Government System Test and Evaluation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.625"
                                            },
                                            "Text": {
                                                "val": "FY 2019 Accomplishments:\nTest and evaluation of Enterprise Aviation.  Built and tested prototypes to verify compliance with capability requirements; and established initial product baseline for all configuration items.  Performed design reviews prior to test article fabrication and\/or software build or increment coding. Preparations for Developmental Test and Evaluation (DT&E) and Operational Test and Evaluation (OT&E).\nSuccessful completion of Release 1A development, integrator testing, Government testing, and Production Readiness Review; Release 1A includes management of Aviation Master Data in AESIP Hub. The Release 1A software code was incorporated into GCSS-Army Baseline August 2019."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.719"
                                            },
                                            "Text": {
                                                "val": "Independent Government Testing on EAVN Release 1."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.855"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.855"
                                            },
                                            "Text": {
                                                "val": "FY 2021 funding will provide for government personnel to conduct continuous evaluation assessment of developmental testing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Release 1 government testing will be completed in FY20. Release 2 government testing will commence in FY 2022."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.45"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "W11011"
                                    },
                                    "Title": {
                                        "val": "GCSS-Army Increment 2"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.841"
                                        },
                                        "CurrentYear": {
                                            "val": "6.841"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.794"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.794"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.946"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "24.422"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OMA - 423612000-OMA"
                                    },
                                    "Title": {
                                        "val": "GCSS-Army Increment2"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.357"
                                        },
                                        "BudgetYearOne": {
                                            "val": "16.791"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "16.791"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "20.146"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "41.294"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "GCSS-Army Increment 2 continues the evolutionary acquisition strategy of Increment 1 and will define, develop, and deploy additional and enhanced capabilities to GCSS-Army based upon proven technology, time-phased requirements, projected threat assessments, and demonstrated manufacturing capabilities. The program office will award a base year contract with 3 option years in FY 2020, using a Department of Defense Enterprise Software Initiative (DoD ESI) contract, to design and develop the core architecture that will be used for disconnected ground and aviation operations.  This same contract vehicle will also be used to build the edge software for disconnected supply, maintenance and accountability. \nGCSS-Army will also leverage the partnership with the U.S. Army Communications-Electronics Command, and supplement the design and development team with architecture and engineering support from the existing support contract.\n\nGCSS-Army Increment 2 is being implemented in three waves:\n\nWave 1 provides the Army Enterprise Aviation logistics capability. Government System Integrator is the Combat Capability Development Command (CCDC) Aviation and Missile Center, System Simulation and Software Integration (S3I) Directorate.. Department of Defense (DoD) Enterprise Software Initiative (ESI) blanket purchase agreement (BPA) contract will be awarded in 2020.\n\nWave 2 provides the enhanced BI\/BW capability. Contract was awarded June 2019.\n\nWave 3 provides the APS capability.  Contract award TBD."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMO Operations"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PMO"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.86"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.860"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.45"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.450"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "EAVN Blueprinting"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AMRDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "89.282"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.533"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "90.815"
                                                    },
                                                    "TargetValue": {
                                                        "val": "90.815"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "EAVN System Design, Develop and Build"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CCDC Aviation and Missile Cmd"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville AL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "34.139"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "31.111"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "30.634"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "30.634"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "20.062"
                                                    },
                                                    "TotalCost": {
                                                        "val": "115.946"
                                                    },
                                                    "TargetValue": {
                                                        "val": "115.397"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2019 SBIR \/ STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.398"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.269"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.533"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.533"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "1.407"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.607"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "EAVN ADO Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DOD ESI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington VA"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.112"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "16.614"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "16.614"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "2.366"
                                                    },
                                                    "TotalCost": {
                                                        "val": "25.092"
                                                    },
                                                    "TargetValue": {
                                                        "val": "25.337"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "EAVN SME Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DOD ESI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Richmond VA"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.555"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.667"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.667"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "1.701"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.923"
                                                    },
                                                    "TargetValue": {
                                                        "val": "5.168"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "EAVN SETA Supt"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "LMI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.963"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.035"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.197"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.197"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "6.924"
                                                    },
                                                    "TotalCost": {
                                                        "val": "27.119"
                                                    },
                                                    "TargetValue": {
                                                        "val": "27.364"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "BI\/BW Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "4M"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville AL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.14"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.918"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.403"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.403"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "4.971"
                                                    },
                                                    "TotalCost": {
                                                        "val": "10.432"
                                                    },
                                                    "TargetValue": {
                                                        "val": "10.677"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "BI\/BW Program\/SETA Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "LMI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.259"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.627"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.889"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.889"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "1.335"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.110"
                                                    },
                                                    "TargetValue": {
                                                        "val": "4.355"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.748"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.486"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.219"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.219"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "1.335"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.788"
                                                    },
                                                    "TargetValue": {
                                                        "val": "4.033"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "EAVN Government Matrix Supt"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CCDC Aviation and Missile Cmd"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville A"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.355"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.93"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.222"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.222"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.507"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen PG MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.625"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.474"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.855"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.855"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "10.290"
                                                    },
                                                    "TotalCost": {
                                                        "val": "12.244"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "7_EK2_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "MDA Meeting"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Deployment ATP"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Capability Support ATP"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Rel 1 EAVN Blueprinting\/ SW Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Rel 1 Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Rel 1 Deployment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Release 2 EAVN Blueprinting\/R2 SW Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Rel 2 Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Rel 2 Deployment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Business Intelligence\/Business Warehouse Blueprinting\/Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "APS Blueprinting\/Development\/Testing\/\/Deployment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "The schedule for GCSS-Army Increment 2 is based upon the Army Acquisition Executive (AAE) decision to utilize the Government System Integrator. Schedule reflects three releases for Enterprise Aviation (Wave 1), one release for Business Intelligence\/Business Warehouse (Wave 2), and one release for Army Prepositioned Stock (Wave 3)."
                        }
                    }
                }
            ]
        }
    }
}