{
    "id": "2021-Navy-PB-1319-MJBOOK-3-0-744c7ee94c2cc798fbfd935e35baade9caa8a86b67e6f22ecedd75220314848f-15",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605866N"
        },
        "ProgramElementTitle": {
            "val": "Navy Space & Electr Warfare Supt"
        },
        "R1LineNumber": {
            "val": "186"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "16.032"
            },
            "CurrentYear": {
                "val": "12.652"
            },
            "BudgetYearOne": {
                "val": "15.787"
            },
            "BudgetYearOneBase": {
                "val": "15.787"
            },
            "BudgetYearTwo": {
                "val": "18.890"
            },
            "BudgetYearThree": {
                "val": "17.667"
            },
            "BudgetYearFour": {
                "val": "17.099"
            },
            "BudgetYearFive": {
                "val": "17.440"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Project 0706, Electromagnetic Compatibility (EMC) and Radio Frequency (RF) Management Program: Develops advanced technology to identify and eliminate Electromagnetic Interference (EMI) sources from Navy systems. Supports research and development technology efforts, develops top-level plans, and supports systems in the Space and Electronic Warfare (SEW) mission area.\n\nProject 3239, The Real-Time Spectrum Operations (RTSO) effort researches and develops software to automate analyses of the Electromagnetic (EM) Environmental Effects (E3) between shipboard transmitters and receivers on ships and the interactions of the EM systems within the other systems installed on units within a strike group.  RTSO develops and updates numerical models, algorithms, data bases, and software which aids and supports warfighter spectrum planning, sensing and monitoring characterization and prediction, and managing and maneuvering within the EM spectrum."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "16.227"
                },
                "CurrentYear": {
                    "val": "15.773"
                },
                "BudgetYearOne": {
                    "val": "17.632"
                },
                "BudgetYearOneBase": {
                    "val": "17.632"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "16.032"
                },
                "CurrentYear": {
                    "val": "12.652"
                },
                "BudgetYearOne": {
                    "val": "15.787"
                },
                "BudgetYearOneBase": {
                    "val": "15.787"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.195"
                },
                "CurrentYear": {
                    "val": "-3.121"
                },
                "BudgetYearOne": {
                    "val": "-1.845"
                },
                "BudgetYearOneBase": {
                    "val": "-1.845"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-3.121"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.195"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.868"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.868"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.023"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.023"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Real-Time Spectrum Operations (RTSO) funding was realigned into PU 3239 from PU 0706 starting in FY20 to support transition to the designated lead capability integrator.\n\nRTSO - FY21  $2.191M increase is associated with the start of the design, development, and transition of the RTSO Own Force Monitoring (OFM) Deployable Mission Module (DMM) capability to meet critical Fleet requirements for Emissions Control (EMCON) Validation and Tactical Situation (TACSIT) management to all non-capable ships.  The RTSO OFM DMM will be developed and fielded to meet validated OFM capability requirements outlined in U.S. Fleet Forces Command \/ Commander, U.S. Pacific Fleet RTSO Requirements Document Ltr dtd 4 Dec 2017."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0706"
                    },
                    "ProjectTitle": {
                        "val": "EMC & RF Mgmt"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "16.032"
                        },
                        "CurrentYear": {
                            "val": "2.233"
                        },
                        "BudgetYearOne": {
                            "val": "3.177"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.177"
                        },
                        "BudgetYearTwo": {
                            "val": "3.106"
                        },
                        "BudgetYearThree": {
                            "val": "2.960"
                        },
                        "BudgetYearFour": {
                            "val": "3.011"
                        },
                        "BudgetYearFive": {
                            "val": "3.070"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Electromagnetic Compatibility (EMC) and Radio Frequency (RF) Management Program. This project develops tools, processes, and algorithms to identify and mitigate EMI sources for Navy systems and platforms.\n\n(a) It will support the Afloat Electromagnetic Spectrum Operations Program (AESOP), an automated spectrum Fleet operational capability. The application will be enhanced to comply with fleet operational requirements and streamline Strike Force frequency management processes. It will provide automated Spectrum Management (SM) tools for development of operational task communication and radar\/weapon plans to support fleet deployments, exercises, and contingency operations. It will provide identification and mitigation of EMI in Navy, North Atlantic Treaty Organization (NATO), Allied, Ashore and Joint Combat Operations. It will provide analysis related to spectrum reallocation proposals to assess impacts on Navy operations and systems, as well as for the Spectrum Supportability Risk Assessments.\n\n(b) It will support the Shipboard Electromagnetic Compatibility Improvement Program (SEMCIP) to identify, engineer, and evaluate effectiveness of potential EMI corrections. The program also characterizes and quantifies the operational impact of EMI problems on system's mission performance.\n\n(c) It will support the Nuclear Electromagnetic Pulse (EMP) Survivability Program. The program assesses the EMP survivability of all mission critical systems and funds development of a hardness assurance and maintenance program. It will develop improved modeling capability to reduce hardness validation costs at delivery and over the lifetime of the system\/platform. The program develops new and updated design criteria, test methodology, test limits, and survivability validation procedures for all Navy systems, ships, submarines and shore facilities.\n\n(d) It will support the Real-Time Spectrum Operations Program (RTSO). The program researches the Electromagnetic (EM) Environmental Effects (E3) between shipboard transmitters and receivers on ships and the interactions of the EM systems within the other systems installed on units within a strike group. The program will develop a capability to monitor the EM Spectrum Usage on a ship and be able to validate the spectrum plan to ensure Electromagnetic Capability (EMC) is achieved within the strike group. The program will develop a capability to display compliance with the spectrum plan in a Common Operational Picture (COP) display. These initial capabilities of Own Force Monitoring provide Battlespace Awareness and will be instrumental in enabling Electromagnetic Maneuver Warfare. These capabilities of self-awareness will further enhance the Navy's ability to perform Command and Control (C2) of the EM Spectrum warfighting domain. \n\nAt the direction of OPNAV, in the beginning of FY2018 the project changed the technical approach to mitigate cost, schedule, and performance risks associated with the original Hardware (H\/W) solution that required extensive integration and networking of all spectrum dependent systems. The revised technical approach simplifies the original hardware plan required in favor of a centralized radio frequency monitoring capability with software applications that can still meet fleet requirements of own force monitoring. This has resulted in near term schedule delay that is recoverable in FY19."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Afloat Electromagnetic Spectrum Operations Program (AESOP)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.324"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Develop updates for spectrum models, develop revised electromagnetic compatibility (EMC) criteria, spectrum coordination procedures, and update required databases.\n- Document EMC criteria in the NAVSEA Operational Publication S9407-AA-GYD-010\/(S) OP-3840 \"Electromagnetic Compatibility Criteria for Navy Systems (U)\".\n- Research and update spectrum usage and revised coordination procedures based on updates to Numbered Fleet Standing Communications Plans.\n- Research and update spectrum usage and revised coordination procedures based on updates to international or national guidance to ensure compliance.\n- Develop spectrum compatibility and coordination procedures for Navy systems.\n- Develop tactically feasible interference mitigation strategies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.415"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.415"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Provide engineering analyses and recommendations for updating Littoral Radiation Restrictions for numbered fleet areas of responsibility.  Document the worldwide Littoral Radiation Restrictions and provide to the fleet and to RTSO.\n- Conduct engineering analyses and testing to determine electromagnetic compatibility (EMC) criteria for Navy assets.\n- Document EMC criteria in NAVSEA Operational Publication S9407-AA-GYD-010\/(S) OP-3840 \"Electromagnetic Compatibility Criteria for Navy Systems (U)\".\n- Revise and update Standing Operational Tasking (OPTASK) Communications Plans to accommodate Navy equipment and host nation regulations.\n- Provide impact assessments and analysis for new spectrum-dependent equipment, spectrum policy updates, and changing geopolitical conditions.\n- Research interactions and leveraging opportunities between various data sources for spectrum data; provide the Navy layer input for joint restricted frequency lists, and equipment, platform, and other databases.\n- Serve as the Navy's subject matter experts for spectrum de-confliction, EMC, and tactical spectrum management within Navy, DoD, and external components."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of 0.11 from FY 2020 to FY 2021 is for increased engineering analysis requirements to support Real-Time Spectrum Operations (RTSO) and provide compatibility criteria and spectrum assessments for Navy operations and systems."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Shipboard Electromagnetic Compatibility Improvement Program (SEMCIP)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.677"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.273"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Characterize and quantify operational impact of Electromagnetic Interference (EMI) on approximately 60 specific EMI problems to identify level of problem severity and prioritize EMI mitigation efforts, with Fleet commanders, system and ship or submarine program managers.\n- Provide engineering, analytical, and technical support to achieve electromagnetic compatibility (EMC) among and\nbetween shipboard electronic\/electric systems and\/or equipment.\n- Develop and evaluate the effectiveness of proposed Electromagnetic Interference (EMI) solutions to mitigate interference among and between shipboard electronic\/electric systems and\/or equipment.\n- Coordinate the proposed solutions with the system and ship or submarine program managers for ensure proper integration, and long term logistic support.\n- Develop and field limited production fixes, and evaluate their effectiveness in mitigating shipboard Interference.\n- Investigate the operational impacts to deployed shipboard radars, based on the Radar Spectrum Engineering Criteria (RSEC) to ensure continued operational capability.\n- Develop innovative measurement capabilities, to reduce test time and to quantify electromagnetic environmental effects of Navy platforms, systems, subsystems, and equipment to and from their intended operational electromagnetic environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.817"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.817"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Characterize and quantify operational impact of new Electromagnetic Interference (EMI) problems reported and predicted from FY18 to present.  \n- Analyze and evaluate effectiveness of radar signal processing algorithms for the mitigation of current and future electromagnetic environment waveforms.  \n- Analyze and evaluate effectiveness of forward error correction algorithms for the mitigation of current and future electromagnetic environment waveforms.  \n- Continue to develop new EMI fixes and evaluate their effectiveness in mitigating shipboard EMI.\n- Continue evaluation of Unmanned Bit Error Rate Test (UBERT) capability and research applicability to Ship EMC Certification. \n- Develop autonomous EMI detection capabilities for radar and communication systems in order to reduce test time and quantify likelihood over extended periods, like ship underway periods or operational deployments.\n- Research historical context of high frequency (HF) intermodulation (IMI) test methods and standards, and develop alternate test methods applicable to digital HF receivers."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of 0.524 from FY 2020 to FY2021 is due to the required technical support needed to perform Radar Spectrum Engineering Criteria analysis and direct fleet support."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electromagnetic Pulse (EMP) Survivability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.811"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.660"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Complete Continue computational electromagnetic (CEM) modeling capability to assist in ship hardness design.\n- Develop new Hybrid-Based High Altitude Electrometric Pulse (HEMP) evaluation technique to evaluate HEMP hardness of navy ships via a low-cost, low potential for equipment damage and quicker method of analysis (decreasing costs in the performance of tests).\n- Investigate small, inexpensive measurement devices for incorporation into Hybrid-Based HEMP evaluation methodology.\n- Develop instrumentation and data acquisition capability in support of the HEMP Ashore Test Facility [i.e., Naval\nOrdinance Transient Electromagnetic Simulator].\n- Develop and\/or improve design criteria, test methodology, test limits, and survivability validation procedures for Navy systems, ships, submarines and shore facilities.\n- Perform research and development of integrated solutions that for EMP hardening. Investigate improvements to the cable shield ground adapters, terminal protection devices and cable maintenance procedures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.945"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.945"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Complete computational electromagnetic (CEM) modeling capability to assist in ship hardness design.\n- Continue developing new Hybrid-Based High Altitude Electrometric Pulse (HEMP) evaluation technique to evaluate HEMP hardness of navy ships via a low-cost, low potential for equipment damage and quicker method of analysis (decreasing costs in the performance of tests).\n- Continue investigating small, inexpensive measurement devices for incorporation into Hybrid-Based HEMP evaluation methodology.\n- Finish developing instrumentation and data acquisition capability in support of the HEMP Ashore Test Facility [i.e., Naval Ordinance Transient Electromagnetic Simulator].\n- Refine design criteria, test methodology, test limits, and survivability validation procedures for Navy systems, ships, submarines and shore facilities.\n- Perform research and development of integrated solutions that for EMP hardening. Investigate improvements to the cable shield ground adapters, terminal protection devices and cable maintenance procedures."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of 0.285 from FY 2020 to FY 2021 is due to support development of new Hybrid-Based High Altitude\nElectromagnetic Pulse (HEMP) evaluation technique"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Real-Time Spectrum Operations (RTSO)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.220"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "An acquisition strategy is not required."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3239"
                    },
                    "ProjectTitle": {
                        "val": "Real-Time Spectrum Operations (RTSO)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "10.419"
                        },
                        "BudgetYearOne": {
                            "val": "12.610"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.610"
                        },
                        "BudgetYearTwo": {
                            "val": "15.784"
                        },
                        "BudgetYearThree": {
                            "val": "14.707"
                        },
                        "BudgetYearFour": {
                            "val": "14.088"
                        },
                        "BudgetYearFive": {
                            "val": "14.370"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Real-Time Spectrum Operations (RTSO) funding was  realigned into PU 3239 from PU 0706 starting in FY20 to support transition to the designated lead capability integrator."
                        },
                        "ProjectMissionDescription": {
                            "val": "Real-Time Spectrum Operations (RTSO)) develops tools, processes, and algorithms to conduct spectrum planning, sense and monitor, characterize and predict Electromagnetic Environmental Effects(E3), and manage and maneuver to avoid and mitigate Electromagnetic Interference (EMI) and Electromagnetic (EM) Vulnerability for Navy systems and platforms.\n\nRTSO supports Navy and Marine Corps Electromagnetic Spectrum Operations for global spectrum usage and allocation planning. The effort researches the EM E3 between shipboard transmitters and receivers on ships and the interactions of the EM systems within the other systems installed on units within a strike group.  RTSO will develop a capability to sense and monitor shipboard EM Spectrum Usage and validate the spectrum plan to achieve Emissions Control (EMCON) within the strike group.  The effort will validate and display spectrum plan compliance with a spectrum common operational picture.  This EM spectrum Management Aid with own force monitoring sensor input supports Battlespace Awareness and Information Operations.  These self-awareness and validation capabilities will greatly enhance the Navy's ability to perform Command and Control of the EM Spectrum warfighting domain."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Real-Time Spectrum Operations (RTSO)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.419"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue the development and fielding of a capability to perform Frequency Plan Compliance Verification monitoring ship's radiating spectrum dependent systems ensuring compliance to frequency plans.\n- Continue the development of a new multi-mode radar coordination procedures and assignments to ensure new U.S. Navy radars are electromagnetically compatible within the strike group.\n- Leverage FY2019 Plans to build an initial Spectrum Operational Planning Tool (SOPT) developing alternate operational and map views, utilizing a Naval Tactical Data System (NTDS) type displays.\n- Continue the development of spectrum restrictions visualization map for shipboard personnel.\n- Continue the development of processes and methods to publish the emissions control (EMCON) bill for a given ship.\n- Continue the development of processes and software capability for numbered fleet commands, combatant commands, and Navy Marine Corps Spectrum Offices to develop and publish littoral radiation restriction regulations.\n- Continue to participate in the Consolidated Afloat Networks and Enterprise Services (CANES) Application Integration (AI) System Integration Test (SIT). \n- Continue to participate in exercises and experiments. \n- Continue updates to Real-Time Spectrum Operations (RTSO) software documents and artifacts to include, but not limited to, the Top Level Requirements (TLR), Requirements Traceability Matrix (RTM), Requirements Definition Package (RDP), functional Architecture, RMF cybersecurity accreditation documentation, test and fielding plans, training development and consolidated training strategy, and sustainment plans."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.610"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.610"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to research, develop, enhance and refine Cloud architecture, Spectrum COP, Live data, Detect, counter-detect (1-to-1), Time slide, and Network nodes.\n- Continue research, development, testing, and evaluation for own-force spectrum monitoring capabilities, including commercial and military sensors, antenna, and network connections.\n- Continue research and development of proof-of-concept capabilities for spectrum mission planning decision aids and intelligent sectoring\/cut-outs for radiating systems\n- Continue research and development efforts for models to estimate effective RF performance ranges of spectrum dependent systems in the complex electromagnetic environment (one-on-one and multi-on-one effects)\n- Continue to refine analysis with Ship Signal Exploitation Equipment (SSEE) Family of Systems (FoS) Programs of Records to identify long-term hardware solution set for deployment for SSEE enabled platforms as well as non-SSEE enables platforms. \n- Continue research on RTSO support on Tactical Airborne and Submarine platforms.\n- Continue Limited Objective Experiments (LOEs) to demonstrate incremental capability to Fleet users.\n- Continue development of an architecture that supports mission module delivery of RTSO capability on all platforms"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "RTSO - FY21  $2.191M increase is associated with the start of the design, development, and transition of the RTSO Own Force Monitoring (OFM) Deployable Mission Module (DMM) capability to meet critical Fleet requirements for Emissions Control (EMCON) Validation and Tactical Situation (TACSIT) management to all non-capable ships.  The RTSO OFM DMM will be developed and fielded to meet validated OFM capability requirements outlined in U.S. Fleet Forces Command \/ Commander, U.S. Pacific Fleet RTSO Requirements Document Ltr dtd 4 Dec 2017."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "An Acquisition strategy is not required"
                        }
                    }
                }
            ]
        }
    }
}