{
    "id": "2021-Navy-PB-1319-MJBOOK-3-0-744c7ee94c2cc798fbfd935e35baade9caa8a86b67e6f22ecedd75220314848f-19",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0606355N"
        },
        "ProgramElementTitle": {
            "val": "Warfare Innovation Management"
        },
        "R1LineNumber": {
            "val": "190"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "40.722"
            },
            "CurrentYear": {
                "val": "28.750"
            },
            "BudgetYearOne": {
                "val": "37.022"
            },
            "BudgetYearOneBase": {
                "val": "37.022"
            },
            "BudgetYearTwo": {
                "val": "43.675"
            },
            "BudgetYearThree": {
                "val": "45.814"
            },
            "BudgetYearFour": {
                "val": "48.144"
            },
            "BudgetYearFive": {
                "val": "49.023"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Allied\/Coalition Maritime Environment (ACME) 0798:\nThis project promotes interoperability with allied and coalition forces by facilitating maritime interoperability in both processes and communication systems, including emerging capabilities, to counter growing high-end asymmetric threats. \n\nSpace & Electronic Warfare (SEW) Engineering 2144:\nThis project is a systems engineering non-acquisition program to develop, test, implement Technical Authority (TA) products, and validate Naval Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR), Business Information Technology (IT), and Space System architectures to support naval, Joint and Coalition missions across normal, contested, and degraded cyber\/operational environments.  The objective of this project is carried out by multiple tasks that ensure development and delivery of Naval Information Warfare (IW) capabilities that are well-integrated, interoperable, secure, and resilient to meet validated warfighting requirements.  \n\nThe Intelligence, Surveillance, and Reconnaissance (ISR) Architecture 2147:\nThis project is intended to guide system of systems capability development and promote interoperability across Navy ISR programs, as well as interoperability and alignment with Department of Defense (DoD)-wide enterprise initiatives including Joint Information Environment (JIE) and Intelligence Community (IC) Information Technology Environment (ITE). This effort to develop integrated ISR architectures will also help instill systems engineering discipline and standardization across the Navy ISR Enterprise and provide a means by which to assess ISR Program of Record (POR) progress in conforming to a single Navy architecture.\n\nFleet Experimentation 3319:  \nThe U.S. Navy's Fleet Experimentation (FLEX) project advances\/augments operational and tactical warfighter capabilities through the experimentation of high payoff initiatives, technologies and concepts, Fleet Concepts of Operations (CONOPS), doctrine, and new tactics, techniques and procedures (TTP). The main focus of FLEX between 2018 and 2024 is to operationalize \"A Design For Maintaining Maritime Superiority\" Blue Line of Effort (LOE) through the execution of Fleet Design materiel\/non-materiel capability employment.  \n\nTrident Warrior Project 3320: \nThe U.S. Navy's Trident Warrior (TW) experimentation campaign enables early delivery of capabilities to the warfighter via Fleet-directed Trident Warrior operational events with an emphasis on United States Fleet Forces\/Commander Pacific Fleet (USFF\/CPF) directed focus areas. \n  \nMaritime Communications Demonstration Project 3420:\nClassified Project Maritime Communications Demonstration (MCD) is not a new start.  Funding was realigned from project 3319 FLEX in FY18. The Expeditionary SFOC Communications is developing and experimenting innovative concepts designed to validate both materiel and non-materiel methodologies to provide resilient command and control within the maritime domain.  Identified previous work done within Office of the Secretary of Defense (OSD) channels, and will leverage lessons learned."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "41.918"
                },
                "CurrentYear": {
                    "val": "28.750"
                },
                "BudgetYearOne": {
                    "val": "39.456"
                },
                "BudgetYearOneBase": {
                    "val": "39.456"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "40.722"
                },
                "CurrentYear": {
                    "val": "28.750"
                },
                "BudgetYearOne": {
                    "val": "37.022"
                },
                "BudgetYearOneBase": {
                    "val": "37.022"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.196"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-2.434"
                },
                "BudgetYearOneBase": {
                    "val": "-2.434"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.050"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.246"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.426"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.426"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.008"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.008"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY2021 funding request was decreased by $1.577 million to account for the availability of prior year execution balances."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0798"
                    },
                    "ProjectTitle": {
                        "val": "Allied\/Coalition Maritime Environment (ACME)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.059"
                        },
                        "CurrentYear": {
                            "val": "1.114"
                        },
                        "BudgetYearOne": {
                            "val": "1.194"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.194"
                        },
                        "BudgetYearTwo": {
                            "val": "1.226"
                        },
                        "BudgetYearThree": {
                            "val": "1.274"
                        },
                        "BudgetYearFour": {
                            "val": "1.297"
                        },
                        "BudgetYearFive": {
                            "val": "1.324"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The ACME program advances Information Warfare (IW) (to include Command, Control, Communications, Computers; Intelligence, Surveillance and Reconnaissance (C4ISR); Electronic Warfare (EW); and Cyber Warfare), interoperability with Australia, Canada, New Zealand, United Kingdom, United States (AUSCANNZUKUS), North Atlantic Treaty Organization (NATO), and other Allied and Coalition partners. The program determines maritime operational gaps with our allies, identifies Doctrine, Organization, Training, Material, Leadership, Personnel, and Facilities (DOTMLPF) solutions with the potential to fill those gaps, and assesses these solutions and associated concepts of operation in laboratory and at-sea environments. The ACME program includes integration and testing in support of joint and Allied war fighting capabilities, including interoperability testing of IW equipment. Allied and joint interoperability is critical for future maritime operations, especially as the United States Navy (USN) expands Internet Protocol (IP) networking throughout the fleet via Consolidated Afloat Networks and Enterprise Services (CANES), Next Generation Networks (NGEN), Mission Partner Environment\/ Future Mission Networking (MPE\/FMN), the U.S. Battlefield Information Collection and Exploitation System - eXtended (BICES-X), and with the Joint Information Environment (JIE).\nCurrently, IP connectivity with AUSCANNZUKUS and other Allied\/Coalition forces is limited, requiring extensive backhaul through ashore infrastructure. Higher bandwidth solutions suitable for use over tactical networks require development and assessment for emerging coalition and joint interoperability requirements, such as Maritime Domain Awareness (MDA), Network Operations Without Shore (NOWS), Satellite Communications (SATCOM) Denied, Degraded, Intermittent and Low-bandwidth (DDIL) operations, and to counter Anti-Access Area Denial (A2\/AD) threats. Increases in data throughput are required for the effective exchange of rich IW data sets and services via Service Oriented Architectures (SOA) within the limitations of High Frequency (HF), Ultra-High Frequency (UHF), and other portions of the radio frequency spectrum, coupled with appropriate Information Assurance and Computer Network Defense (IA\/CND) mechanisms. Development and assessment of potential solutions will integrate improved IP capabilities with the Advanced Digital Network Systems (ADNS) and existing international standards (e.g. Allied Communications Publication 200, NATO Standardization Agreements 5066 and 4691). The continued development and refinement of advanced tactical networking technologies and protocols, to include Low Probability of Intercept (LPI), Low Probability of Detection (LPD), and Anti-Jam (AJ) capabilities as well as Automatic Link Establishment (ALE) standards, will provide for a significant improvement in secure data sharing within, and between, coalition maritime elements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Relay Capabilities"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.059"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.114"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop and evaluate secure, interoperable technologies and capabilities supporting Denied, Degraded, Intermittent and Low-bandwidth (DDIL) operations including Allied\/Coalition Shared Situational Awareness, cross-domain and data labeling solutions in maritime tactical networking environments, and advanced Information Assurance and Computer Network Defense (IA\/CND) solutions (with common and interoperable processes and technologies). \n- Continue to evaluate technologies for interoperable maritime networking. Solutions will address higher bandwidth, Low Probability of Intercept (LPI)\/Low Probability of Detection (LPD)\/Anti-Jam (AJ) technologies across the Radio Frequency (RF) and Optical spectrum and include airborne capabilities. Evaluation of electromagnetic spectrum management and visualization technologies, force-level Electronic Warfare\/Electro-magnetic Maneuver Warfare (EW\/EMW) will also enhance interoperable Information Warfare (IW). \n- Continue to enhance Allied IW interoperability with other joint and maritime multi-national forums, such as the Combined Communications Electronic Board (CCEB), Multinational Maritime Information-system Interoperability Steering Group (M2I2), MPE\/FMN, and Joint Information Environment (JIE) forums.\n- Continue to assess and validate individual technologies, integrated solutions, and associated Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel and Facilities (DOTMLPF) through experimentation, trials and demonstrations with Australia, Canada, New Zealand, United Kingdom, United States (AUSCANNZUKUS) and other Allied\/Coalition partners during operational venues, such as the United States Navy (USN) Rim of the Pacific (RIMPAC) or United Kingdom (UK) Joint Warrior exercise series."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.194"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.194"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop and evaluate secure, interoperable technologies and capabilities supporting Denied, Degraded, Intermittent and Low-bandwidth (DDIL) operations including Allied\/Coalition Shared Situational Awareness, cross-domain and data labeling solutions in maritime tactical networking environments, and advanced Information Assurance and Computer Network Defense (IA\/CND) solutions (with common and interoperable processes and technologies). \n- Continue to evaluate technologies for interoperable maritime networking. Solutions will address higher bandwidth, Low Probability of Intercept (LPI)\/Low Probability of Detection (LPD)\/Anti-Jam (AJ) technologies across the Radio Frequency (RF) and Optical spectrum and include airborne capabilities. Evaluation of electromagnetic spectrum management and visualization technologies, force-level Electronic Warfare\/Electro-magnetic Maneuver Warfare (EW\/EMW) will also enhance interoperable Information Warfare (IW). \n- Continue to enhance Allied IW interoperability with other joint and maritime multi-national forums, such as the Combined Communications Electronic Board (CCEB), Multinational Maritime Information-system Interoperability Steering Group (M2I2), MPE\/FMN, and Joint Information Environment (JIE) forums.\n- Continue to assess and validate individual technologies, integrated solutions, and associated Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel and Facilities (DOTMLPF) through experimentation, trials and demonstrations with Australia, Canada, New Zealand, United Kingdom, United States (AUSCANNZUKUS) and other Allied\/Coalition partners during operational venues, such as the United States Navy (USN) Rim of the Pacific (RIMPAC) or United Kingdom (UK) Joint Warrior exercise series."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $0.08 million from FY 2020 to FY 2021 is attributed to additional support required for Allied Information Warfare (IW) interoperability exercises with other joint and maritime multi-national forums."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2144"
                    },
                    "ProjectTitle": {
                        "val": "Space & Elec Warfare Engineering"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "21.513"
                        },
                        "CurrentYear": {
                            "val": "14.535"
                        },
                        "BudgetYearOne": {
                            "val": "22.165"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.165"
                        },
                        "BudgetYearTwo": {
                            "val": "27.491"
                        },
                        "BudgetYearThree": {
                            "val": "29.295"
                        },
                        "BudgetYearFour": {
                            "val": "30.703"
                        },
                        "BudgetYearFive": {
                            "val": "31.231"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "The FY2021 funding request was decreased by $0.773 million to account for the availability of prior year execution balances."
                        },
                        "ProjectMissionDescription": {
                            "val": "To support Navy objectives in advancing Information Warfare (IW) capabilities, the Space and Electronic Warfare (SEW) Engineering project provides three main functions:\n\n(1) Perform System of Systems (SoS) Cybersecurity Engineering; develop the architectures, specifications and standards, tools, and processes to support a single integrated Navy plan for cybersecurity. These engineering artifacts provide Navy specific guidance to drive common and consistent implementation of security controls across current and future Navy Programs of Record\/projects. This eliminates redundancies and inefficiencies characteristic of previous stove-pipe development efforts in which each system addressed security individually. These efforts enable a standardized approach to move out faster to improve the Navy's cyber resiliency. Provide the cybersecurity vulnerability and functional test capability, which supports cybersecurity test requirements and the Command, Control, Communications, Computers, Intelligence (C4I) components of Naval Information Warfare Systems Command (NAVWARSYSCOM) Information Warfare (IW) Capability Testing Lab (formerly USS SECURE). NAVWAR Cyber Security Testing Capability\/Labs is a cyber assessment program within the Navy. This SoS (Afloat, Aloft, C4I & Shore) capability in a test laboratory environment provides a rapidly re-configurable capability that integrates maritime hardware systems into a virtual platform. This platform level SoS provides cybersecurity research, development, test and evaluation, and training, not otherwise possible. This combination of Systems Commands (SYSCOM) laboratories, cyber ranges, and Red Teams simulating Navy platforms in operational maritime environments is critical for effectively evaluating cyber threats against specified mission threads.\n\n(2) Perform System of Systems (SoS) Capability Roadmapping and Engineering; define an integrated Enterprise Architecture to support design, development and delivery of integrated Navy Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR), Business Information Technology (IT), and Space System capabilities. This architecture reflects current (as-is) and future (target) end states to support technical analyses, program planning, and enterprise-level investment decisions across IW capabilities. Perform mission based system of systems analysis to ensure integration and interoperability, and validate end-to-end warfighting capabilities to quickly address emerging threats. Provides engineering tools and processes to drive rigorous Systems Engineering discipline across the acquisition lifecycle to support rapid development and delivery of secure and interoperable C4ISR, Business IT, and Space Systems capabilities that meet Fleet requirements. Conduct Systems Engineering Technical Reviews (SETRs) to provide independent, objective assessments of technical maturity and compliance with applicable architectures, specifications and standards across IW capabilities. The Coalition Warrior Interoperability eXploration, eXperimentation, eXamination, eXercise (CWIX) provides a means to demonstrate and evaluate the interoperability of United States (US), North Atlantic Treaty Organization (NATO), and coalition information sharing systems.\n\n(3) Navy Additive Manufacturing (AM) technology aligns to CNO priorities to deliver revolutionary capabilities to improve fleet readiness. These enterprise solutions will provide the foundation to (a) enhance warfighter capability through new innovative system designs; (b) increase readiness through low volume production of hard to source items; and (c) improve warfighting capacity by enabling production at or near the point of need. Specific efforts include the development of an Enterprise Digital Manufacturing Architecture which addresses design and certification of AM capabilities for both afloat and ashore, development of Cyber Security Risk Management Profiles for devices and applications on operational networks, definition of a secure Technical Data Package to describe components that can be digitally manufactured, and the development of an overarching, enterprise-level Digital Manufacturing Thread (device management, digital rights management, licensing, configuration management, data storage rule\/access and application programing interfaces)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cybersecurity Architecture, Specifications and Standards"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.695"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.793"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to evaluate emerging threats, advances in technology, updates to National Institute of Standards and Technology (NIST) and DoD guidance, and results of Naval Information Warfare Systems Command (NAVWARSYSCOM) Information Warfare (IW) Capability Testing Lab (formerly USS SECURE) cyber test activities to inform the need for new technical artifacts that provide cybersecurity guidance to Navy Programs of Record (PoR) and projects.\n- Develop detailed design artifacts for PoRs to ensure integration between Navy Cyber Situational Awareness (NCSA) tools and the Defensive Cyber Operations (DCO) enclave to enable command and control of Navy networks under all cyber conditions.\n- Continue to assess Acquisition Category (ACAT) programs compliance with Information Technology (IT) and Cybersecurity (CS)\/ Technology Authority (TA) architectures, specifications and standards.  Refine the Cybersecurity Figure of Merit (CFOM) to assess Information Warfare programs and projects effectiveness in meeting cybersecurity requirements.\n- Continue to evaluate and provide feedback on Navy PoRs plans for implementation of cybersecurity controls. Support program reviews and milestones by assessing compliance with CS\/TA cybersecurity architectures and standards, and perform risk assessments that articulate systems' ability to effectively support operational missions in various cyber conditions. \n- Drive implementation of CS\/TA cybersecurity architectures and standards across programs and projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Beginning in FY21, funding has been consolidated into System of Systems (SoS) Cybersecurity Engineering."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY21 decrease is due to the consolidation of this subproject into consolidated SoS Cybersecurity Engineering."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cybersecurity Vulnerability & Functional Test Capability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.021"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.831"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to utilize lab assets for cross-SYSCOM Naval Information Warfare Systems Command (NAVWARSYSCOM) Information Warfare (IW) Capability Testing Lab (formerly USS SECURE) serial test events."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Beginning in FY21, funding has been consolidated into System of Systems (SoS) Cybersecurity Engineering."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY21 decrease is due to the consolidation of this subproject into System of Systems (SoS) Cybersecurity Engineering."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enterprise Architecture"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.728"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.668"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Support Navy digital requirements by continuing to grow the capabilities of the Architecture Data Repository to effectively share data across the Naval Information Warfare Systems Command (NAVWAR) enterprise and with other Naval Systems Commands (SYSCOMs). Provide the infrastructure critical to implementing an integrated Model Based Systems Engineering environment, and provide configuration management. \n- Continue development of Model Based System Engineering (MBSE) capabilities, processes and tools to support complex technical performance gap analysis and trade recommendations by identifying capability gaps and overlaps, interoperability issues, and cybersecurity risks between Navy System of Systems (SoS) capabilities.  \n- Continue to refine the Integration and Interoperability (I&I) Integrated Capability Framework to support SoS analyses of how well systems operate together across the Naval enterprise to deliver validated warfighting capabilities. \n- Continue to use Command and Control (C2), Battlespace Awareness, and Integrated Fires (IF) Integrated Capabilities Technical Baseline (ICTBs) to perform analysis of mission performance, identify capability gaps, and perform engineering trade studies for prioritized missions, to better inform investment decisions and ensure alignment to all emerging warfighting objectives for increased interoperability and information sharing across weapons, sensors, and shooters."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Beginning in FY21, funding has been consolidated into System of Systems (SoS) Capability Roadmapping and Engineering."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY21 decrease is due to the consolidation of this subproject into System of Systems (SoS) Capability Roadmapping and Engineering."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SYSCOM Systems Engineering"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.161"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.979"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- As the Technical Authority (TA) for acquisition programs, continue to perform Systems Engineering Technical Reviews (SETRs) to ensure compliance with statutory and regulatory directives, as well as applicable Information Technology (IT) and Information Assurance (IA) TA architectures, specifications, standards and profiles.  Provide an independent assessment of technical risk to support milestone decision authority and program manager decisions.\n- Continue to develop and perform technical reviews of formal acquisition and engineering documentation to ensure the application of sound systems engineering analysis and design principles to system planning requirements, design, testing, and supportability. Implement applicable current TA architectures, specifications, standards, policies and processes in documentation. Provide independent technical analyses to support Milestone Decisions.\n- Continue to conduct Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) certifications through design and testing analysis, ensuring interoperability with platform, force level, and joint\/allied\/coalition forces.\n- Continue engineering evaluations, assessments of compliance with authoritative architectures and technical standards, and address technical issues in the following domains: Command and Control (C2); Intelligence, Surveillance, & Reconnaissance\/Information Operations (ISR\/IO); Space Systems, Business IT; and Communications & Networks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Beginning in FY21, funding has been consolidated into System of Systems (SoS) Capability Roadmapping and Engineering."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY21 decrease is due to the consolidation of this subproject into System of Systems (SoS) Capability Roadmapping and Engineering."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Coalition Warrior Interoperability eXploration, eXperimentation, eXamination, eXercise (CWIX)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.007"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.048"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop interoperability and information sharing through coalition engagement, technology, demonstrations, and assessments leading to improvements of Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) systems within the Navy and in conjunction with Joint Services and Coalition efforts.\n- Coordinate with the MultiNational Maritime Informational Technology and Interoperability Board (M2I2) to facilitate interaction between Resource Sponsor guidance and experimentation desires of Coalition Partner Nations.\n- Continue to pursue and utilize greater Pacific Command (PACOM) and Southern Command (SOUTHCOM) Partner Nation engagement by fostering a connected, distributed experimentation environment suitable for expanded experimentation in those areas.\n- Continue to enhance interoperability across North Atlantic Treaty Organization (NATO) and affiliated Coalition Partners by participating in the planning and execution of Coalition Warrior Interoperability eXploration, eXperimentation, eXamination, eXercise (CWIX).\n- Continue to assess Coalition Interoperability assurance, validation, and verification as related to the engineering and execution of the Mission Partner Environment (MPE) in the appropriate venues.\n- Continue to utilize connected environments such as the Combined Federated Battle Laboratories Network (CFBLNet) to experiment with innovative technical solutions in order to evaluate their value in fostering enhanced interoperability across Coalition Partner Nations and the United States (US)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Beginning in FY21, funding has been consolidated into System of Systems (SoS) Capability Roadmapping and Engineering."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY21 decrease is due to the consolidation of this subproject into System of Systems (SoS) Capability Roadmapping and Engineering."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Additive Manufacturing"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.901"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.216"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Utilize the Additive Manufacturing (AM) Test-Bed to develop specifications, standards, and architecture to drive interoperability across the Navy Enterprise Digital Thread for Additive Manufacturing.\n- Continue development of Risk Management Framework (RMF) Profiles for the various components and interfaces required to network AM hardware and software assets.\n- Define a Defense-in-Depth Functional Implementation Architecture Network Transformation(DFIANT) architecture for additive manufacturing.\n- Initiate an additive manufacturing data strategy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.117"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.117"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Complete development of Risk Management Framework (RMF) Profiles for the various components and interfaces required to network AM hardware and software assets.\n- Continue utilizing the Additive Manufacturing Test-Bed to develop specifications, standards, and architecture to drive interoperability across the Navy Enterprise Digital Thread for Additive Manufacturing.\n- Define a Defense-in-Depth Functional Implementation Architecture Network Transformation(DFIANT) architecture for additive manufacturing.\n- Complete the Additive Manufacturing data strategy.\n- Define the Digital Manufacturing Strategy for integration into logistics Digital transformation plan.\n- Create Off-Shore deployable Data Repository and digital architecture for Afloat Units."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $0.901 million from FY 2020 to FY 2021 is attributed to Digital Architecture expansion required to achieve higher levels of data and cyber security postures. Funds will create additional off-shore deployable data repositories to support afloat units."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "System of Systems (SoS) Cybersecurity Engineering"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Funding in FY20 and prior resides in (a) Cybersecurity Architecture, Specifications & Standards, and (b) Cybersecurity Vulnerability & Functional Test Capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.290"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.290"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to evaluate emerging threats, advances in technology, updates to National Institute of Standards and Technology (NIST) and DoD guidance, and results of Naval Information Warfare Systems Command (NAVWARSYSCOM) Information Warfare (IW) Capability Testing Lab (formerly USS SECURE) cyber test activities to inform the need for new technical artifacts that provide cybersecurity guidance to Navy Programs of Record (PoR) and projects.\n  \n- Continue to develop the architectures, specifications, and standards that provide the technical foundation of the single, integrated Navy plan for cybersecurity, and drive implementation of Information Technology (IT)  and Cybersecurity (CS)\/Technology Authority (TA) architectures, specifications and standards across programs and projects. Support program reviews and milestones via risk assessments that articulate systems' ability to support operational missions in various cyber conditions and refining the Cybersecurity Figure of Merit (CFOM) to assess Information Warfare programs and projects effectiveness in meeting cybersecurity requirements.\n\n- Develop detailed design artifacts for PoRs to ensure integration between Navy Cyber Situational Awareness (NCSA) tools and the Defensive Cyber Operations (DCO) enclave to enable command and control of Navy networks under all cyber conditions.\n\n-Continue to utilize lab assets for cross-SYSCOM NAVWAR Cybersecurity Testing Capability serial test events."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY21 increase from FY20 is due to consolidated efforts totaling $7.624 million. The additional $4.666 million is due to increased Navy demand for systems that have robust cybersecurity whether they be business or C4ISR systems and capabilities, and that those capabilities have been tested in a virtual environment prior to deployment. Funds support increased labor costs needed to keep assets cyber secure in an ever-changing and complex threat environment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "System of Systems (SoS) Capability Roadmapping and Engineering"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Funding in FY20 and prior resides in (a) Enterprise Architecture, (b) SYSCOM Systems Engineering, and (c)Coalition Warrior Interoperability eXploration, eXperimentation, eXamination, eXercise (CWIX) programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.758"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.758"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue supporting Navy digital engineering requirements by continuing to grow the capabilities of the Architecture Data Repository to effectively share data across the NAVAL INFORMATION WARFARE SYSTEMS COMMAND (NAVWARSYSCOM) enterprise and with other Naval Systems Commands (SYSCOMs). Provide the infrastructure critical to implementing an integrated Model Based Systems Engineering environment, and provide configuration management.\n\n- Continue development of Model Based System Engineering (MBSE) capabilities, processes and tools to support \ndevelopment and delivery of recommendations to address capability gaps, overlaps, interoperability issues and cybersecurity risks across complex Navy System of Systems (SoS) to ensure effective end-to-end mission performance.\n\n- Continue to refine the Integration and Interoperability (I&I) Integrated Capability Framework (ICF) to support SoS analyses of how well systems operate together across the Naval enterprise to deliver validated warfighting capabilities.\n\n- Perform Systems Engineering Technical Reviews (SETRs) across Command and Control (C2); Intelligence, Surveillance, & Reconnaissance\/Information Operations (ISR\/IO); Space Systems, Business IT; and Communications & Networks to ensure compliance with statutory and regulatory directives, as well as implementing applicable Information Technology (IT) and Cybersecurity (CS) Technology Authority (TA) architectures, specifications, standards, policies, processes and profiles. \n\n- Continue to conduct Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance(C4ISR) certifications and technical reviews of formal acquisition and engineering documentation through design and testing analysis, ensuring interoperability with platform, force level, and joint\/ allied\/coalition forces. \n\n- Resume Competency Development Model (CDM) development by defining roles and appropriate Knowledge Skills and Abilities (KSAs) for the Naval Information Warfare Systems Command (NAVWARSYSCOM) Engineering Competency required to meet evolving mission requirements.\n\n- Continue to promote improved interoperability and information sharing through coalition engagement, technology, demonstrations, and assessments leading to improvements of Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) systems within the Navy and in conjunction with Joint Services and Coalition efforts. Partners include the MultiNational Maritime Informational Technology and Interoperability Board (M2I2), Pacific Command (PACOM) and Southern Command (SOUTHCOM), and North Atlantic Treaty Organization (NATO). Partner feedback is for the planning and execution of Coalition Warrior Interoperability eXploration, eXperimentation, eXamination, eXercise (CWIX) and execution of the Mission Partner Environment (MPE) in the appropriate venues."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY21 increase from FY20 is due to consolidated efforts totaling $3.695 million.  The additional $2.063 million is due to increased fleet demand for operational architectures and roadmapping to build robust information warfare systems capable of being supported by or supporting the fleet. Funds will expand and develop system architectures able to meet new standards and expectations from fleet users."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2147"
                    },
                    "ProjectTitle": {
                        "val": "ISR  Architecture"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.544"
                        },
                        "CurrentYear": {
                            "val": "1.535"
                        },
                        "BudgetYearOne": {
                            "val": "1.541"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.541"
                        },
                        "BudgetYearTwo": {
                            "val": "1.570"
                        },
                        "BudgetYearThree": {
                            "val": "1.597"
                        },
                        "BudgetYearFour": {
                            "val": "1.631"
                        },
                        "BudgetYearFive": {
                            "val": "1.664"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Integrated architectures provide a technical framework for assessing capability gaps and performance of individual systems and System of Systems (SoS) and their ability to effectively provide the desired effects to support warfighting missions. They also serve as a means to influence and drive Programs of Record (PoR) toward a common, more efficient state that promotes interoperability and security.\n\nThe Naval Intelligence, Surveillance, and Reconnaissance (ISR) Reference Architecture project is intended to guide system of systems capability development and promote interoperability across Navy ISR programs, as well as interoperability and alignment with Department of Defense (DoD)-wide enterprise initiatives including Joint Information Environment and Intelligence Community Information Technology Environment and Space & Naval Warfare Systems Command-wide Enterprise Architecture policies. This effort to develop integrated ISR architectures will instill systems engineering discipline and standardization across the Navy ISR Enterprise and provide a means by which to assess ISR PoR progress in conforming to a single Navy architecture. These efforts will reduce Information Technology\/ISR infrastructure complexity and variances, making it easier to manage, operate and defend our ISR capabilities, and help inform investment decisions across the Navy's ISR enterprise to support Assured Command and Control, Battlespace Awareness and Integrated Fires.\n\nThis effort will encompass the documentation and analysis of current ISR enterprise architectures to inform and guide requirements for target architecture development and performance requirements to support full use and incorporation of ISR capabilities to advance Navy operations afloat. The associated studies will produce both technical and non-technical implementation guidance across the Doctrine, Organization, Training, Material, Leadership, Personnel and Facilities spectrum."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Intelligence, Surveillance, and Reconnaissance (ISR) Architecture"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.544"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.535"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to analyze the current ISR capabilities of afloat, ashore, joint, and national systems within mission contexts to demonstrate gaps and overlaps in Information Warfare capabilities and document in engineering artifacts and architectures. Perform trade space analysis and develop and quantify solutions using technical and operational performance parameters.\n- Continue to build on the documentation and analysis of the enterprise ISR capabilities to support System of Systems engineering assessments to identify integration and interoperability gaps, trades, and solutions to support investment decision-making across the ISR portfolio.\n- Continue to integrate the National, Joint, and Naval ISR architectures within mission contexts to identify functional capacities, materiel integration and interoperability gaps and overlaps, as well as any policy and doctrine impacts.\n- Continue to perform verification and validation (V&V) to ensure ISR architecture and analytic products accurately capture system performance specifications. \n- Continue to capture all architectural data in the Naval Information Warfare Systems Command (NAVWAR) analysis tool suite to support rigorous engineering assessments and architecture excursions against solution alternatives.\n- Continue to ensure alignment and interoperability between ISR Architectures and Joint Information Enterprise, Intelligence Community Information Technology Enterprise and NAVWAR Enterprise Architectures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.541"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.541"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to analyze the current ISR capabilities of afloat, ashore, joint, and national systems within mission contexts to demonstrate gaps and overlaps in Information Warfare capabilities and document in engineering artifacts and architectures. Perform trade space analysis and develop and quantify solutions using technical and operational performance parameters.\n- Continue to build on the documentation and analysis of the enterprise ISR capabilities to support System of Systems engineering assessments to identify integration and interoperability gaps, trades, and solutions to support investment decision-making across the ISR portfolio.\n- Continue to integrate the National, Joint, and Naval ISR architectures within mission contexts to identify functional capacities, materiel integration and interoperability gaps and overlaps, as well as any policy and doctrine impacts.\n- Continue to perform V&V to ensure ISR architecture and analytic products accurately capture system performance specifications. \n- Continue to capture all architectural data in the NAVWAR analysis tool suite to support rigorous engineering assessments and architecture excursions against solution alternatives.\n- Continue to ensure alignment and interoperability between ISR Architectures and Joint Information Enterprise, Intelligence Community Information Technology Enterprise and NAVWAR Enterprise Architectures."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The $0.006M increase is attributed to additional V&V support required to ensure ISR architecture and analytic products accurately capture system performance specifications."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3319"
                    },
                    "ProjectTitle": {
                        "val": "Fleet Experimentation"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "8.790"
                        },
                        "CurrentYear": {
                            "val": "9.281"
                        },
                        "BudgetYearOne": {
                            "val": "9.783"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.783"
                        },
                        "BudgetYearTwo": {
                            "val": "11.000"
                        },
                        "BudgetYearThree": {
                            "val": "11.213"
                        },
                        "BudgetYearFour": {
                            "val": "12.028"
                        },
                        "BudgetYearFive": {
                            "val": "12.269"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "The FY2021 funding request was decreased by $0.804 million to account for the availability of prior year execution balances."
                        },
                        "ProjectMissionDescription": {
                            "val": "Chief of Naval Operations Fragmented Order (FRAGO) 01\/2019 signed December 2019, focuses on improved warfighting using experiments and exercises in venues such as Large Scale Exercises (LSE) and Fleet Battle Problems to assess implementation progress for concepts like Distributed Maritime Operations (DMO).  Fleet Experimentation (FLEX) funds are used to implement Fleet Design through foundational warfighting concepts like DMO and is a proven and efficient approach to improving warfighting effectiveness. FLEX resources the experimentation venues - operationally representative environments - to focus solutions on to solving warfighting problems and maturing foundational warfighting concepts.  Through experimentation, concept solutions are tested, refined, and used to support acquisition strategy and inform procurement decisions.  The FLEX program addresses warfighting gaps identified in: Integrated Prioritized Capability Lists (IPCL) generated by Warfighting Development Centers (WDC), Fleet Integrated Priorities Letter (IPL), Fleet Commanders' FLEX Guidance, Navy Urgent Operational Needs Statements, Fleet Design, DMO, and other concepts.  Additionally, through experimentation activities such as workshops, war simulations, live at-sea events, and experimentation campaigns, the FLEX program examines potential materiel and non-materiel solutions that will enhance the Fleet's ability to execute assigned missions. FLEX events and campaigns are comprised of all facets of experimentation including design, planning, systems engineering and integration, execution, data collection, analysis, assessment, and the delivery of tangible products. While Naval-centric, FLEX efforts include joint, coalition, Science and Technology (S&T), academia, and industry partners."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Fleet Experimentation (FLEX)"
                                    },
                                    "Description": {
                                        "val": "Fleet Experimentation (FLEX) is a collaborative effort with multiple partners designed to address prioritized capability gaps to produce Doctrine, Organization, Training, Materiel, Leadership, Personnel, Facilities, and Policy (DOTMLPF-P) actions. FLEX deliverables are focused on operational and tactical warfighting capabilities in the near term (within the Future Years Defense Plan) and prioritized by annual Fleet (CUSFF, CPF, CNE-AF) Commanders' guidance to enhance warfighting capability across all warfare areas.  FLEX is the enabler to Fleet Design and its experimentation initiatives support delivery of Navy Operational Architecture (NOA), Fleet Warfighting Training Continuum (FWTC) and Distributed Maritime Operations (DMO).   \n\nFLEX supports efforts for workshops, in-port and at-sea experiments, and war simulations.  FLEX provides venues and the expertise to identify DOTMLPF-P gaps for sponsored programs\/technologies prior to delivery to the Fleet, with the goal of delivering capability wholeness to the warfighter. FLEX is vital to continuously improving critical naval warfighting capabilities identified in the Navy's Concept for Distributed Maritime Operations (DMO) signed by CNO Feb 2019 and \"A Design for Maintaining Maritime Superiority 2.0\" signed by CNO Dec 2018"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.790"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.281"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Commander U.S. Fleet Forces Command, Commander Pacific Fleet and Commander Naval Forces Europe - Africa, approve the Fleet Experimentation (FLEX) Execution Plan every two (2) years. Highlighted in this submission is the FY20\/21 plan. The Navy's FY20 FLEX plan aligns to the U.S. Navy Fleet Design campaign plan and its implementation by 2023. The following FLEX efforts will build upon prior year efforts in either a workshop, at-sea event, or war simulation:\n\nOPERATIONAL COMMAND AND CONTROL (C2) OF MINE WARFARE (MIW)\nThis tabletop experiment will examine, compare, and contrast the merits of several courses of action proposed to modify the existing MIW C2 construct. The results will be used to support a Fleet Commander decision on the way-ahead for MIW C2.\n\nFLEET BATTLE PROBLEM 19-4\nFBP 19-4 will examine an Amphibious Readiness Group's (ARG) capability to execute specified tasks during an extended duration transit in restrictive Emissions Control (EMCON) conditions, including flight operations, replenishments at sea, and casualty evacuations. FLEX will focus on Information Warfare Commander concept of operations and own force monitoring capabilities during EMCON.\n\nFAST AGILE NAVAL TECHNOLOGY MUNITIONS (FANTOM) TECHNOLOGY INNOVATION GAME (TIG) WORKSHOP\nTIG workshops, executed in conjunction with ONR, give Fleet operators the opportunity to examine emerging capabilities and determine potential concepts of employment to effectively incorporate innovative capabilities into Fleet warfighting missions and tasks. The FANTOM workshop will provide fleet feedback on potential employment of emerging torpedo technology.\n\nFLEET BATTLE PROBLEM 20-1E\nFLEX during this Fleet Battle Problem will focus on Information Warfare Commander concept of operations and enabling doctrine, alternate communication paths, and enhancing communication flexibility and battle awareness for the Maritime Operations Center (MOC).\n\nNAVAL INTEGRATED FIRES CAMPAIGN KINETIC WAR SIMULATION\nThis effort builds upon prior year experiments to further examine US Navy Carrier Strike Group (CSG) capability to successfully employ Navy Integrated Fires capabilities.\n\nSILENT ECHO\nDuring this Commander, Sixth Fleet exercise, FLEX will examine Navy Tactical Exploitation of National Capabilities (TENCAP) sponsored capabilities focused on electromagnetic maneuver warfare enablers.\n\nJUNIPER COBRA 20-2\nDuring this Commander, Sixth Fleet exercise, FLEX will examine capabilities focused on electromagnetic maneuver warfare enablers such as maneuver decision aids and alternative communication paths\/methods.\n\nADVANCED LONG RANGE TARGETING (ALRT) TECHNOLOGY INNOVATION GAME (TIG) WORKSHOP\nTIG workshops, executed in conjunction with ONR, give Fleet operators the opportunity to examine emerging capabilities and determine potential concepts of employment to effectively incorporate innovative capabilities into Fleet warfighting missions and tasks. The ALRT workshop will provide fleet feedback on potential employment of battle management decision tools incorporating artificial intelligence capabilities.\n\nPACIFIC BATTLE LAB\nThis Pacific at-sea experiment will employ a two-ship task group with an opposition force to examine alternative communication paths in a contested environment.\n\nJOINT WARRIOR 201\nDuring this at-sea exercise, FLEX will examine Navy TENCAP-sponsored capabilities focused on electromagnetic maneuver warfare enablers.\n\nLARGE SCALE EXERCISE 2020\nDuring this two-week globally integrated large scale fleet exercise, FLEX will examine multiple initiatives focused on advancing critical Expeditionary Advanced Base Operations (EABO) and Distributed Maritime Operations (DMO) capabilities in support of Fleet Design.\n\nBALTIC OPERATIONS (BALTOPS) 2020\nDuring this annual NATO exercise, FLEX will examine several initiatives focused on electromagnetic maneuver warfare enablers and employment of unmanned systems in support of mine warfare.\n\nRIM OF THE PACIFIC (RIMPAC) 2020\nDuring this biennial coalition exercise, FLEX will examine manned-unmanned teaming, employment of unmanned systems in support of DMO, and employment of emerging technologies in support of Full Spectrum Undersea Warfare (USW).\n\nVALIANT SHIELD 2020\nDuring this biennial joint exercise, FLEX will primarily examine the employment of long range maritime fires.\n\nCOUNTER-UNMANNED SYSTEMS\nThis at-sea experiment will build upon previous efforts to examine emerging technologies in support of the detection, tracking, and engagement of Unmanned Systems (UxS) in a maritime environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.783"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.783"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Commander U.S. Fleet Forces Command, Commander Pacific Fleet and Commander Naval Forces Europe - Africa, approve the Fleet Experimentation (FLEX) Execution Plan every two (2) years. Highlighted in this submission is the FY20\/21 plan. The Navy's FY21 FLEX plan aligns to the U.S. Navy Fleet Design campaign plan and its implementation by 2023. The following FLEX efforts will build upon prior year efforts in either a workshop, at-sea event, or war simulation:\n\nCOUNTER-INTELLIGENCE, SURVEILLANCE, RECONNAISSANCE AND TARGETING (ISRT)\nExperiments will build upon EMW-related experiments completed in recent years to explore technologies and associated Training Tactic and Procedure (TTP) designed to counter adversary ISRT capabilities.\n\nRESILIENT COMMUNICATIONS AND MISSION COMMAND\nExperiments will build upon technologies and associated TTP designed to provide the Fleet with alternative communication capabilities that can be relied upon in communication contested environments.\n\nLOGISTICS MOBILITY, CAPACITY, AND PROTECTION\nExperiments will build upon technologies and associated TTP designed to enhance fleet logistics capabilities to support operations in contested environments.\n\nSPACE AND CYBERSPACE INTEGRATION\nExperiments will build upon technologies and associated TTP designed to enhance the fleet's capability to integrate space and cyberspace operations in support of Distributed Maritime Operations (DMO).\n\nREMOTE AND PASSIVE SENSING INTEGRATION\nExperiments will build upon technologies and associated TTP designed to enhance the fleet's capability to take advantage of all available sensor data in support of DMO.\n\nLONG RANGE FIRES\nExperiments will build upon technologies and associated TTP designed to enhance fleet long range fires capabilities in support of DMO.\n\nPOINT DEFENSE\nExperiments will build upon technologies and associated TTP designed to enhance the fleet's capability to provide \"last line\" of defense against adversary manned and unmanned threats.\n\nNAVAL OPERATIONAL ARCHITECTURE\nExperiments will build upon Large Scale Exercise (LSE) 2020 and continue to explore technologies and associated TTP designed to provide the fleet with an integrated operational architecture capable of supporting all facets of DMO."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY21 $0.502 million increase supports additional experimentation venues and initiatives including Fleet Battle Problems (FBP) and Large Scale Exercises (LSE) in support of the Distributed Maritime Operations (DMO) concept and as directed in FRAGO 01\/2019:  \"A Design for Maintaining Maritime Superiority 2.0\", and faster introduction of the capabilities identified in these documents.\n\nThe FY 2021 funding request was reduced by $0.804 million to account for the availability of prior year execution balances."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3320"
                    },
                    "ProjectTitle": {
                        "val": "TRIDENT Warrior"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "2.213"
                        },
                        "CurrentYear": {
                            "val": "2.285"
                        },
                        "BudgetYearOne": {
                            "val": "2.339"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.339"
                        },
                        "BudgetYearTwo": {
                            "val": "2.388"
                        },
                        "BudgetYearThree": {
                            "val": "2.435"
                        },
                        "BudgetYearFour": {
                            "val": "2.485"
                        },
                        "BudgetYearFive": {
                            "val": "2.535"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "U.S. Navy's Trident Warrior (TW) experiment campaign enables early delivery of Information Warfare (IW) capabilities to the warfighter via Fleet-directed TW operational events. Integrates stand-alone systems and efforts to achieve substantially enhanced capability, demonstrates\/tests these capabilities in both laboratory and operational environments, and evaluates their effectiveness. Develops supporting concepts and Concept of Operations to improve warfighting effectiveness. Coordinates IW efforts with other Service\/Joint\/Department of Defense\/National efforts to ensure Joint\/Interagency\/ Allied\/Coalition applicability and interoperability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Trident Warrior"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.213"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.285"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Evaluate Trident Warrior 2019 (TW19) executed experiments and recommend next steps to all stakeholders.\n- Promote broad participation in Trident Warrior (TW) by researching advanced technology solution candidates, in conjunction with other services, and academic research in order to fill Information Warfare (IW) technology gaps.\n- In accordance with standardized procedures, lead TW participant efforts with the following: specific goal identification; risk identification; experiment plans (to include data requirements and collection); and required installation and security certifications, accreditations, and approvals.\n- Provide Subject Matter Expertise (SME) for core ship services during the experimentation period.  \n- Provide independent experts to ensure compliance with experiment plans, lead analysis effort, and deliver unbiased assessments.\n- Provide Subject Matter Expertise to ensure initiative readiness and compliance in the following areas: Information Assurance, Naval Modernization Process, Experimentation Design, Data Collection and Analysis, Report writing and dissemination.\n- Provide results to government sponsors to support the program's engineering recommendations.\n- Plan and execute Trident Warrior 2020 (TW20) experiments to accelerate the transition of IW capability to the Fleet.\n- Begin Trident Warrior 2021 (TW21) planning, taking into consideration identified Naval Capability Gaps."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.339"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.339"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Evaluate TW20 executed experiments and recommend next steps to all stakeholders.\n- Promote broad participation in TW by researching advanced technology solution candidates, in conjunction with other services, and academic research in order to fill IW technology gaps.\n- In accordance with standardized procedures, lead TW participant efforts with the following: specific goal identification; risk identification; experiment plans (to include data requirements and collection); and required installation and security certifications, accreditations, and approvals.\n- Provide independent experts and SME to ensure compliance with experiment plans, lead analysis effort, and deliver unbiased assessments and results to government sponsors to support the program's engineering recommendations.\n- Plan and execute TW20 experiments to accelerate the transition of IW capability to the Fleet.\n- Begin Trident Warrior 2022 (TW22) planning, taking into consideration identified Naval Capability Gaps."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $0.054 million from FY 2020 to FY 2021 is attributed to additional Subject Matter Expertise (SME) support for core ship services during the experimentation period."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3420"
                    },
                    "ProjectTitle": {
                        "val": "Expeditionary Submarine Fiber Optic Cable (SFOC)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "5.603"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.603"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Maritime Communications Demonstration (MCD) project is a classified program responsible for developing concepts designed to validate material and non-material solutions providing resilient Command and Control (C2) within the maritime domain. The focus is to demonstrate capabilities leveraging existing DOD investments and infrastructure to move data and information. Demonstration will include maritime assets, experimental methodologies, and current backhaul architecture for data movement.The key deliverable will be a series of at sea demonstrations to validate maritime segment components in an operationally representative environment.  This is not a new start.  In FY17 $2.8M of funding was managed from within the Fleet Experimentation (FLEX) program and used for MCD project tasking for transparency. This effort is part of Secretary of Defense's (SECDEF) third offset initiative and was identified as a required operational capability by USEUCOM, USNORTHCOM, USPACOM, and USSTRATCOM. This effort will fund limited technical development and a series of at-sea demonstrations raising the technical readiness levels of various components with a cable handling and deployment system in an operationally representative environment, with the intent to rapidly transition to an operational capability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Expeditionary Submarine fiber Optic Cable (SFOC)"
                                    },
                                    "Description": {
                                        "val": "Classified Project - the Maritime Communications Demonstration (MCD) project is developing and experimenting innovative concepts designed to validate both materiel and non-materiel methodologies to provide resilient command and control within the maritime and littoral domains. The project focus is to demonstrate capabilities that leverage existing industry and DOD investments and infrastructure using non-traditional means to move data and information. The key deliverable will be a series of at-sea demonstrations to validate maritime segment components in an operationally representative environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.603"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The last year of funding for this project is FY19 RDT&E"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Maritime Communications Demonstration is a non-acquisition program that promotes DoD interoperability to achieve resilient C2 data flows by facilitating maritime architectures in both processes and communications systems, including emerging capabilities, to counter growing high-end asymmetric threats, and is a key enabler of the Combatant Commanders C2 functionality."
                        }
                    }
                }
            ]
        }
    }
}