{
    "id": "2021-Navy-PB-1319-MJBOOK-0-0-744c7ee94c2cc798fbfd935e35baade9caa8a86b67e6f22ecedd75220314848f-19",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603651M"
        },
        "ProgramElementTitle": {
            "val": "JT Non-Lethal Wpns Tech Dev"
        },
        "R1LineNumber": {
            "val": "20"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "12.956"
            },
            "CurrentYear": {
                "val": "13.307"
            },
            "BudgetYearOne": {
                "val": "13.301"
            },
            "BudgetYearOneBase": {
                "val": "13.301"
            },
            "BudgetYearTwo": {
                "val": "13.564"
            },
            "BudgetYearThree": {
                "val": "13.840"
            },
            "BudgetYearFour": {
                "val": "14.116"
            },
            "BudgetYearFive": {
                "val": "14.399"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The DoD Non-Lethal Weapons Program was established by the FY96 National Defense Authorization Act. The Office of the Secretary of Defense designated the Commandant of the Marine Corps (CMC) as the DoD NLW Executive Agent (EA). The EA exercises centralized responsibility for joint research and development of non-lethal weapons and technology through the Joint Non-Lethal Weapons Program (JNLWP). The Office of the Under Secretary of Defense for Acquisition and Sustainment (A&S) serves as the OSD Principal Staff Assistant and oversees, in consultation with the Under Secretary of Defense for Policy, the DoD NLW Executive Agent.\n\nThe efforts described in this Program Element (PE) reflect science and technology (S&T) investment decisions by the Joint Non-Lethal Weapons (NLW) Integrated Product Team, a multi-service flag level corporate board that provides executive oversight and management for the JNLWP for the CMC. This direction is based on the requirements and capabilities sought by the Services and the Coast Guard, as identified in the DoD's Non-Lethal Weapons Joint Capabilities Based Assessment Document. This coordinated joint S&T development approach addresses mutual capability gaps and assures the most relevant non-lethal technologies, capabilities and equipment are provided to the operating forces while eliminating duplicative service S&T investment. These advanced technology development initiatives feed non-lethal capabilities which directly support the National Defense Strategy (NDS) objective of strategic competition by providing options to the joint force in pursuit of national objectives in legal or policy constrained scenarios, as well as complementing the use of lethal effects in complex combat scenarios, for example, in urban environments with large civilian populations. Ongoing NLW studies, analyses and exercise efforts with  North Atlantic Treaty Organization (NATO) and Allies also support NDS objectives to strengthen alliances and partnerships. Resulting capabilities will facilitate a fully integrated non-lethal competency as a complement to lethal firepower, providing force application options for below lethal threshold engagements.\n\nThis program funds Advanced Technology Development of next-generation non-lethal capabilities and includes performing analysis, technology development efforts, and modeling and simulation necessary to ensure optimum weaponization and use of these capabilities. Investment areas include research and development of next-generation NLWs such as: non-lethal directed energy weapons (lasers, millimeter wave and high power microwave) for counter-personnel and counter-materiel missions; non-lethal counter-personnel technologies (acoustic, optical, and human electro-muscular disruption technologies), and advanced non-lethal materials (including materials for vehicle\/vessel stopping and counter-facility applications). Next generation non-lethal systems focus on long-range localized non-lethal effects to identified threat individuals (or groups of individuals) and\/or their threat weapons systems operating in complicated environments such as urban areas, crowds, buildings, vehicles, vessels, and also in close proximity to high-value civilian facilities.\n\nThis Program Element (PE) funds Advanced Technology Development (ATD) that includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment. Efforts in this PE generally have Technology Readiness Levels TRL) of 4 (component and\/or breadboard validation in laboratory environment.), 5 (component and\/or breadboard validation in relevant environment.), or 6 (system\/subsystem model or prototype demonstration in a relevant environment).\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "13.313"
                },
                "CurrentYear": {
                    "val": "13.307"
                },
                "BudgetYearOne": {
                    "val": "13.301"
                },
                "BudgetYearOneBase": {
                    "val": "13.301"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "12.956"
                },
                "CurrentYear": {
                    "val": "13.307"
                },
                "BudgetYearOne": {
                    "val": "13.301"
                },
                "BudgetYearOneBase": {
                    "val": "13.301"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.357"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.357"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: No significant change\nTechnical: no significant change\nSchedule: no significant change"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3022"
                    },
                    "ProjectTitle": {
                        "val": "Joint Non Lethal Weapons"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "12.956"
                        },
                        "CurrentYear": {
                            "val": "13.307"
                        },
                        "BudgetYearOne": {
                            "val": "13.301"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.301"
                        },
                        "BudgetYearTwo": {
                            "val": "13.564"
                        },
                        "BudgetYearThree": {
                            "val": "13.840"
                        },
                        "BudgetYearFour": {
                            "val": "14.116"
                        },
                        "BudgetYearFive": {
                            "val": "14.399"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds the research and development of next-generation Non-Lethal Weapons and includes performing analysis, technical development efforts, and modeling and simulation necessary to ensure optimum weaponization and use of these NLWs.  Investment areas include research and development of next-generation Non-Lethal Weapons (NLW) such as: non-lethal directed energy weapons (lasers, millimeter wave and high power microwave) for counter-personnel and counter-materiel missions; non-lethal counter-personnel technologies (acoustic, optical, and human electro-muscular disruption technologies), and advanced non-lethal materiels (including materiels for vehicle\/vessel stopping and counter-facility applications). Next-generation Non-Lethal Weapon systems focus on long-range localized Non-Lethal effects to identified threat individuals (or groups of individuals) and\/or their threat weapons systems operating in complicated environments such as urban areas, crowds, buildings, vehicles, vessels, and also in close proximity to high-value civilian facilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Non-Lethal Weapons"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.956"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.307"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Advance the development, integration, and demonstration of advanced technologies and payloads capable of addressing non-lethal counter-personnel and counter-materiel capability gaps while minimizing risk to the operator.  Development efforts include the prototyping of: (1) a next-generation long range - long duration wireless Human Electro-Muscular Incapacitation munition; (2) short pulse source and other high power microwave waveforms that are effective against threat vehicle, vessel, and other target with embedded electronic systems; (3) longer range but more compact millimeter wave technologies capable of being integrated and tested on future escalation of force platforms; and (4) improved sound and light and non-lethal laser technologies.  This includes the development and integration of advanced solid-state and vacuum-tube based millimeter wave technologies for counter-personnel directed energy effects.  Continue human effects modeling and analysis efforts to incorporate risk of significant injury knowledge of specific next-generation NLWs currently under development and utilizing new non-lethal stimuli and phenomenologies.  Transition prototype technologies offering operational utility to higher levels of technology development and acquisition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.301"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.301"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct research and investigation of intermediate force effects and emergent technologies with the potential to further address the Joint Requirements Oversight Council (JROC) approved non lethal counter-personnel and counter-materiel capability gaps. Specifically, explore new non-lethal effects and evaluate alternative innovative applications of existing technologies to address future non-lethal capability needs as escalation of force platforms. Some examples of counter-personnel research include further optimization of non-lethal human effects, and enhanced understanding of human target behavioral effects. Conduct applied research to characterize non-lethal phenomena and to assess target human effects and weapon effectiveness, including the development of dose response and injury correlates for new Non-Lethal Weapons (NLW) technologies. Other research includes the assessment and study of new intermediate force technologies related to NLW effectiveness and behavioral response, such as advancing the understanding of Flash Bang effects on humans to support novel non-explosive alternatives to pyrotechnic non-lethal devices. Some examples of counter-materiel research include the investigation of novel intermediate force capabilities for increased delivery and employment options for applications such as vehicle and vessel stopping, and the further optimization of intermediate force materials for integration into future escalation of force platforms. Other research includes feasibility and design studies for high peak power radio frequency directed energy sources and other high power microwave directed energy technologies (e.g., lasers, millimeter-waves) with extended range applications and longer duration of effect. Other examples of counter-materiel research include the investigation and conceptual design of high power microwave technologies to enable improved reduce overall size, weight, power consumption, thermal cooling requirements, and overall system costs (SWaP-C) performance. Results will support the transition of viable technologies to higher levels of development and demonstration to further mitigate the JROC-approved joint non-lethal effects capability-gaps."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY2020 and FY2021"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}