{
    "id": "2021-AirForce-PB-3600-JBOOK-3e653292bf23896b48cfe5595b0e37331c47f0115b5ffcbbc983acf5fb3f0001-61",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-AIRFORCE_V3B-U_RDTE_JustificationBook_Air_Force_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1201921F"
        },
        "ProgramElementTitle": {
            "val": "Service Support to STRATCOM - Space Activities"
        },
        "R1LineNumber": {
            "val": "302"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "28.636"
            },
            "CurrentYear": {
                "val": "0.988"
            },
            "BudgetYearOne": {
                "val": "0.993"
            },
            "BudgetYearOneBase": {
                "val": "0.993"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "1.004"
            },
            "BudgetYearThree": {
                "val": "1.013"
            },
            "BudgetYearFour": {
                "val": "1.022"
            },
            "BudgetYearFive": {
                "val": "1.041"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Prior to the FY20 PB cycle, The Space Analysis and Application Development Program (WSC 67A011), the Joint Navigation and Warfare Center (WSC 672486), along with the Data Integration and Fusion Center (WSC 67A011), and the Defense Critical Infrastructure Program (WSC 670373) funding were all reported under PE 1201921F.  Beginning in FY20, the Space Analysis and Application Development program and the Joint Navigation Warfare Center will be reported under the newly created PE 1202140F, USSPACECOM.  Leaving only the Data Integration and Fusion Center and the Defense Critical Infrastructure Program being reported under PE 1201921F."
        },
        "ProgramElementMissionDescription": {
            "val": "The USSTRATCOM Data Integration and Fusion Center (DIFC) is an innovative organization developing and experimenting innovative concepts designed to validate both material and non-material methodologies to overcome data isolation in order to enable kill chains in the Joint Battlespace. Funds are necessary to update current government-owned software to ingest and disseminate new data sources from Title 10 and Title 50 sensors.  The DIFC efforts at COCOM sponsored experimentation events will inform service acquisition decisions, capability gaps, intelligence gaps and tactics, techniques and procedures (TTP) development and implementation to mitigate effects on warfighter operations.\n\nMission Assurance (MA) is a DoD risk management effort, driven by DODD 3020.40 that seeks to ensure the availability of networked assets critical to DoD missions.  \"DoD will continue, under the MA construct and policy, existing efforts to meet national and Defense Critical Infrastructure (DCI) requirements established by PPD-21.  Existing Department-level Defense Critical Infrastructure Program policy will remain effective until integrated into, replaced, or rescinded by MA policy.  DoD Components will maintain sufficient resources to meet DCI responsibilities for identifying, assessing, managing, and monitoring risk to critical infrastructure and align associated security, protection, and risk management efforts under an MA construct.”  Critical infrastructure assets can include installations, facilities, antennas, vehicles, computing systems, and communications links.  The USSTRATCOM Defense Critical Infrastructure Protection program (DCIP) is a risk management program that seeks to ensure the availability of networked assets critical to USSTRATCOM and other DoD missions.  Critical infrastructure assets can include installations, facilities, antennas, vehicles, computing systems, and communications links. DCIP is directed by the Office of the Assistant Secretary of Defense (Homeland Defense & Americas' Security Affairs) [OASD (HD&ASA)].  DCIP manages the identification, prioritization, assessment, and assurance of Critical Infrastructure as a comprehensive program that includes the development of adaptive plans and procedures to mitigate risk, restore capability in the event of loss or degradation, support incident management, and protect defense critical infrastructure.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "14.161"
                },
                "CurrentYear": {
                    "val": "0.988"
                },
                "BudgetYearOne": {
                    "val": "0.996"
                },
                "BudgetYearOneBase": {
                    "val": "0.996"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "28.636"
                },
                "CurrentYear": {
                    "val": "0.988"
                },
                "BudgetYearOne": {
                    "val": "0.993"
                },
                "BudgetYearOneBase": {
                    "val": "0.993"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "14.475"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.003"
                },
                "BudgetYearOneBase": {
                    "val": "-0.003"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "14.475"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.003"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.003"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY19 funding increased by $14.475 due to Joint Urgent Operational Need reprogramming.\n\nIn FY20 the decrease is associated with the funding for the Joint Navigation Warfare Center, and the USSTRATCOM Space Modeling and Simulation moving into the newly created USSPACECOM PE 1202140F. The only RDT&E funding remaining in 1201921F will be for the Data Integration and Fusion Center (~$500K per year) and the Defense Critical Infrastructure Program (DCIP) ($488K in FY20)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "670373"
                    },
                    "ProjectTitle": {
                        "val": "DCIP"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.487"
                        },
                        "CurrentYear": {
                            "val": "0.488"
                        },
                        "BudgetYearOne": {
                            "val": "0.495"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.495"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.505"
                        },
                        "BudgetYearThree": {
                            "val": "0.514"
                        },
                        "BudgetYearFour": {
                            "val": "0.523"
                        },
                        "BudgetYearFive": {
                            "val": "0.532"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "An October 2014 memorandum of agreement between USSTRATCOM and Deputy Assistant Secretary of Defense for Defense Continuity and Mission Assurance transferred budget authority for DCIP funding  to USSTRATCOM beginning in FY16. THIS IS NOT A NEW START."
                        },
                        "ProjectMissionDescription": {
                            "val": "Mission Assurance (MA) is a DoD risk management effort, driven by DODD 3020.40 that seeks to ensure the availability of networked assets critical to DoD missions.  \"DoD will continue, under the MA construct and policy, existing efforts to meet national and Defense Critical Infrastructure (DCI) requirements established by PPD-21.  Existing Department-level Defense Critical Infrastructure Program (DCIP) policy will remain effective until integrated into, replaced, or rescinded by MA policy.  DoD Components will maintain sufficient resources to meet DCI responsibilities for identifying, assessing, managing, and monitoring risk to critical infrastructure and align associated security, protection, and risk management efforts under an MA construct.”  Critical infrastructure assets can include installations, facilities, antennas, vehicles, computing systems, and communications links.\n\nThe USSTRATCOM Defense Critical Infrastructure Protection program (DCIP) is a risk management program that seeks to ensure the availability of networked assets critical to USSTRATCOM and other DoD missions.  Critical infrastructure assets can include installations, facilities, antennas, vehicles, computing systems, and communications links. DCIP is directed by the Office of the Assistant Secretary of Defense (Homeland Defense & Americas' Security Affairs) [OASD (HD&ASA)].  DCIP manages the identification, prioritization, assessment, and assurance of Critical Infrastructure as a comprehensive program that includes the development of adaptive plans and procedures to mitigate risk, restore capability in the event of loss or degradation, support incident management, and protect defense critical infrastructure."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mission Assurance Defense Critical Infrastructure Program"
                                    },
                                    "Description": {
                                        "val": "Supports 1) systems engineering analysis for the decomposition of mission systems and assets, and supporting networks and infrastructure that execute USSTRATCOM missions, 2) research, studies, analysis, and operational assessment of mission system capabilities, methodologies, and tactics to identify critical assets and dependency relationships, and 3) evaluation of mission risk through research, studies, analysis and assessment of threats and hazards paired with exploitable vulnerabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.487"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.488"
                                            },
                                            "Text": {
                                                "val": "DCIP continued to support of analysis, studies and research of critical infrastructure assets and dependencies supporting all USSTRATCOM assigned missions, to include focusing efforts of future critical infrastructure vulnerability assessments and researching the various sources to perform threats and hazards assessments.\n\nNo OCO requested"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.495"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.495"
                                            },
                                            "Text": {
                                                "val": "Provide analysis, studies and research of critical infrastructure assets and dependencies supporting all USSTRATCOM assigned missions, to include focusing efforts of future critical infrastructure vulnerability assessments and researching the various sources to perform threats and hazards assessments.  Develop link-node display of systems connecting tasked missions and operational plans to mission essential tasks and critical infrastructure assets. Identifies vulnerabilities, and participate in risk management process for remediation and mitigation."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "No OCO Requested"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from 2020 to 2021 is due to inflation adjustments"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "The Defense Critical Infrastructure Program is an on-going program, cost to complete is N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "Projects funded through DCIP will be awarded using competitive contracts to the maximum extent possible."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Asset Dependency and Risk Characterization Research"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.487"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.488"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.495"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.495"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-01"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Defense Critical Infrastructure Program"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Asset Dependency, Risk Mitigation, Ops Research, Design\/Development, Modeling and Simulation, Test and Evaluation...this is an on-going effort"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "672486"
                    },
                    "ProjectTitle": {
                        "val": "JOINT NAVWAR CENTER (JNWC) SPACE ACTIVITIES"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "21.902"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Beginning in FY20 all funding moved to PE 1202140F - USSPACECOM PE"
                        },
                        "ProjectMissionDescription": {
                            "val": "The JNWC mission has transferred to USSPACECOM.  Funding for the JNWC has moved into PE 1201240F,"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "PNT Operational Field Assessments"
                                    },
                                    "Description": {
                                        "val": "The JNWC will be reported under PE 1202140F, a USSPACECOM PE"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.902"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Beginning in FY20, the program will be reported under the newly created PE 1202140F, USSPACECOM"
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Beginning in FY 2018 the JNWC portfolio transferred out of PE 15921F in to PE 120921F."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PNT Operational Field Assessments"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Kirtland AFB, NM"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "21.902"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Navigation Warfare (NAVWAR)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "NAVWAR Operational Field Assessements"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Create Maintain NAVWAR Knowledge - PNTAA"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "NAVWAR Operations & CONOPS Events"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "Joint Navigation Warfare Center (JNWC) conducts PRISM, FORTUNE, and GYPSY operational field assessments on an on-going, annual basis.\n\nPRISM events encompass all Operations, Actions, and Activities (OAAs) associated with events outside of specific Combatant Command and\/or Service exercise or mission event.  \n\nFORTUNE events are Positioning, Navigation, and Timing (PNT) vulnerability field assessments and are small scale technical risk assessments or can be risk reduction events for larger GYPSY events.\n\nGYPSY events are larger than FORTUNE PNT related events and involve other coalition partners, and multiple US services in direct support of Geographic Combatant Command requirements. \n\nJNWC uses the Major Range and Test Facility Base (MRTFB) program, administered by USD (AT&L). Requirements dictate which MRTFB facility will be contracted to host a GYPSY or FORTUNE event."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "67A011"
                    },
                    "ProjectTitle": {
                        "val": "Space Analysis and Application Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.247"
                        },
                        "CurrentYear": {
                            "val": "0.500"
                        },
                        "BudgetYearOne": {
                            "val": "0.498"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.498"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.499"
                        },
                        "BudgetYearThree": {
                            "val": "0.499"
                        },
                        "BudgetYearFour": {
                            "val": "0.499"
                        },
                        "BudgetYearFive": {
                            "val": "0.509"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Prior to the FY20 PB cycle, The Space Analysis and Application Development Program was reported under PE 1201921F, WSC 67A011.  Beginning in FY20, the program will be reported under the newly created PE 1202140F, USSPACECOM. Leaving only the Data Integration and Fusion Center being reported in WSC\/BPAC 67A011, PE 1201921F"
                        },
                        "ProjectMissionDescription": {
                            "val": "The USSTRATCOM Data Integration and Fusion Center (DIFC) is an innovative organization developing and experimenting innovative concepts designed to validate both material and non-material methodologies to overcome data isolation in order to enable kill chains in the Joint Battlespace. Funds are necessary to update current government-owned software to ingest and disseminate new data sources from Title 10 and Title 50 sensors.  The DIFC efforts at COCOM sponsored experimentation events will inform service acquisition decisions, capability gaps, intelligence gaps and tactics, techniques and procedures (TTP) development and implementation to mitigate effects on warfighter operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Data Integration and Fusion Center"
                                    },
                                    "Description": {
                                        "val": "USSTRATCOM\/J8 Data Integration and Fusion Center (DIFC) is an innovative organization developing and experimenting innovative concepts designed to validate both material and non-material methodologies to overcome data isolation in order to enable kill chains in the Joint Battlespace. The DIFC will work to update current government-owned software to ingest and disseminate new data sources from Title 10 and Title 50 sensors.  The DIFC efforts at COCOM sponsored experimentation events will inform service acquisition decisions, capability gaps, intelligence gaps and tactics, techniques and procedures (TTP) development and implementation to mitigate effects on warfighter operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "The DIFC will continue to investigate, experiment, and disseminate various Title 10 and Title 50 data sources from collection through dissemination to tactical platforms using machine to machine solutions to move data more efficiently and affect kill chain timelines.\n\nNo OCO Requested"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.498"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.498"
                                            },
                                            "Text": {
                                                "val": "The DIFC will continue to investigate, experiment, and disseminate various Title 10 and Title 50 data sources from collection through dissemination to tactical platforms using machine to machine solutions to move data more efficiently and affect kill chain timelines."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "No OCO requested"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease from FY19 to FY20 is related to the standup of USSPACECOM.  The Space Modeling and Simulation funding moved out of PE 1201921F and into PE1202140F. The DIFC remained in PE 1201921F.  No fluctuation between FY20 and FY21...the DIFC is a steady state program funded at $500K per year."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Analysis and Application Development"
                                    },
                                    "Description": {
                                        "val": "The Space Analysis and Application Development program (Space Modeling and Simulation) transferred into the new USSPACECOM PE 1202140F."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.447"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Beginning in FY20 the RDT&E funding portfolio for the Space Analysis and Application Development program within USSTRATCOM transfers to the newly created PE 1202140F, USSPACECOM."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "See write-up in PE 1202140F"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "No OCO requested"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Space Campaign Modeling and Simulation funding moved to the newly created USSPACECOM PE 1202140F beginning in FY20.  All that will remain in BPAC 67A011 PE 1201921F is the Data Integration and Fusion Center RDT&E funding.  It will be an on-going program. Cost to complete is N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "Any new projects funded in this program will be awarded using competitive procedures to the maximum extent possible.\n\nBest value to the government selected contractors, universities, government facilities, federally funded research and development centers, laboratories, or other organizations"
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Beginning in FY20 the RDT&E funding in the USSTRATCOM Space Analysis and Application Development program is transferring into the newly created PE 1202140F, USSPACECOM"
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Best value to the government selected contractors, universities, government facilities, federally funded research and development centers, laboratories, or other organizations"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Model Space effects and evaluate current campaign models to determine feasibility to incorporate into space architectures"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.447"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Data Integration and Fusion Center"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple Gov\/Civ Agencies"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Schriever AFB, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.498"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.498"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Data Integration and Fusion Center"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Continue to develop concepts to overcome data isolation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "On-going effort to develop concepts to overcome data isolation in order to enable kill chains in the Joint Battlespace"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Experimentation with current government owned software to injest and disseminate new data sources from Title 10 and Title 50 sensors"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Continue to investigate, experiment, and disseminate various Title 10 and Title 50 data sources from collection through dissemination to tactical platforms"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Continue to investigate, develop, experiment and disseminate Title 10 and Title 50 data sources from collection through distribution to tactical platforms"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Continue to investigate, develop, experiment and disseminate Title 10 & Title 50 sources from collection through distribution to the Warfighter in the field"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Continue experimentation with current governement owned software, continue to investigate, develop, and disseminate data sources from collection through distribution to the users in the field"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "Beginning in FY20 the funding portfolio for the Space Analysis Modeling and Simulation program within USSTRATCOM will transfer to the newly created PE 1202140F, USSPACECOM"
                        }
                    }
                }
            ]
        }
    }
}