{
    "id": "2021-TheJointStaff-PB-0400-MJBOOK-0-11-7785e498f08da31904e836881ba7711c1e6b2127a147e20d7386b2865869377d-1",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-VOL5_ALL-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603829J"
        },
        "ProgramElementTitle": {
            "val": "Joint Capability Experimentation"
        },
        "R1LineNumber": {
            "val": "145"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "13.000"
            },
            "BudgetYearOne": {
                "val": "11.239"
            },
            "BudgetYearOneBase": {
                "val": "11.239"
            },
            "BudgetYearTwo": {
                "val": "11.006"
            },
            "BudgetYearThree": {
                "val": "11.443"
            },
            "BudgetYearFour": {
                "val": "11.481"
            },
            "BudgetYearFive": {
                "val": "11.481"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The FY2019 NDAA amends the Chairman’s responsibilities to address experimentation on future concepts and the 2018 National Defense Strategy Implementation Guidance directs that rigorous experimentation take place on concepts to ensure Department investments adequately address future requirements as well as those of today. Accordingly, the Joint Staff requires an experimentation capability to analyze and validate priority joint concept required capabilities. \n\nConcept analysis and validation will have a multi-faceted nature to meet the Chairmen’s Title 10 responsibility of, “identifying new joint military capabilities based on advances in technology and concepts of operation, and recommending investments and experiments in such capabilities.” Wargames will assess baseline mission and campaign level outcomes of the concepts as well as identify a tradespace of potential new capabilities. This tradespace of capabilities is further explored with quantitative models and software that identify the most efficient cost and capability tradeoffs to help meet the Title 10 responsibility of “advising the Secretary on new and alternative joint military capabilities, and alternative program recommendations and budget proposals, within projected resource levels.” \n\nThe National Defense Strategy directs “early design tradeoffs in the requirements process to increase the speed of delivery.” The Joint Staff approach to tradespace exploration follows that guidance by providing a cost conscious and operationally relevant prioritization tradeoff technique early in the portfolio design process. Using this rigorous prioritization approach, the capability development cycle can efficiently focus resources on more detailed experimentation of specific capabilities to inform the requirements process. The analysis from the experimentation program will be used to provide foundational evidence to directly inform the Joint Military Net Assessment (JMNA), the Chairman’s Program Recommendation (CPR), and ultimately the Defense Planning Guidance for Joint Force development and design."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "13.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "13.000"
                },
                "BudgetYearOne": {
                    "val": "11.239"
                },
                "BudgetYearOneBase": {
                    "val": "11.239"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "11.239"
                },
                "BudgetYearOneBase": {
                    "val": "11.239"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Internal realignment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "11.239"
                                },
                                "BudgetYearOneBase": {
                                    "val": "11.239"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "(DWR) The FY 2021 funding request was reduced during the Secretary of Defense’s Defense-Wide Review (DWR) reform effort to account for change in requirements and contract savings resulting in less funds needed."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "001"
                    },
                    "ProjectTitle": {
                        "val": "Joint Capability Experimentation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "13.000"
                        },
                        "BudgetYearOne": {
                            "val": "11.239"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.239"
                        },
                        "BudgetYearTwo": {
                            "val": "11.006"
                        },
                        "BudgetYearThree": {
                            "val": "11.443"
                        },
                        "BudgetYearFour": {
                            "val": "11.481"
                        },
                        "BudgetYearFive": {
                            "val": "11.481"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The FY2019 NDAA amends the Chairman’s responsibilities to include experimentation on future concepts. The 2018 National Defense Strategy Implementation Guidance directed rigorous experimentation on concepts as a means to ensure Department investments adequately address future requirements, not just near term. Given this, the Joint Staff must establish an experimentation capability suitable for analysis and validation of priority joint concept required capabilities. The base of experimentation and wargaming will expand through the initial operating capability to full operating capability.  This will provide the necessary capacity and capability.  The combination will allow the Chairman to identify cost efficient and effective capability tradeoffs. This capability will enable the Chairman to fulfill his Title 10 responsibility, “advising the Secretary on new and alternative joint military capabilities, and alternative program recommendations and budget proposals, within projected resource levels.” This capability more fully supports the Chairman’s production of the Joint Military Needs Assessment (JMNA), the Chairman’s Program Recommendation (CPR) and ultimately the Defense Planning Guidance for Joint Force development and design."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Capability Experimentation"
                                    },
                                    "Description": {
                                        "val": "The FY 2019 NDAA amends the Chairman’s responsibilities to address experimentation on future concepts and the 2018 National Defense Strategy Implementation Guidance directs vigorous experimentation take place on concepts to ensure department investments are adequately addressing future requirements as well as those today.  The project will deliver analytically rigorous, resource-conscious and operationally-validated portfolio investment strategies for the CJCS to ensure an enduring competitive advantage."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not applicable. This is a new program element starting in FY 2020."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "Integrate, synthesize, and prioritize concept-required capabilities for Joint Force development and design efforts out to 2030 that are aligned with the Capstone Concept for Joint Operations: Joint Force 2030 and based on Joint Operating Concepts for Russia, China, Iran and North Korea.\n\nIdentify priority concept required capabilities using set criteria of criticality, strategic guidance, and Combatant Command and Service priorities.\n\nEvaluate and validate priority concept required capabilities through an integrated and federated experimentation, exercises, wargames, and studies approach.\n\nConduct study and research of trade space to help prioritize the most efficient options based on cost and capability tradeoffs.\n\nIn FY 2020, the top 5 to 10 priority CRC’s will be evaluated and validated in two joint and\/or service exercises; at least one technology demonstration; at least one Globally Integrated Operations (GIO) wargame; leveraging already planned Service and Combatant Command events with extensive use of modeling and simulation. Experimentation will also leverage research and development, science and technology, and Defense Advanced Research Projects Agency (DARPA) efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.239"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.239"
                                            },
                                            "Text": {
                                                "val": "(DWR) $11.2M funding results from the Secretary of Defense’s Defense-Wide Review (DWR) reform effort as part of a realignment of resources to higher priorities within the Department.  This synergized and synchronized way forward accelerates the integration of new concepts and capabilities into the Joint Force by developing a continuously adapting Joint Force Development and Design (JFDD) enterprise that can inform Service force development and design efforts.  To facilitate this initiative requires several lines of effort (LOE): \n\n1) Developing and executing Globally Integrated Exercises (GIE);\n \n2) Developing and executing a new series of Globally Integrated Wargames (GIWGs) and the associated development of concepts;\n\n3) Developing and deploying the IT architecture to collect and share data and information (i.e. exercises, experimentation, wargaming, analysis) that supports JFDD including GIE, GIWG, and Joint Warfighting Concepts;\n\n4) Conducting JFDD Enterprise Integration and Testing to inform key decisions and evaluate GIWGs and other JFDD activities including in the near-term JADC2, Contested Logistics, Global Fires, and Information Advantage; and\n\n5) Employing red teaming at all levels, implementing reforms to Professional Military Education (PME) for JFDD and incorporating emerging concepts into Joint Doctrine.\n\nFunding allows for alignment and coordination of disparate activities across the Department and establishes a capability for joint experimentation and wargaming focused on JFDD that will enhance the capability of the Joint Staff to provide the Chairman with sound analysis of the future environment, concepts, and joint capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor reduction from FY 2020 to FY 2021 reflects baseline funding profile for FY 2021 to FY 2025 (approximately $11M per year)."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}