{
    "id": "2021-Army-PB-2040-JBOOK-8f7fdbb59cb85b132b0478715b87ff02c7eb359f73f79d73e48c9151ed5a28f2-22",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603462A"
        },
        "ProgramElementTitle": {
            "val": "Next Generation Combat Vehicle Advanced Technology"
        },
        "R1LineNumber": {
            "val": "65"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0"
            },
            "CurrentYear": {
                "val": "260.535"
            },
            "BudgetYearOne": {
                "val": "199.358"
            },
            "BudgetYearOneBase": {
                "val": "199.358"
            },
            "BudgetYearTwo": {
                "val": "196.039"
            },
            "BudgetYearThree": {
                "val": "208.501"
            },
            "BudgetYearFour": {
                "val": "219.054"
            },
            "BudgetYearFive": {
                "val": "210.850"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "1294.337"
            }
        },
        "ProgramElementNote": {
            "val": "All efforts in this Program Element (PE) were previously funded, with continuity of effort realigned from the following PEs:\n* 0603004A (Weapons and Munitions Advanced Technology)\n* 0603005A (Combat Vehicle and Automotive Advanced Technology)\n* 0603270A (EW Technology)\n* 0603313A (Missile and Rocket Advanced Technology)\n* 0603606A (Landmine Warfare and Barrier Advanced Technology)\n* 0603710A (Night Vision Advanced Technology)\n* 0603734A (Military Engineering Advanced Technology)\n* 0603772A (Advanced Tactical Computer Science & Sensor Technology)"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE executes development, and demonstration for the Army's modernization priority for the Next Generation of Combat Vehicles.  This PE matures, integrates and demonstrates combat vehicle technologies that enable the Army to have a smarter, faster, more lethal, more precise, more protected, and more adaptable force. Technology development builds upon the foundational vehicle architectures to support the Next Generation of Combat Vehicles, to include autonomy architecture, power architecture, vehicle electronic architecture, physical architecture, lethality architecture and vehicle protection architecture. Technologies developed, matured, and demonstrated will enable leap ahead capabilities for manned, optionally manned and unmanned vehicles that deliver decisive lethality.   \n\nWork in this PE complements PE 0602141A (Lethality Technology), PE 0602144A (Ground Technology), PE 0602145A (Next Generation Combat Vehicle Technology), PE 0602146A (Network C3I Technology), PE 0602782A (Command, Control, Communications Technology), PE 0603116A (Lethality Advanced Technology), PE 0603119A (Ground Advanced Technology), PE 0603463A (Network C3I Advanced Technology), PE 0604115A (Technology Maturation Initiatives), and PE 0708045A (End Item Industrial Preparedness Activities).  Work in this PE also transitions to PE 0603645A (Armored Systems Modernization Adv Dev) and PE 0604017A (Robotics Development).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project supports the Army Modernization Priority Next Generation Combat Vehicle.\n\nWork is performed by the U.S. Army Futures Command and the U.S. Army Engineer Research and Development Center."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "160.035"
                },
                "BudgetYearOne": {
                    "val": "174.428"
                },
                "BudgetYearOneBase": {
                    "val": "174.428"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "260.535"
                },
                "BudgetYearOne": {
                    "val": "199.358"
                },
                "BudgetYearOneBase": {
                    "val": "199.358"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "100.5"
                },
                "BudgetYearOne": {
                    "val": "24.93"
                },
                "BudgetYearOneBase": {
                    "val": "24.93"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "100.5"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "24.93"
                                },
                                "BudgetYearOneBase": {
                                    "val": "24.93"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY2020 funding change due to $100.500 M in Congressional adds\n\nFY2021 funding change due to administrative 6.2 to 6.3 shift from 0602145A\/BG6\/Advanced Concepts for Active Defense, to 0603462A\/BG7\/Ground Systems Active Defense, and increase in $8.0M due to Office of Management and Budget (OMB) Passback Transfer"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "BF2"
                    },
                    "ProjectTitle": {
                        "val": "Autonomous Ground Resupply (AGR) Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "18.772"
                        },
                        "BudgetYearOne": {
                            "val": "19.278"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.278"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "38.050"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0603005A (Combat Vehicle and Automotive Advanced Technology) \/ 515 (Robotic Ground Systems)\nPE 0603734A Military Engineering Advanced Technology Development \/ T08 (Combat Eng Systems)"
                        },
                        "ProjectMissionDescription": {
                            "val": "Autonomous Ground Resupply (AGR) will mature and demonstrate an improved ground supply distribution system across multiple levels of strategic and tactical sustainment operations. The effort will equip existing military ground vehicles with scalable robotic technology through the integration of modular kits, common interfaces, and a common architecture to improve inter-node supply movement. Further, the system will modernize and optimize the operations within the supply nodes to improve accountability and throughput. The objective of AGR is to integrate new and emerging technologies into the Army's sustainment system to improve throughput, accountability, and safety and provide the Warfighter with the flexibility needed to meet future needs.\n\nThe work under this Project will transition to the Leader Follower Program of Record (PoR). The architecture and safety work under this Project also lays the groundwork for the Army Modernization Priority Next Generation Combat Vehicle (NGCV).\n\nThis Project matures and demonstrates simulation tools that predict autonomous vehicle performance. This Project matures and demonstrates a real-time simulator that provides the ability to design and assess ground vehicle autonomous behaviors in adverse environmental conditions, reducing the need for field testing. These simulation technologies can be integrated across Army vehicle platforms as required.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project supports the Army Modernization Priority Next Generation Combat Vehicle.\n\nWork in this Project is performed by the United States (US) Army Futures Command and the US Army Engineer Research and Development Center.\n\nWork is also coordinated with PE 0602145A (Next Generation Combat Vehicle Technology), and transitions to PE 0604017A (Robotics Development)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Architecture and Standards"
                                    },
                                    "Description": {
                                        "val": "This effort matures and validates the government-owned autonomous architecture for an inclusive military library of behaviors that are non-proprietary and modular format to allow for design and development of payloads across the\nenterprise. This architecture allows the development and implementation of the same government owned software across multiple robotic systems. This will enable interoperability and modularity within systems and will lay the foundation for an affordable and sustainable lifecycle management model.  This effort is coordinated with PE 0602145A (Next Generation Combat Vehicle Technology)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.097"
                                            },
                                            "Text": {
                                                "val": "Will improve the fail-safe architecture with common interfaces, software and algorithms for increased robotic capability, increased reliability, and autonomous testing methodologies and procedures.  Will work within and make recommendations for improvements to the government-controlled interoperability profile (IOP) standard.  Will validate that standardized interfaces are enforced between unmanned platforms, payloads, controllers, and wireless communication devices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.51"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.51"
                                            },
                                            "Text": {
                                                "val": "Will mature and validate the government-owned autonomous architecture, the autonomous behaviors in the government-owned software library, and improvements to the government-managed interoperability profile standard. Will validate the fail-safe architecture utilizing autonomous testing methodologies and procedures and demonstrate that standardized interfaces are enforced between unmanned platforms, payloads, controllers and wireless communication devices through field testing and Soldier experimentation events. Will develop documentation for transition to Program Executive Office Combat Support and Combat Service Support in support of Leader Follower Program of Record and to the Next Generation Combat Vehicle."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hardware and Hardware-in-the-loop\/Software-in-the-loop (HIL\/SIL)"
                                    },
                                    "Description": {
                                        "val": "The HIL\/SIL is a test system that uses real-time, physics-based models of the vehicle (multi-body dynamics), sensor systems (optics\/signal processing and positioning), platform mobility (vehicle-terrain interaction) and weather\/environment to provide a \"virtual proving ground\" for the AGR system.  This effort is coordinated with PE 0602145A (Next Generation Combat Vehicle Technology)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.999"
                                            },
                                            "Text": {
                                                "val": "Will evaluate new hardware and software configurations to optimize AGR solutions throughout the full range of environmental conditions that are controllable and repeatable to optimize performance.  Will utilize HIL SIL capability to improve and validate hardware and software configurations in the laboratory before field experimentation, reducing costs, saving time and improving overall system performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.69"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.69"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate HIL and SIL configurations to optimize AGR sub-systems throughout the full range of environmental conditions that are controllable and repeatable within a validated simulation environment to optimize autonomous performance. Will use HIL and SIL capability to rapidly integrate and simulate advanced software behaviors prior to conducting field testing. Will improve and validate HIL and SIL system configurations in the laboratory before field testing and Soldier experimentation to reduce costs, save time and decrease risk for the Leader Follower Program of Record. Will provide documentation for transition to Program Executive Office Combat Support and Combat Service Support in support of Leader Follower Program of Record and to the Next Generation Combat Vehicle."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Experimentation"
                                    },
                                    "Description": {
                                        "val": "In conjunction with the Army Training and Doctrine Command (TRADOC) and Army Test and Evaluation Command (ATEC), this effort will employ unmanned systems in an operational evaluation to test the system in real word applications and environments. After the lab testing is complete and a safety test performed by ATC, then the soldier will provide the final test to determine if AGR is useful and rugged enough to enable the soldiers to increase through put on actual missions. This effort is coordinated with PE 0602145A (Next Generation Combat Vehicle Technology)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.537"
                                            },
                                            "Text": {
                                                "val": "Will utilize soldier feedback to optimize utility and reliability within all AGR efforts. Will improve training and maintenance packages to enable expedient transition to the soldier. Will identify high risk and vulnerabilities of the system to increase survivability of the system from enemies to inform the Program of Record (PoR)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.578"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.578"
                                            },
                                            "Text": {
                                                "val": "Will mature and validate safety documentation to demonstrate the employment of leader follower autonomous capability including advanced software behaviors in an operational evaluation to obtain Soldier feedback.  Will collaborate with TRADOC and ATEC to obtain a safety release to enable Soldiers and Marines to utilize AGR equipment in relevant operational environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Simulation Tools for Autonomous Ground Resupply"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates a real-time and high-fidelity, hardware and software-in-the-loop simulation environment for evaluation of autonomous systems, and algorithm design and development for the same; demonstrates novel analysis methods for modeling and simulation to provide enhanced demonstrations of autonomous ground vehicles to include adverse environmental conditions."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.287"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate simulation environment performance and impact to autonomous deployment cost and timeline; will support Autonomous Ground Resupply capstone demonstrations via simulation-enabled analyses methods; and will integrate additional sensors and algorithms into simulation tools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.5"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate simulation environments for algorithm design and development to predict autonomous vehicle system performance in multiple adverse environmental conditions and provide improved analytical tools for optimizing sensor configurations for autonomous behavior for autonomous ground resupply."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.852"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BF4"
                    },
                    "ProjectTitle": {
                        "val": "Combat Vehicle Robotics Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "10.308"
                        },
                        "BudgetYearOne": {
                            "val": "8.82"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.82"
                        },
                        "BudgetYearTwo": {
                            "val": "27.803"
                        },
                        "BudgetYearThree": {
                            "val": "33.274"
                        },
                        "BudgetYearFour": {
                            "val": "37.976"
                        },
                        "BudgetYearFive": {
                            "val": "39.233"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "157.414"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0603005A Combat Vehicle and Automotive Advanced Technology \n* Project 515 Robotic Ground Systems"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates innovative enabling technologies that enable scalable integration of multi-domain robotic and autonomous system capabilities teamed within Army formations supporting all combat warfighting functions (close combat, reconnaissance, targeting and acquisition, etc.). Project focus areas include Platform Electronic Control and Autonomy Safety Engineering.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy (AMS). \n\nWork in this Project supports the Army Modernization Priority, Next Generation Combat Vehicle (NGCV).\n\nWork is performed by the U.S. Army Futures Command (AFC).\n\nWork is also coordinated with PE 0602145A (Next Generation Combat Vehicle Technology), and transitions to PE 0604017A (Robotics Development)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Platform Electronic Control"
                                    },
                                    "Description": {
                                        "val": "This effort optimizes the electronic, closed loop control of by-wire vehicle systems to provide stable, reliable, and predictable control in the presence of potential malicious or unintended commands for both wheeled and tracked unmanned vehicles."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.346"
                                            },
                                            "Text": {
                                                "val": "Will optimize sensors and software algorithms that provide for robotic vehicle perception to be continuously effective across adverse operational conditions. Will mature the interface technologies that allow for field changes to vehicle payload configurations that self-align with native vehicle control scheme and mission taskings."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.5"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate the smart payload-agnostic interfaces and control mechanisms into the autonomous control systems to provide robust mobility characteristics and standard inputs. Will develop a robust platform with system health intelligence for monitoring the critical component state and control data streams."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding from this effort is realigned the Unmanned Maneuver and Soldier-Robotic Interface Integration efforts within this Project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Safety Engineering"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates a holistic approach to the development of Robotic and Autonomy System (RAS) Safety Standards, development of RAS Virtual Testing Procedures, and maturation of a Safety Based Design Methodology for Robotic Systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.494"
                                            },
                                            "Text": {
                                                "val": "Will develop the RAS Safety Standard utilizing the newly formed RAS Safety Review Board (Army) that exploits the published guidelines on best practices for isolation of safety critical software from other RAS behaviors. Will optimize process for obtaining a useable Safety Confirmation for robotic systems and reduce the overall time for developmental safety testing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort completed in FY20 with funding from this effort being realigned the Unmanned Maneuver and Soldier-Robotic Interface Integration efforts within this Project. ."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unmanned Maneuver"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates the advanced mobility performance of autonomous systems within complex, combat scenarios to allow for the completion of mission goals in separate and teaming configurations at various levels of autonomy."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3"
                                            },
                                            "Text": {
                                                "val": "Will integrate advanced autonomous behaviors for the robotic combat vehicle in a manned\/unmanned team mission demonstrating the off-road capability and commanded formation.  Will optimize the ability to operate in extreme weather conditions and on unimproved terrain while challenging the robotic assets within the complexity of a combat scenario."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding in this effort is realigned from the Unmanned Maneuver and Soldier-Robotic Interface Integration efforts within this Project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier-Robotic Interface Integration"
                                    },
                                    "Description": {
                                        "val": "This effort is a focused approach to optimize control of the unmanned systems with improved performance incorporating Manned-Unmanned Teaming enabled formations and is measured against multiple phases of the combat scenario for improved operational effectiveness and overall system performance."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.32"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.32"
                                            },
                                            "Text": {
                                                "val": "Will develop enhanced multi-vehicle, assisted autonomous control to include dynamically reconfigurable interfaces for the mission systems to increase standoff and enable force multiplication. Will develop the capability to utilize and orient configurations of the control interface per the preferred operational mission, allowing the warfighter to choose the screen layout and interface assistance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding in this effort is realigned from the Unmanned Maneuver and Soldier-Robotic Interface Integration efforts within this Project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.468"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BF5"
                    },
                    "ProjectTitle": {
                        "val": "Adv Lethality & Accuracy Sys for Med Cal Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "2"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20) this Project was realigned from:\nProgram Element (PE) 0603004A Weapons and Munitions Advanced Technology\n*  Project 232 Advanced Lethality & Survivability Demo\n\nIn FY21 this Project is Eliminated."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates advanced medium caliber ammunition, weapon, fire control, and Ammunition Handling Systems (AHS) optimized for remote operation. This effort demonstrates cannon super high elevation engagement, high performance stabilization, remote ammunition loading, weapon safety and reliability, improved lethality, accuracy, ability to fire a suite of ammunition from non-lethal to lethal, and escalation of force capability in one system.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project supports the Army Modernization Priority Next Generation Combat Vehicle. \n\nWork in this Project is performed by the United States (US) Army Futures Command.\n\nWork in this Project is related to and fully integrated with the efforts funded in Program Element PE0604115A (Technology Maturation Initiative)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Lethality and Accuracy System for Medium Caliber Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates advanced medium caliber ammunition, weapon, fire control, and AHS optimized for remote operation. This effort demonstrates cannon-super high elevation engagement, high performance stabilization, remote ammunition loading, weapon safety and reliability, improved lethality, accuracy, ability to fire a suite of ammunition from non-lethal to lethal, and escalation of force capability in one system."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.909"
                                            },
                                            "Text": {
                                                "val": "Will validate weapon system integration with demonstration of AHS and will complete system level performance optimization efforts of programmable air burst munition  and armor piercing  munition fire control solutions for stationary on stationary engagements against personnel and materiel targets.  The maturation and demonstrations that will be conducted through FY20 will inform technical updates to the level 2 technical data package that will be finalized for transition to Program Executive Office (PEO) Ground Combat Systems and PEO Ammunition."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort completes in FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.091"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BF7"
                    },
                    "ProjectTitle": {
                        "val": "Crew Augmentation and Optimization Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "3.871"
                        },
                        "BudgetYearOne": {
                            "val": "4.411"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.411"
                        },
                        "BudgetYearTwo": {
                            "val": "4.412"
                        },
                        "BudgetYearThree": {
                            "val": "4.337"
                        },
                        "BudgetYearFour": {
                            "val": "4.288"
                        },
                        "BudgetYearFive": {
                            "val": "4.331"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "25.650"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0603005A (Combat Vehicle and Automotive Advanced Technology) \/ 441 (Combat Vehicle Mobility)"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates advanced technologies to enable crew augmentation and optimization for closed hatch operations of ground vehicle platforms in a complex multi-domain operations environment. This includes integration of intelligent technologies to improve dynamic tasking and full crew interactions, machine learning to improve decision aids, early warnings, reduce response times and shorten task durations, and machine learning to optimize tasking and function. Mature technologies are incorporated onto existing or prototype Army-owned technology demonstrators so that performance of the enabling technologies can be evaluated.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project supports the Army Modernization Priority Next Generation Combat Vehicle. Work in this Project is conducted by the United States (US) Army Futures Command.\n\nWork in this PE\/Project is also coordinated with work in PE 0602145A (Next Generation Combat Vehicle Technology) and PE 0602143 (Soldier Lethality Technology)"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Crew Augmentation & Optimization Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on optimizing crew station technologies while reducing crew sizes that will provide the same overall performance by exploiting human-machine interaction technologies, automation, machine intelligence and customization to permit soldiers to achieve performance beyond today's constrained ground vehicle environment"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.696"
                                            },
                                            "Text": {
                                                "val": "Will mature crew station technologies by increasing crew performance over existing baseline capabilities.  Will integrate and demonstrate advancements in multimodal hardware, displays and controls and task augmentation to provide greater situational awareness and faster decision timelines. Will validate effectiveness in relevant field demonstration utilizing Soldier subjects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.411"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.411"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate vehicle and crew task management and re-tasking to enhance team performance.  Will demonstrate effectiveness of individual vehicle operators without increasing levels of manpower for specific mission sub-sets.  Will demonstrate baseline teaming of crew and robotic operator configurations to permit reconfiguration of roles, improve ease of use and increase overall productivity.  Will validate effectiveness in an operationally-relevant, motion-based simulation environment with Soldiers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.175"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BG1"
                    },
                    "ProjectTitle": {
                        "val": "Sensors for Auto Oper and Survivability Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "10.128"
                        },
                        "BudgetYearOne": {
                            "val": "14.213"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.213"
                        },
                        "BudgetYearTwo": {
                            "val": "11.262"
                        },
                        "BudgetYearThree": {
                            "val": "12.696"
                        },
                        "BudgetYearFour": {
                            "val": "12.835"
                        },
                        "BudgetYearFive": {
                            "val": "12.837"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "73.971"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2020 this Project is realigned from:\nPE 0603606A (Landmine Warfare and Barrier Advanced Technology) \/ Project 683 (Area Denial Sensors)\nPE 0603710A (Night Vision Advanced Technology) \/ Project K70 (Night Vision Advanced Technology)"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures, optimizes, and demonstrates automated, advanced multi-function sensors and algorithms enabling autonomous man-unmanned combined arms maneuver in full spectrum, complex environments, for next generation manned, optionally manned, and robotic platform applications. This Project will deliver\nsensor payloads which provide greatly increased situational awareness (e.g. pre-shot and hostile fire detection, threat classification) in all environments for manned and unmanned ground vehicle systems.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project supports the Army Science and Technology Next Generation Combat Vehicle, Soldier Lethality, and Future Vertical Lift modernization priorities. \n\nWork in this Project is performed by the US Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sensors for Autonomous Operations and Survivability Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "This effort will demonstrate aided target detection (AiTD) and aided target recognition (AiTR) for rapid search, and an automated, multi-spectral sensing capability to detect concealed threats and identify\/apply countermeasures to enable decisive action and maneuver, for manned and unmanned platforms.  This effort is coordinated with PE 0602145A (NGCV Technology), 0602143A (Soldier Lethality Technology), and 0603118A (Soldier Lethality Advanced Technology)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.668"
                                            },
                                            "Text": {
                                                "val": "Will validate performance of AiTD and AiTR algorithms against ground targets in cluttered environments with situational awareness and targeting sensors.  Will mature sensors with multi-spectral response and increased dynamic range to enable innovative AiTR behaviors and tasking in moderately complex environments, and against asymmetric targets. Will improve embedded processing techniques to provide real-time performance on space-constrained platforms. Will mature and optimize threat optics detection with targeting sensors."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned to Advanced Sensors with Embedded Processing and Multi-Mission Payload efforts in this Project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Sensors with Embedded Processing"
                                    },
                                    "Description": {
                                        "val": "Matures and demonstrates advanced, automated multi-spectral and multi-function sensors, and image processing capabilities with improved performance in all environments and against all threats to include low-contrast targets in camouflage or in degraded conditions to enable combined arms maneuvers in complex environments for Next Generation Combat Vehicle via manned, optionally manned, and robotic platform applications."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.74"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.74"
                                            },
                                            "Text": {
                                                "val": "Will mature sensor payloads with embedded Aided Target Detection and Recognition (AiTD and AiTR) algorithms for situational awareness and targeting sensors. Will demonstrate sensors with multi-spectral response and embedded processing to provide real-time performance on space-constrained platforms. Will continue to mature threat optics detection with targeting sensors by combining pre-shot and thirdgeneration forward looking infrared capability."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned from the Sensors for Autonomous Operations and Survivability Advanced Technology effort in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Mission Payload"
                                    },
                                    "Description": {
                                        "val": "Matures and demonstrates sensor payloads for ground vehicle based unmanned aerial systems to detect line of sight, and beyond line of sight threats and complex obstacles such as personnel and vehicles in all environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.473"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.473"
                                            },
                                            "Text": {
                                                "val": "Will mature multi-mission sensor payloads for small unmanned aerial system platforms using polarized and broad band electro-optic \/ infrared technology to provide improved cueing performance against threats that inhibit maneuver. Will demonstrate sensor payloads on-the-move at low altitudes for rotary and fixed wing platforms in close combat open terrain scenarios. Will mature threat cueing algorithms based on the integrated sensor payload architecture and multi-look flight paths."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned from the Sensors for Autonomous Operations and Survivability Advanced Technology effort in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.46"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BG3"
                    },
                    "ProjectTitle": {
                        "val": "Modeling and Simulation for MUMT Advanced Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "3.53"
                        },
                        "BudgetYearOne": {
                            "val": "3.364"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.364"
                        },
                        "BudgetYearTwo": {
                            "val": "0.999"
                        },
                        "BudgetYearThree": {
                            "val": "1.019"
                        },
                        "BudgetYearFour": {
                            "val": "4.586"
                        },
                        "BudgetYearFive": {
                            "val": "4.586"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "18.084"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2020 this Project was realigned from PE 0603734A (Military Engineering Advanced Technology) \/ Project T08 (Combat Eng Systems)."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates modeling and simulation (M&S) tools\/technologies to assess and improve freedom of movement for ground forces and supports vehicle developers by addressing challenges for robotic and ground vehicles. This Project matures and demonstrates obstacle detection capabilities for autonomous systems operating in complex environments. This Project also matures and demonstrates real-time mobility decision support tools, vehicle-terrain interaction models for autonomous convoy operations, simulation tools for vehicle mobility in highly altered terrain, and M&S tools for predicting the performance of autonomous vehicles. These M&S technologies can be integrated across Army vehicle platforms as required.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project supports the Army Modernization Priority Next Generation Combat Vehicle.\n\nWork is performed at the U.S. Army Engineer Research and Development Center and coordinated with U.S. Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mobility in Complex Urban Environments Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates a real-time, hardware-in-the-loop simulator capable of rapid design and assessment of ground vehicle autonomous behaviors and integrates autonomy solutions into this tool. This effort is coordinated with PE 0602145A (Next Generation Combat Vehicle Technology)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.496"
                                            },
                                            "Text": {
                                                "val": "Mature a fully integrated real-time hardware-in-the-loop simulator to validate autonomous vehicle maneuver configurations; conduct field demonstrations to assess performance; demonstrate mobility obstacle detection software to support real-time mobility decisions in urban environments; integrate further sensor modalities into the simulator."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort was realigned to the Simulation Tools for CoVeR Demonstrations Effort within this same Project"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Simulation Tools for CoVeR Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates high-fidelity M&S tools to support the development and optimization of autonomous vehicle platforms and components to support autonomous maneuver in unstructured environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.364"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.364"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate desktop and high performance computing-based software-in-the-loop and hardware-in-the-loop M&S tools for operational assessments of autonomy algorithms and hardware; will optimize and improve M&S tools to support autonomous vehicle platforms and component development; and will optimize adaptive learning models and analytical tools for predicting impacts to maneuver in unstructured environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort was realigned from the Mobility in Complex Urban Environments Demonstrations effort within this Project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.034"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BG4"
                    },
                    "ProjectTitle": {
                        "val": "Adv Mobility Experimental Prototype Adv Tech Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "9.658"
                        },
                        "BudgetYearOne": {
                            "val": "3.903"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.903"
                        },
                        "BudgetYearTwo": {
                            "val": "2.927"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "16.488"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2020 this Project is realigned from PE 0603005A (Combat Vehicle and Automotive Advanced Technology) \/ Project 441 (Combat Vehicle Mobility)."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and fabricates advanced powertrain, power generation and running gear technologies into a combat vehicle that will reduce the percentage of no- go terrain for ground vehicles, increase the maneuver speeds across all traversable terrain, reduce fuel demands thus extending operation time between resupply, and provide onboard power generation to enable the integration of energy based capabilities such as directed energy weapons and electromagnetic armor.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project supports the Army Modernization Priority Next Generation Combat Vehicle.\n\nWork in this Project is conducted by the United States (US) Army Futures Command. \n\nThis Project is coordinated with PE 0604115A (Technology Maturation Initiatives)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Mobility Experimental Prototype (AMEP) Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "This effort develops the advanced powertrain, track and running gear, and unmanned robotic technologies for integration into a ground combat vehicle to demonstrate increased mobility, increased maneuver speeds, and optionally manned capabilities in order to validate performance and capability enhancements at increased vehicle weights to inform ground combat vehicle design."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.219"
                                            },
                                            "Text": {
                                                "val": "Will mature powertrain, power generation and running gear components for integration into surrogate ground vehicle system.  Will develop powertrain controls architecture and algorithms to improve powertrain component efficiencies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.903"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.903"
                                            },
                                            "Text": {
                                                "val": "Will develop field-installable suspension system to enable increased mobility performance for a specific class of combat vehicles. Will mature powertrain drive-by-wire control software to enable autonomous maneuverability."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.439"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BG5"
                    },
                    "ProjectTitle": {
                        "val": "Extended Line of Sight (ELOS) Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "12"
                        },
                        "BudgetYearOne": {
                            "val": "1.449"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.449"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "13.449"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0603004A Weapons and Munitions Advanced Technology, Project: \n* 232 Advanced Lethality & Survivability Demo"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project develops a precision guided tank fire and forget 120-mm munition to engage high-value targets including heavy armor, the growing Anti-Tank Guided Munition (ATGM) threat (dismounted and mounted), and light armor at extended ranges (2 to 8 km (T), 2 to 12 km (O)).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project supports the Army Modernization Priority Next Generation Combat Vehicle. \n\nWork in this Project is performed by the United States (US) Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Extended Line Of Sight (ELOS) Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates a 120-mm Tank-fired ELOS Munition that counters the growing Anti-Tank Guided Missile (ATGM) threat at extended line of sight ranges beyond current capability."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.455"
                                            },
                                            "Text": {
                                                "val": "Will optimize an ELOS Munition Air Frame (projectile) design to include fin stabilization element, Seeker Unit, Guidance Electronics Unit (GEU), Canard Actuation System (CAS), Warhead, GNC (Guidance, Navigation and Control) Software, Target Acquisition and Tracking (TA&T) Software, Propulsion system; will integrate these components to validate their performance through preprogram maneuver cannon fired experiments. Finalize Seeker Unit design, initiate Processor in the Loop (PIL) and Hardware in the Loop (HIL) analysis\/testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.449"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.449"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate a 120-mm tank-fired munition with the capability to seek, detect, guide, maneuver, and defeat an ATGM threat at extended range.  The munition demonstrated advanced technologies including: fin stabilization; next generation seeker components; electronic guidance, navigation and control (GNC) software; and other advanced component technology."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding in this effort is realigned in FY21 to support higher priority Army Modernization needs."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.545"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BG7"
                    },
                    "ProjectTitle": {
                        "val": "Ground Systems Active Defense (GSAD) Advanced Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "23.387"
                        },
                        "BudgetYearOne": {
                            "val": "49.073"
                        },
                        "BudgetYearOneBase": {
                            "val": "49.073"
                        },
                        "BudgetYearTwo": {
                            "val": "51.743"
                        },
                        "BudgetYearThree": {
                            "val": "50.801"
                        },
                        "BudgetYearFour": {
                            "val": "49.038"
                        },
                        "BudgetYearFive": {
                            "val": "44.76"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "268.802"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0603004A (Weapons and Munitions Advanced Technology) \/ L97 (Smoke and Obscurants Advanced Technology)\nPE 0603005A (Combat Vehicle and Automotive Advanced Technology) \/ 221 (Combat Veh Survivability)\nPE 0603270A (EW Technology) \/ K16 (Non-Commo ECM Tech Demo)\nPE 0603313A (Missile and Rocket Advanced Technology) \/ 263 (Future MSL Tech Integr)"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates protection and survivability technologies to increase the survivability of ground vehicles and the protection of the Soldiers who depend on them. The tasks will focus on component maturation and demonstration and transfer products for demonstration as holistic (vehicle level) solutions. The Project will mature technologies to defeat threats throughout the timeline of a threat engagement; from obscuring a target, to actively defeat a threat and through mitigating its effects after engagement. These include the active employment of smoke, physical and electronic active protection, advanced and adaptive armors, advanced and active blast mitigation systems and adaptive interior protection.\n\nWork in this Project supports the Army Modernization Priority Next Generation Combat Vehicle.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project is performed by the United States (US) Army Futures Command.\n\nWork in this project will be coordinated with PE 0602145A (Next Generation Combat Vehicle Technology) and transitions to PE 0604852A (Suite of Vehicle Protection Systems - EMD)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ground Systems Active Defense Development"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates active and adaptive component sensors and effectors which, in combination with modular Survivability Subsystem Controls (SSC) architecture, provide the ability to sense, track, respond and neutralize pacing threats prior to catastrophic terminal effects. The components\/subsystems will work in tandem in an efficient manner to provide threat defeat redundancy and layered survivability to optimize protection with reduced weights.  This effort matures and demonstrates modern armors that directly complement active protection technologies in order to implement sophisticated mass efficient protection mechanisms and materials investments to act as a system in order to defeat advanced threats.  This effort also matures and demonstrates active blast technologies to counter underbody attacks."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.989"
                                            },
                                            "Text": {
                                                "val": "Will further develop and mature sensor and effector technologies for inclusion in suite of threat defeat capability. Will validate compliance with SSC architecture, perform environmental and durability testing of developed components to mature the technology, and provide demonstration of pacing threat defeat in representative environment.  Will optimize and mature subsystem packaging and integration methods for both active protection components as well as base vehicle armor protection for the defeat of residual fragments that result from countermeasure engagements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Work in this effort is realigned in FY21 to the Soft Kill System Development, Top\/Bottom Attack Protection, Survivability Capability Characterization and Experimentation, Sensors for Adaptive Armor, and Active Blast Mitigation Environmental and Durability Validation efforts within this Project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Obscuration Technologies for Active Protection Systems"
                                    },
                                    "Description": {
                                        "val": "Research, develop, test, evaluate, and demonstrate obscurant soft-kill vehicle protection technologies to defeat the observer\/gunner, anti-tank guided missiles (ATGMs), and other guided threats. Design and evaluate systems that are Modular Active Protection System (MAPS) and Survivability Subsystem Controls (SSC) compliant."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.584"
                                            },
                                            "Text": {
                                                "val": "Will conduct prototype field experiments and characterization of the Improved Rapid Obscuration System that provides short range coverage for indirect defeat (obscuring the gunner?s view)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.34"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.34"
                                            },
                                            "Text": {
                                                "val": "Will optimize payloads and demonstrate dissemination of obscurant materials for the Extended Range Obscuration System (EROS)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Protection Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates protection for light armored combat vehicles from anti-armor threat weapons such as rocket-propelled grenades (RPG), anti-tank guided missiles (ATGM), and recoilless rifle projectiles (RR)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.304"
                                            },
                                            "Text": {
                                                "val": "Will continue maturation and adaptation of a hard-kill countermeasure and fire control sensor to provide protection for Next Generation Combat Vehicles from guided missile, recoilless rifle, and rocket propelled grenade attacks.  Will validate the lethal mechanism design through laboratory testing. Design and develop countermeasure and fire control subsystems that are MAPS compliant."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.135"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.135"
                                            },
                                            "Text": {
                                                "val": "Will conduct component experiments with radar, propulsion\/thruster and warhead mechanisms hardware and software to verify performance meets design intent and is repeatable; will begin design and development of integrated testbed for demonstration and evaluation of integrated protection system."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Radar and Soft-Kill (A-RASK) suite"
                                    },
                                    "Description": {
                                        "val": "This effort matures next generation vehicle radar technologies and holistic electronic warning and soft-kill countermeasure techniques to support a layered modular active protection suite and ensure the survivability of ground combat platforms in all-weather day or night conditions with 360 degree situational awareness and threat defeat."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.448"
                                            },
                                            "Text": {
                                                "val": "For Combat Operations Battlefield Radar: Will conduct capability\/tradeoff analysis based on demonstrated technology to mature active protection systems for 360 degree situational awareness.  Will improve resource management and processing algorithms that supports multi-mission capabilities.  Improve radar simulation models to support HWIL evaluation of emerging threats and future sensor improvements and technologies. \n\nFor Advanced Soft Kill Countermeasures (ASKCM): Will mature the soft-kill countermeasure system and hardware components and integrate techniques to address multiple types of anti-tank threats by optimizing hardware performance. Begin demonstrations of ASKCM capabilities to validate system performance against multiple threat classes, launch profiles and distances.\nSoft Kill Techniques and Effects: Will mature methodologies for countermeasure sources to be characterized, assessed and optimized against the priority threats of interest. Will demonstrate countermeasure capabilities against a variety of threats and guidance types."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.974"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.974"
                                            },
                                            "Text": {
                                                "val": "For Combat Operations Battlefield Radar:  Will conclude capability\/tradeoff analysis based on techniques for active protection systems with 360-degree situational awareness radar technology; conclude baseline improvement of resource management and processing algorithms to support multiple combat vehicle protection capabilities and radar simulation models for hardware-in-the-loop evaluation of emerging threats and future sensor improvements and technologies; and provide analysis to ensure operation in cluttered radio frequency environments. \nFor Advanced Soft Kill Countermeasures (ASKCM):  Will integrate laser hardware into existing soft-kill countermeasure system to defeat additional threats and to demonstrate defeat of anti-tank guided missiles as part of a layered protection system in cooperation with the Soft-Kill System Development effort in this Project. \nFor Soft Kill Techniques and Effects:  Will execute 2nd & 3rd iterations of validation of threat hardware successfully integrated in the lab without countermeasure in the loop (dry shot demonstration).  Will perform laboratory validation and demonstration of two iterations of soft-kill countermeasure techniques to evaluate performance and transition techniques to the most promising soft-kill countermeasure design from the layered protection system demonstration conducted in the Soft-Kill System Development effort in this Project."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Range Hard Kill Countermeasure (LRHK-CM)"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates a MAPS-compliant hard-kill countermeasure system able to defeat current threats such as RPG, ATGM and future threat munitions such as kinetic energy and artillery delivered sub-munitions. This effort will optimize a complete hard-kill active protection system including munitions, launcher, sensors, and fire-control, and demonstrate capabilities through modeling and simulation and live-fire demonstrations."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.036"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.036"
                                            },
                                            "Text": {
                                                "val": "Will conduct system trade studies by incorporating additional system, experimental, and threat data. Will mature the hard-kill countermeasure munition and incorporate effectiveness against multiple threat categories. Will mature a hard-kill countermeasure launcher and integrate using the MAPS Framework and Controller on a combat vehicle, integrate existing sensor technologies and perform simulation and live-fire demonstrations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is added to support Army Modernization needs for countering existing and future enemy threat systems targeting combat vehicles."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soft-Kill System Development"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on maturing and demonstrating soft-kill system technologies to protect combat vehicles from current and emerging ATGM threats at stand-off distances with an unlimited magazine and low collateral hazard.  This capability will also enhance situational awareness to vehicle occupants by detecting and alerting when threats have been fired.  Technologies will be optimized and integrated on combat vehicles using the MAPS Framework and Controller, and demonstrated in a relevant environment."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.14"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.14"
                                            },
                                            "Text": {
                                                "val": "Will integrate the soft-kill system developed in the Advanced Radar and Soft-Kill Suite effort in this Project utilizing the MAPS Framework and Controller for system demonstration. Will conduct virtual \/ laboratory demonstrations; assess system performance and robustness through and verify system performance in physical live-fire demonstration with the goal to alert the crew of threats being fired and providing the defeat of multiple ATGMs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned in FY21 from the Ground Systems Active Defense Development effort in this Project and increased to support Army Modernization priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Threat Protection"
                                    },
                                    "Description": {
                                        "val": "This effort matures and integrates armor and occupant protection technology to protect against emerging both top and bottom attacks threats increasing vehicle survivability and Soldier protection."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.294"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.294"
                                            },
                                            "Text": {
                                                "val": "Will mature test methods to evaluate Soldier protection technologies from both top and bottom attack emerging threats.  Will leverage modelling and simulation to evaluate protection technologies from current and future top and bottom attack threats.  Will demonstrate underbody technologies that provide full-spectrum protection against bottom attack threats at a reduced weight from current technology. Will demonstrate top attack armor solutions and evaluate whether they interfere with vehicle operation. Will validate compliance with combat vehicle architectures, perform environmental and durability testing, and demonstrate capabilities against pacing threats in a representative environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned in FY21 from the Ground Systems Active Defense Development effort in this Project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability Capability Characterization and Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates emerging protection technologies to characterize and assess their performance and maturity and potential for transition to Product Manager (PdM) Vehicle Protection System (VPS)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.944"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.944"
                                            },
                                            "Text": {
                                                "val": "Will assess vehicle protection capability gaps, conduct a targeted market survey of emerging survivability technologies which address those gaps, request vendor proposals, and provide an experimentation venue to demonstrate performance of selected technologies in FY21 to characterize enhanced vehicle protection. Characterization data will be used to inform technology development and transition to PdM VPS."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned from the Ground Systems Active Defense Development effort and increased to support Army Modernization priorities in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensors for Adaptive Armor"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates mature sensor technology to enable an adaptive armor system using the MAPS Framework and Controller on a combat vehicle platform.  This effort matures real-time processing software, continuously refines the threat trajectory prediction algorithm and integrates sensors with an adaptive countermeasure for threat defeat to the MAPS Framework and Controller to ensure the activation of adaptive armor to protect against incoming threats."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.714"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.714"
                                            },
                                            "Text": {
                                                "val": "Will mature the real-time processing software of sensor data, improve detect and track algorithms of the adaptive armor system and analyze\/assess MAPS architecture-compliant integration on a combat vehicle platform. Will perform analysis and maturation of adaptive armor countermeasure concepts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned in FY21 from the Ground Systems Active Defense Development effort in this project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Blast Mitigation Environmental and Durability Validation"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates mature sensor technology for an Active Blast Mitigation System (ABMS) into the MAPS Framework on a combat vehicle platform with improved countermeasure design for protection from blast events. ABMS will support a reduction of injuries caused from underbody blast events by providing a counterforce to the blast acceleration of the vehicle hull."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.496"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.496"
                                            },
                                            "Text": {
                                                "val": "Will optimize MAPS-compliant ABMS technology using improved countermeasure design for safety and manufacturing. Will develop a more effective countermeasure and improve upon the performance of prior ABMS designs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned in FY21 from the Ground Systems Active Defense Development effort in this project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.062"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BG9"
                    },
                    "ProjectTitle": {
                        "val": "Obscuration Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "3.085"
                        },
                        "BudgetYearOne": {
                            "val": "10.145"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.145"
                        },
                        "BudgetYearTwo": {
                            "val": "2.708"
                        },
                        "BudgetYearThree": {
                            "val": "2.772"
                        },
                        "BudgetYearFour": {
                            "val": "2.809"
                        },
                        "BudgetYearFive": {
                            "val": "2.809"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "24.328"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2020 this Project is realigned from PE 0603004A (Weapons and Munitions Advanced Technology) \/ Project L97 (Smoke and Obscurants Advanced Technology)."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Project matures and demonstrates obscurant technologies with potential to enhance personnel and platform survivability by degrading threat force surveillance sensors and defeating the enemy's target acquisition devices, missile guidance, and directed energy weapons. Dissemination systems for new and improved obscurants are developed with the goal of providing efficient and safe screening of deployed forces. Synthetic Biology Manufacturing technologies in this project will provide Department of Defense (DoD) with the ability to manufacture products such as explosive alternatives and defense-only critical chemicals & materials. \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project supports the Army Modernization Priority Next Generation Combat Vehicle.\n\nWork is performed by the U.S. Army Futures Command. \n\nWork in this Project is related to, and fully coordinated with PE 0602145A (Next Generation Combat Vehicle Technology)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Obscuration"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs and demonstrates the dissemination of new and advanced obscurants. This effort will support PE 0603462 Project (Ground Systems Active Defense Advanced Technology)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.945"
                                            },
                                            "Text": {
                                                "val": "Will continue to mature particulate infrared and bispectral obscurant dissemination in the screening obscuration module.  Investigate obscurant cloud interaction for vehicle protection applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.145"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.145"
                                            },
                                            "Text": {
                                                "val": "Will validate and demonstrate dissemination materials compatible with the screening obscuration module.  Will demonstrate dissemination materials for the Improved Rapid Obscuration System (IROS).  Will optimize multi-spectral payloads to perform as obscurant countermeasures for effective vehicle protection."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY21, this task was decreased to support Army modernization priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Synthetic Biology Bioprocessing Facility"
                                    },
                                    "Description": {
                                        "val": "This effort supports the modernization of the Army's Synthetic Biology Bioprocessing Technology to manufacture pilot scale products such as explosives, obscurants and defense-only critical chemicals & materials.  This effort will expedite transitioning products from the new Synthetic Biology Manufacturing Innovation Institute into technology development efforts to support the Department of Defense."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8"
                                            },
                                            "Text": {
                                                "val": "Will modernize bio-manufacturing facility's fermentation and downstream purification capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase in FY21 due to Office of Management and Budget (OMB) Passback Transfer of $8.0M"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.14"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BH1"
                    },
                    "ProjectTitle": {
                        "val": "Survivability Systems Controls Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "13.022"
                        },
                        "BudgetYearOne": {
                            "val": "13.68"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.68"
                        },
                        "BudgetYearTwo": {
                            "val": "14.094"
                        },
                        "BudgetYearThree": {
                            "val": "14.009"
                        },
                        "BudgetYearFour": {
                            "val": "13.772"
                        },
                        "BudgetYearFive": {
                            "val": "13.912"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "82.489"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from PE 0603005A (Combat Vehicle and Automotive Advanced Technology) \/ 221 (Combat Veh Survivability)."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project advances the design and capability of the Modular Active Protection System (MAPS) framework and controller to enable integrating emerging survivability technologies into safe and secure configurations and demonstrating them in a representative operational environment. The effort will verify compliance of component sensors and effectors with the modular active protection architecture. This effort ultimately feeds demonstrations of active defense subsystems for demonstration as holistic (vehicle level) solutions. This Project is a key enabler for insertion of current and future active survivability technologies onto ground platforms in order to combat current and emerging threats.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project supports the Army Modernization Priority Next Generation Combat Vehicle.\n\nThis work is performed by the United States (US) Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Survivability System Control"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on maturing and demonstrating a common and open survivability architecture and core implementation to ensure its operational effectiveness.  Specifically, this effort includes extending the MAPS architecture across a broader set of active survivability capabilities and increasing the portfolio of Modular APS Framework (MAF) compliant technologies. In addition, this project will enhance the government-developed controller subsystem for performance and integration effectiveness with high speed digital signal processing and embedded systems\/firmware\/software which will be required due to the expanded active defense suite of sensors (e.g., electro-optic, infrared, radio frequency, magnetic, acoustic), sensor fusion, and explore synthesizing sensor data beyond situational awareness to situational understanding with context that can greatly enhance operational effectiveness and vehicle survivability. The activities under this effort provide incremental growth for broader threat spectrum defeat relevant to vehicle protection systems and will be aligned to capability gaps for transition to the acquisition community."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.431"
                                            },
                                            "Text": {
                                                "val": "Will build upon foundation of the MAPS controller and artifacts by analyzing latest stakeholder requirements and conducting functional analysis in preparation for an update to the MAF. Will optimize and enhance the Modular APS (MAPS) controller subsystem to begin accepting new technologies identified through design analysis activities. Will continue to advance modeling and simulation (M&S) and verification capabilities in the system integration lab. Will maintain configuration management of delivered MAPS-compliant systems. Will certify and demonstrate survivability components for MAPS-compliant active defense subsystems through use of hardware-in-the-loop and M&S. Will assess available artificial intelligence algorithms and technology that can synthesize sensor input data to paint contextual threat picture for optimized response. Will explore adaptability for tactical fleet integration with focus on SWAP constraints and affordability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.68"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.68"
                                            },
                                            "Text": {
                                                "val": "Will continue to build upon the foundation of the MAPS controller and artifacts to include an update to the framework and extend beyond active protection capability to a layered protection capability.  Will implement and demonstrate an expanded MAPS base kit derived from studies conducted in FY20.  Will demonstrate a reduced size-weight-and-power MAPS base kit design enabling integration for tactical wheeled vehicles and providing alternative integration solutions for combat vehicles.  Will expand the layering capability of multiple, future MAPS Framework compliant vehicle protection technologies developed in PE 0603462A Next Generation Combat Vehicle Advanced Technology, Project BG7 Ground System Active Defense (GSAD)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.591"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BH3"
                    },
                    "ProjectTitle": {
                        "val": "C4ISR Modular Autonomy Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "3.926"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "3.926"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20) this Project was realigned from:\nProgram Element (PE) 0603772A Advanced Tactical Computer Science & Sensor Technology\n* Project 101 Tactical Command and Control\n\nIn FY21 this Project is realigned to:\nPE 0603462A Next Generation Combat Vehicle Advanced Technology \n* Project BZ9 Smart Targeting Environment for Lower Level Assets"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and develops software and algorithms to integrate ground and aerial Robotics and Autonomous Systems (RAS) with mission command information systems enabling commanders to more effectively plan, monitor and incorporate RAS into unit formations and missions, and assist the development of doctrine.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy (AMS).\n\nWork in this Project supports the Army Modernization Priority Next Generation Combat Vehicle. \n\nWork in this Project is performed by the United States (US) Army Futures Command (AFC).\n\nWork in this PE complements PE 0602145A (Next Generation Combat Vehicle Technology)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Command of Autonomous Teams (COAT)"
                                    },
                                    "Description": {
                                        "val": "This effort designs, fabricates, evaluates, and integrates RAS and Manned Unmanned Teaming (MUM-T) concepts with mission command information systems and doctrine allowing commanders' the ability to plan, monitor and incorporate RAS into formations while reducing Soldier burden. This work will provide an integrated mission planning and execution capability for Next Generation Combat Vehicle, and allow RAS platforms to be quickly incorporated into mission formations and complete complex tactical tasks."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.747"
                                            },
                                            "Text": {
                                                "val": "Will implement the computational situation awareness engine, which consumes the data feeds from RAS and produces a model of the mission to display to the user; will complete interfaces to the mission model that allows soldiers to create alerts based on mission data and priority; will complete implementation of tactical service language that allows Soldiers to define behaviors for RAS platforms in the mission model."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned to the PE 0603462A (NGCV Advanced Technology) Project BZ9 (Smart Targeting Environment for Lower Level Assets) effort to support Army Modernization needs."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.179"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "BH4"
                    },
                    "ProjectTitle": {
                        "val": "Ground Vehicle Holistic Defense Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "14.145"
                        },
                        "BudgetYearThree": {
                            "val": "15.794"
                        },
                        "BudgetYearFour": {
                            "val": "15.81"
                        },
                        "BudgetYearFive": {
                            "val": "15.969"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "61.718"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "ProjectNumber": {
                        "val": "BH6"
                    },
                    "ProjectTitle": {
                        "val": "Platform Electrification and Mobility Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "5.198"
                        },
                        "BudgetYearOne": {
                            "val": "24.701"
                        },
                        "BudgetYearOneBase": {
                            "val": "24.701"
                        },
                        "BudgetYearTwo": {
                            "val": "31.077"
                        },
                        "BudgetYearThree": {
                            "val": "34.717"
                        },
                        "BudgetYearFour": {
                            "val": "36.008"
                        },
                        "BudgetYearFive": {
                            "val": "20.944"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "152.645"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This Project is a new start in FY 2020."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures, integrates and demonstrates technologies to electrify both manned and unmanned Next Generation Combat Vehicle platforms. Electrification of these platforms will enable advanced onboard electrified payloads such as directed energy weapons, reduce battlefield fuel consumption, and provide new capabilities such as burst acceleration, extended silent mobility and silent watch. The effort will mature, integrate and demonstrate technologies to increase electric power such as a high voltage\/temperature generator and high power\/ temperature power electronics as well as technologies to reduce power demands including composite rubber band track and adaptive hydro-strut suspension.     \n\nThis Project also continues the Advanced Vehicle Power Technology Alliance between the Department of Energy and the Department of the Army with a focus on electrification technology that enables military ground vehicles to become significantly more energy efficient. The Alliance is chartered to accelerate the conceptualization and transition into deployment of inventive and creative energy-saving concepts that the Nation needs to achieve energy security.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.    \n\nWork in this Project supports the Army Modernization Priority Next Generation Combat Vehicle.\n\nWork is performed by the U.S. Army Futures Command.\n\nThis work complements PE 0602145A (Next Generation Combat Vehicle Technology)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NGCV Platform Electrification & Mobility Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "This effort develops and demonstrates scalable electrification architecture, electronics and mobility components required to electrify both manned and unmanned Next Generation Combat Vehicle platforms."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.962"
                                            },
                                            "Text": {
                                                "val": "Will develop electrified mobility demonstrator design. Will develop composite rubber track and hydro strut suspension with track tensioner required to lower power demands for the electrified mobility demonstrator."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Work in the NGCV Platform Electrification & Mobility Advanced Technology effort is realigned to the Platform Electrification Technologies, Advanced Mobility Technologies and System\/Vehicle Integration and Test efforts in this Project in FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Platform Electrification Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and integrates components and sub-systems in order to demonstrate a modular electrification architecture  that scales across light to heavy weight classes of combat vehicles."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.072"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.072"
                                            },
                                            "Text": {
                                                "val": "Will develop scaleable, modular combat vehicle electrification architecture.   Will develop electric sprocket drive motors, diesel-electric power system and thermal management system for electrification architecture.  Will develop combat vehicle electrification software architecture. Will develop electric fan and demonstrate cooling architecture.   Will demonstrate combat vehicle electrification software architecture.Will demonstrate architecture and components for a modular high voltage, high energy storage system.  Will demonstrate architecture for a tactical battlefield recharge capability."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Work in Platform Electrification Technology was previously conducted in the NGCV Platform Electrification & Mobility Advanced Technology effort in this Project ."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Mobility Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates a reduced weight composite running gear system for medium combat vehicle applications which increases operational effectiveness and reduces fuel consumption."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.744"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.744"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate and validate performance of solid composite track and external suspension systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Work in Advanced Mobility Technologies was previously conducted in the NGCV Platform Electrification & Mobility Advanced Technology effort in this Project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Vehicle Power Technology Alliance (AVPTA)  - Electrification Technology"
                                    },
                                    "Description": {
                                        "val": "This effort develops and matures advanced energy storage technologies to improve power and energy performance and safety for vehicles.  Higher energy stored with less space and weight increases vehicle efficiency and range.  Ensures electrified ground vehicles have enough power for mobility, silent watch, and enables capabilities such as advanced protection, lethality and network capabilities.  This effort is a partnership with the Department of Energy."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.841"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.841"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate commercial battery chemistry and packaging technologies applicable to military hybrid and all-electric drive combat and tactical platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This activity transitioned from PE0602145A (Next Generation Combat Vehicle Technology), Project BH5 (Platform Electrification and Mobility Technology) in FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "System\/Vehicle Integration and Test"
                                    },
                                    "Description": {
                                        "val": "This effort integrates advanced mobility, platform electrification components and electrification architecture technologies into surrogate platforms to demonstrate the performance, scalability and modularity of the system approach which will provide the capabilities of silent mobility, improved mobility performance, improved operational duration without re-supply, and provides power to enable integration of advanced protection, lethality and network capabilities."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.044"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.044"
                                            },
                                            "Text": {
                                                "val": "Will integrate the sub-system models of the modular electrification architecture and components into surrogate hull models to maximize available volume."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Work in System\/Vehicle Integration and Test was previously conducted in the NGCV Platform Electrification & Mobility Advanced Technology effort in this Project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.236"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BH8"
                    },
                    "ProjectTitle": {
                        "val": "Enhanced VETRONICS Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "12.96"
                        },
                        "BudgetYearOne": {
                            "val": "12.397"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.397"
                        },
                        "BudgetYearTwo": {
                            "val": "10.113"
                        },
                        "BudgetYearThree": {
                            "val": "10.758"
                        },
                        "BudgetYearFour": {
                            "val": "10.146"
                        },
                        "BudgetYearFive": {
                            "val": "10.25"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "66.624"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from Program Element (PE) 0603005A (Combat Vehicle and Automotive Advanced Technology) \/ Project 497 (Combat Vehicle Electro)."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures, integrates, and demonstrates vehicle electronics hardware such as computers, sensors, communications systems, displays, and vehicle command\/control\/driving mechanisms as well as vehicle software to enhance crew performance, increase vehicle fuel efficiency, reduced Size, Weight, and Power (SWaP) burdens and reduce vehicle maintenance costs. This Project also advances open system architectures (power and data) for military ground vehicles to enable common interfaces, standards and hardware implementations. The overall vehicle system architecture approach provides an open architecture such as the Vehicle Integration for Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance \/ Electronic Warfare (C4ISR\/EW) Interoperability (VICTORY), to allow platforms to accept future technologies without the need for significant re-design as new technologies are developed and integrated. Additionally this Project matures infrastructure that enables the ease of integration of autonomous subsystem technologies into future and existing tactical and combat vehicle architectures. Technical challenges include: software and algorithm development for increased levels of automation for both manned and unmanned systems, secure vehicle data networks, interoperability of intra-vehicle and inter-vehicle systems, and implementation of advanced user interfaces. Overcoming these technical challenges enables improved and increased span of collaborative vehicle operations, efficient workload management, commander's decision aids, embedded simulation for battlefield visualization and fully integrated virtual test\/evaluation.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project supports the Army Modernization Priority Next Generation Combat Vehicle. \n\nWork in this Project is performed by the U.S.United States (US) Army Futures Command.\n\nWork is also coordinated with PE 0602145A (Next Generation Combat Vehicle Technology)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enhanced - Vehicle Electronics (E-Vetronics)"
                                    },
                                    "Description": {
                                        "val": "This effort addresses technical and integration challenges in the areas of vehicle architecture and systems integration. Specifically, this effort focuses on maturing and demonstrating a common ground vehicle open architecture with distributed display processing architecture, computing hardware capable of being re-configured to adapt to changes in Input \/ Output (I\/O) needs, advanced network video distribution, advancements in slip ring technology, tactical situational awareness (SA), cooperative engagement and mission package integration through open architecture components and software. These efforts will enable future vehicle capabilities, reduce dependencies on proprietary solutions, and support increased market competition through open architecture components and software."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.371"
                                            },
                                            "Text": {
                                                "val": "Will mature open systems architecture defining capabilities for flexible computing, I\/O, advanced video network distribution, advancements in slip ring technology, tactical SA, cooperative engagement.  Will define the standards and performance for flexible computing and I\/O component. Defines the open system standards for integrating tactical SA capabilities into ground vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.397"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.397"
                                            },
                                            "Text": {
                                                "val": "Will begin development of a shared processor to support addition of new functionality without requiring additional processing hardware to the vehicle. Will conduct first bench level demonstration of advanced slip ring technology, flexible computing I\/O, and advancements in open systems architecture and tactical SA."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.589"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BI1"
                    },
                    "ProjectTitle": {
                        "val": "Protection for Autonomous Systems Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "4.1"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.100"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20) this Project was realigned from:\nProgram Element (PE) 0603004A Weapons and Munitions Advanced Technology\n* Project 232 Advanced Lethality & Survivability Demo\nPE 0603005A Combat Vehicle and Automotive Advanced Technology\n* Project 221 Combat Veh Survivability\n\nIn FY21, this Project is realigned to:\nPE 0603462A Next Generation Combat Vehicle Advanced Technology\n* Project BG7 Ground Systems Active Defense (GSAD) Advanced Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures, integrates, and demonstrates protection and survivability components such as novel ballistic and sensor protection to address both current and emerging advanced threats to autonomous ground vehicles. This Project integrates complimentary survivability technologies to enable advanced protection suites, providing greater survivability and protection against emerging threats. This Project develops a holistic set of protection technologies that specifically target the autonomous subsystems integrated on a robotic platform.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. All FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nIn FY 2020 this Project will develop efforts that were successfully funded in PE 0602601A (Combat Vehicle and Automotive Technology) \/ Project C05 (Armor Applied Research) during FY 2019.\n\nWork in this Project supports the Army Science and Technology Next Generation Combat Vehicle Portfolio.\n\nWork is performed by the U.S. Army Futures Command.\n\nWork in this Project complements PE 0602145A (Next Generation Combat Vehicle Technology)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Protection for Autonomous Systems"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on maturing and demonstrating novel ballistic protection and sensor protection concepts to ensure autonomous ground vehicles can continue their mission in contested environments."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.707"
                                            },
                                            "Text": {
                                                "val": "Will determine potential vulnerabilities to an autonomous ground combat vehicle through modeling and simulation using physics-based tools. Will develop capabilities to validate vulnerabilities in a laboratory environment.  Will matures protection technologies for autonomous sensors."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding in this effort was realigned to support higher modernization priority areas."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vehicle Anti-Personnel Protection Armament System"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates capabilities to provide protection of manned and unmanned platforms against threats, non-combatants, civilian belligerents, and other potentially hostile actors."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.207"
                                            },
                                            "Text": {
                                                "val": "Will optimize and improve developmental technologies such as kinetic energy weapons\/munitions and millimeter Wave energy sources for employment on unmanned platforms to deliver effects (repel, suppress, move) that enable freedom of platform movement and maneuver."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding in this effort was realigned to support higher modernization priority areas."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.186"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BI3"
                    },
                    "ProjectTitle": {
                        "val": "Sensor Protection Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "1.5"
                        },
                        "BudgetYearOne": {
                            "val": "1.798"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.798"
                        },
                        "BudgetYearTwo": {
                            "val": "1.798"
                        },
                        "BudgetYearThree": {
                            "val": "1.798"
                        },
                        "BudgetYearFour": {
                            "val": "1.818"
                        },
                        "BudgetYearFive": {
                            "val": "1.818"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.530"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0603710A (Night Vision Advanced Technology) \/ K70 (Night Vision Advanced Technology)"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates novel sensor protection capabilities which dramatically reduce the susceptibility of our thermal electro-optic\/infrared (EO\/IR) sensors to ever increasing threats on the battlefield. This effort enables continuation of the mission despite potential threat laser engagements. Low cost modular solutions will be demonstrated that can be applied across current and planned EO\/IR targeting, surveillance, and situational awareness sensor systems against existing and emerging threats in support of combined arms maneuver.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project supports the Army Modernization Priorities Next Generation Combat Vehicle, Soldier Lethality, and Future Vertical Lift.\n\nWork in this Project is performed by the United States (US) Army Futures Command.\n\nWork in this Project is coordinated with PE 0602145A (Next Generation Combat Vehicle Technology), 0602143A (Soldier Lethality Technology), 0603465A (Future Vertical Lift Advanced Technology) and 0603118A (Soldier Lethality Advanced Technology)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sensor Protection Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "This effort will mature and demonstrate sensor protection and signature reduction capabilities which better ensure sensors are difficult to detect, dazzle, and damage by current and future laser threats."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.432"
                                            },
                                            "Text": {
                                                "val": "Will mature novel approaches for protecting optics from energetic threats on multiple types of vehicle platforms and soldier sensors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.798"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.798"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate technologies to protect emerging high sensitivity uncooled longwave infrared sensors."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned lifecycle of this effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.068"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BI5"
                    },
                    "ProjectTitle": {
                        "val": "Materials Application and Integration Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "3.625"
                        },
                        "BudgetYearOne": {
                            "val": "5.487"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.487"
                        },
                        "BudgetYearTwo": {
                            "val": "5.628"
                        },
                        "BudgetYearThree": {
                            "val": "5.741"
                        },
                        "BudgetYearFour": {
                            "val": "5.8"
                        },
                        "BudgetYearFive": {
                            "val": "4.577"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "30.858"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2020 this Project is realigned from PE 0603005A (Combat Vehicle and Automotive Advanced Technology) \/ Project 221 (Combat Veh Survivability)."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures, integrates, and demonstrates lightweight novel materials, and new manufacturing processes and methodologies. These materials and technologies will enable the Army to address critical areas within survivability, mobility, and transportability.\n\nThis Project also continues the Advanced Vehicle Power Technology Alliance between the Department of Energy and the Department of the Army with a focus on materials, providing an emphasis on developing advanced technologies that enable military ground vehicles to become significantly more energy efficient. The Alliance is chartered to accelerate the conceptualization and transition into deployment of inventive and creative energy-saving concepts that the Nation needs to achieve energy security. This Project matures and integrates lightweight materials and joining technologies in support of lighter military vehicles which are more fuel-efficient and expeditionary with superior mobility and protection of both vehicles and occupants.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project supports the Army Modernization Priority Next Generation Combat Vehicle. \n\nWork is performed by the United States (US) Army Futures Command .\n\nWork in this Project is coordinated with PE 0602145A (Next Generation Combat Vehicle Technology)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "System Design Optimization for Lightweighting"
                                    },
                                    "Description": {
                                        "val": "This effort matures technologies, tools, and advanced manufacturing techniques in support of the Army?s mission to increase mobility, protection, and transportability while reducing weight.  This effort focuses on maturing and demonstrating technologies to decrease ground vehicle weight while optimizing performances and enabling the Army trade space for enhanced capabilities.  The technologies being demonstrated are in the fields of material maturation, design optimization, operational metrics, joining technologies, and additive manufacturing.  This effort is coordinated with PE 0602145A (NGCV Technology)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.46"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate advanced materials for weight optimization.  Will demonstrate an optimization design which will result in meeting\/exceeding required performance while reducing weight and increasing system robustness.  Will validate the operational metrics on a combat platform established for light weighting to include freedom of movement, freedom and maneuver, and enhanced transportability and supportability. Will demonstrate the integration of a hybrid joint design of dissimilar materials. Exploit the capabilities of Additive Manufacturing by demonstrating performance requirements on a combat platform that are enabled by the unique geometries and design options that are not possible with traditional manufacturing techniques."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.793"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.793"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate advanced\/lightweight material technologies for design\/weight optimization and advanced manufacturing, to include additive manufacturing. Will validate and demonstrate integration of solid-state joining and hybrid joint design of dissimilar materials to improve performance while reducing weight and increasing system robustness. Will validate material and component manufacturability, blast\/ballistic performance, machinability, weldability, corrosion resistance, and stiffness characteristics."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding realigned  from PE 0602145A (Next Generation Combat Vehicle Technology) \/ BI4 (Materials Application and Integration Technology) to better support the Army Modernization Priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Vehicle Power Technology Alliance ? Materials"
                                    },
                                    "Description": {
                                        "val": "This effort develops and matures lightweight materials and joining technologies in support of lighter military vehicles which are more fuel-efficient and expeditionary with superior mobility and protection of both vehicles and occupants. Lighter materials\/constructions and advances in joining technologies such as multi-material and dissimilar material joining will lead to lightweight military vehicle structures."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.694"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.694"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate advanced\/lightweight materials for ground vehicle weight optimization, energy storage\/transfer, and protection such as FeMnAl (Iron, Manganese and Aluminum alloy), CuTa (Copper Tantalum), Magnesium, and\/or other high strength aluminum alloys through optimization and validation of advanced manufacturing, machining, blast\/ballistic performance, dissimilar material joining\/weldability, and corrosion."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned from PE 0602145A (Next Generation Combat Vehicle Technology) \/ BI4 (Materials Application and Integration Tech)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.165"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "BI8"
                    },
                    "ProjectTitle": {
                        "val": "All-Electric Combat Powertrain Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "1.249"
                        },
                        "BudgetYearFour": {
                            "val": "4.596"
                        },
                        "BudgetYearFive": {
                            "val": "15.794"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "21.639"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "ProjectNumber": {
                        "val": "BJ1"
                    },
                    "ProjectTitle": {
                        "val": "Vehicle System Security Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "1.25"
                        },
                        "BudgetYearOne": {
                            "val": "1.499"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.499"
                        },
                        "BudgetYearTwo": {
                            "val": "2.843"
                        },
                        "BudgetYearThree": {
                            "val": "4.502"
                        },
                        "BudgetYearFour": {
                            "val": "4.948"
                        },
                        "BudgetYearFive": {
                            "val": "3.502"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "18.544"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20) this Project is realigned from;\nProgram Element (PE) 0603005A Combat Vehicle and Automotive Technology\n* Project 441 Combat Vehicle Mobility"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates ground vehicle cyber protection and resilience technologies to increase the cybersecurity of ground vehicles and ensure their continued operation in near-peer cyber contested environments. This Project will mature cybersecurity technologies at the platform level to defeat cybersecurity threats and maintain assured vehicle functionality and freedom of maneuver in the cyber warfighting domain.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project supports the Army Modernization Priority Next Generation Combat Vehicle.\n\nWork is performed by the United States (US) Army Futures Command.\n\nThis Project is coordinated with PE 0602145A (Next Generation Combat Vehicle Technology)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Vehicle System Security Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates technologies required to maintain operating tempo and overmatch capability during offensive digital attacks to military ground vehicle systems. Additionally, the effort will maintain critical vehicle functionality in peer and near-peer cyber-contested environments. The effort will also mature and demonstrate technologies to mitigate risk of future and emerging cyber vulnerabilities by designing highly assured systems with cybersecurity designed from the beginning."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.193"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate quantifiable security & resiliency metrics to inform digital protection requirements for future capabilities.  Will develop and mature embedded cyber-resilient technologies to protect against offensive and malicious attacks. Will mature and demonstrate resilient runtime technologies for real-time threat detection and operation in near-peer cyber-contested environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.499"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.499"
                                            },
                                            "Text": {
                                                "val": "Will develop a secure systems integration and assessment capability integrating hardware-in-the-loop and vehicular cybersecurity vulnerability models and exploits to assess cyber resiliency approaches.  Will also mature and demonstrate vehicle data bus protection using embedded advanced sensing and analytics to provide real-time protection against malicious near-peer cyber attacks for both present and future tactical and combat military vehicles."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding re-aligned to more foundational efforts in PE 622145 (Next Generation Combat Vehicle Technology) \/ BI9 (Vehicle System Security Technology), which coordinates with this Project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.057"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BJ6"
                    },
                    "ProjectTitle": {
                        "val": "Hydrogen Based Combat System Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "4.485"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.485"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20) this Project was realigned from:\nProgram Element (PE) 0603005A Combat Vehicle and Automotive Advanced Technology\n* Project 441 Combat Vehicle Mobility\n\nIn FY21 this Project is realigned to:\nPE 0603462A Next Generation Combat Vehicle Advanced Technology\n* Project BH6 Platform Electrification and Mobility Adv Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures, integrates and demonstrates the technologies required to enable combat systems to be powered by fuel cells to enable increased operational endurance, silent operations and improved mobility. This effort demonstrates the integration of multiple fuel cell stacks to achieve necessary power levels for tracked combat systems. The efforts in this Project analyze hydrogen generation and distribution approaches to validate operational relevance of hydrogen on the battlefield. This effort also develops and demonstrates in a relevant environment the required hydrogen generation technologies in order to quantify reliability, durability and efficiency.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project supports the Army Modernization Priority Next Generation Combat Vehicle. \n\nWork is performed by the U.S. Army Futures Command (AFC).\n\nThis Project is coordinated with PE 0602145A (Next Generation Combat Vehicle Technology)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hydrogen Based Combat System Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "This effort matures, integrates and demonstrates the technologies required to enable combat systems to be powered by fuel cells."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.281"
                                            },
                                            "Text": {
                                                "val": "Will conduct performance evaluation of both reusable solid hydrogen storage tanks and liquid hydrogen for battlefield operations.  Will demonstrate the physical integration of multiple fuel cell stacks into a larger module to reduce volume and increase power density."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is realigned in FY21 to BH6 (Platform Electrification and Mobility Adv Tech) to support Army Modernization Priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.204"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BJ8"
                    },
                    "ProjectTitle": {
                        "val": "Detection of Explosive Hazards Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "5.13"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.130"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20) this Project is realigned from:\nProgram Element (PE) 0603606A Landmine Warfare and Barrier Advanced Technology\n* Project 608 Countermine & Bar Dev\n\nIn Fiscal Year 21 (FY21) this Project will realign to:\nPE 0602145A Next Generation Combat Vehicle Technology\n* Project BF9 Sensors for Autonomous Operations and Surv Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures, optimizes and demonstrates leap ahead capabilities for manned and unmanned detection and neutralization of peer, near peer and other threat mines, minefields and improvised explosive devices in all environments.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project supports Army Modernization Priorities Next Generation Combat Vehicle, and Soldier Lethality modernization priorities.\n\nWork in this Project is performed by the United States (US) Army Futures Command.\n\nThis Project is coordinated with PE 0602145A (Next Generation Combat Vehicle Technology)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Detection of Explosive Hazards Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates an integrated, standoff, modular sensor processing capability that will enable remote, rapid autonomous detection of mines, other Explosive Hazards (EH) and indicators of emplacement from manned and unmanned ground vehicles and Unmanned Aerial Systems (UAS). This effort is coordinated with PE 0602145A (Next Generation Combat Vehicle Technology), 0602143A (Soldier Lethality Technology), and 0603118A (Soldier Lethality Advanced Technology)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.897"
                                            },
                                            "Text": {
                                                "val": "Will mature an EH detection payload for a manned or unmanned ground vehicle and validate performance in multiple environments.  Will mature EH threat detection payload for small fixed wing and rotary wing UASs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding in this effort was realigned to support higher Army Modernization priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.233"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BK1"
                    },
                    "ProjectTitle": {
                        "val": "Autonomous Mobility Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "7.14"
                        },
                        "BudgetYearOne": {
                            "val": "8.791"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.791"
                        },
                        "BudgetYearTwo": {
                            "val": "6.894"
                        },
                        "BudgetYearThree": {
                            "val": "6.794"
                        },
                        "BudgetYearFour": {
                            "val": "5.736"
                        },
                        "BudgetYearFive": {
                            "val": "5.736"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "41.091"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This project transitions technologies from 0602145A\/BJ9, Autonomous Mobility Tech, for additional maturation and demonstration."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates Artificial Intelligence and Machine Learning (AI\/ML) technologies to increase autonomy and mobility to perform teamed operations with manned and unmanned air and ground vehicles in a military relevant environment through data collection on relevant platforms. Data collection will involve both simulation and live collection. Simulation will provide a baseline to correctly collect, clean, and analyze data that meets the need for improving algorithms for both formation control and unmanned aerial vehicle map input for unmanned ground vehicle mobility. Live data will start with Surrogate platforms in local areas. This will allow proper collection techniques, tools, and data to maximize embedded autonomy using Machine Learning and other Artificial Intelligent methods before utilizing live data collection. The Project will use AI\/ML techniques to mature and demonstrate intelligent formation control to be used on maintained roads and in complex terrain without the need for GPS. Data will be collected from mounted platforms utilizing special internal and external sensors to improve algorithms for exact positioning, undistributed formation control, and increased speeds of unmanned platforms. Also, the Project will use AI\/ML techniques to optimize intelligent autonomous ground platform planning through the use of Unmanned Aerial Systems (UAS) mapped areas. Data collected from air vehicle will be converted to maneuverable information for unmanned ground platform with the identification of enemy positions, go\/no-go areas, terrain classification, and optimal suggested paths.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy .\n\nWork in this Project supports the Army Modernization Priority Next Generation Combat Vehicle.\n\nWork is performed by the United States (US) Army Futures Command.\n\nThis Project is coordinated with PE 0602145A (Next Generation Combat Vehicle Technology)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Machine Learning Data Collection"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates techniques and technologies for mass data collection to be used towards Army research in mobility with AI\/ML efforts."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.777"
                                            },
                                            "Text": {
                                                "val": "Will mature data collection system to include multiple sensing modalities and proper computation requirements. Will develop and conduct collection plans leveraging both simulation and live data collection across multiple vehicles. Will develop and conduct test and validation plans to understand proper data to collect from training exercises. Will develop collection, analysis, and validation tools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.195"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.195"
                                            },
                                            "Text": {
                                                "val": "Will optimize data collection system created in FY20. Will design the data pipeline and infrastructure to support a large number of sensor platforms, petabytes (quadrillion bytes) of data, and many concurrent users. Will mature and demonstrate overall data collection approach with surrogate and actual vehicles using training and simulated operational events."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is increased in FY21 to design the data pipeline and infrastructure for a large number of support platforms, and underlying data and users."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Formation Control"
                                    },
                                    "Description": {
                                        "val": "This effort uses AI\/ML techniques to develop intelligent formation control to be used on maintained roads and in complex terrain without the need for GPS. Data will be collected from mounted platforms utilizing special internal and external sensors to develop algorithms for exact positioning, undistributed formation control, and increased speeds of unmanned platforms."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.038"
                                            },
                                            "Text": {
                                                "val": "Will develop and mature simulation tools that will be used to research coordination and collaboration between vehicles and show usability of collected data from above. Will develop algorithms to determine position\/orientation of vehicle within formation utilizing AI\/ML that has been trained with Army relevant platform data."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort was realigned to shift focus to UAS Mapping efforts in FY21 within this same Project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "UAS Mapping"
                                    },
                                    "Description": {
                                        "val": "This effort uses AI\/ML techniques to develop intelligent autonomous ground platform planning through the use of UAS mapped areas.  Data collected from air vehicle will be converted to maneuverable information for unmanned ground platform with the identification of enemy positions, go\/no-go areas, terrain classification, and optimal suggested paths."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.596"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.596"
                                            },
                                            "Text": {
                                                "val": "Will improve the ability to use data collected from UAS to inform Unmanned Ground Vehicles (UGV) maneuver including in Global Positioning System (GPS)-denied and other degraded environments. Will optimize the UAS's ability to identify enemies and terrain to be used for future UAS\/UGV coordination."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort was realigned from Formation Control within this Project to support UAS and UGV coordination."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.325"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BK4"
                    },
                    "ProjectTitle": {
                        "val": "Next Gen Intelligent Fire Control(NG-IFC) Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0.45"
                        },
                        "BudgetYearOne": {
                            "val": "9.241"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.241"
                        },
                        "BudgetYearTwo": {
                            "val": "1.998"
                        },
                        "BudgetYearThree": {
                            "val": "2.398"
                        },
                        "BudgetYearFour": {
                            "val": "2.498"
                        },
                        "BudgetYearFive": {
                            "val": "3.158"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "19.743"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This project transitions technologies from 0602145A\/BK3, Next Gen Intelligent Fire Control (NG-IFC) Tech, for additional maturation and demonstration."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project will mature and deliver armament specific hardware, algorithms and architectures to support the Next Generation Combat Vehicle with the necessary fire control on future manned and unmanned platforms.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project supports the Army Modernization Priority Next Generation Combat Vehicle.\n\nWork in this Project is performed by the United States (US) Army Futures Command.\n\nWork in this Project is related to and fully integrated with the efforts funded in PE 0602145A (Next Generation Combat Vehicle Technology)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Next Generation Intelligent Fire Control"
                                    },
                                    "Description": {
                                        "val": "This effort will deliver armament specific hardware, algorithms and architectures to support the Next Generation Combat Vehicle with the necessary fire control on future manned and unmanned platforms."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.43"
                                            },
                                            "Text": {
                                                "val": "Will optimize the fire control auto-tracking algorithms capability for advanced weapons systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.241"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.241"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate sensor interoperability in a fire control System Integration Lab (SIL) environment. Will optimize and integrate hardware and software for beyond line of sight targeting with a forward sensor platform\/system. Will integrate fire control system, decision-aided algorithms, and targeting hardware in a relevant environment to demonstrate decreased sensor to shooter engagement time for combat vehicle platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increased to conduct demonstration of hardware and software in support of Army Modernization priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.02"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BK6"
                    },
                    "ProjectTitle": {
                        "val": "Adv Direct InDirect Armament Sys (ADIDAS) Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0.51"
                        },
                        "BudgetYearOne": {
                            "val": "3.14"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.14"
                        },
                        "BudgetYearTwo": {
                            "val": "1.499"
                        },
                        "BudgetYearThree": {
                            "val": "1.499"
                        },
                        "BudgetYearFour": {
                            "val": "1.998"
                        },
                        "BudgetYearFive": {
                            "val": "2.242"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.888"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This project transitions technologies from 0602145A\/BK5, Adv Direct In-Direct Armament Sys (ADIDAS) Tech, for additional maturation and demonstration."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates technologies for large caliber direct fire light-weight armament systems that will exceed the current capability of 120 millimeter (mm) direct fire cannons and be optimized for future operational environment with cross-domain engagement capability. Specifically this effort integrates and demonstrates technologies for rapid fire on-the-move at all elevations (direct & indirect), compact ammunition design with advanced ignition, advanced recoil mitigation to reduce impulse and allow integration onto lighter platforms, automated ammunition handling and reloading. This Project supports open architecture to enable supervised autonomy and remote operation and integrates intelligent fire control to address multi-domain targets from manned and unmanned platforms.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project supports the Army Modernization Priority Next Generation Combat Vehicle.\n\nWork in this Project is performed by the United States (US) Army Futures Command.\n\nWork in this Project is related to and fully integrated with the efforts funded in Program Element (PE) 0602145A (Next Generation Combat Vehicle Technology) and PE 0604115A  (Technology Maturation Initiative)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Direct In-Direct Armament System (ADIDAS)"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates technologies for large caliber direct fire light-weight armament systems that will exceed the current capability of 120mm direct fire cannons and be optimized for future operational environment with cross-domain engagement capability."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.487"
                                            },
                                            "Text": {
                                                "val": "Will optimize the armament system configurations for high elevations and advanced recoil mitigation to reduce impulse.  Will mature system level designs through modeling and simulation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort transitions in FY21 to the Large Caliber Armament System (LCAS) effort in this Project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Large Caliber Armament System (LCAS)"
                                    },
                                    "Description": {
                                        "val": "This effort develops a next generation, automated, lightweight 120-mm armament system design for Next Generation Combat Vehicle, providing tank-like lethality for light medium-weight optionally manned platforms."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.14"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.14"
                                            },
                                            "Text": {
                                                "val": "Will optimize the weapon mount for increased gun elevations, an automated ammunition handling system, and integration on lighter weight, optionally manned combat vehicles; and mature and demonstrate an improved 120-mm reduced recoil weapon mount with increased lethality for future combat vehicles."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Project and effort is increased to demonstrate large caliber armament technologies for light and medium weight optionally manned platforms in support of the Army Modernization priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.023"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BP6"
                    },
                    "ProjectTitle": {
                        "val": "Ground Vehicle Advanced Technology(CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "100.5"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "100.500"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional Interest Item funding provided for Ground Vehicle Advanced Technology."
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding provided for Ground Vehicle Advanced Technology.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Additive Manufacturing for Jointless Hull"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "20"
                                        },
                                        "Text": {
                                            "val": "Additive Manufacturing for Jointless Hull"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Carbon Fiber and Graphite Foam Technology"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Carbon Fiber and Graphite Foam Technology"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hydrogen Fuel Cells"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Hydrogen Fuel Cells"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ATE5.2 Engine Development"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "ATE5.2 Engine Development"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Additive Manufacturing of Critical Components"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Additive Manufacturing of Critical Components"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Water Harvesting Technology"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Advanced Water Harvesting Technology"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced High Strength and Lightweight Steels"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "3"
                                        },
                                        "Text": {
                                            "val": "Advanced High Strength and Lightweight Steels"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Vehicle Weight Reduction Initiative"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8"
                                        },
                                        "Text": {
                                            "val": "Combat Vehicle Weight Reduction Initiative"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Virtual and Physical Prototyping"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8"
                                        },
                                        "Text": {
                                            "val": "Virtual and Physical Prototyping"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HMMWV Augmented Reality System"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "HMMWV Augmented Reality System"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Health Usage Monitoring for HMMWV"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "3"
                                        },
                                        "Text": {
                                            "val": "Health Usage Monitoring for HMMWV"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HMMWV Autonomy"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "HMMWV Autonomy"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HMMWV Torque Monitoring"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "2"
                                        },
                                        "Text": {
                                            "val": "HMMWV Torque Monitoring"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HMMWV Automotive Enhancements"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "7.5"
                                        },
                                        "Text": {
                                            "val": "HMMWV Automotive Enhancements"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Additive Manufacturing"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4"
                                        },
                                        "Text": {
                                            "val": "Additive Manufacturing"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BZ9"
                    },
                    "ProjectTitle": {
                        "val": "Smart Targeting Environment for Lower Level Assets"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "3.968"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.968"
                        },
                        "BudgetYearTwo": {
                            "val": "4.096"
                        },
                        "BudgetYearThree": {
                            "val": "4.343"
                        },
                        "BudgetYearFour": {
                            "val": "4.392"
                        },
                        "BudgetYearFive": {
                            "val": "4.392"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "21.191"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2021 (FY21) this Project was realigned from:\nProgram Element (PE) 0603462A Next Generation Combat Vehicle Advanced Technology\n* Project BH3 C4ISR Modular Autonomy Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates mission targeting support software and algorithms leveraged from the Defense Advanced Research Project Agency (DARPA) System-of-System Enhanced Small Unit (SESU) concepts and technology to enable small units to continuously build and share targeting data and access strike assets in multi-domain operations.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project supports the Army Modernization Priority Next Generation Combat Vehicle.\n\nWork in this Project is performed by the United States (US) Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Small Targeting Environment for Lower Level Assets (STELLA )"
                                    },
                                    "Description": {
                                        "val": "This effort integrates search, fusion, data dissemination and interoperability algorithms to speed the overall targeting process by: utilizing  automated target search algorithms based on mission parameters for processing time , detecting concealed targets  and target priority; fusing local data processing of navigation and payload data to increase accuracy for  engagement of targets; optimizing data dissemination algorithms based on local network conditions; streamlining interfaces for small units to access joint strike assets."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.968"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.968"
                                            },
                                            "Text": {
                                                "val": "Will analyze reports and laboratory models to improve performance of technologies that will be integrated into small unit common operating picture (COP) to identify enemy location and access strike assets; mature tactical automated search algorithms with attribute trade-offs such as speed  or detection thresholds."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding was realigned into this effort to support higher priority Army Modernization needs."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}