{
    "id": "2021-Army-PB-2040-JBOOK-7f1ee284016a103cbd6a4d63ea727aa617711f15268cf669f26149e7ae172ad5-29",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602716A"
        },
        "ProgramElementTitle": {
            "val": "Human Factors Engineering Technology"
        },
        "R1LineNumber": {
            "val": "35"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "23.755"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "23.755"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020, this Program Element (PE) is realigned with continuity of effort to the following PEs:\n* PE 0602143A Soldier Lethality Technology\n* PE 0602145A Next Generation Combat Vehicle Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE conducts applied research on human factors to maximize the effectiveness of Soldiers in concert with their equipment. The resulting data are the basis for weapon systems and equipment design standards, guidelines, handbooks, and Soldier training as well as manpower requirements to improve equipment operation and maintenance. Application of this research will yield reduced workload, fewer errors, enhanced Soldier protection, user acceptance, and allows the Soldier to extract the maximum performance from the equipment.  \n\nMajor efforts research sources of stress, potential stress moderators, and intervention methods, and identify and quantify human performance measures and methods to address current and future warrior performance issues. Individual efforts exploit adaptive learning methods and strategies, enhance and validate human performance modeling tools; investigate integration of advanced concepts in crew stations designs, optimizes interfaces for information systems and improves human robot interaction (HRI) in a full mission context.\n\nResults of these efforts are transitioned to the Research, Development, and Engineering Centers, the Program Executive Offices (PEO) & Program Managers, Army Training and Doctrine Command (TRADOC), Army Medical Command (MEDCOM), Human Systems Integration (HSI) Directorate (Army G1), and Army Test and Evaluation Command (ATEC).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the United States Army Futures Command (AFC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "24.121"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "23.755"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.366"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.007"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.359"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H70"
                    },
                    "ProjectTitle": {
                        "val": "Human Fact Eng Sys Dev"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "23.755"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "23.755"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0602143A Soldier Lethality Technology\n* Project AY6 Soldier Squad Small Arms Armaments Technology\n* Project BB7 Exoskeleton: technology for Man-Machine Interface\n* Project BC3 Soldier Decision Making & Comms Performance Tech\n* Project BE8 Synthetic Training Environment (STE) Technology\nPE 0602145A Next Generation Combat Vehicle Technology\n* Project BF6 Crew Augmentation and Optimization Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project conducts applied research on human factors to maximize the effectiveness of Soldiers in concert with their equipment.  The resulting data are the basis for weapon systems and equipment design standards, guidelines, handbooks, and Soldier training as well as manpower requirements to improve equipment operation and maintenance. Application of this research will yield reduced workload, fewer errors, enhanced Soldier protection, user acceptance, and allows the Soldier to extract the maximum performance from the equipment.  \n\nMajor efforts research sources of stress, potential stress moderators, and intervention methods, and identify and quantify human performance measures and methods to address current and future warrior performance issues. Individual efforts exploit adaptive learning methods and strategies, enhance and validate human performance modeling tools; investigate integration of advanced concepts in crew stations designs, optimizes interfaces for information systems and improves human robot interaction (HRI) in a full mission context.\n\nResults of these efforts are transitioned to the Research, Development, and Engineering Centers, the Program Executive Offices (PEO) & Program Managers, Army Training and Doctrine Command (TRADOC), Army Medical Command (MEDCOM), Human Systems Integration (HSI) Directorate (Army G1), and Army Test and Evaluation Command (ATEC).\n\nEfforts in this Project support the Under Secretary of Defense for Research and Engineering Science and Technology priorities and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Interfaces for Collaboration and Decision Making"
                                    },
                                    "Description": {
                                        "val": "This effort looks at the study of how networks influence, and are influenced by, human behavior in the context of military decision making.  The studies, which range from computational modeling to networked simulations in a laboratory environment, to large-scale simulation exercises, will investigate the effects of technology on information flow, cognitive workload, team collaboration, organizational effectiveness, situational awareness, and decision making."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.8"
                                            },
                                            "Text": {
                                                "val": "Developed initial capability for real-time empirical assessment of human cyber performance to include leveraging human digital behaviors (i.e. keystrokes, mouse-clicks, tool use, screen recordings); identified specifications for Soldier cyber security training needs in tactical environments; developed techniques and measures to assess cyber team effectiveness; created behavioral models of Soldier situation understanding and defense of enterprise-level networked operational environments; continued development of capabilities for dynamic human\/agent cyber experimentation using cyber test-range for on-site and remote human-in-the-loop experiments with authoring and execution of repeatable cyber scenarios."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Performance Modeling"
                                    },
                                    "Description": {
                                        "val": "Enhance human performance modeling tools to enable system analysis that will inform system design early in the acquisition process.  These tools will allow the identification of design flaws that can be mitigated to reduce workload and human errors and increase user acceptance of developing technologies allowing the Soldier to extract the maximum performance from the equipment.  Collect and analyze empirical data on human perception (vision and hearing) to support human and system performance models used for equipment design and training."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.025"
                                            },
                                            "Text": {
                                                "val": "Investigated the use of Human Systems Integration (HSI) tools to validate the effects of autonomous systems on operator workload and mission performance; conducted human performance modeling tool maintenance, development, and support; continue to extend development of human accommodating analysis to quantify human resource costs in terms of manpower, personnel and training; developed training videos to support the HSI practitioners; explored the development of human agent assisted tools for supporting HSI evaluations and assessments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Brain-Computer Interaction"
                                    },
                                    "Description": {
                                        "val": "Investigate the use of neurophysiological and behavior-based technologies for enhancing the interaction between Soldiers and systems such as autonomous systems and advanced crew stations. Implement guidelines for algorithms for characterizing Soldier brain activity in operational contexts, and real-time techniques to integrate neurally-based information into systems designs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.23"
                                            },
                                            "Text": {
                                                "val": "Developed novel multiclass rapid-serial visual presentation brain-computer interaction paradigms for improved integration with deep-learned computer vision; developed novel approaches for determining the optimal allocation of images across hybrid teams of computer vision and brain-computer interface-using humans for enhancing efficiency of image analysis."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dismounted Soldier Performance"
                                    },
                                    "Description": {
                                        "val": "Investigate equipment design standards and human performance measures and create guidelines for maneuver team information systems solutions that improve situational understanding and decision cycle time; identify, mature, and quantify human performance limitations to address future warrior performance issues."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.375"
                                            },
                                            "Text": {
                                                "val": "Determined the performance thresholds associated with individual and small team performance as a function of physical and cognitive constraints; examined the distinctions between equipment configurations, including novel system interface approaches designed to improve performance metrics (e.g., timing, accuracy, mobility); continued to investigate the effects of human variability on the performance of small arms shooting accuracy, and will determine ways of mitigating negative effects; conducted studies that relate characteristics of individual Soldier weapon systems, ancillary equipment, and ammunition to dismounted Soldier shooting performance (accuracy and precision)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human-Robot Interaction"
                                    },
                                    "Description": {
                                        "val": "Design human-centered design requirements and technologies for supervision and Soldier interaction with multiple semi-autonomous unmanned vehicles in urban and unstructured environments.  This research will be transitioned to U.S. Army TARDEC."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.068"
                                            },
                                            "Text": {
                                                "val": "Extended advances in multimodal, bidirectional communications models, including natural language solutions for small teams, to enhance Soldier collaborations with multiple heterogeneous agents in a distributed operational environment; enhanced models of trust and transparency to include adaptive roles for both humans and agents and serve as basis for human centered design requirements in multi-agent systems; explored applications for bidirectional communication and trust and transparency to include both mounted and dismounted operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Understanding Socio-cultural Influence"
                                    },
                                    "Description": {
                                        "val": "Investigate and model cognitive aspects of socio-cultural influences on Soldier\/Commander decision making and communication to enhance Soldier performance with systems, within teams and in the mission context.  Extend models of individual and teams to societal levels to support regional understanding, training, mission rehearsal, and influence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.025"
                                            },
                                            "Text": {
                                                "val": "Continued to quantify the processes and proficiencies that are selected for and taught by practitioners who collect, process, and distribute sociocultural information within the Army; developed a predictive model of group behavior based on religion to augment Civil Affairs decision making; conducted preliminary experiments to explore methods for improving situational understanding and decision making when visualizing sociocultural information in virtual reality; leveraged theory from cognitive science to inform experimentation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Continuous Multi-Faceted Soldier Characterization for Adaptive Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort will investigate technologies that provide the foundation for future Army systems to adapt to individual Soldier?s states, behaviors, and intentions in real-time.  Develop novel approaches to individualize adaptive systems through enhanced interfaces, interactions, or interventions that capitalize on prediction methods; and decrease time-to-train, augment physical, cognitive, and social performance, and improve human-network interactions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.6"
                                            },
                                            "Text": {
                                                "val": "Developed techniques and algorithms to collect, synchronize and integrate high resolution behavioral, physiological, environmental, and task-based sensor information with existing low-resolution multi-faceted assessment capability to enable continuous monitoring of an individual across a variety of timescales; developed capability for real-time group-based performance assessment incorporating multi-faceted individual metrics and social dynamics through integration of multiple, pervasive data sources."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Training Effectiveness Research"
                                    },
                                    "Description": {
                                        "val": "Novel technologies and their implementation in Army systems may result in demands on Soldiers that exceed their knowledge, skill, or memory capacity.  When demands cannot be remediated by human systems integration, training may enable the demands to be met.  This effort will identify human operator tasks in complex, intelligent, and emerging systems critical to mission employment of new technologies.  The aspects (particularly knowledge and skill) of those tasks will be determined through experimentation and analysis to inform development of training and simulation technologies, fundamental research on the effectiveness of training regimes, and simultaneous task combinations that must be trained."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.992"
                                            },
                                            "Text": {
                                                "val": "Conducted experiments with refined research-based integration of multi-sensor data (e.g. accuracy, communications, psycho-physiological, and\/or movement\/location) for automated measurement of critical training outcomes; explored and identify training effectiveness measures for collective training (mixed reality and live); explored and identified multi-sensor data for automated measurement of effective collective training outcomes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Soldier Capability Enhancement"
                                    },
                                    "Description": {
                                        "val": "Research the relationship of augmentation agents and Soldier performance & behavior.  Investigates the effects of augmentation agents (perceptual, cognitive, and\/or physical), used either individually or coupled as a system of agents, on Soldier performance, resilience, and training during operationally relevant tasks. Development of guidelines and models for designing and employing augmentation agents. Implementation of guidelines will enhance augmented Soldier performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.76"
                                            },
                                            "Text": {
                                                "val": "Investigated augmentation applications, to understand functionality in mounted and dismounted operational environments; enhanced models of performance and adaptation to facilitate more robust prediction of capability enhancement including short and long term adaptations and factors related to individual variability; enhanced metrics for quantifying Soldier performance while using a system of augmentation agents in complex environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tools for Assessing Human\/Intelligent Team Performance"
                                    },
                                    "Description": {
                                        "val": "Develop tools for verifying and validating Soldier interactions and overall human-system performance of mixed Soldier-intelligent agent teams, while providing the foundation for a generalizable tool for a broad range of Human-System Integration (HSI) assessments. Focus on flexible, tailor-able analysis tools for laboratory grade, high-resolution assessment of dismount-robot interactions in complex environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Developed portable, ?plug and play? analysis toolkit that enables individualized assessment of a single human interacting with an intelligent agent in pseudo-controlled environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Explainable Intelligence Underlying Efficient Integration of Cognitive Assist Agents"
                                    },
                                    "Description": {
                                        "val": "This effort will develop novel methods for joint human \/ intelligent agent learning and decision making to capitalize on the individual strengths of humans and intelligent agents to improve emergent group performance; and enable rapid, cooperative decision making and learning utilizing machine learning approaches."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.05"
                                            },
                                            "Text": {
                                                "val": "Developed novel machine learning approaches for learning the optimal allocation of tasks across hybrid teams of humans and artificial intelligent agents; developed novel approaches to deep neural networks based on the underlying geometry of the data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Focused Neurotechnologies"
                                    },
                                    "Description": {
                                        "val": "Neurotechnologies for Soldier use are limited by a lack of sufficient tools and methodologies capable of interpreting brain data in real world environments. Research will focus on the development of novel user-transparent data acquisition systems that are comfortable and non-invasive and on the development of robust tools that account for high levels of variance and noise expected in recorded brain data in real-world environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.33"
                                            },
                                            "Text": {
                                                "val": "Determined and developed efficacy of novel materials for use in advanced validation tools for mobile brain-recording hardware; developed a framework describing the relationship between computational neural data features and the performance of corresponding neural state classifiers within non-ideal, noisy environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Exoskeleton"
                                    },
                                    "Description": {
                                        "val": "Accelerates Soldier lethality and mobility capabilities through exoskeleton systems with improved Soldier compatibility and reduced training requirements. Advances innovative assessment and analysis techniques and metrics that inform hardware design, system control and technology use case objectives. Identifies and matures fundamental assessment protocols for transition to Army Test and Evaluation community."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.5"
                                            },
                                            "Text": {
                                                "val": "Identified and validated initial surrogate tasks and associated performance metrics against an anticipated urban terrain scenario; identified key quantitative measures and model their relationship to performance outcomes; characterized human movement variability in performance of and transitions between component tasks and responses to perturbations within movement through complex urban environment scenario."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}