{
    "id": "2021-Army-PB-2040-JBOOK-714ad55e40c208dd6daa0faf0cf32aa88e3bc8f15c4df77071b9706a36db953e-11",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA5A-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604713A"
        },
        "ProgramElementTitle": {
            "val": "Combat Feeding, Clothing, and Equipment"
        },
        "R1LineNumber": {
            "val": "129"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "4.393"
            },
            "CurrentYear": {
                "val": "7.393"
            },
            "BudgetYearOne": {
                "val": "2.814"
            },
            "BudgetYearOneBase": {
                "val": "2.814"
            },
            "BudgetYearTwo": {
                "val": "1.815"
            },
            "BudgetYearThree": {
                "val": "1.53"
            },
            "BudgetYearFour": {
                "val": "1.61"
            },
            "BudgetYearFive": {
                "val": "1.61"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "21.165"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Projects under this Program Element support the development, demonstration and Non-Developmental Item (NDI) Commercial Off The Shelf (COTS) evaluation of combat feeding equipment to enhance soldier efficiency, improve soldier survivability, and reduce food service logistics requirements for all four services. These Projects support multi-fuel, rapidly deployable field food service equipment initiatives. Efforts also support the Engineering and Manufacturing Development (EMD) phase of programs to improve equipment, enhance safety in food service, and decrease fuel and water requirements. The Projects develop critical enablers that support the Joint Future Capabilities and Joint Expeditionary mindset, by maintaining readiness through integrating new equipment, enhancing the field soldier's well-being, and providing soldiers usable equipment. The Projects also reduce sustainment requirements, related Combat Support\/Combat Service Support (CS\/CSS) demands on lift, the combat zone footprint, and costs for logistical support.\n\n\nThis PE\/Project supports Field Feeding programs for all the services."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.502"
                },
                "CurrentYear": {
                    "val": "2.393"
                },
                "BudgetYearOne": {
                    "val": "2.817"
                },
                "BudgetYearOneBase": {
                    "val": "2.817"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.393"
                },
                "CurrentYear": {
                    "val": "7.393"
                },
                "BudgetYearOne": {
                    "val": "2.814"
                },
                "BudgetYearOneBase": {
                    "val": "2.814"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.109"
                },
                "CurrentYear": {
                    "val": "5"
                },
                "BudgetYearOne": {
                    "val": "-0.003"
                },
                "BudgetYearOneBase": {
                    "val": "-0.003"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "5"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.109"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.003"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.003"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY2020 Increase supports Project 548 Congressional Interest Item."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "548"
                    },
                    "ProjectTitle": {
                        "val": "Mil Subsistence Sys"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.092"
                        },
                        "CurrentYear": {
                            "val": "7.393"
                        },
                        "BudgetYearOne": {
                            "val": "2.814"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.814"
                        },
                        "BudgetYearTwo": {
                            "val": "1.815"
                        },
                        "BudgetYearThree": {
                            "val": "1.53"
                        },
                        "BudgetYearFour": {
                            "val": "1.61"
                        },
                        "BudgetYearFive": {
                            "val": "1.61"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "17.864"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project enables system development and demonstration of Joint Service combat rations and field feeding equipment\/systems designed to improve warfighter performance and reduce the logistics burden of subsistence support. Efforts funded in this Project support all four Services, the Special Operations Command, and the Defense Logistics Agency (DLA).  The Army serves as the Executive Agent for this Department of Defense (DoD) program, with oversight and coordination provided by the DoD Combat Feeding Research and Engineering Board (CFREB) as required by DoD Directive (DoDD) 3235.02E. Centralized execution of the DoD Combat Feeding Research and Engineering Program (CFREP) with Joint Service review and approval eliminates unnecessary duplication of efforts across the Services and maximizes use of common materiel solutions."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Containerized Ice Making System (Congressional Add)"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4.964"
                                        },
                                        "Text": {
                                            "val": "Containerized Ice Making System (Congressional Add)"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Service Combat Ration System Development"
                                    },
                                    "Description": {
                                        "val": "This effort integrates and demonstrates mature Joint Service combat ration systems that enable warfighter maneuver, readiness and effectiveness during highly mobile, dispersed operations.  Prototypes are transitioned from PE 0603747A Project 610 to develop individual and group combat rations with improved capabilities including improved warfighter physical and cognitive performance through optimized nutrition and reduced logistics burden through weight and cube reduction.  This effort completes operational test and evaluation (OT&E) to confirm system level performance, and develops ration specifications for transition to Defense Logistics Agency - Troop Support (DLA - Troop Support) for procurement."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.63"
                                            },
                                            "Text": {
                                                "val": "Integrated prototype components\/technologies into individual and group menu systems to improve quality, optimize nutritional content, decrease weight\/cube and\/or improve modularity; conducted OT&E on ration systems to validate system level performance; presented recommendations to the Joint Services Operational Ration Forum for Milestone C approval; finalized procurement documents and initiated transition to DLA-Troop Support; obtained Surgeon General approval of revised menus; executed production testing with industry to ensure consistent ration quality, validated Performance Contract Requirements (PCR), and resolved vendor\/supplier issues; and conduct confirmatory sensory, chemical, physical and shelf life testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.357"
                                            },
                                            "Text": {
                                                "val": "For existing ration platforms (Meal, Ready-to-Eat; First Strike Ration; Meal, Cold Weather, Modular Operational Ration Enhancement; Unitized Group Rations ? A\/M\/H&S), will integrate prototype components\/technologies into menu systems and ration assembly processes to improve quality, optimize nutritional content, decrease weight\/cube\/cost and\/or improve modularity and field utility; will conduct OT&E on ration systems to validate system level performance; present recommendations to the Joint Services Operational Ration Forum (JSORF) for Milestone C approval; will finalize procurement documents and initiate transition to DLA-Troop Support; will obtain Surgeon General approval of revised menus; will execute production testing with industry to ensure consistent ration quality, validate Performance-based Contract Requirements (PCRs), and resolve vendor\/supplier issues; will conduct confirmatory sensory, chemical, physical and shelf life testing. For developmental Close Combat Assault Ration (CCAR), will conduct OT&E of capabilities\/systems successfully demonstrated in 6.4 that provide Warfighters with lower weight, lower volume, more calorically dense, higher quality, commercially producible ration components; will validate system level performance of prototype CCARs in the context of providing Warfighters with viable nutrition options for a 7-day period without resupply; will present recommendations to the JSORF for Milestone C approval as new components providing advanced nutrition and logistical capabilities within existing ration platforms, as CCAR system concepts mature."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.704"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.704"
                                            },
                                            "Text": {
                                                "val": "For existing ration platforms (Meal, Ready-to-Eat; First Strike Ration; Meal, Cold Weather, Modular Operational Ration Enhancement; Unitized Group Rations - A\/M\/H&S), will integrate prototype components\/technologies into menu systems and ration assembly processes to improve quality, optimize nutritional content, decrease weight\/cube\/cost and\/or improve modularity and field utility; will conduct OT&E on ration systems to validate system level performance; will present recommendations to the JSORF for Milestone C approval; will finalize procurement documents and initiate transition to DLA-Troop Support; will obtain US Army, Surgeon General approval of revised menus; will execute production testing with industry to ensure consistent ration quality, will validate PCRs, and resolve vendor\/supplier technical production issues; and conduct confirmatory sensory, chemical, physical and shelf life testing.  For developmental Close Combat Assault Ration (CCAR), will complete OT&E of capabilities\/systems successfully demonstrated in 6.4 that provide Warfighters with lower weight, lower volume, more calorically dense, higher quality, commercially producible ration components; will complete validation of system level performance of prototype CCARs in the context of providing Warfighters with viable nutrition options for a 7-day period without resupply; will present CCAR to the JSORF for Milestone C approval and will obtain US Army, Surgeon General approval of initial CCAR menus."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Change in funding to support acceleration of Close Combat Assault Ration (CCAR)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Service Field Feeding Systems Development"
                                    },
                                    "Description": {
                                        "val": "This effort integrates and demonstrates field feeding equipment systems in support of the Navy (USN), Air Force (USAF), and Marine Corps (USMC) that reduce the logistics burden, improve efficiency, and decrease operation and support costs as directed by the DoD CFREB and Joint Service partners. Validated systems, specifications, and technical data packages are transitioned to the appropriate Service partner for procurement and fielding. Service partners include Product Manager Combat Support Equipment (PdM-CSE), Naval Sea Systems Command (NAVSEA), Naval Supply Systems Command (NAVSUP), Navy Expeditionary Combat Command (NECC) and USAF Basic Expeditionary Airfield Resources (BEAR) Program Office."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.46"
                                            },
                                            "Text": {
                                                "val": "Conducted OT&E of new integrated mounting system for galley equipment to reduce operation and support costs in support of the USN; supported integration and demonstration of efficient refrigeration assets and an Energy Management System (EMS) in support of the USAF BEAR Type I & II kitchen systems; develop reports, Engineering Change Proposals (ECPs) and logistical data to reduce overall fuel and water consumption in support of the USMC; transitioned validated prototype equipment and technical data to USN, USMC and USAF."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.964"
                                            },
                                            "Text": {
                                                "val": "Will conduct OT&E of Inflatable Refrigerated Space (IRefS) and Tray Ration Heater - Improved for USMC; will obtain aerial delivery certification for IRefS; will complete OT&E on Mobile Feeding Galley and transition technical data to USN; will continue OT&E of integrated mounting system for galley equipment to reduce operation and support costs in support of the USN; will develop reports, Engineering Change Proposals (ECPs) and logistical data to reduce overall fuel and water consumption in support of the USMC; will transition other validated prototype equipment and technical data to USN, USMC and USAF."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.11"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.11"
                                            },
                                            "Text": {
                                                "val": "Will conduct OT&E of Inflatable Refrigerated Space (IRefS) and complete aerial delivery certification; will complete OT&E of equipment production models with embedded sense and respond technology to track reliability, maintenance, and current health of equipment assets; will develop reports, Engineering Change Proposals (ECPs) and logistical data to reduce overall fuel and water consumption in support of the USMC; and will transition validated prototype equipment and technical data to USN, USMC and USAF."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increased to support OT&E for Joint Services."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.002"
                                            },
                                            "Text": {
                                                "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.108"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "610"
                                    },
                                    "Title": {
                                        "val": "Food Adv Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.425"
                                        },
                                        "CurrentYear": {
                                            "val": "3.721"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.055"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.055"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.172"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.968"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.129"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.129"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "26.599"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Complete Engineering and Manufacturing Development (EMD) and Demonstration of food items and equipment for transition into competitive procurement contract. Complete advanced research efforts to support Engineering Change Proposals for previously developed equipment."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Combat Feeding Program Management"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CCDC Soldier Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.141"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.235"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.487"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.607"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.607"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "N\/A"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "N\/A"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.002"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.002"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.108"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.108"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Joint Service Rations and Combat Feeding Equipment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.958"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.696"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.177"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.24"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.24"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Joint Service Rations and Combat Feeding Equipment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CCDC Soldier Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.291"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.159"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.648"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.967"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.967"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Containerized Ice Making System (Congressional Add)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.973"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.973"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "5_548_0.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "5_548_1.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Conduct operational testing of combat ration systems"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct OT&E of Close Combat Assault Ration (CCAR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Obtain Joint Service and Army Surgeon General approval of first generation CCAR"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop CCAR Technical Data Package and contract for Low Rate Initial Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop and transition CCAR documents to DLA-TS for procurement"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct OT&E of Expeditionary Group Ration (EGR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop and transition individual and group ration documents annually to DLA-TS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Refine heat recovery prototype for integration and conduct OT&E."
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop and transition TDP for the EMS, JSERCS, and heat recovery system to USAF"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct OT&E of BEAR Type II kitchen system and transition to USAF"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct OT&E of Energy Conversation technologies for BEAR kitchens to USAF"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct land-based user evaluation of MIKS and transition data to USN"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct OT&E and transition Mobile Feeding Galley to USN"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct OT&E  & transition labor & energy saving galley\/scullery upgrades to USN"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct OT&E of expeditionary kitchen systems for shore-based Navy units"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct OT&E of Improved Tray Ration Heater and transition to USMC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Obtain Aerial Delivery Certification of Inflatable Refrigerated Space (IRefS)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct OT&E of EFK upgrades and transition to USMC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct OT&E of intuitive kitchen equipment and transition to Services"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EL2"
                    },
                    "ProjectTitle": {
                        "val": "Army Field Feeding Equipment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.301"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "3.301"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports the development, demonstration and Non-Developmental Item (NDI) Commercial Off The Shelf (COTS) evaluation of combat feeding equipment to enhance Soldier efficiency, improve Soldier survivability, and reduce food service logistics requirements for the Army. The Project supports multi-fuel, rapidly deployable field food service equipment initiatives. Efforts also support the Engineering and Manufacturing Development (EMD) phase of programs to improve equipment, enhance safety in food service, and decrease fuel and water requirements. The Projects develop critical enablers that support the Army's Strategic Planning Guidance by developing and integrating critical expeditionary capabilities that maintain readiness, providing effective solutions that reduce the resource and operational energy footprint, providing modernized equipment, and enhancing the field Soldier's well being. This project reduces sustainment requirements, related Combat Support\/Combat Service Support (CS\/CSS) demands on lift, the combat zone footprint, and costs for logistical support.\n\n\nThis PE\/Project supports Field Feeding programs for the Army."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Battlefield Kitchen (BK)"
                                    },
                                    "Description": {
                                        "val": "Develop replacement of the obsolete Mobile Kitchen Trailer (MKT) system. The BK is designed to replace the MKT with a kitchen that provides fuel efficient, thermally controlled, closed combustion appliances within an environmentally controlled workspace. The BK shall provide rations for up to 300 Soldiers within 4 hours of setup. The BK provides refrigeration, running water and a heated serving line using the same off-road prime mover as the MKT as well as transportability by rail, sea, fixed and rotary wing aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.483"
                                            },
                                            "Text": {
                                                "val": "Validated revised design and documented objective configuration in technical data package for future production."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Expeditionary Solid Waste Disposal System (ESWDS)"
                                    },
                                    "Description": {
                                        "val": "Provides an integrated waste disposal capability providing substantial improvement over open air burn pits that pose health risks to Soldiers and\/or the logistics burden of backhauling trash. Will safely process 1,000 pounds per day of mixed solid waste. Two systems can be used together to double capacity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.789"
                                            },
                                            "Text": {
                                                "val": "Completed test and evaluation and prepared production design and procurement documentation. Completed redesign of exhaust stack for reduced weight and easier setup."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Containerized Kitchen, Modular"
                                    },
                                    "Description": {
                                        "val": "Integrate the Army's new Modular Appliance Burner and modular appliances into the Containerized Kitchen Platform. Replacing the open combustion appliances on the CK eliminates a key safety issue and the modular appliances are 20-40% more fuel efficient. Sharing the modular concept across all Army Field Feeding Platforms cuts the life cycle support costs significantly."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.029"
                                            },
                                            "Text": {
                                                "val": "Awarded contract for design and prototyping of Containerized Kitchen with integrated modular, closed combustion appliances."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "EL1"
                                    },
                                    "Title": {
                                        "val": "Army Field Feeding Programs"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.303"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "R62830"
                                    },
                                    "Title": {
                                        "val": "Battlefield Kitchen (BK)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.024"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "M65801"
                                    },
                                    "Title": {
                                        "val": "REFRIGERATED CONTAINER SYSTEMS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.14"
                                        },
                                        "CurrentYear": {
                                            "val": "14.3"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.279"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "2.279"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Complete Engineering Manufacturing Decisions (EMD) of food service items and equipment for transition into competitive procurement contract. Complete advanced research efforts to support Engineer Change Proposals for previously developed equipment."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PMFSS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.49"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.425"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.915"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Battlefield Kitchen"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PMFSS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.201"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.752"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.953"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Containerized Kitchen, Modular"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PMFSS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.35"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.350"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Eexpeditionary Solid Waste Disposal System"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.424"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.424"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Ice Making System"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATC\/Ft Lee"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Virginia"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.205"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.205"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Battlefield Kitchen"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATC\/FT Lee"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Virginia"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.552"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.35"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.902"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "5_EL2_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Conduct Limited User Testing on the Battlefield Kitchen"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Prepare procurement package for use CCCK development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Award development contract for CCCK development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop testable system prototypes for CCCK"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct ESWDS user test and Log Demo"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Award delivery order for ESWDS required improvements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Complete ESWDS hardware improvements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Draft production contract documentation for ESWDS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Award delivery order for BK improvements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Complete modified BK prototypes"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Complete drafted techincal manual for BK"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}