{
    "id": "2021-ChemicalandBiologicalDefenseProgram-PB-0400-JBOOK-e299e2d271e4a54a66db4fcaecfb2e998434156b5cf0195b08d46a3b84e0ee65-1",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-CBDP-U_RDTE_JustificationBook_Chemical_and_Biological_Defense_Program_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Chemical_and_Biological_Defense_Program_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Chemical and Biological Defense Program",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602384BP"
        },
        "ProgramElementTitle": {
            "val": "CHEMICAL\/BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
        },
        "R1LineNumber": {
            "val": "16"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Chemical and Biological Defense Program"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "189.614"
            },
            "CurrentYear": {
                "val": "215.057"
            },
            "BudgetYearOne": {
                "val": "201.807"
            },
            "BudgetYearOneBase": {
                "val": "201.807"
            },
            "BudgetYearTwo": {
                "val": "208.635"
            },
            "BudgetYearThree": {
                "val": "210.332"
            },
            "BudgetYearFour": {
                "val": "211.537"
            },
            "BudgetYearFive": {
                "val": "213.333"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The projects in this program element (PE) support applied research in the areas of physical technologies, non-traditional agent (NTA) medical and physical defense technologies, and medical technologies.  Major efforts support development of vaccines, therapeutics, next generation diagnostics systems, next generation chemical detectors, nerve agent pretreatments, and individual protection advances.\n\nIndividual projects include:\n- Chemical Biological Defense (CB2): continual improvements in CB physical sciences defense materiel, including contamination avoidance, decontamination, detection and protection technologies, as well as biological weapon\/agent surveillance (e.g. CB protective materials, textiles, and filtration, sensors and sensing algorithms, effects modeling, chemical formulations, processes, and methods for hazard mitigation).\n\n- Non-Traditional Agents (NTA) Defense (NT2): supports all NTA efforts (both medical and non-medical) including pretreatments, therapeutics, detection, threat agent science, modeling, protection and hazard mitigation and characterization of emerging threats.  Starting in FY21, an administrative change pertaining to efforts of improving S&T budget agility and transition efficiency was applied by merging NTA lines to RDT&E Projects CB2, Chemical Biological Defense and TM2, Techbase Medical Defense.\n\n- Techbase Medical Defense (TM2): development of antidotes, drug treatments, disease surveillance and point-of-need diagnostic devices, patient decontamination and medical technologies management (e.g. drug discovery and platform technology development, biomarkers and assay development useful in drug development and diagnostics, human mimicking devices and regulatory science).\n\nCBDP S&T Applied Research Stakeholders: U.S. Army Combat Capabilities Development Command Chemical Biological Center (CCDC CBC), United States Army Medical Research Institute of Infectious Diseases (USAMRIID), United States Army Medical Research Institute of Chemical Defense (USAMRICD), United States Army Natick Soldier Systems Center, Naval Research Lab (NRL), Air Force Research Lab (AFRL), among others.  The intent is to maintain strategic partnerships with the DoD Service communities for mission success across the enterprise through collaborative planning and programming maintaining budget assurance.\n\nEfforts under this PE will transition to or will provide risk reduction for Advanced Technology Development (PE 0603384BP), Advanced Component Development and Prototypes (PE 0603884BP), and System Development and Demonstration (PE 0604384BP) activities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "192.674"
                },
                "CurrentYear": {
                    "val": "202.587"
                },
                "BudgetYearOne": {
                    "val": "204.863"
                },
                "BudgetYearOneBase": {
                    "val": "204.863"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "189.614"
                },
                "CurrentYear": {
                    "val": "215.057"
                },
                "BudgetYearOne": {
                    "val": "201.807"
                },
                "BudgetYearOneBase": {
                    "val": "201.807"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.060"
                },
                "CurrentYear": {
                    "val": "12.470"
                },
                "BudgetYearOne": {
                    "val": "-3.056"
                },
                "BudgetYearOneBase": {
                    "val": "-3.056"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "12.470"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.293"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-5.351"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.002"
                                },
                                "BudgetYearOne": {
                                    "val": "-3.056"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.056"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: FY19 (+$2.293 Million): Reprogramming to support Threat Agent Science Non-Traditional Agent projects and to develop medical countermeasures against viral and bacterial threat agents.\nFY19 (-$5.351 Million): Transfer of funding to support Small Business Innovative Research\/Small Business Technology Transfer efforts.\n\nFY20 (+$12.470 Million): Congressional Add for Coatings Technologies (+$2.100 Million), program increase to counter biological threats (+$12.500 Million), and Congressional reduction (-$2.130 Million).\n\nFY21 (-$3.056 Million): Program adjustments to balance portfolio to fiscal guidance (-$2.732 Million) and Departmental economic adjustments (-$0.324 Million).\n\nSchedule: N\/A\n\nTechnical: N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CB2"
                    },
                    "ProjectTitle": {
                        "val": "Chemical Biological Defense (Applied Research)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "72.352"
                        },
                        "CurrentYear": {
                            "val": "87.773"
                        },
                        "BudgetYearOne": {
                            "val": "103.497"
                        },
                        "BudgetYearOneBase": {
                            "val": "103.497"
                        },
                        "BudgetYearTwo": {
                            "val": "103.969"
                        },
                        "BudgetYearThree": {
                            "val": "108.132"
                        },
                        "BudgetYearFour": {
                            "val": "109.257"
                        },
                        "BudgetYearFive": {
                            "val": "109.258"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project CB2 provides physical science applied research to develop future, multi-disciplinary, and multi-functional capabilities in life sciences, physical sciences, environmental sciences, mathematics, cognitive sciences, and engineering.  Efforts in this project support the seamless integration of state-of-the-art-technologies into a collection of systems across the spectrum of capabilities required to support chemical and biological defense missions.  Project NT2, Techbase Non-Traditional Agents Defense, will merge into this Project starting in FY21.\n\nIndividual efforts in this project include: \n- Protection and hazard mitigation focuses on providing technologies that protect from and reduce the impact of chemical\/biological threat or hazard to the Warfighter, weapons platforms, and structures. \n- Detection focuses on developing technologies for remote and point detection and identification of chemical and biological agents.\n- Decision analysis and management focuses on advanced hazard prediction, medical and epidemiological modeling of biological agents, operational effects and risk assessment, and systems performance modeling. \n- Warning and reporting focuses on methods of alerting to chemical or biological threat agent releases and exposures.  \n- Threat agent science is devoted to characterizing threat agents and the hazards they present in terms of agent fate in the environment, toxicology, and pathogenicity, and focuses on the horizontal integration of CB defensive technologies in support of the Joint Services.\n- Non-Traditional Agent (NTA) Defense including pretreatments, therapeutics, detection, threat agent science, modeling, protection and hazard mitigation and characterization of emerging threats."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Material Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Develop highly effective non-traditional or novel decontamination technologies that integrate with current procedures and support non-material improvements of the overall decontamination effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.897"
                                            },
                                            "Text": {
                                                "val": "- Completed development of a sprayer to improve\/enhance agent mapping (disclosure\/assurance) technologies and transitioned to Contamination Indicator Decontamination Assurance System Program of Record with the Joint Program Manager for Protection (JPM P). \n- Continued efforts to develop\/enhance agent mapping technology.  \n- Continued vapor and complex surface efficacy performance evaluations and accelerated transition efforts on sprayable slurry immediate\/operational decontamination system to meet operational needs. \n- Continued chemical and biological hot air decontamination effort to address sensitive equipment, platform interior, and aircraft decontaminant needs and explore using aerosol decontaminants and germinants to enhance the process. \n- Continued coatings research to understand polyurethane coatings and mechanisms of agent absorption and also investigate potential new coatings to improve agent resistance of current polyurethane coatings. \n- Continued Wide Area Decontamination of Bacillus anthracis project, focused on agrochemical approaches, and prepared for FY20 demonstration. \n- Continued surface science investigations with expanded set of materials, parameters, and agents to inform design for the development of the next generation of hazard mitigation technologies to achieve toxicology-based efficacy goals. \n- Continued elimination\/bulk chemical warfare agent destruction effort, focusing on neutralization and polymerization of bulk nerve agents to explore process optimization and begin scaling efforts. \n- Initiated elimination\/bulk chemical blister agent destruction effort. \n- Initiated effort to develop Wide Area Decontamination of chemical warfare agents capability\/system. \n- Completed effort to examine how decontamination technologies perform on field assets when contaminated with other than Chemical Agent Standard Analytical Reference Material (CASARM) (laboratory quality\/pure) chemical agents. \n- Continued effort to determine the most predictive surrogate virus for Ebola virus disinfection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.923"
                                            },
                                            "Text": {
                                                "val": "- Continue biological hot air decontamination effort to address sensitive equipment, platform interior, and aircraft biological warfare agent decontaminant needs and explore using germinants to enhance the process. \n- Continue coatings research to understand polyurethane coatings and mechanisms of agent absorption and also investigate potential new coatings to improve agent resistance of current polyurethane coatings. \n- Continue surface science investigations with expanded set of materials, parameters, and agents to inform design for the development of the next generation of hazard mitigation technologies to achieve toxicology-based efficacy goals. \n- Continue elimination\/bulk chemical warfare agent destruction effort, focusing on neutralization and polymerization of bulk chemical warfare agents to explore process optimization and begin scaling efforts.\n- Continue effort to examine how decontamination technologies perform on field assets using methods reflecting real-world conditions. \n- Continue efforts to develop\/enhance low light agent mapping (disclosure\/assurance) technologies. \n- Continue effort to develop Wide Area Decontamination of chemical warfare agents capability\/system.\n- Develop new materials for novel coatings that promote chemical and biological agent decontamination on surfaces."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.064"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.064"
                                            },
                                            "Text": {
                                                "val": "- Continue integrating the full range of Non-Traditional Agents (NTAs) and other emerging threats into the material contamination mitigation portfolio. \n- Continue responsive coatings efforts to enhance NTA decontaminability as part of the systems approach to achieving efficacy goals. \n- Continue effort to examine how decontamination technologies perform on field assets that include battlefield grime when contaminated with impure weapons-grade representative NTAs. \n- Complete efforts to develop\/enhance NTA mapping (disclosure\/ assurance) technologies, including generating electronic records of contamination locations. \n- Continue discovery, development and testing of materials capable of sorption and reaction of NTAs for next generation decontamination materials.\n- Continue optimization of chemical hot air decontamination process.\n- Continue evaluating polyurethane coatings and potential temporary or permanent coatings to potentially decrease logistical burden of decontamination of polyurethane-coated equipment.  \n- Continue effort to examine how decontamination technologies perform on field assets when contaminated with weapons representative chemical agents by expanding evaluations to include simulated relevant conditions. \n- Continue elimination\/bulk chemical warfare agent destruction effort, focusing on neutralization and polymerization of bulk chemical warfare agents using modeling and expand target chemical warfare agents.\n- Continue efforts to examine impacts of in operando conditions on the hazard mitigation process to inform \"design to future\" (next generation) decontamination strategies. \n- Complete efforts to develop\/enhance agent mapping (disclosure\/assurance) technologies. \n- Identify new catalytic materials that are capable of reacting, sorbing, and neutralizing chemical and biological agents. \n- Continue Wide Area Decontamination (chemical) efforts to examine analytical methods and test procedures for concrete, asphalt and soil for decontamination of chemical agents."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to change in program\/project technical parameters.  RDT&E Project NT2, Techbase Non-Traditional Agents Defense, will merge into this program starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Respiratory and Ocular Protection"
                                    },
                                    "Description": {
                                        "val": "Development and integration of novel filtration media into a lightweight, low-profile, and low-burden individual protective filter, which has enhanced performance against a broader range of challenges that include Chemical Warfare Agents (CWA), Biological Weapons Agents  (BWA), and Toxic Industrial Chemicals (TICs). Development of respiratory protection and design for better interoperability to support longer range missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.867"
                                            },
                                            "Text": {
                                                "val": "- Continued novel filtration efforts to develop respirator-helmet integration technologies. \n- Continued closed circuit Self-Contained Breathing Apparatus (SCBA) development and integration with portable air management systems for Full Spectrum Respiratory Protection (FSRP). \n- Developed relevant respiratory and ocular protection multifunctional systems configurations at scale and demonstrated in an operational assessment. \n- Assembled and evaluated improved thermal sensor technologies and control systems into SCBA platforms. \n- Developed and assessed flexible and stretchable materials for tactical all hazard protective ensemble applications. \n- Developed and assessed a prototype system for respirator protection assessment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.707"
                                            },
                                            "Text": {
                                                "val": "- Explore trade space for next generation general purpose mask. This subsumes previous efforts for respiratory helmet technology integration. \n- Continue to evaluate and assemble improved sensor technologies and control systems into Self-Contained Breathing Apparatus (SCBA) platforms, and build multiple Full Spectrum Respiratory Protection System (FSRPS) prototypes for testing. \n- Continue to explore technologies for oxygen storage and CO2 removal including materials and components, and integrate into FSRPS. \n- Continue coordination with percutaneous protection whole ensemble developmental efforts to extend the available operational time and improve interfaces with tactical equipment. \n- Continue efforts that integrate emerging respirator and helmet filtration components and technologies.  Improve closure systems for integrated ensemble."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.687"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.687"
                                            },
                                            "Text": {
                                                "val": "- Continue to demonstrate performance enhancements for existing air purification technologies towards TICs.\n- Continue development and integration of component and system upgrades to existing air purification (including respiratory protection) technologies to provide protection and extended filter life against emerging threats.\n- Continue to explore trade space for next generation general purpose mask. \n- Identify new catalytic materials that are capable of reacting, sorbing, and neutralizing chemical and biological agents. \n- Complete development and transition systems that provide chemical biological (CB) respiratory protection technologies in support of tactical all hazard, FSRPS."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred from another funding line.  RDT&E Project NT2, Techbase Non-Traditional Agents Defense, will merge into this program starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Percutaneous Protection"
                                    },
                                    "Description": {
                                        "val": "Develop advanced ensemble prototypes with state-of-the art materials that address the full spectrum of threats and provide a range of solutions optimized for protection, thermal comfort, and mission performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.374"
                                            },
                                            "Text": {
                                                "val": "- Completed validation testing of the Chemical-Biological Agent Resistance Test (CBART) for agent penetration testing. \n- Completed verification and validation testing for the aerosol and vapor testing. \n- Continued the process to mount compounded materials onto fabrics for protection. \n- Continued to conduct fiber and yarn analysis to develop knit and woven samples for the evaluation of closures and seals for respirator, helmet integration, and glove integration in order to develop and qualify flexible and stretchable materials for all hazard use. \n- Fabricated and test hood\/mask interface concepts, perform whole system agent tests. \n- Conducted warfighter demonstration and operational assessment of advanced National Fire Protection Association (NFPA) certified fully encapsulated ensemble prototypes with state-of-the art materials that addressed the full spectrum of threats to guide development and aid in future transition. \n- Continued to develop advanced National Fire Protection Association (NFPA) certified fully encapsulated ensemble prototypes with state-of-the art materials that address the full spectrum of threats and provided a range of solutions optimized for protection, thermal comfort, and mission performance. \n- Continued to develop composite and novel multi-functional materials and low thermal burden garment materials which provide site-specific CB protection on demand."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.152"
                                            },
                                            "Text": {
                                                "val": "- Continue to mount compounded materials onto fabrics for protection.\n- Continue to conduct fiber and yarn analysis to develop knit and woven samples for the evaluation of closures and seals for respirator, helmet integration, and glove integration in order to develop and qualify flexible and stretchable materials for all hazard use. \n- Continue efforts to scale and evaluate membrane technologies for responsive materials to chemical and biological agents. \n- Continue development of deliverables including lessons learned and seam sealing for Chemical and Biological Operational Assessment reporting and technical assessments to inform system design and final technical and user assessments.  \n- Conduct additional warfighter demonstrations and assessments of advanced National Fire Protection Association (NFPA) certified fully encapsulated ensemble prototypes with state-of-the art materials that address the full spectrum of threats to guide development and aid in future transition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.929"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.929"
                                            },
                                            "Text": {
                                                "val": "- Continue investigation and scaling of membrane materials for protection against NTAs and emerging threats.\n- Continue investigation of new\/novel sorptive materials for percutaneous protection. \n- Continue development of deliverables including lessons learned and seam sealing against NTAs and emerging threats.\n- Continue to mount compounded materials onto fabrics for protection. \n- Continued to conduct fiber and yarn analysis to develop knit and woven samples for the evaluation of closures and seals for respirator, helmet integration, and glove integration in order to develop and qualify flexible and stretchable materials for all hazard use. \n- Continue efforts to scale and evaluate membrane technologies for materials responsive to chemical and biological agents. \n- Continue development of deliverables including lessons learned and seam sealing for Chemical and Biological Operational Assessment reporting and technical assessments to inform system design and final technical and user assessments.  \n- Plan and design dual gender Photographic Aerosol System Testing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred from another funding line.  RDT&E Project NT2, Techbase Non-Traditional Agents Defense, will merge into this program starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Expeditionary Collective Protection"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies for soldiers to determine the remaining chemical vapor service life of their Chemical Warfare Agents (CWA) filters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.640"
                                            },
                                            "Text": {
                                                "val": "- Completed systems integration and surveillance of Guard Bed filters.\n- Continued systems integration and surveillance of RLIs. \n- Continued fabrication\/production of RLI satellite cartridge prototypes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.897"
                                            },
                                            "Text": {
                                                "val": "- Continue field testing and sampling of guard bed and Residual Life Indicator (RLI) filters.\n- Continue discovery, development and testing of materials capable of sorption and reaction of NTAs for next generation filter materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.299"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.299"
                                            },
                                            "Text": {
                                                "val": "- Continue evaluation of advanced threats to filtration technologies including NTAs and other emerging threats.  Explore new effort for novel filtration against NTAs and other emerging threats in Collective Protection (ColPro) and other large scale filter systems. \n- Continue discovery, development and testing of materials capable of sorption and reaction of NTAs for next generation filter materials.\n- Complete field testing and sampling of guard bed and Residual Life Indicator (RLI) filters at fixed sites and provide final report.  \n- Identify new catalytic materials that are capable of reacting, sorbing, and neutralizing chemical and biological agents."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred from another funding line.  RDT&E Project NT2, Techbase Non-Traditional Agents Defense, will merge into this program starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Personnel Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies to mitigate the risk associated with contaminated human remains and personal effects (materials) exposed to and contaminated by chemical agents by neutralizing and\/or physically removing the residual chemical agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.639"
                                            },
                                            "Text": {
                                                "val": "- Continued personnel decontamination efforts to enhance current processes (kinetics, dwell time, mechanics, etc.) and supported mass casualty personnel decontamination warfighter operations to increase throughput and decrease logistics and burden on warfighters, including efficacy studies associated with the homeland defense mission."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.365"
                                            },
                                            "Text": {
                                                "val": "- Assess decontamination effectiveness of different methods of applying decontamination to hair and skin to discern the most efficient way of decontaminating personnel against chemical and biological agents. \n- Assess reactive sorbent assessment for individual and skin decontamination. \n- Identify new catalytic materials that are capable of reacting, sorbing, and neutralizing chemical and biological agents."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.999"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.999"
                                            },
                                            "Text": {
                                                "val": "- Continue personnel decontamination efforts to enhance current processes including efficacy data against representative NTAs and emerging threats in relevant environments and identifying battlefield interferants.\n- Continue personnel decontamination efforts to enhance current processes and support mass casualty personnel decontamination warfighter operations, including homeland defense mission, including efficacy data against representative NTAs required to achieve Food and Drug Administration (FDA) approval. \n- Continue hot air decontamination studies of personal effects (materials) exposed to and contaminated by chemical agents. \n- Continue discovery, development and testing of materials capable of sorption and reaction of NTAs for next generation decontamination materials.\n- Continue to assess decontamination effectiveness of different methods of applying decontamination to hair and skin to discern the most efficient way of decontaminating personnel against chemical and biological agents.\n- Continue to identify new catalytic materials that are capable of reacting, sorbing, and neutralizing chemical and biological agents."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred from another funding line.  RDT&E Project NT2, Techbase Non-Traditional Agents Defense, will merge into this program starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Detection Sensor Technologies"
                                    },
                                    "Description": {
                                        "val": "Focus of this effort is to develop capabilities to detect and identify chemical and biological threats.  This activity includes development of point, remote, or standoff sensors as appropriate, to address both conventional and non-traditional chemical and biological threats.  These efforts are being developed to further the detection capability for early warning of contamination exposure to the warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.993"
                                            },
                                            "Text": {
                                                "val": "- Continued concept and technology development for biological and chemical threat early warning detection to include distributed biological reconnaissance capabilities along with the ability to reduce false alarms in a highly complex and chemically saturated environment.  \n- Continued development of detection capabilities for identifying genomic editing events.  \n- Initiated the development of exploring sensing approaches to provide unattended monitoring of perimeters for rapid defensive positioning to enable early indication of airborne chemical threats.\n- Continued the development of sensors for mobile applications, including development for unmanned systems. \n- Initiated a program to investigate an automated man-out-of-loop remote biological collection and detection system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.546"
                                            },
                                            "Text": {
                                                "val": "- Complete development of final technology in the Man-Worn Chemical Hazard Sensor program and transition for advanced development \/ testing. \n- Complete development for technologies to reduce false alarms in a highly complex chemical environment. \n- Continue concept and technology development for biological and chemical threat early warning detection to include distributed biological reconnaissance capabilities. \n- Continue development of detection capabilities for identifying genomic editing events. \n- Continue the development of chemical sensors for collection and detection packages on unmanned platforms. \n- Continue development of detection technologies to provide unattended monitoring for early indication of airborne chemical threats.\n\n- Additional congressional funding will be used to support chemical detector S&T development in the Compact Vapor Chemical Agent Detector (CVCAD) and Proximity Chemical Agent Detector (PCAD) programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.566"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.566"
                                            },
                                            "Text": {
                                                "val": "- Complete development of final technology in the Man-Worn Chemical Hazard Sensor program and transition to CVCAD for advanced development \/ testing.\n- Complete development for technologies to reduce false alarms in a highly complex chemical environment. \n- Continue concept and technology development for biological and chemical threat early warning detection to include distributed biological reconnaissance capabilities. \n- Continue development of detection capabilities for identifying genomic editing events. \n- Continue the development of chemical sensors for collection and detection packages on unmanned platforms.\n- Continue development of detection technologies to provide unattended monitoring for early indication of airborne chemical threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Warning and Reporting"
                                    },
                                    "Description": {
                                        "val": "Integrate and fuse disparate sensor data, leverage non-invasive physiological data for detection of threat exposure prior to symptom onset, and provide timely data-driven predictions and warnings."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.351"
                                            },
                                            "Text": {
                                                "val": "- Develop algorithms to utilize typical and non-typical Intelligence Surveillance and Reconnaissance (ISR) and host-based data available to the warfighter to provide earlier warning of chemical and biological threats and\/or exposure.\n- Investigate individual versus group informatics for earlier warning.\n- Expand on algorithm development that alerts to warfighter chemical or biological threat agent exposure.\n- Develop warning and reporting aids for tactical users leveraging the compute resources resident on End User Devices. \n- Investigate automated approaches using artificial intelligence and machine learning to detect signals and provide earlier warning of chemical and biological threats.\n- Explore machine learning approaches for reducing sensor false alarm rates.\n- Develop algorithms to optimize the location of static sensors and optimize the path of moving sensors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.036"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.036"
                                            },
                                            "Text": {
                                                "val": "- Expand on wearable device-based non-invasive biomarker analysis for pre-symptomatic indication of chemical or biological exposure.\n- Enhance early warning algorithm development for predicting altered health severity and duration to inform on warfighter time-to-mission-readiness.\n- Develop a sensor model toolbox application for rapid development of new sensor models.\n- Continue development of algorithms to optimize the path of moving sensors for detection and source term estimation and develop the capability to react to events.\n- Continue development of warning and reporting aids for tactical users leveraging the compute resources resident on End User Devices. Explore the use of augmented reality to provide chemical and biological threat situational awareness in head-mounted visual displays."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to change in program\/project technical parameters.  Decrease due to completion of all transitions to Biosurveillance Portal and JWARN."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Hazard Prediction"
                                    },
                                    "Description": {
                                        "val": "Improve battlespace awareness by accurately predicting hazardous material releases, atmospheric transport and dispersion, and resulting human effects.  Develop capability for predicting the source term of releases of chemical, biological, and industrial materials.  Program merged in FY20 under RDT&E Project CB2, Decision Management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.253"
                                            },
                                            "Text": {
                                                "val": "- Continued development of coupled indoor and outdoor dispersion models for enhanced hazard prediction in urban environments.  Execute a field trial to collect validation data for coupled indoor and outdoor dispersion models and conduct sample analysis for all field trial samples. \n- Continued development of MicroSWIFT\/SPRAY (MSS) for improved hazard prediction in urban environments.  \n- Continued enhancements to source term estimation and source characterization algorithms.  \n- Completed development of a secondary evaporation model.  Begin integration of secondary evaporation model with MSS.  \n- Continued researching new methods for the development of next generation dispersion models such as hybrid Large Eddy Simulation\/Gaussian approaches."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Data Analysis"
                                    },
                                    "Description": {
                                        "val": "Develop CBRN data sharing capabilities and simulation tools. Develop chapters of the Chemical and Biological Agent Effects Manual Number 1 (CB-1), an authoritative source capturing analytical methods for evaluating the effects of Chemical Biological (CB) agents on equipment, personnel, and operations. These chapters are developed by a mix of contractors and labs, employing experts in each subject area.  Program closed out in FY20, funding covered under RDT&E Project CB2, Decision Analysis and Management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.364"
                                            },
                                            "Text": {
                                                "val": "- Continued to develop, revise and integrate CB-1.  \n- Continued to host and maintain online accessibility of CB-1 to the Chemical Biological Defense Program (CBDP) community, as well as enhance online capabilities based on user feedback."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Decision Analysis and Management"
                                    },
                                    "Description": {
                                        "val": "Improve battlespace awareness and support decision-making by predicting hazardous material releases and resulting human effects. Provide tools to enable the assessment and mitigation of impacts at personnel, system, tactical, operational, and strategic levels. Develop CBRN data sharing capabilities and information resources."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.371"
                                            },
                                            "Text": {
                                                "val": "Hazard Prediction:\n- Continue development of coupled indoor and outdoor dispersion models for enhanced hazard prediction in urban environments. \n- Conduct field trial to collect validation data for coupled indoor and outdoor dispersion models. \n- Continue development of enhancements to human response models for CBRN agent and toxic industrial chemical exposures. \n- Continue development of microscale transport and dispersion software for improved hazard prediction in urban environments. \n- Complete integration of secondary evaporation model with microscale transport and dispersion software. \n- Complete development of a new software architecture for HPAC to meet Common CBRN Model Interface requirements. \n- Continue development of next generation littoral waterborne modeling system. \n\nAnalytic Applications Platform:\n- Develop and implement data standards for the transmission and storage of information sources relevant to the earlier warning of chemical and biological threat agents. \n- Complete Air Force, Navy, Army, and Marine Corps service specific human performance studies. \n- Complete efforts to determine the effects of chemical warfare agents (CWAs) on individual tasks. \n- Complete direct subsurface direct transport measurement studies and continue modeling contact transfer exposures. \n- Complete development, revision and integration of  CB-1. Host and maintain online accessibility of CB-1 to the CBDP community on the Biosurveillance Ecosystem, as well as enhance online capabilities based on user feedback.\n- Continue Analysis Support Program in support of Chemical Biological Defense Program stakeholders and exercises.\n\nMedical and Epidemiological Modeling:\n- Enhance capability for modeling particle size dependent casualty estimation and health effects. Incorporate patient casualty condition codes into transport and dispersion models.\n- Integrate chemical agent modeling into the Naval Health Research Center (NHRC) fielded Joint Medical Planning Tool (JMPT).\n- Explore Artificial Intelligence (AI) and Machine Learning (ML) approaches to detecting signatures for genetically engineered pathogens.\n- Initiate efforts to develop ML algorithms for disease prediction and forecasting.\n- Initiate efforts to model operationally relevant outputs to support medical decision making."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.383"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.383"
                                            },
                                            "Text": {
                                                "val": "Hazard Prediction:\n- Continue development of coupled indoor and outdoor dispersion models for enhanced hazard prediction in urban environments.\n- Conduct field trial to collect validation data for coupled indoor and outdoor dispersion models.\n- Complete development of microscale transport and dispersion software for improved hazard prediction in urban environments.\n- Continue development of next generation littoral and liminal waterborne modeling system.\n\nMedical and Epidemiological Modeling:\n- Initiate biological agent modeling into the NHRC fielded JMPT.\n- Continue to develop ML algorithms for disease prediction and forecasting for mobile platforms.\n- Continue to develop ML algorithms to detect signatures of genetically engineered pathogens.\n- Continue to develop models to provide operationally relevant outputs to support medical decision making. Integrate outputs into existing comprehensive epidemiological modeling tool."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments.  RDT&E Project NT2, Techbase Non-Traditional Agents Defense (Modeling & Simulation), will merge into this program starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "11) Threat Agent Sciences"
                                    },
                                    "Description": {
                                        "val": "Supports defensive countermeasure development against CB threats by delivering the scientific data, understanding, and relevant human estimates of the hazards posed to humans by exposure to CB agents. Toxicological and\/or infectious-dose information and environmental response supports development and\/or enhancement of both operational risk and exposure guidelines; identifies gaps in detection and protection; informs decontamination procedures; and supports the development of medical countermeasures. Knowledge generated from this program is used to inform understanding of hazards, hazard prediction models, and materiel and countermeasure development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.490"
                                            },
                                            "Text": {
                                                "val": "- Continued developing advanced methods for threat agent characterization. \n- Continued providing data on fate, persistence, and response of priority agents in various environments. \n- Continued developing methods to understand agent fate on surfaces. \n- Continued defining particle properties and agent-substrate interaction to predict agent behavior and aerosolization to inform hazard assessment. \n- Continued studies to provide host response, infectious dose and toxicity data to inform operational risk and exposure guidelines, response, detection, and protection; and define goals for the development of decontamination procedures and medical countermeasures. \n- Continued assessing the impact of environmental factors on threat agent activity (persistence, transport, degradation, resuspension, decontamination, and disinfection). \n- Initiated rapid threat assessment and microphysiological systems method development to provide toxicity and mechanism of action data of threat agents and emerging threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.461"
                                            },
                                            "Text": {
                                                "val": "- Continue developing advanced methods for threat agent characterization. \n- Continue developing methods to understand agent fate on operational surfaces.\n- Continue developing predictive capabilities and models, linking the different properties to provide initial hazard assessment information on emerging threat compounds. Continue delivering data on fate, persistence, and response of priority agents in various environments to inform hazard assessment. \n- Continue assessing the impact of environmental factors on threat agent activity (persistence, transport, degradation, resuspension, and decontamination). \n- Continue identifying and assessing technological advancements that will impact the chemical and biological threat space. \n- Initiate a framework to quickly analyze emerging biological threats.\n- Initiate a horizon scanning capability to provide situational awareness in assessing technological convergence that can affect the chemical and biological threat space.\n- Initiate the assessment of synthetic biological tools and other biotechnology developments that can enhance or alter the threat space."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.534"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.534"
                                            },
                                            "Text": {
                                                "val": "- Continue developing advanced methods for threat agent characterization, including more complex agent mixtures or combinations. \n- Continue developing methods to understand agent fate on operational surfaces. \n- Continue developing predictive capabilities and models, linking the different properties to provide initial hazard assessment information on emerging threat compounds. \n- Continue delivering data on fate, persistence, and response of priority agents in various environments to inform hazard assessment. \n- Continue assessing the impact of environmental factors on threat agent activity (persistence, transport, degradation, resuspension, and decontamination). \n- Continue studying employment methods and feasibility for emerging threat agents Continue studies to provide acute toxicity and mechanism of priority NTAs and emerging threat agents using developed computational and medium to high throughput predictive toxicology methods including developed rapid threat assessment and microphysiological systems methods. \n- Continue identifying and assessing technological advancements that will impact the chemical and biological threat space. \n- Continue a framework to quickly analyze emerging biological threats. \n- Continue a horizon scanning capability to provide situational awareness in assessing technological convergence that can affect the chemical and biological threat space. \n- Continue the assessment of synthetic biological tools and other biotechnology developments that can enhance or alter the threat space.  \n- Initiate characterization studies to close knowledge gaps associated with traditional biological threat to help inform capability development."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred from another funding line.  RDT&E Project NT2, Techbase Non-Traditional Agents Defense, will merge into this program starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "12) Operational Effects and Planning"
                                    },
                                    "Description": {
                                        "val": "Provide tools to enable the assessment and mitigation of impacts at the personnel, system, tactical, operational and strategic levels.  Develop and institutionalize consensus-based, scientifically sound data and analytical methods to link CBRN exposures to relevant operational effects and to enhance test and evaluation.  Program merged in FY20 under Research Development Test & Evaluation (RDT&E) Project CB2, Decision Management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.332"
                                            },
                                            "Text": {
                                                "val": "- Continued Air Force and Navy service specific human performance studies.  Plan and initiate Army and Marine Corps specific operational performance studies.  \n- Continued to enhance CBRN operational risk assessment tools for the Navy.  \n- Continued studies to determine the toxicity levels of Toxic Industrial Chemicals (TICs).  \n- Conducted direct subsurface transport measurement studies and continue modeling contact transfer exposures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "13) Threat Surveillance"
                                    },
                                    "Description": {
                                        "val": "Integrate disparate military and civilian datasets, investigate methodologies to appropriately integrate open source data into chemical and biological threat advanced warning systems, tactical decision aids, and leverage and enhance advanced epidemiological models and algorithms for disease prediction, forecasting, impact and biological threat assessment.  Program ended in FY19."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.503"
                                            },
                                            "Text": {
                                                "val": "- Completed expansion of the number of pathogens, hosts and vectors incorporated into a robust prediction and forecasting capability.  \n- Developed tactical decision aids on mobile applications to identify risks and provide mitigation strategies for chemical and biological threats.  Identified new data streams, such as physiological markers, which can be leveraged to support early warning and forecasting.  \n- Developed a global area of concern forecasting risk map capability. Conducted studies to determine the validity of using wearable biomonitoring data as indicative and predictive of health status in controlled environments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CB3"
                                    },
                                    "Title": {
                                        "val": "Chemical Biological Defense (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "22.956"
                                        },
                                        "CurrentYear": {
                                            "val": "19.798"
                                        },
                                        "BudgetYearOne": {
                                            "val": "24.448"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "24.448"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "24.946"
                                        },
                                        "BudgetYearThree": {
                                            "val": "25.239"
                                        },
                                        "BudgetYearFour": {
                                            "val": "24.090"
                                        },
                                        "BudgetYearFive": {
                                            "val": "24.293"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NT2"
                    },
                    "ProjectTitle": {
                        "val": "Non-Traditional Agents Defense (Applied Research)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "43.859"
                        },
                        "CurrentYear": {
                            "val": "52.902"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "96.761"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project NT2 provides early applied research to enhance and develop defensive capabilities against Non-Traditional Agents (NTAs). This project focuses on expanding scientific knowledge required to develop defensive capabilities and to demonstrate fast and agile scientific responses to enhance or develop capabilities that address emerging threats.  Efforts and studies conducted under this project address direction from the FDA to conduct specific post-New Drug Application (NDA)-approval efforts and studies (e.g. required studies, Post Marketing Commitments), and requirements from the joint service users. This project is a comprehensive and focused effort for developing Non-Traditional Agents (NTA) defense capabilities, coordinated with specific interagency partners for doctrine, equipment, and training for the Warfighter and civilian population for defense against NTAs.\n\nIndividual efforts in this project include:\n- Support an integrated approach to counter emerging threats through innovative science and technology (S&T) solutions for detection, protection, decontamination, information systems and modeling and simulation, and medical countermeasures. \n- Provides for the upgrade and modernization of Medical Chemical  Defense countermeasures which include U.S. Food and Drug Administration (FDA) approved prophylactics, pre-treatments, and therapeutics and intend to protect and\/or sustain the Joint Service Member in a toxic chemical threat environment.\n\nStarting in FY21, an administrative change improving S&T budget agility and transition efficiency will merge NTA lines to RDT&E Projects Chemical Biological Defense (CB2) and Techbase Medical Defense (TM2)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Expeditionary Collective Protection"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies for soldiers to determine the remaining chemical vapor service life of their chemical warfare agent (CWA) filters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.359"
                                            },
                                            "Text": {
                                                "val": "- Assessed baseline novel filtration materials against NTAs and other emerging threats under laboratory conditions. \n- Continued to analyze and characterize the performance of Residual Life Indicator (RLI) satellite filter cartridges against NTAs and other emerging threats.\n- Continued to collect data to establish correlation of filter bed performance and pre-filter system against NTAs and other emerging threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.790"
                                            },
                                            "Text": {
                                                "val": "- Continue evaluation of advanced threats to filtration technologies including Non-Traditional Agents (NTAs) and other emerging threats.  Explore new effort for novel filtration against NTAs and other emerging threats in Collective Protection (ColPro) and other large scale filter systems. \n- Continue discovery, development and testing of materials capable of sorption and reaction of NTAs for next generation filter materials."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line.  This program will merge to RDT&E Project CB2, Chemical Biological Defense starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Material Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Develop highly effective non-traditional or novel decontamination technologies that integrate with current procedures and support non-material improvements of the overall decontamination effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.605"
                                            },
                                            "Text": {
                                                "val": "- Continued to integrate the full range of NTAs and other emerging threats into the material contamination mitigation portfolio.\n- Continued responsive coatings efforts to enhance NTA decontaminability as part of the systems approach to achieving efficacy goals. \n- Continued effort to examine how decontamination technologies perform on field assets that include battlefield grime when contaminated with impure weapons-grade representative NTAs. \n- Continued efforts to develop\/enhance NTA mapping (disclosure\/ assurance) technologies. \n- Continued to investigate how chemical agents are retained and released from coatings. \n- Continued effort to examine how decontamination technologies perform on field assets when contaminated with other than Chemical Agent Standard Analytical Reference Material (CASARM) (laboratory quality\/pure) chemical agents."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.792"
                                            },
                                            "Text": {
                                                "val": "- Continue integrating the full range of NTAs and other emerging threats into the material contamination mitigation portfolio. \n- Continue responsive coatings efforts to enhance NTA decontaminability as part of the systems approach to achieving efficacy goals. \n- Continue effort to examine how decontamination technologies perform on field assets that include battlefield grime when contaminated with impure weapons-grade representative NTAs. \n- Complete efforts to develop\/enhance NTA mapping (disclosure\/ assurance) technologies, including generating electronic records of contamination locations. \n- Continue discovery, development and testing of materials capable of sorption and reaction of NTAs for next generation decontamination materials."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line.  This program will merge to RDT&E Project CB2, Chemical Biological Defense starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Personnel Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies to mitigate the risk associated with contaminated human remains and personal effects (materials) exposed to and contaminated by chemical agents by neutralizing and\/or physically removing the residual chemical agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.359"
                                            },
                                            "Text": {
                                                "val": "- Completed development of a containment pouch for transport of contaminated human remains.\n- Continued hot air decontamination studies of personal effects (materials) exposed to and contaminated by chemical agents. \n- Continued personnel decontamination efforts to enhance current processes and supported mass casualty personnel decontamination warfighter operations, including homeland defense mission, including efficacy data against representative NTAs required to achieve FDA approval."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.444"
                                            },
                                            "Text": {
                                                "val": "- Continue personnel decontamination efforts to enhance current processes and support mass casualty personnel decontamination warfighter operations, including homeland defense mission, including efficacy data against representative NTAs required to achieve FDA approval. \n- Continue hot air decontamination studies of personal effects (materials) exposed to and contaminated by chemical agents. \n- Continue discovery, development and testing of materials capable of sorption and reaction of NTAs for next generation decontamination materials."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line.  This program will merge to RDT&E Project CB2, Chemical Biological Defense starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Respiratory and Ocular Protection"
                                    },
                                    "Description": {
                                        "val": "Development and analysis of design alternatives for chemical and biological air-purifying respirators that provide enhanced protection with lower physiological burden and improved interface with mission equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.250"
                                            },
                                            "Text": {
                                                "val": "- Continued development and integration of component and system upgrades to existing air purification (including respiratory protection) technologies to provide protection and extended filter life against emerging threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.791"
                                            },
                                            "Text": {
                                                "val": "- Continue to demonstrate performance enhancements for existing air purification technologies towards TICs.\n- Continue development and integration of component and system upgrades to existing air purification (including respiratory protection) technologies to provide protection and extended filter life against emerging threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line.  This program will merge to RDT&E Project CB2, Chemical Biological Defense starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Chemical Therapeutics - Medical"
                                    },
                                    "Description": {
                                        "val": "Investigates common mechanisms of agent injury. Physiological parameters and pathological assessments will be used to establish the general mode and mechanism(s) of toxicity to inform countermeasure development. Develops, assesses, evaluates, and validates therapeutics for treatment resulting from exposure to NTAs and emerging chemical threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.749"
                                            },
                                            "Text": {
                                                "val": "- Continued pursuit of analogs of therapeutic compounds to treat NTA exposures.  \n- Continued to test compounds using high-throughput, in vitro screens.  \n- Continued to evaluate licensed FDA therapeutics against selected, priority NTAs. \n- Continued to evaluate compounds at the ADMET CoE to identify leads and deliver information to the advanced developer on the evaluation of FDA licensed\/approved products for therapeutic applications for countering the deleterious effects of an NTA exposure. - Continued animal studies to support regulatory submission of candidate therapeutics for treatment of the toxic effects of selected, priority NTAs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.700"
                                            },
                                            "Text": {
                                                "val": "- Continue pursuit of therapeutic compounds to treat NTA exposures including evaluation of licensed FDA therapeutics and use of high-throughput in vitro screens and the ADMET CoE to identify lead candidates. Deliver information on the evaluation of additional FDA licensed\/approved products for therapeutic applications for countering the deleterious effects of an NTA exposure to the advanced developer. \n- Continue animal studies to support regulatory submission of candidate therapeutics for treatment of the toxic effects of selected, priority NTAs.\n- Continue drug formulation efforts for MCMs with a longer shelf-life and with feasibility of an auto-injector containing material and chemical composition.\n- Initiate efforts in neuroprotective therapeutics to increase the quality of life after chemical agent exposure."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line.  This program will merge to RDT&E Project TM2, Techbase Med Defense (Chemical Therapeutics) starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Modeling & Simulation"
                                    },
                                    "Description": {
                                        "val": "Provide modeling of NTA materials for hazard prediction. Develop NTA source term algorithms for predicting chemical hazards from intentionally functioning weapons, counter-proliferation scenarios (bomb on target), and missile intercept.  Investigate NTA agent fate for secondary effects, environmental\/atmospheric chemistry, atmospheric and waterborne transport and dispersion, human effects, model Validation and Verification (V&V), scaled testing, casualty estimation, and supporting data management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.457"
                                            },
                                            "Text": {
                                                "val": "- Completed development of agent fate modeling for NTAs.  \n- Initiated expansion of System for Hazard Assessment of Released Chemicals (SHARC) to model biological agent."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.714"
                                            },
                                            "Text": {
                                                "val": "- Continue development of methodologies to model NTAs with limited source data.\n- Initiate modeling of toxicokinetic, time, and dosage varying health effects from exposure to NTAs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line.  This program will merge to RDT&E Project CB2, Chemical Biological Defense (Decision Analysis and Management) starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Percutaneous Protection"
                                    },
                                    "Description": {
                                        "val": "Study and assessment of percutaneous protective technologies to include membrane and composite material (\"novel materials\"\/\"multifunctional materials\")."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.987"
                                            },
                                            "Text": {
                                                "val": "- Continued development of novel materials and ensembles that provide protection against NTAs and emerging threats.\n- Initiated additional NTA and other emerging threats tests."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.195"
                                            },
                                            "Text": {
                                                "val": "- Continue investigation and scaling of membrane materials for protection against NTAs and emerging threats.\n- Continue investigation of new\/novel sorptive materials for percutaneous protection. \n- Continue development of deliverables including lessons learned and seam sealing against NTAs and emerging threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line.  This program will merge to RDT&E Project CB2, Chemical Biological Defense starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Threat Agent Sciences"
                                    },
                                    "Description": {
                                        "val": "Provide critical agent characterization (chemical, physical and physiological\/toxicological) data on current and emerging threat agents to prepare for surprise, enabling and informing development and testing of NTA defense technology (e.g., detection, decontamination, protection, and hazard assessment). This characterization of new threats informs decision makers and development of Concept of Operations (CONOPs) and Tactics, Techniques and Procedures (TTP); it also provides the basis for countermeasure development and assessment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.668"
                                            },
                                            "Text": {
                                                "val": "- Continued characterizing priority emerging threats to provide critical support data to enable countermeasure development and testing as well as inform CONOPs, policies, doctrines and procedures. \n- Continued to build linkages between emerging threat characterization and advanced development capability assessments to better define current capability gaps for emerging threats. \n- Continued evaluating synthesis pathways, physicochemical properties and environmental fate properties for priority threats. \n- Continued assessing the impact of environmental factors and substrate properties on threat agent activity (e.g. persistence, transport, degradation, resuspension). \n- Continued preparing laboratory and operationally-relevant toxicity estimates for next priority NTAs.\n- Continued to refine and deliver human toxicity estimates for next priority NTAs. \n- Continued development of medium- to high-throughput laboratory approaches and methods to predict acute systemic toxicity of an emerging threat. Expanded computational and in vitro research efforts concerning ADMET, physical and chemical characterization and behavior."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.076"
                                            },
                                            "Text": {
                                                "val": "- Continue characterizing priority emerging threats to provide critical support data to enable countermeasure development and\ntesting as well as inform CONOPs, policies, doctrines and procedures.\n- Continue to build linkages between emerging threat characterization and advanced development capability assessments to better define current capability gaps for emerging threats. \n- Continue evaluating synthesis pathways, physicochemical properties and environmental fate properties for priority threats. \n- Continue assessing the impact of environmental factors and substrate properties on threat agent activity (e.g. persistence, transport, degradation, resuspension). \n- Continue preparing laboratory and operationally-relevant toxicity estimates for next priority NTAs. \n- Continue to refine and deliver human toxicity estimates for next priority NTAs. \n- Continue development of medium- to high-throughput laboratory approaches to predict acute toxicity and mechanism of action of emerging threat agent. \n- Continue to expand and refine computational and in vitro research efforts, physical and chemical characterization and behavior to support toxicity evaluation and prediction."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line.  This program will merge to RDT&E Project CB2, Chemical Biological Defense starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Chemical Pretreatments and Prophylactics - Medical"
                                    },
                                    "Description": {
                                        "val": "Develops pretreatments and prophylactics that provide protection against NTAs and emerging chemical threats.  Prophylactic MCMs include catalytic and stoichiometric bioscavengers that rapidly bind and detoxify a broad spectrum of NTAs.\n\nTransferred FY19 NT2 funds to NT3 in FY20\/21 to support more advanced efforts such as the opioid MCMs and 2-PAM BBB delivery efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.425"
                                            },
                                            "Text": {
                                                "val": "- Continued efforts to develop catalytic enzymes for use against selected, priority NTAs.  \n- Continued to explore alternative technologies for prophylaxis to address capability gaps such as immunogenicity, circulatory stability, dosing, shelf-life, and delivery.    \n- Completed evaluation of Food and Drug Administration (FDA) licensed MCMs for potential pretreatment\/prophylaxis against NTAs and emerging chemical threats.  \n- Continued research projects at the ADMET CoE to improve MCM understanding and facilitate development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.400"
                                            },
                                            "Text": {
                                                "val": "- Continue efforts to develop catalytic enzymes for use against selected, priority NTAs. \n- Continue expanded pre-clinical studies of lead catalytic scavengers to support future investigative new drug (IND) filing. \n- Continue evaluation of FDA-licensed MCMs for potential pretreatment\/prophylaxis against NTAs and emerging chemical threats. \n- Continue new approaches to identify pretreatment and prophylaxis against multiple classes of NTAs and emerging chemical threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line.  This program will merge to RDT&E Project TM2, Techbase Med Defense (Pretreatments and Prophylactics, Nerve Agents) starting in FY21."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "NT3"
                                    },
                                    "Title": {
                                        "val": "Non-Traditional Agents Defense (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "21.494"
                                        },
                                        "CurrentYear": {
                                            "val": "24.180"
                                        },
                                        "BudgetYearOne": {
                                            "val": "15.308"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "15.308"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.396"
                                        },
                                        "BudgetYearThree": {
                                            "val": "18.388"
                                        },
                                        "BudgetYearFour": {
                                            "val": "18.384"
                                        },
                                        "BudgetYearFive": {
                                            "val": "18.384"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TM2"
                    },
                    "ProjectTitle": {
                        "val": "Techbase Medical Defense (Applied Research)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "73.403"
                        },
                        "CurrentYear": {
                            "val": "74.382"
                        },
                        "BudgetYearOne": {
                            "val": "98.310"
                        },
                        "BudgetYearOneBase": {
                            "val": "98.310"
                        },
                        "BudgetYearTwo": {
                            "val": "104.666"
                        },
                        "BudgetYearThree": {
                            "val": "102.200"
                        },
                        "BudgetYearFour": {
                            "val": "102.280"
                        },
                        "BudgetYearFive": {
                            "val": "104.075"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project TM2 provides for applied research for innovative technology approaches to advance medical systems designed to rapidly identify, diagnose, prevent, and treat disease due to exposure to chemical and biological threat agents.  Project NT2, Techbase Non-Traditional Agents Defense, will merge into this Project starting in FY21.\n\nIndividual efforts in this project include:\n- Core science efforts in Medical Chemical, Medical Biological, Diagnostics, and Medical Countermeasures.  \n- Supports applied research for the investigation of new medical countermeasures to include prophylaxes, pretreatments, antidotes, skin decontaminants, and therapeutic drugs against identified and emerging biological and chemical warfare agents. \n- Medical Science and Technology (S&T) efforts in this Budget Activity refine promising medical initiatives identified in Budget Activity 1, resulting in the development of countermeasures to protect against and treat the effects of exposure to chemical and biological (CB) agents. \n- Diagnostic research focuses on providing high quality data closer to the point-of-need comprising device innovation, panels of biomarkers driven by bioinformatics, and epidemiological modeling tools."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Medical Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Investigate medical diagnostics ubiquitous and comprehensive against chemical and biological threats (including NTAs, pharmaceutical-based agents, and toxins) by advancing diagnostic innovations; investigating emerging technologies; ensuring medical diagnostics rapid adaptation to emerging threats; harvesting and synergizing the immense volume of diagnostic data; and aligning medical diagnostics capabilities with the FDA pipeline and larger commercial supply chain."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.869"
                                            },
                                            "Text": {
                                                "val": "- Continued the development of a diagnostic platform to diagnose chemical exposure at the point-of-care.\n- Continued to optimize processes and platform technologies to include complementary diagnostics employed in laboratory characterization of host and pathogen biomarker signatures of exposure and disease. \n- Continued discovery and identification of host response and\/or agent biomarkers. \n- Continued assay development for extremely difficult to detect\/diagnose intracellular pathogens of severe acute systemic febrile illnesses. \n- Initiated efforts to exploit gene-editing systems and synthetic methods for development of robust diagnostic platforms with reduced cold-chain needs. \n- Continued the development of a diagnostic platform to diagnose chemical exposure to nerve agents. \n- Initiated the development of the In-vitro Affinity Diagnostic System (IADS) platform that will complement the currently fielded molecular-based diagnostics system. \n- Initiated development of computational tools to include artificial intelligence tools for biological assay development.  \n- Initiated prototype development for integrated platforms that identify antimicrobial resistance and perform antimicrobial susceptibility testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.945"
                                            },
                                            "Text": {
                                                "val": "- Complete assay development for extremely difficult to detect\/diagnose intracellular pathogens of severe acute systemic febrile illnesses. \n- Continue the development of a diagnostic platform prototype to diagnose chemical exposure at the point-of-care to nerve agents.\n- Continue to optimize processes and platform technologies to include complementary diagnostics employed in laboratory characterization of host and pathogen biomarker signatures of exposure and disease. Continue discovery and identification of host response and\/or agent biomarkers. \n- Continue to optimize processes and platform technologies employed in laboratory characterization of host and pathogen biomarker signatures of exposure and disease. \n- Continue discovery and identification of host response and\/or agent biomarkers. \n- Continue efforts to exploit gene-editing systems and synthetic methods for development of robust diagnostic platforms with reduced cold-chain needs.\n- Continue development of computational tools to include artificial intelligence tools for biological assay development.\n- Support prototype diagnostics development in the areas of ImmunoAssay Diagnostics System (IADS), Synthetic Molecular Binding Agents (SYMBAs), and Detecting Indicators of Chemical Exposure (DICE)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.853"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.853"
                                            },
                                            "Text": {
                                                "val": "- Continue development of a diagnostic platform to diagnose chemical exposure at the point-of-care.\n- Continue to optimize processes and platform technologies to include complementary diagnostics employed in laboratory characterization of host and pathogen biomarker signatures of exposure and disease. \n- Continue discovery and identification of host response and\/or agent biomarkers.  \n- Continue efforts to exploit gene-editing systems and synthetic methods for development of robust diagnostic platforms with reduced cold-chain needs.  \n- Continue development of computational tools to include artificial intelligence tools for biological assay development."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments.  Maturing approaches are entering from Basic Research."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Viral\/Bacterial\/Toxins Vaccines"
                                    },
                                    "Description": {
                                        "val": "Generate novel or improved vaccines against viral, bacterial and toxin biothreat agents, and demonstrate preliminary efficacy in small animal models.  Develop assays that identify correlates of protective immunity in animal models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.816"
                                            },
                                            "Text": {
                                                "val": "- Continued selection of T and B cell antigens for Q Fever vaccine candidates. \n- Continued analysis of candidate Q fever vaccines.  \n- Continued down-selection of subunit tularemia vaccine candidates in animal models.  \n- Continued development of animal models for medical countermeasure development against aerosolized biological toxins including marine toxins.\n- Continued nonclinical efficacy and clinical safety development of candidate vaccines against Marburgvirus.  Evaluated potential for boosting of recombinant vesicular stomatitis virus (rVSV)- based ebolavirus vaccine. \n- Continued detailed immune correlate studies of filovirus vaccines for animal rule licensure including antibody response maturation and passive transfer studies.  \n- Continued improvements to delivery mechanism, immunogenicity, efficacy and manufacturing of VEEV DNA vaccine and the trivalent WEVEE vaccine including animal modeling.  \n- Initiated development of multiplexed VEEV infection biomarker assay.  \n- Continued to assess MCM capabilities and strategies to defend against emerging and genetically engineered bioweapon (BW) threat agents."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.486"
                                            },
                                            "Text": {
                                                "val": "- Evaluate Q fever vaccines based on selected T and B cell antigens. \n- Continue development of well-defined animal models for medical countermeasure development against aerosolized biological toxins including marine toxins.\n- Continue development of nanoparticle and other subunit tularemia vaccines. \n- Continue development of Burkholderia and Yersinia vaccines. \n- Continue nonclinical efficacy, safety and manufacturing development of candidate vesicular stomatitis virus (VSV) and DNA vaccines against Marburg virus.\n- Continue improvements to delivery mechanism, immunogenicity, efficacy and manufacturing of Venezuelan Equine Encephalitis Virus (VEEV) DNA vaccine. \n- Continue qualification\/validation of well-defined animal models for alphaviruses. \n- Continue development of multiplexed VEEV infection biomarker assay and qualification\/validation of VEEV immune assays for clinical and pivotal animal studies. \n- Continue to assess medical countermeasure (MCM) capabilities and strategies to defend against emerging and genetically engineered biological warfare (BW) threat agents.\n- Continue evaluation of toxins in animal models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.587"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.587"
                                            },
                                            "Text": {
                                                "val": "- Continue analysis of V920 ebolavirus vaccine.\n- Develop ferret model of filovirus infection.\n- Continue evaluation of Q fever vaccines based on selected T and B cell antigens.\n- Continue development of well-defined animal models for medical countermeasure (MCM) development against aerosolized biological toxins including marine toxins.\n- Continue development of Live Attenuated Vaccine (LAV), nanoparticle and other tularemia vaccines.\n- Continue nonclinical development of Burkholderia and Yersinia vaccines.\n- Continue nonclinical efficacy, safety and manufacturing development of candidate vesicular stomatitis virus (VSV) and DNA vaccines against Marburg virus.\n- Continue improvements to delivery mechanism, immunogenicity, efficacy and manufacturing of VEEV DNA vaccine.\n- Continue qualification\/validation of well-defined animal models for alphaviruses.\n- Continue development of multiplexed Venezuelan Equine Encephalitis Virus (VEEV) infection biomarker assay and qualification\/validation of VEEV immune assays for clinical and pivotal animal studies.\n- Continue to assess MCM capabilities and strategies to defend against emerging and genetically engineered biological warfare (BW) threat agents.\n- Continue evaluation of toxins and antitoxin prophylaxis in animal models."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Vaccine Platforms and Research Tools"
                                    },
                                    "Description": {
                                        "val": "Use novel technology and methods to support development of vaccine candidates.  Conduct studies to determine potential immune interference between lead vaccine candidates, the effect of alternative vaccine delivery methods, and thermo-stabilization technologies on the efficacy of lead vaccine candidates.  Identify correlates of protection in humans, and predict the success of lead vaccine candidates in humans."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.733"
                                            },
                                            "Text": {
                                                "val": "- Continued nonclinical evaluation of hybrid arenavirus and filovirus antigen vaccines in animal models.\n- Continued evaluation of Burkholderia, Q Fever and filovirus vaccines in the biomimetic Modular Immune In-vitro Construct (MIMIC) system.\n- Continued development of inactivated alphavirus vaccine.\n- Qualified\/validated MIMIC for use in evaluation of pulmonary responses to biodefense vaccines. \n- Sustained the Human Specimen Archive at USAMRIID.\n- Continued evaluation of next generation adjuvants for use in biodefense vaccines.\n- Continued evaluation of multivalent vaccines against filoviruses."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.108"
                                            },
                                            "Text": {
                                                "val": "- Continue nonclinical evaluation of hybrid arenavirus and filovirus antigen vaccines in animal models.\n- Continue evaluation of Burkholderia, Q Fever and filovirus vaccines in the biomimetic Modular Immune In-vitro Construct (MIMIC) system.\n- Continue development of inactivated alphavirus vaccine.\n- Continue to qualify\/validate MIMIC for use in evaluation of pulmonary responses to biodefense vaccines. \n- Continue to sustain the Human Specimen Archive at USAMRIID.\n- Continue evaluation of next generation adjuvants for use in biodefense vaccines.\n- Continue evaluation of multivalent vaccines against filoviruses."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.536"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.536"
                                            },
                                            "Text": {
                                                "val": "- Initiate nonclinical evaluation of arenavirus vaccines\n- Continue evaluation of filovirus antigen vaccines in animal models.\n- Continue evaluation of Burkholderia, Q Fever and filovirus vaccines in the biomimetic Modular Immune In-vitro Construct (MIMIC) system.\n- Continue development of inactivated alphavirus vaccine.\n- Continue to qualify\/validate MIMIC for use in evaluation of pulmonary responses to biodefense vaccines. \n- Continue to sustain the Human Specimen Archive at USAMRIID.\n- Continue evaluation of next generation adjuvants for use in biodefense vaccines.\n- Continue evaluation of multivalent vaccines against filoviruses."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Viral Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate lead candidate therapeutics for efficacy against viral pathogens."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.556"
                                            },
                                            "Text": {
                                                "val": "- Continued screening, evaluation and development of novel small molecule inhibitors and monoclonal antibodies effective against filo- and alpha-virus infections in vitro and in vivo. \n- Continued development of small molecule ribonucleoside viral replication inhibitors directed against alphaviruses.  Developed alphavirus animal models for evaluation of therapeutic countermeasures for use with Animal Rule Guidance by the FDA.  \n- Continued optimization of broad-spectrum inhibitors of filovirus infection that antagonize NPC1-GP interactions.  \n- Continued studies to enhance anti-viral therapies against Ebola (Zaire) and Marburg Viruses.  \n- Continued funding small molecule\/repurposing efforts.  \n- Began feasibility studies on reducing neuro-inflammation by repurposing existing therapeutics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.895"
                                            },
                                            "Text": {
                                                "val": "- Continue screening, evaluation and development of novel small molecule inhibitors and monoclonal antibodies effective against filo- and alpha-virus infections in vitro and in vivo. \n- Continue the development of small molecule ribonucleoside viral replication inhibitors directed against alphaviruses. \n- Continue development of rodent and non-human primate alphavirus animal models for evaluation of therapeutic countermeasures for use with Animal Rule Guidance by the FDA.\n- Continue optimization of broad-spectrum inhibitors of filovirus infection that antagonize NPC1-GP interactions.\n- Continue studies to enhance anti-viral therapies against Ebola (Zaire, Sudan, Bundibugyo), and Marburg Viruses. \n- Continue funding small molecule\/repurposing efforts. \n- Continue feasibility studies on reducing neuro-inflammation by repurposing existing therapeutics. Test feasibility of hemofiltration for treatment of cytokine induced shock from filoviral infection and bacterial-induced sepsis. \n- Continue discovery and early development of novel monoclonal antibodies from survivors to alphavirus and arenavirus infections."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.372"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.372"
                                            },
                                            "Text": {
                                                "val": "- Continue screening, evaluation and development of novel small molecule inhibitors and monoclonal antibodies effective against filo and encephalitic alpha-virus infections in vitro and in vivo. \n- Continue studies to enhance anti-viral therapies against Ebola (Zaire), Sudan, Bundibugyo, and Marburg Viruses. \n- Continue funding small molecule\/repurposing efforts. \n- Continue the development of novel formulations for the delivery of antiviral therapeutics. Begin the identification of host directed therapies for viral targets. \n- Begin the development of antivirals to arenaviruses. Begin studies to identify host pathways involved in protective immunity against Crimean-Congo hemorrhagic fever. \n- Continue development of non-human primate encephalitic alphavirus animal models for evaluation of therapeutic countermeasures for use with Animal Rule Guidance by the FDA. Investigate novel host-pathogen interactions as antiviral targets. \n- Begin investigating host\/pathogen interactions in NHPs. \n- Explore target pathway analysis in mice and NHP to interrogate new potential targets for drug intervention."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments.  Increase due to the expansion of discovery efforts to include new viruses and animal studies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Bacterial Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate lead therapeutic candidates effective against designated bacterial threat agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.579"
                                            },
                                            "Text": {
                                                "val": "- Continued the discovery and advancement of novel, non-traditional, as well as traditional, strategies to diversify approaches to identify lead therapeutic candidates against bacterial infection.  \n- Continued evaluation of FDA approved and mid to late stage therapeutics for activity against wild-type and Multi Drug Resistant (MDR) Francisella tularensis, Bacillus anthracis, Yersinia pestis, and Burkholderia species.  \n- Completed evaluation of reformulation and\/or targeted delivery approaches to enhance efficacy of poorly performing or failed drug candidates."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.379"
                                            },
                                            "Text": {
                                                "val": "- Continue the discovery and advancement of novel, non-traditional, as well as traditional, strategies to diversify approaches to identify lead therapeutic candidates against bacterial infection.\n- Initiate evaluation of the potential of antibody and derivatives to treat intracellular bacterial infection.\n- Continue evaluation of FDA approved and mid to late stage therapeutics for activity against wild-type and MDR Francisella tularensis, Bacillus anthracis, Yersinia pestis, and Burkholderia species."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.367"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.367"
                                            },
                                            "Text": {
                                                "val": "- Continue the discovery and advancement of novel, non-traditional (antimicrobial peptides, immunomodulators, host-directed therapies), as well as traditional, strategies to identify lead therapeutic candidates to treat bacterial infections.\n- Complete discovery of antibody and derivatives to treat intracellular bacterial infection. \n- Develop novel formulations of existing antibiotics to overcome antimicrobial resistance, improve pharmacokinetic parameters, dose-sparing and to enhance antimicrobial killing. \n- Investigate novel host-pathogen interactions as antibacterial targets. Begin investigating host\/pathogen interactions in NHPs. \n- Explore target pathway analysis in mice and NHP to interrogate new potential targets for drug intervention."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments.  Increase due to the expansion in discovery efforts to include immune modulators and host-target interactions."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Toxin Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate therapeutic candidates that are effective against biological toxin agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.156"
                                            },
                                            "Text": {
                                                "val": "- Developed single domain monoclonal antibody in small animal studies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.319"
                                            },
                                            "Text": {
                                                "val": "- Continue development of a scMAb (single chain monoclonal antibody) which is capable of entering the neuromuscular junction in an attempt to abrogate Botulinum Neurotoxin (BoNT) intoxication."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.339"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.339"
                                            },
                                            "Text": {
                                                "val": "- Evaluate small molecule compounds and biologics for efficacy in the treatment and recovery from intoxication by different botulinum serotypes."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Chemical Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Focuses on therapeutic strategies to effectively minimize injuries resulting from exposure to CWAs. This effort involves the development of neuroprotectants, anticonvulsants, improved therapies for enzyme reactivation, and investigation of alternate pathways leading to treatment. This effort also includes discovery and development of therapeutic strategies to treat dermal, ocular and respiratory injuries of CWAs. Efforts in this area are designed to develop potential candidates that will ultimately be submitted for Food and Drug Administration (FDA) licensure or to identify previously licensed products for new uses in the treatment of chemical warfare casualties."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.145"
                                            },
                                            "Text": {
                                                "val": "- Continued supporting validation and characterization of therapeutics for: 1) an improved broad spectrum reactivator; 2) compounds effective in the brain for enhanced neuroprotection and 3) compounds effective in the brain for enhanced survival.\n- Continued exploring technologies for delivery of therapeutics to the brain crossing the Blood Brain Barrier (BBB). \n- Continued supporting development and screening for broad spectrum cholinesterase reactivators that work in the brain.\n- Continued development of animal models for operationally relevant threat agent exposure and medical countermeasure efficacy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.713"
                                            },
                                            "Text": {
                                                "val": "- Continue validation and characterization of therapeutics for: 1) an improved broad spectrum  reactivator and 2) compounds effective in the brain for enhanced neuroprotection and\/or increased survival.\n- Continue exploring technologies for delivery of therapeutics to the brain (crossing the BBB).\n- Continue development of current and screening for novel broad spectrum cholinesterase reactivators that are effective in the brain.\n- Continue development of animal models for operationally relevant threat agent exposure and medical countermeasure efficacy.\n- Continue efforts to explore safety and efficacy of down-selected therapeutic decontaminants.\n- Continue efforts to develop therapeutic medical countermeasures to treat mustard agent pulmonary injury."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.694"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.694"
                                            },
                                            "Text": {
                                                "val": "- Continue pursuit of therapeutic compounds to treat NTA exposures including evaluation of licensed FDA therapeutics and use of high-throughput in vitro screens to identify lead candidates. Deliver information to the advanced developer on the evaluation of additional FDA licensed\/approved products for therapeutic applications for countering the deleterious effects of an NTA exposure.\n- Continue animal studies to support regulatory submission of candidate therapeutics for treatment of the toxic effects of selected, priority NTAs.\n- Continue drug formulation efforts for MCMs with a longer shelf-life and with feasibility of an auto-injector.\n- Continue efforts in neuroprotective therapeutics to increase the quality of life after chemical agent exposure.\n- Continue validation and characterization of therapeutics for: 1) an improved broad spectrum reactivator and 2) compounds effective in the brain for enhanced neuroprotection and\/or increased survival.\n- Continue exploring technologies for delivery of therapeutics to the brain (crossing the Blood Brain Barrier - BBB).\n- Continue development of current and screening for novel broad spectrum cholinesterase reactivators that are effective in the brain.\n- Continue development of animal models for operationally relevant threat agent exposure and medical countermeasure efficacy.\n- Continue efforts to explore safety and efficacy of down-selected therapeutic decontaminants.\n- Complete efforts to develop therapeutic medical countermeasures to treat mustard agent pulmonary injury."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred from another funding line.  RDT&E Project NT2, Techbase Non-Traditional Agents Defense, will merge into this program starting in FY21."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Pretreatments and Prophylactics, Nerve Agents"
                                    },
                                    "Description": {
                                        "val": "Develop pretreatments and prophylactics that provide protection against chemical warfare agents, including organophosphorus nerve agents (OPNA), such as stoichiometric and catalytic scavengers and other entities that rapidly bind and detoxify a broad spectrum of agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.549"
                                            },
                                            "Text": {
                                                "val": "- Continued efforts developing prophylactic and pretreatment medical countermeasures. \n- Continued development of animal models for operationally relevant exposures to better support development of pretreatment and prophylactic MCMs and MCM concepts of use including post-exposure pre-symptomatic applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.537"
                                            },
                                            "Text": {
                                                "val": "- Continue efforts to develop capability for rapid development of medical countermeasures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.562"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.562"
                                            },
                                            "Text": {
                                                "val": "- Continue efforts to develop catalytic enzymes for use against selected, priority NTAs.\n- Continue expanded pre-clinical studies of lead catalytic scavengers to support future investigative new drug (IND) filing.\n- Continue evaluation of FDA-licensed MCMs for potential pretreatment\/prophylaxis against NTAs and emerging chemical threats.\n- Continue new approaches to identify pretreatment and prophylaxis against multiple classes of NTAs and emerging chemical threats.\n- Continue efforts to develop capability for rapid development of medical countermeasures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred from another funding line.  RDT&E Project NT2, Techbase Non-Traditional Agents Defense, will merge into this program starting in FY21."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "TM3"
                                    },
                                    "Title": {
                                        "val": "Techbase Medical Defense (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "86.713"
                                        },
                                        "CurrentYear": {
                                            "val": "120.526"
                                        },
                                        "BudgetYearOne": {
                                            "val": "137.829"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "137.829"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "135.016"
                                        },
                                        "BudgetYearThree": {
                                            "val": "129.004"
                                        },
                                        "BudgetYearFour": {
                                            "val": "129.543"
                                        },
                                        "BudgetYearFive": {
                                            "val": "140.685"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB4"
                                    },
                                    "Title": {
                                        "val": "Medical Biological Defense (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "63.783"
                                        },
                                        "CurrentYear": {
                                            "val": "46.166"
                                        },
                                        "BudgetYearOne": {
                                            "val": "47.727"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "47.727"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "37.689"
                                        },
                                        "BudgetYearThree": {
                                            "val": "42.517"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.436"
                                        },
                                        "BudgetYearFive": {
                                            "val": "35.462"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC4"
                                    },
                                    "Title": {
                                        "val": "Medical Chemical Defense (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.685"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "3.685"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB5"
                                    },
                                    "Title": {
                                        "val": "Medical Biological Defense (SDD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "127.933"
                                        },
                                        "CurrentYear": {
                                            "val": "130.074"
                                        },
                                        "BudgetYearOne": {
                                            "val": "86.460"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "86.460"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "56.868"
                                        },
                                        "BudgetYearThree": {
                                            "val": "45.226"
                                        },
                                        "BudgetYearFour": {
                                            "val": "68.593"
                                        },
                                        "BudgetYearFive": {
                                            "val": "83.282"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC5"
                                    },
                                    "Title": {
                                        "val": "Medical Chemical Defense (SDD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "43.648"
                                        },
                                        "CurrentYear": {
                                            "val": "60.220"
                                        },
                                        "BudgetYearOne": {
                                            "val": "54.392"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "54.392"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "52.813"
                                        },
                                        "BudgetYearThree": {
                                            "val": "31.441"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.215"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.019"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB7"
                                    },
                                    "Title": {
                                        "val": "Medical Biological Defense (Op Sys Dev)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.602"
                                        },
                                        "CurrentYear": {
                                            "val": "3.231"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.308"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.308"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.012"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.305"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.975"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.188"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}