{
    "id": "2021-Army-PB-2040-JBOOK-7f1ee284016a103cbd6a4d63ea727aa617711f15268cf669f26149e7ae172ad5-33",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602784A"
        },
        "ProgramElementTitle": {
            "val": "Military Engineering Technology"
        },
        "R1LineNumber": {
            "val": "39"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "96.922"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "96.922"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) is realigned with continuity of effort to following:\n* PE 0602144A Ground Technology \n* PE 0602145A Next Generation Combat Vehicle Technology\n* PE 0602146A Network C3I Technology\n* PE 0602150A Air and Missile Defense Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE investigates and advances technologies, techniques, and tools for representation of the physical and human environment for use in military planning and operations; for characterizing geospatial, atmospheric, and weather conditions and impacts on systems and military missions; for conducting mobility, counter-mobility, survivability, and force protection planning and operations; and for enabling secure, sustainable, energy efficient facilities. Research focuses on special requirements for battlefield visualization, tactical decision aids, weather intelligence products, and capabilities to exploit space assets. Project 855 conducts geospatial research and development supporting a standard sharable geospatial foundation enabling a common operating environment across mission and command systems. Project H71 supports the materiel development, testing, and operations communities in evaluating the impacts of weather and atmospheric obscurants on military materiel and operations. Project T40 advances force protection technologies across the range of military operations, including expedient protection and hardened construction to defeat complex threats. This Project also designs and develops software and hardware to identify and mitigate ground obstacles for manned and unmanned vehicles; characterizes austere navigation environments, including complex urban environments, and designs and develops materiel solutions, including rapidly emplaced bridging and expedient repair technologies, to allow austere port and airfield entry of forces; and builds and uses modeling and simulation tools to advance understanding of the interactions of weapons\/munitions and novel defeat methodologies with protective construction and critical infrastructure. Project T41 investigates application of technologies to enable garrison\/post commanders to plan, monitor, and operate facilities more efficiently, cost-effectively, securely, and sustainably; creates tools (including advanced models and simulations) that provide a framework for making trades and decisions; and supports research to assess non-combat population characteristics and status from social and cultural perspectives to achieve mission objectives. Project T42 develops and validates models and simulations to understand the impacts of the physical environment on the performance of forces, ground and air vehicles, and sensors; as well as the impact of natural and man-made changes in the environment on military operations. Project T45 investigates materials, components, and systems that have potential to reduce energy losses in buildings and shelters; and potential to detect and mitigate consequences of contaminants, such as bacteria and molds, in air handling equipment and building materials.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy..\n\nResearch is transitioned to PE 0603734A (Military Engineering Advanced Technology).\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this PE is performed by the Army Engineer Research and Development Center (ERDC) and the Army Futures Command (AFC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "101.124"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "96.922"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.202"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.894"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.308"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "855"
                    },
                    "ProjectTitle": {
                        "val": "Topographical, Image Intel & Space"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.846"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "17.846"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0602146A Network C3I Technology:\n* Project AT7 Network-Enabled GeoSpatial and GEOINT Services Tech\n* Project AT9 Tactical GeoSpatial Information Capabilities Technology\n* Project AU3 Geospatially Enabled Operational Design Technology\n* Project AU5 Automated Analytics for Understanding the Operational Environment Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and advances capabilities for collection, processing, and creation of data and information depicting physical and human terrain, environmental conditions, and relationships in time and space; digital map creation, transmission, and dissemination; and map-based analytics for planning, decision making, and execution. This Project uses non-traditional methods that exploit existing open source text, multi-media, and cartographic materials addressing social, cultural, and economic geography to advance the capability to produce and transmit high fidelity digital maps depicting the physical terrain, human terrain, and environmental conditions. This Project also develops software tools and methods for map-based analytics that allow deeper insights into the effects of the physical terrain, human terrain, and environmental conditions on military operations, to include tactics and effects upon equipment and Soldier performance. This Project explores and advances components and methods that optimize the utility of the Army Geospatial Enterprise (AGE) to the total Army, which provides map and geospatial data, information, and software services to the total force.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Army Engineer Research and Development Center (ERDC), Vicksburg, Mississippi."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "GeoIntelligence - Geospatial Data Collection, Processing, and Decision Support"
                                    },
                                    "Description": {
                                        "val": "This effort investigates novel map content generation and geo-temporal analytics for the development of geospatially-based decision support tools. This research focuses on automatic inference and the correlation between events and objects (i.e., people, places) through space and time from massive data sets developed in the Geoenabled Computing Environments effort. In addition, the effort investigates advanced models to forecast effects of the physical terrain, human terrain, and environment for applications to the Military Decision Making Process, an analysis that informs course of action development and evaluation of tactics, equipment, and mission risk."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.989"
                                            },
                                            "Text": {
                                                "val": "Investigated emerging computational models to increase the tempo of small unit tactical decision making through spatial reasoning, analysis, and multi-domain information and data fusion toward narrative information packages aligned with the current mission and situation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "GeoIntelligence - Geospatial Data Analysis and Decision Support"
                                    },
                                    "Description": {
                                        "val": "This effort develops means to collect, process, and visualize very high-fidelity data and information to capture the dynamic effects of the physical and human terrain impacting military ground operations. The research focuses on tactical, rather than national or commercial, remote sensing of physical terrain to achieve the fidelity required for current and future operations. Research includes investigating new methods for effective sensor systems and materials to 'tag' features, items, and people of interest based upon novel and emerging Light Detection and Ranging (LiDAR) sensor systems, innovative LiDAR collection and analysis techniques, and an array of other sensor systems for intermittent and persistent optimal data collection, object identification, and classification for ground operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.923"
                                            },
                                            "Text": {
                                                "val": "Investigated enhanced utility and quality of three-dimensional (3D) imagery for wide area mapping and surveillance of dense urban areas; assess utility and sufficiency of Geiger mode LiDAR prototype for wide area mapping at increasingly higher altitudes and increasing area coverage rates; and researched emerging remote sensing technologies for a multi-modal, tiered sensing approach to rapidly increase density and quality of 3D urban environment data, merging exterior, interior and below ground geospatial information."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Geography - Spatial Reasoning, Analysis, and Visualization"
                                    },
                                    "Description": {
                                        "val": "This effort investigates integration of behavior and population dynamics research and analysis into geospatial frameworks to depict the operational environment including culture, demographics, terrain, climate, and infrastructure. Research exploits existing open source text, leverages multi-media and cartographic materials, and investigates data collection methods to ingest geospatial data directly from the tactical edge to characterize parameters of social, cultural, and economic geography. Results of this research augment existing conventional geospatial datasets by providing the rich context of the human aspects of the operational environment, which offers a holistic understanding of the operational environment for the Warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.008"
                                            },
                                            "Text": {
                                                "val": "Developed beta model for estimating future risks and impacts of extreme weather and climate variability on water, energy and food systems to inform the Joint Preparation of the Operational Environment; and developed critical enhancements to the suite of methods and tools supporting mission analysis for civil-military operations to enhance stability and mitigate threats to the civilian population."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Geo-enable Computing Environments"
                                    },
                                    "Description": {
                                        "val": "This effort develops geospatially-enabled, collaborative mission planning capabilities providing services, data, and information to Army planners, staffs, and leaders. Work leverages Army geospatial enterprise standard data sets and incorporate geo-enabled mission command tools and analytical capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.926"
                                            },
                                            "Text": {
                                                "val": "Investigated a compatible framework for sharing a relevant and focused geospatially enabled visualization of the operational environment within the command post computing environment; and investigated geospatial-enabled collaborative mission planning capabilities providing services, data, and information to the Army planners, staffs, and leadership."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H71"
                    },
                    "ProjectTitle": {
                        "val": "Meteorological Research For Battle Command"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.62"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.620"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0602146A Network C3I Technology:\n* Project AV7 Atmospheric Modeling and Meterological Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project develops tactical weather and atmospheric effects\/impacts algorithms for their integration into battlefield information products. Efforts include high-resolution, local assessments and forecasts of meteorological conditions in near real time including effects of urban and mountainous terrain; analytical tools to assess the impact of the atmosphere to optimize system performance and operations planning and advanced atmospheric sensing applications to characterize and mitigate wind and turbulence in complex terrain. It provides detailed model applications for various effects of the atmosphere on electro-optical and acoustic target detection, location, and identification. This Project develops both physics-based decision aids and rule-based decision support systems for assessing the impacts of weather\/ atmosphere across a spectrum of friendly and threat weapons systems, sensors, platforms, and operations. Information can be applied to mission planning and execution, battlefield visualization, reconnaissance surveillance and target acquisition, route planning to maximize stealth and efficiency, web enabled tactical decision aids, and also modeling of environmental impacts for combat simulations and war games.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nThis work transitions technologies to the Department of Defense weather and operations modeling community, the United States Air Force 557th Weather Wing to improve their operational weather support to the Army Project Leader-Fire Support Command and Control and Marine Corps Systems Command (MCSC) for field artillery systems, the Project Manager, Distributed Common Ground System-Army (DCGS-A), the Joint Improvised Threat Defeat Agency, the Program Executive Office Aviation\/Tactical Airspace Integration System (TAIS)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Atmospheric Characterization, Modeling, and Impacts (formerly Atmospheric Modeling)"
                                    },
                                    "Description": {
                                        "val": "This effort develops high resolution, short-range forecasting, and high resolution atmospheric modeling capabilities for mountainous, urban, and forest complex terrain."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.614"
                                            },
                                            "Text": {
                                                "val": "Researched and developed decision support technology, including characterizing atmospheric impacts on and optimized paths for hypersonic munitions; researched and developed enhancements to automated routing capabilities to include accounting for acoustic signatures of air\/ground platforms in varying environments (e.g. complex terrain and dense urban environments); developed and implemented methods for decision support tools to ingest and represent probabilistic components and forecast certainty\/uncertainty of atmospheric prediction models; developed a densely-instrumented urban environmental testbed to characterize urban flow processes under varied background meteorological conditions; developed system for optimizing Weather Running Estimate-Nowcast (WRE-N) configuration based on geographical characteristics including system verification and validation; optimized the atmospheric boundary layer environment using Lattice Boltzman method (ABLE-LBM) dynamical core for use on small platforms with accelerator cards; demonstrated capability of incorporating unmanned aerial systems (UAS) and other local data sources into a networked- constrained Nowcast model; developed tailored model for improved autonomous system performance; and refined next generation atmospheric acoustic decision support tool used to determine the detection footprint of small UAS by investigating physics constrained machine learning"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.006"
                                            },
                                            "Text": {
                                                "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T40"
                    },
                    "ProjectTitle": {
                        "val": "Mob\/Wpns Eff Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "31.899"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "31.899"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0602144A Ground Technology:\n* Project BL5 Expedient Passive Protection for Technology\n* Project BL7 Power Projection in A2\/AD Environments Technology\n* Project BL9 Protection from Advanced Weapon Effects Technology\nPE 0602145A Generation Combat Vehicle Technology:\n* Project BF1 Autonomous Ground Resupply\n* Project BG2 Modeling & Simulation for MUMT Technology\nPE 0602146A Network C3I Technology:\n* Project AR9 Persistent Geophysical Sensing-Infrasound Tech\n* Project AT2 Subterranean Detection and Monitoring Technology\nPE 0602150A Air and Missile Defense Technology\n* Project AE2 Unconventional Countermeasures-Survivability Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates, designs, and develops technologies for adaptive and expedient force protection and projection across the range of military operations. Focus areas include force projection and maneuver, including austere port and airfield entry; prediction, definition, avoidance, or defeat of natural and manmade gaps and obstacles to support ground force operations; scalable weapons effects; and high-resolution representation of near-surface terrain and environment for use with sensor models for target detection and unmanned ground systems (UGS) navigation. This research also provides physics-based representations of ground vehicle mobility, obstacle and barrier placement, survivability, and weapons effects in complex and urban terrain modeling and simulation. Work in this Project increases the protection of soldiers and critical assets from conventional, unconventional, and emerging threats and enables maneuver support of ground forces, while reducing their logistical footprint. This Project supports efforts for overcoming critical capability gaps for operations in a number of environments including dismounted Soldiers conducting missions in urban and subterranean environments, distributed small units, and projection and sustainment of forces across an increasing large battlefield.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Army Engineer Research and Development Center (ERDC), Vicksburg, Mississippi.\n\nThis work is fully coordinated with and complementary to PE 0603734A (Military Engineering Advanced Technology). Autonomous ground resupply activities are coordinated in collaboration with the U.S. Army Ground Vehicle Systems Center (GVSC) through PE 0603005A (Combat Vehicle and Automotive Advanced Technology) \/ Project 515 (Robotic Ground Systems), PE 0602601A (Combat Vehicle and Automotive Technology) \/ Project H77 (National Automotive Center), and PE 0602601A (Combat Vehicle and Automotive Technology) \/ Project H91 (Ground Vehicle Technology). Autonomous Ground Resupply activities are also coordinated in collaboration with the Armament Research Development and Engineering Center (ARDEC) through PEs 0603001A (Warfighter Advanced Technology) \/ Project 543 (Ammunition Logistics), PE 06043639A (Weapons and Munitions - Advanced Development) \/ EC3 (Ammunition Logistics Prototyping), and 0605805A (Munitions Standardization, Effectiveness and Safety) \/ Project 297 (Mun Survivability & Log). Unconventional Countermeasure activities are coordinated with PE 0602720A (Environmental Quality Technology) \/ Project 835 (Mil Med Environ Crit) and PE 0603728A (Environmental Quality Technology Demonstrations) \/ Project 03E (Environmental Restoration Technology)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Adaptive Protection"
                                    },
                                    "Description": {
                                        "val": "This effort develops new analytical techniques, advanced materials, and integrated protection systems to support the protection of critical assets on the battlefield. Technology development efforts include techniques and materials to protect fixed and semi-fixed assets and soldiers in complex, urban and contested environments; techniques to increase survivability through unconventional means and advanced hardening material solutions; and techniques to identify subterranean threats against forces and critical assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.55"
                                            },
                                            "Text": {
                                                "val": "Developed algorithms to predict a range of threat weapon effects on relevant urban construction types and designed an assessment tool to ensure safe building occupation decisions; developed and examined rapid signature reduction materials and methods to increase critical asset survivability; developed perimeter security and surveillance technologies and algorithms to detect, track, and classify surface, maritime, and subterranean threat activities; and designed and developed new protective technologies to defeat future near-peer adversarial threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Austere Entry and Maneuver"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs, and creates tools and technologies that identify, assess, and monitor structural and functional suitability of theater access points and infrastructure. This effort investigates materials and models to rapidly repair or construct infrastructure to support power projection and maneuver. This effort creates tools that allow planning of distributed sustainment nodes and tactical logistics resupply networks across the complex, contested battlefield. This effort, investigates techniques and creates tools to simulate manned\/unmanned tactical maneuver and mobility of small disbursed units in complex and urban terrains."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.103"
                                            },
                                            "Text": {
                                                "val": "Provided an updated version of a real-time hardware-in-the-loop simulation environment to investigate autonomous vehicle maneuver; developed software to automatically detect mobility obstacles in near-real time; developed algorithms and began interface design to automate analyses of seismic-infrasound-acoustic-meteorological (SIAM) data for non-subject matter expert use while monitoring infrastructure; identified materials and technologies for modeling efforts to assess and plan projection and protection for dispersed small units in extreme, constantly evolving, and complex environments; began physics-based modeling efforts to predict projection material performance under repetitive loading during projection operations; and identified and examined new materials to reduce weight, increase durability, and enabled rapid constructability during force projection and sustainment operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Impacts on Sensor Performance"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs, and creates physics-based, multiscale numerical models of the geo-environment and synthetic environments representing geo-environment impacts on various sensor modalities and systems. These enable the development of sensors and sensor algorithms for object or target detection, sensor-target pairing, unconventional countermeasures experiments, and autonomous navigation and tactical behaviors in unmanned ground systems. This effort further investigates the design of non-line-of-sight sensors for remote areas, including the investigation of coupling between sensors and their environment for understanding surface and subsurface activities. This effort supports persistent surveillance and detection capabilities and air missile defense."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.862"
                                            },
                                            "Text": {
                                                "val": "Developed computational capabilities to investigate unconventional countermeasures to enhance the protection of critical assets; and developed new and expand current computational test bed capabilities to simulate dynamic adaptive sensing technologies in emerging threat environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Materials Modeling"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and leverages physics-based computational models and laboratory experiments to understand the relationships between the chemical and micro-structural composition of materials and their performance characteristics when used in protecting facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.384"
                                            },
                                            "Text": {
                                                "val": "Provided the first spiral of a virtual material by design procedure to predict engineering properties for force protection material performance; and continued laboratory investigations of novel composites, ceramics, polymers, and other non-cement based materials for layered force protection methods."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T41"
                    },
                    "ProjectTitle": {
                        "val": "Mil Facilities Eng Tec"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.521"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.521"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0602144A Ground Technology:\n*Project BK7 Robotics for Engineer Operations Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and develops technologies and techniques to support robotic and autonomous operations capabilities, ensure sustainable, cost efficient, and effective facilities, and to achieve resilient and sustainable installation and expeditionary operations. The project focuses on facilities and operations technologies directly supporting training, readiness, force projection, force protection, and homeland security. Facility enhancement technologies contribute to cost reductions in the Army facility life cycle process (infrastructure planning, assessment, design, construction, revitalization, sustainment, and disposal), and the supporting installation operations. This work improves the capability of autonomous engineering during combat operations to perform construction and supporting tasks in high risk\/threat and dynamic environments, enables installations to support forces to meet transformation goals, improves designs for close battle training facilities, and enhances security of Soldiers, families, and civilians. Technologies evolving from this work include integrated planning and design tools for United States (U.S.) facilities and on-demand expeditionary structures, models predicting water dispersed contaminant effects on facilities and occupants; sustainable facility and base management; collaborative decision support tools; and advanced materials. In addition, technologies from this work will support analysis of socio-cultural and facility issues in contingency operations, including urban environments.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project is performed by the Army Engineer Research and Development Center (ERDC), Vicksburg, Mississippi."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Infrastructure for Combat Operations (Previously titled Adaptive and Resilient Installations)"
                                    },
                                    "Description": {
                                        "val": "The Army requires the ability to assess, establish, upgrade, and secure infrastructure while in theatre to enable deployed force operations. This effort provides tools for the assessment of physical and ecological impacts on operations, agile infrastructure modification, and custom designed construction for expeditionary structures on demand."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.793"
                                            },
                                            "Text": {
                                                "val": "Designed and developed a decision tool to identify types of additional design scenario variables that relate to the social, cultural, economic and political conditions that impact operational planning; and investigated approaches to fully integrate enterprise business processes and information infrastructure across Army power projection platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotics for Engineer Operations"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate robotic engineer construction equipment capability allowing Engineers to conduct autonomous and semi-autonomous Mobility, Countermobility and Construction missions. This effort supports the Army's Modernization Priority Next Generation Combat Vehicle (NGCV), Maneuver Robotics and Autonomous Systems, and is intended to provide capabilities that enable and increase the effectiveness of future maneuver formations with extended reach (area and time), by enabling increased force survivability by combining manned and robotic teaming in the conduct of cross-domain maneuver in complex terrain while reducing risk to Soldier and units."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.728"
                                            },
                                            "Text": {
                                                "val": "Developed robotic construction equipment capabilities allowing Combat Engineers to conduct autonomous and semi-autonomous mobility, counter-mobility and construction missions. Designed proof of concept for a robotic obstacle-removal platform, and developed advanced construction methods for deployed forces."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T42"
                    },
                    "ProjectTitle": {
                        "val": "Terrestrial Science Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.127"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.127"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned to:\nProgram element (PE) 0602146A Network C3I Technology:\n* Project AT4 GeoINT - OPS Merge Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and advances technologies to characterize and respond to impacts of the terrestrial environment on the performance of emerging and deployed Army systems, as well as the impact of natural and man-made changes in the environment on all phases of unified land operations. Research efforts model the dynamics of electromagnetic, acoustic, and seismic propagation in response to changing terrain state and complex terrain features and geometry, and their depiction in geospatial information and mission command systems. Numerical modeling of weather effects on terrain properties supports intelligence preparation of the battlefield products including mobility estimates and intelligence, surveillance, and reconnaissance planning. This effort integrates terrain knowledge and weather forecast in a mission context to provide geospatial information and mission command-delivered solutions to the Soldier. The understanding gained and products developed improve the ability to predict signature (emitter) behavior and sensor performance in complex operational environments, and support materiel development, sensor performance products for tactical decision-making, and visualization for mission command.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Army Engineer Research and Development Center (ERDC), Vicksburg, Mississippi."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Augmented Reality for Operational Technologies - 3D Terrain"
                                    },
                                    "Description": {
                                        "val": "This effort partnered with Communications - Electronics Research, Development, and Engineering Center, designs and exploits an innovative geospatial framework for storage, extraction, processing and visualization of high-resolution three-dimensional (3D) terrain data for tactical visualization systems, helmet-mounted, and other displays. Research results will mature technological components to enable a leap ahead in Soldier situational awareness by introducing geo-registered geospatial cues with military symbology on the Soldiers view of the real world, enabling more rapid decision making by the mounted and dismounted Warfighters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Developed advanced algorithms for the detection and delineation of edges, sides, and corners of built infrastructure within collected 3D urban data, and exported results as light-weight wireframe or mesh to augment the Soldier?s situational awareness in dense and congested urban and complex terrain."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Geospatial Analytics for High Resolution Enriched Terrain"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops enhanced and automated analytical capabilities to update, revise and complete 3D high-resolution geospatial representations of the time-stable objects and geometries of complex and urban terrain (e.g. buildings) for the common operating picture. Research results, a new and innovative set of geospatial models, apply to a variety of planning and visualization capabilities for enabling the Soldier to effectively operate with greater situational awareness in complex terrain and dense urban environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3"
                                            },
                                            "Text": {
                                                "val": "Investigated emerging man\/machine learning algorithms to automate production processes, to enable change detection, and to support learning by manned and autonomous systems with the capability to collect and\/or complete 3D high-resolution common operating picture of complex and urban terrain."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Geospatial Representation of Dynamic Phenomena"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops capabilities for automated techniques and tools to identify, characterize, and visualize dynamic geospatial features (e.g., non-combatant clutter) to selectively overlay on high-resolution 3D geospatial representations of infrastructure and terrain surfaces for the Common Operating Picture and tactical displays. These dynamic geospatial features include natural and man-made ephemeral conditions affecting military operations (e.g., obstacles, traffic, population, degraded visual environment, snow, ephemeral water bodies, etc.), such as movement and maneuver, and sensor performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.127"
                                            },
                                            "Text": {
                                                "val": "Investigated new methods to identify, characterize, track and visualize battlespace objects that change with time (examples include rubble, bridge damage, vehicles, street markets, flooding and other weather induced effects) impacting Soldier and unmanned systems movement and maneuver in complex terrain."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T45"
                    },
                    "ProjectTitle": {
                        "val": "Energy Tec Apl Mil Fac"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.909"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.909"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned to:\nProgram Element (PE) 0602144A Ground Technology: \n* Project BK7 Robotics for Engineer Operations Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and evaluates technologies necessary for secure, efficient, sustainable military installations and expeditionary structures, emphasizing systems protection in response to evolving needs, including autonomous and semi-autonomous mobility, countermobility and construction. Technologies and processes are also applied to the Army's industrial base to maintain its cost-effective readiness for munitions production and training, and in the theater of operations to reduce logistical footprint. This effort investigates technologies to assess, establish, upgrade, and secure infrastructure while in theatre to enable deployed force operations, develops methods to optimize sustainable operations and maintenance to minimize lifecycle costs, and provides capabilities that enable future maneuver formations. In addition, technologies from this work mature a better understanding of critical infrastructure interdependencies to support sustainable and flexible facility operations and evolving mission requirements.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Army Engineer Research and Development Center (ERDC), Vicksburg, Mississippi."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Robotics for Engineer Operations"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate robotic engineer construction equipment capability allowing Engineers to conduct autonomous and semi-autonomous Mobility, Countermobility and Construction missions. This effort supports the Army's Modernization Priority Next Generation Combat Vehicle (NGCV), Maneuver Robotics and Autonomous Systems, and is intended to provide capabilities that enable and increase the effectiveness of future maneuver formations with extended reach (area and time), enabling increased force survivability by combining manned and robotic teaming in the conduct of cross-domain maneuver in complex terrain while reducing risk to Soldier and units."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.909"
                                            },
                                            "Text": {
                                                "val": "Developed robotic construction capabilities for forward deployed Engineers.  This includes autonomous site characterization for construction; debris and obstacle removal; horizontal infrastructure repair; obstacle emplacement; control methodologies for multiple robotic construction equipment to work collaboratively and cooperatively, and additive printing using concrete or other cementitious materials for onsite implementation and use."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T53"
                    },
                    "ProjectTitle": {
                        "val": "Military Engineering Applied Research (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "29"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "29.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional increases for Program increase"
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional increases supporting the investigation and advancement of technologies, techniques, and tools for representation of the physical and human environment for use in military planning and operations; for characterizing geospatial, atmospheric, and weather conditions and impacts on systems and military missions; for conducting mobility, counter-mobility, survivability, and force protection planning and operations; and for enabling secure, sustainable, energy efficient facilities.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Army Engineer Research and Development Center (ERDC), Vicksburg, Mississippi."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Innovative Construction Materials for the Arctic"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8"
                                        },
                                        "Text": {
                                            "val": "Innovative Construction Materials for the Arctic"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Increase: Unspecified"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Program Increase: Unspecified"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cellulose Nanocomposites Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "15"
                                        },
                                        "Text": {
                                            "val": "Cellulose Nanocomposites Research"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vehicle-born IED Screening"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "1"
                                        },
                                        "Text": {
                                            "val": "Vehicle-born IED Screening"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}