{
    "id": "2021-Army-PB-2040-JBOOK-8f7fdbb59cb85b132b0478715b87ff02c7eb359f73f79d73e48c9151ed5a28f2-9",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603115A"
        },
        "ProgramElementTitle": {
            "val": "Medical Development"
        },
        "R1LineNumber": {
            "val": "52"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "27.723"
            },
            "BudgetYearOneBase": {
                "val": "27.723"
            },
            "BudgetYearTwo": {
                "val": "26.849"
            },
            "BudgetYearThree": {
                "val": "27.386"
            },
            "BudgetYearFour": {
                "val": "27.934"
            },
            "BudgetYearFive": {
                "val": "28.482"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "138.374"
            }
        },
        "ProgramElementNote": {
            "val": "This is a new start in FY2021.\n\nThis Program Element (PE) is a New Start for Fiscal Year 2021 (FY21)."
        },
        "ProgramElementMissionDescription": {
            "val": "This PE funds the Military Human Immunodeficiency Virus (HIV) Research Program and the following medical research efforts: Walter Reed Army Institute of Research (WRAIR) Vaccine Production research, Underbody Blast (UBB) research, and Deployed Warfighter Protection. Funding also supports the Medical Operational Data System (MODS), Pharmacovigilance Defense Application System (PVDAS), Mobile HealthCare Environment (MHCE), and the Civilian Authorized Salaries and Other Operational Requirements programs. \n\nThe Military HIV Program supports the research and development to develop candidate HIV vaccines, to assess their safety and effectiveness in human subjects and to protect military personnel from risks associated with HIV infection.\n\nThe WRAIR Vaccine Production Facility research project supports the development and licensure of vaccines and relevant biologics critical to the global health of our Warfighters serving domestically or abroad in compliance with US Food and Drug Administration (FDA) regulations.\n\nThe Underbody Blast (UBB) Testing medical research project provides funds to establish a scientific and statistical basis for evaluating skeletal injuries to vehicle occupants during ground vehicle UBB events. Areas of interest to the Secretary of Defense are medical research that provides an understanding of the human response and tolerance limits and injury mechanisms needed to accurately predict skeletal injuries to ground combat vehicle occupants caused by UBB events. This enhanced understanding will support the establishment of an improved capability to conduct Title 10 Live Fire Test and Evaluation and to make acquisition decisions.\n\nThe Deployed Warfighter Protection program Armed Forces Pest Management Board provides for the development of new or improved protection of military personnel from insects and tick vectors of disease pathogens.\n\nThe Medical Operational Data System (MODS), Pharmacovigilance Defense Application System (PVDAS), and Mobile HealthCare Environment (MHCE) identify, explore and demonstrate key technologies to overcome medical and military unique technology barriers. \n\nThe Civilian Authorized Salaries and other operational requirements provide funding for authorized civilian workforce performing medical research, development, acquisition management and oversight that support the medical research, development, test, and evaluation (RDTE) programs at the United States Army Medical Research and Materiel Command (USAMRMC), Fort Detrick, Maryland.\n\nIn FY21 programs these programs were transferred from the Defense Health Agency (DHA) to the United States Army."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "27.723"
                },
                "BudgetYearOneBase": {
                    "val": "27.723"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "27.723"
                },
                "BudgetYearOneBase": {
                    "val": "27.723"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "27.723"
                                },
                                "BudgetYearOneBase": {
                                    "val": "27.723"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY21, funding transferred to the Army from the Defense Health Program (DHP) research, development, test, and evaluation (RDTE) Program Elements 0603115DHA (Projects 504, 431A, 448A,and 830A), 0605013DHA (Projects 283C, 283L, and 283P), and 0605145DHA (Project 432A)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EB3"
                    },
                    "ProjectTitle": {
                        "val": "HIV Medical Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "27.723"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.723"
                        },
                        "BudgetYearTwo": {
                            "val": "26.849"
                        },
                        "BudgetYearThree": {
                            "val": "27.386"
                        },
                        "BudgetYearFour": {
                            "val": "27.934"
                        },
                        "BudgetYearFive": {
                            "val": "28.482"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "138.374"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This is a new start in FY2021.\n\nIn Fiscal Year 2021 (FY21) this is a New Start."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Military Human Immunodeficiency Virus (HIV) Research Program develops vaccine candidates, to assess their safety and effectiveness in human subjects, and to protect military personnel from risks associated with HIV infection. All HIV technology development is conducted in compliance with United States Food and Drug Administration (FDA) regulations. This program is jointly managed through an Interagency Agreement between the United States Army Medical Research and Development Command (USAMRDC) and the National Institute of Allergy and Infectious Diseases. The cited work is also consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas.\n\nThe Walter Reed Army Institute of Research (WRAIR) Vaccine Pilot Bioproduction Facility (PBF) is the Department of Defense (DOD) only facility capable of producing good manufacturing practices (GMP) quality biologic products for use in early phase clinical trials. The mission of the WRAIR PBF is to support the development and licensure of vaccines and relevant biologics critical to the global health of our Warfighters serving domestically or abroad in compliance with United States FDA regulations. This project supports vaccine development efforts of strategic importance to the DoD, including Service medical research and development programs, those of other DoD organization such as the Defense Threat Reduction Agency and the Defense Advanced Research Projects Agency, and pandemic bio preparedness for emerging infectious disease threats in the Global Health Security Agenda.\n\nThe Underbody Blast (UBB) Testing medical research project will provide new data on the biomechanics of human skeletal response that occurs in an attack on a ground combat vehicle, it will provide better protection to mounted warriors from the effects of underbody blast caused by landmines or improvised explosive devices (IEDs). The data will provide a biomedical basis for the development of a Warrior-representative blast test manikin (the Warrior Injury Assessment Manikin or WIAMan project) and the required biomedically-valid injury criteria that can be used in Title 10 Live Fire Test and Evaluation (LFT&E) to characterize dynamic events, the risk of injury to mounted warriors, and to support acquisition decisions. The data produced by this project will be used to satisfy a critical need for a scientifically valid capability for analyzing the risk of injury caused by UBB.\n\nThe Deployed Warfighter Protection project, the Armed Forces Pest Management Board (AFPMB), plans to develop new or improved protection for ground forces from disease-carrying insects. The focus of this program is to develop new or improved systems for controlling insects that transmit malaria, dengue, chikungunya and other emerging infectious diseases under austere, remote, and combat conditions; understand the physiology of insecticidal activity to develop new compounds with greater specific activity and\/or higher user acceptability; examine existing area repellents for efficacy and develop new spatially effective repellent systems useful in military situations; develop new methods or formulations for treating cloth to prevent vector biting; and expand the number of active ingredients and formulations of public health pest pesticides, products and application technologies available for safe, and effective applications. The AFPMB partners with the President's Malaria Initiative and the World Health Organization Global Malaria Program to lead development of new tools for insect-borne disease prevention.\n\nThe Medical Operational Data System (MODS) deploys modernized data visualization capabilities to enhance Army Unit and Individual Medical Readiness Reporting. MODS provides Army leadership with a responsive and reliable human resource and readiness information management data system for all categories of military and civilian medical and support personnel. MODS provide Tri-Service support through applications such as Electronic Profile, Behavioral Health, and Medical Education.\n\nThe Pharmacovigilance Defense Application System (PVDAS) provides military providers Defense Patient Safety reports from the Food and Drug Administration (FDA) after a drug's release to market. The program identifies, explores, and demonstrates key information technologies to overcome medical and military unique technology barriers. \n\nThe Mobile HealthCare Environment (MHCE) is the capability of secure, bidirectional messaging and data exchange between patients, providers and clinics using any electronic device. The program identifies, explores, and demonstrates key information technologies to overcome medical and military unique technology barriers.\n\nThe Civilian Authorized Salaries and Other Operational requirements provide funding for authorized civilian workforce performing medical research, development, acquisition management and oversight that support the medical research, development, test, and evaluation (RDTE) programs at the United States Army Medical Research and Materiel Command (USAMRMC), Fort Detrick, Maryland."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "HIV Medical Development"
                                    },
                                    "Description": {
                                        "val": "The Military HIV Research Program aims to develop candidate HIV vaccines, to assess their safety and effectiveness in human subjects, and to protect the military personnel from risks associated with HIV infection. In addition, program also aims to develop other prevention and treatment strategies to mitigate the HIV epidemic globally. This project down selects one or more vaccine candidates that are optimized through pre-clinical studies in non-human primates and conducts human clinical trials in Africa, Asia and the United States to test for safety and immunogenicity (ability to invoke an immune response), and early proof of concept efficacy testing."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.035"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.035"
                                            },
                                            "Text": {
                                                "val": "The Military HIV research program will continue Early Capture HIV Cohort studies in Europe and Asia with the purpose of characterizing recruitment, retention, HIV prevalence, HIV incidence and biological characteristics of acute HIV infection in high risk volunteers. Human population studies in Asia, Europe and West Africa will continue to provide knowledge about the earliest HIV events to inform vaccine development. Human clinical trials in Africa, Asia and the United States designed to test for safety, immunogenicity and early proof of concept efficacy of candidate vaccines will continue."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred from the Defense Health Program (DHP) RDTE Program Element 0603115DHA Project 448A."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "WRAIR Vaccine Production Facility Research"
                                    },
                                    "Description": {
                                        "val": "The WRAIR Vaccine Pilot Bioproduction Facility will focus on the manufacture of early phase clinical materials for vaccine production from varied platforms, such as live virus, conjugates, recombinant proteins, DNA, and monoclonal antibody approaches that: (a) expand collaborative partnerships for product development that meet DoD requirements; (b) open active intramural-based discovery efforts of new products for development; and (c) initiate and extend strategic partnerships with external collaborators (Government and industry) to develop\/co-develop potential new biologic approaches to pandemic disease preparedness."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.315"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.315"
                                            },
                                            "Text": {
                                                "val": "The WRAIR PBF program will continue vaccine and biologic production efforts for use in early phase clinical trials to assess safety and effectiveness of candidate vaccines."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred from the Defense Health Program (DHP) RDTE Program Element 0603115DHA Project 504."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Underbody Blast Testing"
                                    },
                                    "Description": {
                                        "val": "The UBB Testing will provide an understanding of the biomechanics of skeletal injuries that occur in a combat vehicle UBB event involving a landmine or IED, and the biomedical basis for the development of a Warrior-representative blast test manikin and associated biomedically-validated injury criteria that can be used to characterize dynamic events and injury risks for LFT&E crew survivability assessments and vehicle development efforts to better protect Warriors from UBB threats."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.4"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.4"
                                            },
                                            "Text": {
                                                "val": "The Underbody Blast Testing program will prepare final reports and complete contract closeouts to support completion of program efforts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred from the Defense Health Program (DHP) RDTE Program Element 0603115DHA Projects 431A."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Deployed Warfighter Protection"
                                    },
                                    "Description": {
                                        "val": "The Deployed Warfighter Protection project will develop new or improved protection for ground forces from disease carrying insects."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.473"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.473"
                                            },
                                            "Text": {
                                                "val": "The Deployed Warfighter Protection research project will continue to conduct translational research to develop and field tools that protect against emerging infectious disease threats and enable deployed forces to enhance protection from biting insects, primarily mosquitoes and sand flies, which transmit force degrading diseases. The AFPMB Vector Control Capabilities Gap Analysis (completed in FY 2016) will continue to be used to inform the development of functional and performance requirements for future acquisition programs. In addition, the AFPMB will continue to develop the necessary test and evaluation plans to determine a candidate product's ability to meet its stated requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred from the Defense Health Program (DHP) RDTE Program Element 0603115DHA Project 830A."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medical Operational Data System"
                                    },
                                    "Description": {
                                        "val": "The Medical Operational Data System information management system will provide responsive and reliable human resource and medical readiness data for all categories of military and civilian medical and support personnel."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.994"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.994"
                                            },
                                            "Text": {
                                                "val": "Medical Operational Data System will respond to Milestone Decision Authority decisions to add new capabilities, significantly enhance, and technically upgrade existing capabilities, and use federally funded research and development center resources for system engineering and acquisition effectiveness services. These technology upgrades will support the system's ability to help strengthen the scientific basis for decision-making in patient safety and quality performance within the Military Health System."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred from the Defense Health Program (DHP) RDTE Program Element 0605013DHA Project 283C."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pharmacovigilance Defense Application System"
                                    },
                                    "Description": {
                                        "val": "The Pharmacovigilance Defense Application System (PVDAS) provides military providers Defense Patient Safety reports from the Food and Drug Administration (FDA) after a drug's release to market."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.35"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.35"
                                            },
                                            "Text": {
                                                "val": "Pharmacovigilance Defense Application System will implement the testing of the drug surveillance and data visualization capabilities that were developed during previous fiscal years."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred from the Defense Health Program (DHP) RDTE Program Element 0605013DHA Project 283L."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Health Care Environment"
                                    },
                                    "Description": {
                                        "val": "The Mobile HealthCare Environment is the capability of secure, bidirectional messaging and data exchange between patients, providers and clinics using any electronic device."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.364"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.364"
                                            },
                                            "Text": {
                                                "val": "The Mobile HealthCare Environment program will finalize its functionality expansion which will be the data exchange with other systems, specifically a patient's personal health record, and enterprise systems such as their electronic health record. These system enhancements will support the Army's ability to help strengthen the scientific basis for decision-making in patient safety and quality performance within the Military Health System."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred from the Defense Health Program (DHP) RDTE Program Element 0605013DHA Project 283P."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Civilian Authorized Salaries and Other Operational Requirements"
                                    },
                                    "Description": {
                                        "val": "Funding is provided to the USAMRDC for Medical Research Development Acquisition (RDA) Management and Oversight to include the payroll of civilians as well as nominal operating expense."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.792"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.792"
                                            },
                                            "Text": {
                                                "val": "Will fund authorized civilian salaries and associated expenses (supplies, equipment, travel, etc.) at USAMRDC and United States Army Medical Research Acquisition Activity. Funding will also provide regulatory, clinical monitoring and data support for the Special Immunization Program. This program will provide non-licensed vaccines under FDA oversight to personnel at risk of exposure to selected infectious diseases."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding was realigned from Program Element 0605801A Project M02."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}