{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-9035d21372bc28631c31031b85da2fbd962d290bf8d6ca6eecbc49021508de49-63",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605772D8Z"
        },
        "ProgramElementTitle": {
            "val": "Nuclear Command, Control and Communications (NC3)"
        },
        "R1LineNumber": {
            "val": "140"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "3.685"
            },
            "BudgetYearOneBase": {
                "val": "3.685"
            },
            "BudgetYearTwo": {
                "val": "4.068"
            },
            "BudgetYearThree": {
                "val": "4.068"
            },
            "BudgetYearFour": {
                "val": "4.257"
            },
            "BudgetYearFive": {
                "val": "4.257"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Nuclear Command, Control, and Communications (NC3) is not a new start.  It is a continuation of efforts previously contained in PE 0604771D8Z, Joint Tactical Information Distribution System."
        },
        "ProgramElementMissionDescription": {
            "val": "This program supports the Under Secretary of Defense for Acquisition and Sustainment in her roles as the Principal Staff Assistant (PSA) for NC3 and NC3 Capability Portfolio Manager (CPM) as directed by the Secretary of Defense in the NC3 Governance Improvement (NGI) Implementation Plan.  The NC3 Portfolio consists of ~200 systems, platforms, networks, and applications.  The goals of the CPM are to 1) Accelerate NC3 modernization programs to deliver integrated cost-effective capabilities, 2) Maintain the readiness of operational NC3 systems and 3) Increase technology upgrades and prototyping to enable the future capabilities to outpace the threat.  This program will develop the necessary tools and processes to assess integrated programmatic risk and to manage and oversee NC3 modernization and sustainment efforts. These tools include software, analytical expertise, and information storage and retrieval systems to support the continuing development of CPM for managing the complex NC3 enterprise.  These efforts will simultaneously support the Commander, USSTRATCOM as NC3 Enterprise Lead and through the Director of the NC3 Enterprise Center (NEC); systems engineering and architecture development entities; the Under Secretary of Defense (USD) for Research and Engineering (R&E), the Joint Staff, and the Services.  This program supports the capability portfolio-based approach (DoD Directive 7045.02, “Capability Portfolio Management”).  \n\nThis program funds development of new tools, technical assessment and planning for the CPM to manage the NC3 enterprise.  This includes: \n1) developing and deploying software tools for improving NC3 enterprise-level management and programmatic risk assessment; \n2) serving as the office of primary responsibility for NC3 enterprise capability portfolio management (to include assessing current capability, complying with statutory mandates, and conducting NC3-related studies, analysis, and policy updates); \n3) assessing DoD Component plans, programs, and budgets for adequacy and execution (including course of action development and recommendations); \n4) identifying, prototyping, evaluating, and recommending new technology for inclusion in the NC3 system; \n5) supporting development of NC3 architecture updates and modernization aimed at system improvements;\n6) developing NC3 corrective action and risk mitigation plans supported by senior investment decisions.\n."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "3.685"
                },
                "BudgetYearOneBase": {
                    "val": "3.685"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "3.685"
                },
                "BudgetYearOneBase": {
                    "val": "3.685"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "PE Creation - Funds moved from PE0604771D8Z"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "3.689"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.689"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.004"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.004"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "815"
                    },
                    "ProjectTitle": {
                        "val": "Nuclear Command, Control and Communications (NC3)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "3.685"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.685"
                        },
                        "BudgetYearTwo": {
                            "val": "4.068"
                        },
                        "BudgetYearThree": {
                            "val": "4.068"
                        },
                        "BudgetYearFour": {
                            "val": "4.257"
                        },
                        "BudgetYearFive": {
                            "val": "4.257"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program supports development and operation of analytical tools to evaluate authoritative data (cost, schedule, performance, risk) on NC3 Portfolio programs to maximize portfolio alignment to strategic priorities and capabilities. It will create integrated development and delivery schedules for NC3 programs.  These tools will forecast system\/capability degradation as well as plans for capability replacement, improvement, or replacement in the context of the larger NC3 enterprise.  It also provides the technical expertise to support risk management analysis (with an emphasis on system design, development and acquisition) of the NC3 enterprise and will develop strategies for synchronizing NC3 preplanned improvements.  It will support the timely exchange of program and capability status information between elements of the NC3 enterprise, the OSD staff, and the combatant commands with a goal of increasing the use of electronic means to provide current and accurate information on key elements of the NC3 enterprise.  \n\nThe effort will develop robust, integrated capability plans and schedules for NC3 capabilities to clarify system dependencies and identify disconnects.  It will also support cross-department collaboration for development of enterprise-wide approaches for capability management.  This includes: (1) vertical and horizontal integration activities within the Department and with the interagency where appropriate; (2) a coordinated portfolio-based approach to planning, programming, budgeting and execution; (3) reform efforts at the legislative, governance, policy, management and execution levels; 4) protection of information and technology that support or enables technology-based capability development for the NC3 warfighting domain and 5) supports the identification, evaluation, and incorporation of promising technology for inclusion in the NC3 system."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Nuclear Command, Control and Communications (NC3)"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.685"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.685"
                                            },
                                            "Text": {
                                                "val": "In the NC3 Capability Portfolio Manager (CPM) role, support the NC3 governance process by providing analysis to senior leadership bodies (NC3 Enterprise Review, Deputy's Management Action Group, SECDEF Weekly Priorities Review, etc.) and recommend investment and policy alternatives for decision. \n\nSupport the Under Secretary of Defense Acquisition and Sustainment as co-chair of the Council on Oversight of the National Leadership Command, Control, and Communications System (CONLC3S). \nConduct programmatic analysis to assess the NC3 portfolio of programs, systems, and facilities to identify cost, schedule, performance, and cyber security challenges. Work collaboratively with the NC3 Enterprise Center (NEC), Services, and DoD Agencies to develop strategies to correct deficiencies and speed modernization. \n\nConduct an annual Professional Staff Member Advisory Forum (i.e. Staffer Day) to keep congressional leadership informed on NC3 enterprise challenges and successes, seek assistance where appropriate, and build confidence in the DoD NC3 management and governance processes. \n\nWork with the Under Secretary of Defense Research and Engineering to develop Science and Technology Strategic Plans to develop next generation NC3 capabilities and to ensure a viable path exists to transition technology to new or existing acquisition programs.\n\nDevelop NC3 Capability Planning Guidance linked to the National Defense Strategy and Commander U.S, Strategic Command priorities to inform Service POM builds and mitigate adjustments during the CAPE-led issue process.  \n\nContinue development of analytic tools, automated processes, and dashboards that allow data access and monitoring of the NC3 enterprise to identify programmatic issues early and implement corrective action."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding moved from  PE 0604771D8Z, Joint Tactical Information Distribution System to track capture funding profile of NC3 efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Utilize existing fixed-price and cost-plus contracts (where appropriate) to continue implementation of NC3 Capability Portfolio Management, provide technical expertise for NC3 system evaluation and strategic planning, and development of NC3 analytical tools."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "NC3 Capability Portfolio Management"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OUSD(A&S)\/OASD(A)\/DASD(I&IPM): Pentagon"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "OUSD(A&S)\/OASD(A)\/DASD(I&IPM): Pentagon"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.685"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.685"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Nuclear Command, Control and Communications (NC3)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Software  Support Contract Awards"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Systems Engineering  & Technical Support Contract Awards"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "OUSD(A&S) Capability Portfolio Management"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}