{
    "id": "2021-DefenseThreatReductionAgency-PB-0400-JBOOK-f078a1cee4e23a7621f52240a2e9669fd5489baa3afbbffc50d48dab709efc36-2",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-DTRA-U_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602718BR"
        },
        "ProgramElementTitle": {
            "val": "Counter Weapons of Mass Destruction Applied Research"
        },
        "R1LineNumber": {
            "val": "21"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "1255.600"
            },
            "PriorYear": {
                "val": "150.040"
            },
            "CurrentYear": {
                "val": "174.096"
            },
            "BudgetYearOne": {
                "val": "174.571"
            },
            "BudgetYearOneBase": {
                "val": "174.571"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "174.915"
            },
            "BudgetYearThree": {
                "val": "177.995"
            },
            "BudgetYearFour": {
                "val": "185.192"
            },
            "BudgetYearFive": {
                "val": "188.975"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2020, the Defense Threat Reduction Agency (DTRA) consolidated projects RF-Forensics Technologies, RI-Nuclear Survivability, and RL-Nuclear and Radiological Effects into the renamed project RD-Nuclear Technologies and Capabilities Development. Additionally, DTRA consolidated RM-Weapons of Mass Destruction (WMD) Counterforce Technologies into the renamed project RG-Counter WMD Technologies and Capabilities Development. There is no change to the program element or project structure in the FY 2021 request."
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Threat Reduction Agency (DTRA) Counter Weapons of Mass Destruction (CWMD) Applied Research program element funds the application and advancement of basic scientific knowledge to develop novel materials, devices, systems, and methods supporting next generation concepts and technologies, to include advances in Weapons of Mass Destruction (WMD) surveillance, detection, defeat, prevention, nonproliferation, counterproliferation, consequence management, and treaty verification.\n\nThis Applied Research portfolio is aligned with strategic planning objectives and Science and Technology (S&T) investment direction established annually by DTRA, which directly support policy and planning guidance from the Executive Office of the President, the Department of Defense (DoD), and the broader WMD threat reduction community.\n\nThe portfolio advances DTRA’s CWMD mission by balancing the following: invest in DTRA’s applied research capabilities and increase the CWMD technology base to maximize future pay-off; capitalize on opportunities to deliver innovative, cost-effective solutions to technical challenges that must be resolved prior to system-specific technology investigations and development; and ensure applied research efforts are directly aligned to the mission-specific capability requirements of DTRA, the Military Departments, Combatant Commanders, other DoD and federal agencies, and international partners."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "155.924"
                },
                "CurrentYear": {
                    "val": "179.096"
                },
                "BudgetYearOne": {
                    "val": "182.758"
                },
                "BudgetYearOneBase": {
                    "val": "182.758"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "150.040"
                },
                "CurrentYear": {
                    "val": "174.096"
                },
                "BudgetYearOne": {
                    "val": "174.571"
                },
                "BudgetYearOneBase": {
                    "val": "174.571"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.884"
                },
                "CurrentYear": {
                    "val": "-5.000"
                },
                "BudgetYearOne": {
                    "val": "-8.187"
                },
                "BudgetYearOneBase": {
                    "val": "-8.187"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-5.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.244"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.640"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-8.187"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-8.187"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The Congressional reduction in FY 2020 is for unjustified growth. The decrease in FY 2021 from the previous President's Budget submission is due to the net impact of:\n(1) the realignment of funds to PE 0603160BR for the CWMD Information Integration Cell (CIIC) to better reflect the nature of this activity,\n(2) increased investment in nuclear weapons effects targeting, battlefield nuclear warfare, certification without underground testing,\n(3) realignment of funds from PE 0602718BR to 0603160BR for full effects modeling and WMD survivability and consequence management, and\n(4) increased investment in WMD counterforce activities to conduct testing of advanced diagnostics with Defence Research and Development Canada as part of a Coalition Warfare Program to advance CWMD planning tools."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "RA"
                    },
                    "ProjectTitle": {
                        "val": "CWMD Cross-Cutting Technical and Information Sciences"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "264.657"
                        },
                        "PriorYear": {
                            "val": "36.665"
                        },
                        "CurrentYear": {
                            "val": "44.167"
                        },
                        "BudgetYearOne": {
                            "val": "40.965"
                        },
                        "BudgetYearOneBase": {
                            "val": "40.965"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "42.194"
                        },
                        "BudgetYearThree": {
                            "val": "42.773"
                        },
                        "BudgetYearFour": {
                            "val": "47.564"
                        },
                        "BudgetYearFive": {
                            "val": "48.593"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The CWMD Cross-Cutting Technical and Information Sciences project develops concepts and technologies in the areas of high-speed information processing, modeling and simulation, signal detection, and data-driven decision analysis in support of the Defense Threat Reduction Agency's (DTRA's) technical reach-back teams. This project develops and maintains continuously improving collaborative architectures and Weapons of Mass Destruction (WMD) modeling and simulation codes that drive an integrated suite of decision support tools serving the Combatant Commands, other Department of Defense (DoD) agencies, and national and international Countering WMD (CWMD) partners. This effort also funds research activities that benefit the public through analysis and engagement to reduce and counter threats posed by WMD via the Project on Advanced Systems and Concepts for Countering WMD (PASCC). PASCC cultivates national and international research community partnerships across domains, bringing scientific, technical, and social science experts together to help understand and anticipate WMD capabilities and threats."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RA:  CWMD Cross-Cutting Technical and Information Sciences"
                                    },
                                    "Description": {
                                        "val": "Project RA develops concepts and technologies in the areas of high - speed information processing, modeling and simulation, signal detection, and data-driven decision analysis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "36.665"
                                            },
                                            "Text": {
                                                "val": "- Release software update for Force-on-Force Evaluation and Analysis of Key Performance Parameters (FREAK), which provides Integrated Force-on-Force Models for Course of Action Analysis, CONOPS Development, and Sensor Performance Prediction.\n- Release software update for Virtual Radiation Training through Ubiety System (VIRTUS), which provides a mobile phone based radiation sensor emulator for search training.\n- Release software update for Android Tactical Assault Kit (ATAK), which incorporates CWMD capabilities into a mobile phone based tactical common operating picture - for customers to support new, emerging and updated modeling and simulation requirements.\n- Continue to sustain a shared, rapidly configurable computational environment to serve as the common R&D backbone:  core analytic tools, shared information, and applications.  Provide analytic solutions and shared computations environments to support R&D and operational needs.  \n- Transition analytic investments, including machine learning, natural language processing, and statistical analytics technologies to the common R&D backbone for agency wide access.\n- Improve decision making processes and time-to-decision cycles by researching, developing, integrating, deploying, and managing advanced data analytics, data visualizations, and knowledge management capabilities to support DTRA’s and associated mission partners’\/customers’ validated operational capability requirements.\n- Establish and advise on approaches to leverage cloud-based capabilities to improve data access, interoperability, and policy compliance.  Implement and enforce system designs to support compliance with DoD cybersecurity policies.\n- Further develop and implement a sustainable and scalable analytic capability to discover emerging and disruptive technologies in support of efforts to anticipate and meet new and emerging requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "44.167"
                                            },
                                            "Text": {
                                                "val": "- Support select NATO nations’ access to a shared WMD and explosives modeling capability as requested by individual nations through the Partnership of Cooperation agreements.\n- Enhance Force-on-Force Evaluation and Analysis of Key Performance Parameters (FREAK) cloud architecture to increase availability of chemical\/biological personnel casualty and detector models that support Course of Action Analysis, Concept of Operations Development, and Sensor Performance Prediction.\n- Provide software releases to include DoD customer detector requests for Virtual Radiation Training through Ubiety System (VIRTUS), which provides a mobile phone-based radiation sensor emulator for search training.\n- Provide increased stand-alone modeling capability for Android Tactical Assault Kit (ATAK), which incorporates CWMD capabilities into a mobile phone-based tactical common operating picture, to support new, emerging and updated modeling and simulation requirements.\n- Transition the Enhanced Mapping and Positioning System (EMAPS) to the Joint Program Executive Office, Chemical and Biological Defense. This system uses Light, Detection and Ranging (LIDAR) to automatically create real-time 2D\/3D annotated physical maps of areas denied to the Global Positioning System."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "40.965"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "40.965"
                                            },
                                            "Text": {
                                                "val": "- Support select NATO nations’ access to a shared WMD and explosives modeling capability as requested by individual nations through the Partnership of Cooperation agreements.\n- Enhance FREAK cloud architecture to increase availability of chemical\/biological personnel casualty and detector models that support Course of Action Analysis, Concept of Operations Development, and Sensor Performance Prediction.\n- Provide software releases to include DoD customer detector requests for VIRTUS, which provides a mobile phone-based radiation sensor emulator for search training.\n- Provide stand-alone modeling capability for ATAK, which incorporates CWMD capabilities into a mobile phone-based tactical common operating picture, to support new, emerging and updated modeling and simulation requirements.\n- Provide quarterly updates to forecasted changes\/developments in geopolitical landscapes and the intersection of Chemical, Biological, Radiological, and Nuclear (CBRN) and WMD employment systems."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2020 to FY 2021 reflects the net effect of the realignment of funds from this program element to program element 0603160BR for the CWMD Information Integration Cell (CIIC) to better reflect the nature of this activity."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "29\/0603160BR\/RA"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Advanced Technology Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "18.080"
                                        },
                                        "CurrentYear": {
                                            "val": "34.825"
                                        },
                                        "BudgetYearOne": {
                                            "val": "50.019"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "50.019"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "46.279"
                                        },
                                        "BudgetYearThree": {
                                            "val": "49.207"
                                        },
                                        "BudgetYearFour": {
                                            "val": "50.708"
                                        },
                                        "BudgetYearFive": {
                                            "val": "51.721"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "162\/0605502BR\/RA"
                                    },
                                    "Title": {
                                        "val": "Small Business Innovation Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "11.315"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "11.315"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive selection of most appropriate performers to fulfill science and technology development needs."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RD"
                    },
                    "ProjectTitle": {
                        "val": "Nuclear Technologies and Capabilities Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "43.398"
                        },
                        "PriorYear": {
                            "val": "21.050"
                        },
                        "CurrentYear": {
                            "val": "89.860"
                        },
                        "BudgetYearOne": {
                            "val": "92.492"
                        },
                        "BudgetYearOneBase": {
                            "val": "92.492"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "91.351"
                        },
                        "BudgetYearThree": {
                            "val": "93.732"
                        },
                        "BudgetYearFour": {
                            "val": "95.307"
                        },
                        "BudgetYearFive": {
                            "val": "97.214"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2020, DTRA consolidated projects RF-Forensics Technologies, RI-Nuclear Survivability, and RL-Nuclear and Radiological Effects in program element 0602718BR, into the renamed project RD-Nuclear Technologies and Capabilities Development."
                        },
                        "ProjectMissionDescription": {
                            "val": "Nuclear Technologies and Capabilities Development encompasses the following related areas:\n\n1.  Research, development, test, and evaluation (RDT&E) to identify, develop, and exploit signatures associated with nuclear threats in support of U.S. capabilities that detect and interdict such threats; and locate, identify, and track special nuclear material and improve detection factors such as range, time, sensitivity, and accuracy to enhance Service and Special Mission Unit capabilities. These efforts support Department of Defense (DoD) requirements for countering terrorism, counterproliferation, nonproliferation, countering rogue states, and homeland defense.\n\n2.  RDT&E to systematically study signatures associated with adversary nuclear programs and nuclear detonations to gain knowledge or understanding necessary to: determine technical capabilities needed to improve DoD contingency planning activities; improve DoD situational awareness on the nuclear battlefield; and improve capabilities to attribute the source of a nuclear detonation.\n\n3.  Research and develop innovative technologies for the protection of mission-essential personnel, critical military and national defense capabilities, and associated control and support systems during a nuclear event. Research under this project supports the mission critical systems identified under DoD  Instruction 3150.09, Chemical, Biological, Radiological, and Nuclear Survivability Policy. System vulnerability research develops nuclear assessment capabilities to support operational planning, weapons effects predictions, and strategic system design. This activity also provides the DoD’s nuclear design and protection standards for new and existing systems, e.g., command and control facilities and aircraft. Key systems include the Nuclear Command and Control System, the net-centric thin-line, and both military and civilian satellites and associated support systems. Experimental capabilities research provides the warfighter with unique x-ray, gamma ray, and electromagnetic pulse (EMP) test capabilities in support of system survivability development, certification, and sustainment. These efforts also support international collaboration, user groups, case study reviews, and the Joint Atomic Information Exchange Group. The human survivability effort conducts research to develop and validate mortality and morbidity models associated with radiological and nuclear weapon effects.\n\n4.  Research and development modeling tools to support military operational planning, weapons effects predictions, and strategic system design decisions; consolidate validated modeling tools for integrated functionality; predict system responses to nuclear and radiological weapons producing electromagnetic, thermal, blast, shock, and radiation environments; provide detailed adversary nuclear infrastructure characterization to enhance counterforce operations and hazard effects; and, develop foreign nuclear weapon outputs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RD:  Nuclear Technologies and Capabilities Development"
                                    },
                                    "Description": {
                                        "val": "Project RD develops direct and indirect technologies for the detection of radiation and non- radiative signatures associated with nuclear threats, and advances warfighter capabilities to rapidly locate, characterize, and counter such threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.050"
                                            },
                                            "Text": {
                                                "val": "- Develop a contamination avoidance capability.\n- Develop wearable neutron detectors made of Boron-Coated Straw in support of the development of modern, novel detector solutions to revolutionize CONOPs.\n- Develop detailed studies to systematically identify new nuclear threat signatures, breaking down the problem geographically to distinguish between allies and foes, and to determine assets and coverage.\n- Transition those technologies that demonstrate exceptional capabilities in radiation and nuclear threat detection to advanced technology development.\n- Develop tools for pre-detonation diagnostics, leveraging high spatial resolution nuclear imagers, multiplicity algorithms, trace analysis tools, and high-fidelity test objects to increase capability to characterize threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "89.860"
                                            },
                                            "Text": {
                                                "val": "- Enhance contamination avoidance capabilities.\n- Contribute to the development of an American National Standards Institute (ANSI) standard to assess DoD radiation imager’s performance and evaluation.\n- Develop and test new application-specific integrated circuits (ASIC) to improve radiation detector performance while also reducing power requirements.\n- Test and evaluate a proof of principle Virtual Reality\/Augmented Reality (VR\/AR) testbed for use in evaluating radiation detection equipment.\n- Actualize detailed studies to systematically identify new nuclear threat signatures, breaking down the problem geographically to distinguish between allies and foes, and to determine assets and coverage.\n- Develop tools for pre-detonation diagnostics, leveraging high spatial resolution nuclear imagers, multiplicity algorithms, trace analysis tools, and high-fidelity test objects to increase capability to characterize threats.\n- Integrate sensor platforms and layering of additional data sets to enhance detection of nuclear targets of interest.\nEnhance and expand capabilities to identify nuclear targets of interest in overhead imagery using next-generation computer-vision techniques, in order to enable follow-on actions\n- Improve DoD decision-making by gaining knowledge to determine how to adapt nuclear sensor capabilities to quickly characterize nuclear explosions on the nuclear battlefield and inform tactical, operational, and strategic military actions.\n- Systematically study techniques to improve the ability of nuclear modeling codes to support tactical DoD operations.\n- Develop system-generated electromagnetic pulse follow-on efforts and electromagnetic pulse coupling and response efforts to deliver high-fidelity early-time electromagnetic analysis and operational tools for US and Allied nuclear weapon effects stakeholders.\n- Conduct research on improved nuclear battlefield casualty assessment and medical planning for nuclear\/ radiological events.\n- Publish updates to Weapons Output eBooks, delivering high-fidelity nuclear source terms and historical test data for use in, and validation of, modern weapon effects codes.\n- Develop petroleum effects models for nuclear targeting capabilities linking higher order impacts to Political Military Economic Social Infrastructure Information (PMESII) analyses.\nBy 4th QTR FY21, develop software prototype capable of injecting nuclear effects, and integrate into select models supporting CCMD and Service wargames.\n- Develop low-cost, mobile and autonomous wide area and point search detectors to enable the warfighter to characterize, map, and avoid radiation hazards on the nuclear battlefield.\n- Improve support to a robust nuclear deterrent without resumption of underground nuclear testing by providing modernized survivability standards, toolkits and test and evaluation (T&E) data for legacy and new mission critical nuclear, conventional, satellite and missile defense systems.\n- Deliver integrated, cloud-ready, cross-cutting platform, applications, and data analysis AI-enhanced capabilities to support the full spectrum of nuclear operations, war gaming, and assessments.\n- Develop wearable neutron detectors made of Boron-Coated Straw in support of the development of modern, novel detector solutions to revolutionize concept of operations (CONOPs).\n- Develop detailed studies to systematically identify new nuclear threat signatures, breaking down the problem geographically to distinguish between allies and foes, and to determine assets and coverage.\n- Develop petroleum effects models for nuclear targeting capabilities linking higher order impacts to Political Military Economic Social Infrastructure Information (PMESII) analyses.\n- Conduct research on improved nuclear battlefield casualty assessment and medical planning for nuclear\/ radiological events.\n- Develop system-generated electromagnetic pulse follow-on efforts and electromagnetic pulse coupling and response efforts to deliver high-fidelity early-time electromagnetic analysis and operational tools for US and Allied nuclear weapon effects stakeholders."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "92.492"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "92.492"
                                            },
                                            "Text": {
                                                "val": "- Enhance existing contamination avoidance capabilities.\n- Develop an additional new radiation signature test device (RSTD) to expand test capabilities and detector evaluation.\n- Evaluate the performance of novel materials (e.g. CLLBC (Cs2LiLa(Br,Cl)6:Ce, Dual-sided micro-structured semiconductor neutron detectors (DSMSNDs)) as a replacement for both high energy resolution gamma-ray detectors and high pressure Helium- neutron detectors.\n- Further develop detailed studies to systematically identify new nuclear threat signatures, breaking down the problem geographically to distinguish between allies and foes, and to determine assets and coverage.\n- Generate additional tools for pre-detonation diagnostics, leveraging high spatial resolution nuclear imagers, multiplicity algorithms, trace analysis tools, and high-fidelity test objects to increase capability to characterize threats.\n- Support transitioning those technologies that demonstrate exceptional capabilities in radiation and nuclear threat detection to advanced technology development."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2020 to FY 2021 is due to the net impact of:\n(1) increased investment in nuclear weapons effects targeting, battlefield nuclear warfare, certification without underground testing, and\n(2) realignment of funds from PE 0602718BR to 0603160BR for full effects modeling and WMD survivability and consequence management."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "29\/0603160BR\/RD"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Advanced Technology Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "21.193"
                                        },
                                        "CurrentYear": {
                                            "val": "70.153"
                                        },
                                        "BudgetYearOne": {
                                            "val": "51.416"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "51.416"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "51.480"
                                        },
                                        "BudgetYearThree": {
                                            "val": "53.081"
                                        },
                                        "BudgetYearFour": {
                                            "val": "55.547"
                                        },
                                        "BudgetYearFive": {
                                            "val": "56.659"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "128\/0605000BR\/RD"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Systems Development"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "7.500"
                                        },
                                        "BudgetYearOne": {
                                            "val": "15.650"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "15.650"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "14.803"
                                        },
                                        "BudgetYearThree": {
                                            "val": "13.959"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.118"
                                        },
                                        "BudgetYearFive": {
                                            "val": "13.381"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive selection of most appropriate performers to fulfill science and technology development needs."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RE"
                    },
                    "ProjectTitle": {
                        "val": "Counter Terrorism Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.693"
                        },
                        "PriorYear": {
                            "val": "0.850"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.543"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Counter-Terrorism Technologies project is an over-arching project that develops and transitions a full spectrum of new technologies to counter emergent Weapons\nof Mass Destruction (WMD) thus enabling warfighters to improve their ability to detect, disable, interdict, neutralize, and destroy chemical, biological, nuclear production,\nstorage, and weaponization facilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RE: Counter-Terrorism Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RE provides research and development (R&D) support to Joint U.S. Military Forces, specifically U.S. Special\nOperations Command (USSOCOM), in the areas of Explosive Ordnance Disposal Device Defeat; Counter WMD technologies for warfighters; the USSOCOM Countering WMD – Terrorism Support program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.850"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "29\/0603160BR\/RE"
                                    },
                                    "Title": {
                                        "val": "Counter-Terrorism Technologies"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "108.964"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "108.964"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RF"
                    },
                    "ProjectTitle": {
                        "val": "Forensics Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "223.112"
                        },
                        "PriorYear": {
                            "val": "7.716"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "230.828"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Beginning in FY 2020, efforts in this project are captured under project RD-Nuclear Technologies and Capabilities Development."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Forensics Technologies project develops nuclear forensics technologies providing accurate, rapid, and reliable means to collect, analyze, and evaluate prompt data and debris from a nuclear or radiological event in support of exploitation and attribution efforts. These forensics technologies also enable the Defense Threat Reduction Agency's (DTRA) and its partners to detect, locate, identify, track, and interdict nuclear and radiological threats, including weapons and material and enablers to their acquisition and development. In accordance with Department of Defense Directive S-2060.04, DTRA serves as the U.S. Government lead for National Technical Nuclear Forensics (NTNF) research and development. As the central NTNF coordinator, DTRA works in consultation with partners to develop and improve ground-based capabilities supporting exploitation and attribution missions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RF:  Forensics Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RF develops nuclear forensics technologies providing accurate, rapid and reliable means to collect, analyze, and evaluate prompt data and debris from a nuclear or radiological event in support of exploitation and attribution efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.716"
                                            },
                                            "Text": {
                                                "val": "- Reduce the fixed lab process timeline by 50%, increasing confidence and decreasing technical uncertainties in the materials forensics results.  This will be accomplished through expanded interpretability of test results, improvement in quality of ground samples, including complex debris from transient environments, and optimization of current debris analysis constructs.\n- Evaluate and extract relevant data from historic nuclear tests to help calibrate codes to support device characterization improvements.\n- Expand signature databases with appropriate information on generic designs, known weapon designs, and known effects.\n- Increase capability development efforts in ubiquitous networks and airborne platforms to support prompt diagnostics and forensics technology improvements.\n- Conduct\/lead a DoD and interagency end-to-end nuclear forensics process technology demonstration and evaluation of DTRA-developed technologies\/methodologies to assess NTNF process improvements.\n- Identify potential development of a new advanced capability in forensic conclusion confidence, timeliness, and accuracy, and assist in assessing contribution to interagency attribution process and decisions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "29\/0603160BR\/RF"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Advanced Technology Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "30.947"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "30.947"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "128\/0605000BR\/RF"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Systems Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.016"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "6.016"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive selection of most appropriate performers to fulfill science and technology development needs.  Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RG"
                    },
                    "ProjectTitle": {
                        "val": "Counter WMD Technologies and Capabilities Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "105.632"
                        },
                        "PriorYear": {
                            "val": "7.938"
                        },
                        "CurrentYear": {
                            "val": "22.253"
                        },
                        "BudgetYearOne": {
                            "val": "22.958"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.958"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "22.919"
                        },
                        "BudgetYearThree": {
                            "val": "23.715"
                        },
                        "BudgetYearFour": {
                            "val": "24.190"
                        },
                        "BudgetYearFive": {
                            "val": "24.675"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2020, DTRA consolidated RM-Weapons of Mass Destruction (WMD) Counterforce Technologies into RG-Counter WMD Technologies and Capabilities Development."
                        },
                        "ProjectMissionDescription": {
                            "val": "Counter WMD Technologies and Capabilities Development encompasses the following areas.\n\n1.  Defeat Technologies develops innovative kinetic and non-kinetic weapon technologies to expand traditional and asymmetric options available to Combatant Commanders to deny, disrupt, and defeat adversarial use of WMD, while minimizing collateral effects. Technology development focuses on the physical or functional defeat of WMD threat materials, an adversary's ability to deliver the same, and the physical and nonphysical support networks enabling both. It does so through the systematic identification and maturation of technologies capable of defeating WMD agents or agent-based processes and selecting technologies for integration into weapons, delivery systems, or rapid WMD elimination capabilities. This effort includes developing specific WMD agent\/agent-based process simulants, sub-scale test infrastructure, and sampling capability required for effective development, testing, and evaluation of next-generation CWMD capabilities. The project places a high priority on understanding, characterizing, and validating potential weapon effects within mathematical confidence as it relates to the unintended release of hazardous threat materials. Technologies with the potential for weapon and capability integration are transitioned to Budget Activity (BA) 3, Advanced Technology Development (ATD) efforts. On a limited basis, technology test data is shared with coalition partners.\n\n2.  WMD counterforce technologies research develops weapons effects modeling algorithms, full and sub-scale test series required to investigate CWMD weapon effects and sensor performance, and visualization and situational awareness tools to support the next generation Technical Reachback cell. These activities are critical enablers for the development of advanced CWMD planning tools. Energetics research develops materials and weapon design technology providing defeat capabilities for engaging hard and deeply buried targets that are beyond current high explosive blast\/fragmentation warhead technology."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RG: Counter WMD Technologies and Capabilities Development"
                                    },
                                    "Description": {
                                        "val": "Project RG develops innovative kinetic and non-kinetic weapons technologies to expand traditional and asymmetric options available to Combatant Commanders to deny, disrupt, and defeat adversarial use of WMD while minimizing collateral effects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.938"
                                            },
                                            "Text": {
                                                "val": "- Conduct an incremental capability demonstration for an autonomous systems technology update to the Modular Autonomous Counter-WMD System B (MACS-B).\n- Develop future MACS advanced holistic payloads, refining the concept and conducting technology investigation.\n- Develop Combined Effects Payload for Access Denial (CEPAD) payload.\n- Collect signatures on threat-improvised rotary winged and fixed wing IED\/sUAS in a lab and field environment.\n- Provide infrastructure to collect signatures including sensors, lab, and field equipment, collection software and collection tools.\n- Provide a consolidated C-IED\/C-sUAS library including database(s), database access, and database\/library management including entry, creation and vetting of information.\nAnalyze C-IED\/C-sUAS equipment data, and create\/sustain algorithms, databases and tables to monitor the creation and vetting of information.\n- Monitor exploitation of rotary winged, fixed winged IED\/C-sUAS to manage the capability gap (from a technology and database standpoint)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.253"
                                            },
                                            "Text": {
                                                "val": "- Conduct incremental capability demonstrations for advanced technology systems.\n- Initiate development of novel, air delivered, incendiary weapon fills for agent defeat.\n- Develop future advanced  holistic payloads, specifically for hard and deeply buried targets.\n- Provide infrastructure to collect signatures including sensors, lab and field equipment, collection software, and collection tools.\n- Develop advance technical capabilities or methods to detect, locate\/track, identify, characterize, monitor, assess, plan, and protect against, deter, delay, disrupt, neutralize, or destroy WMD through special innovative research targeted at meeting capability gaps in CWMD.\n- Develop and test structural reactive materials and advanced thermal agent defeat devices to improve the capability to defeat and\/or neutralize CWMD-related targets.\n- Test biocide at a larger scale to analyze prompt and persistent effects, improving capability to neutralize or destroy biological weapons or agents.\n- Develop CWMD weapon effects modeling algorithms and scaled test series leveraging machine learning and optimization for attack planning to investigate CWMD weapon effects and enhance WMD defeat modeling and simulation planning tools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.958"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.958"
                                            },
                                            "Text": {
                                                "val": "- Develop offensive counter-proliferation, counter-WMD technologies in support of Combatant Command requirements.\n- Develop WMD pathway defeat technologies, as well as threat-specific test articles and analyses.\n- Develop lighter, smaller, more effective breaching capabilities.\n- Develop next generation WMD detection technology applications.\n- Develop advanced data analytics and technical capabilities to rapidly capture, catalogue and illuminate nefarious activities to counter improvised threat networks and provide WMD situational awareness.\n- Build analytic capabilities that enhance the Fusion Analysis Development Effort (FADE)\/Multi- Intelligence Spatial Temporal (MIST) tool suite for geospatial predictive analytics, and pattern of life and anomaly detection. This fusion of sources provides a central, tailorable asset for CWMD mission planning, mission execution, and supports CONPLAN 7599 for identifying and assessing threats.\n- Deliver mobile phone-based tactical common operating picture to U.S. Forces, to support new, emerging and updated modeling and simulation requirements.\n- Conduct biocide testing at larger scale to analyze prompt and persistent effects, improving capability to\nneutralize or destroy biological weapons or agents.\n- Develop environmental monitors for identification and characterization of CBRN production.\n- Develop CWMD weapon effects modeling algorithms and scaled test series for attack planning to investigate CWMD weapon effects enhance WMD defeat modeling and simulation planning tools and assess new WMD defeat mechanisms.\n- Conduct small scale testing of structural reactive materials and advanced thermal agent defeat devices to improve the capability to defeat and\/or neutralize CWMD-related targets.\n- Conduct  biocide testing at larger scales to analyze prompt and persistent effects, improving capability to neutralize or destroy biological weapons or agents.\n- Research and investment in application of basic and applied research initiatives and support test and evaluation of emerging autonomous technologies to support future and emerging threat requirements.\n- Develop offensive counter-proliferation, counter-WMD technologies in support of combatant command requirements.\n- Develop WMD pathway defeat technologies, as well as threat-specific test articles and analyses.\n- Initiate studies on novel next generation agent defeat warhead fills and design."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2020 to FY 2021 is due to increased investment in WMD counterforce activities to conduct testing of advanced diagnostics with Defence Research and Development Canada as part of a Coalition Warfare Program to advance CWMD planning tools."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "29\/0603160BR\/RG"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Advanced Technology Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "22.354"
                                        },
                                        "CurrentYear": {
                                            "val": "225.087"
                                        },
                                        "BudgetYearOne": {
                                            "val": "265.224"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "265.224"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "242.425"
                                        },
                                        "BudgetYearThree": {
                                            "val": "246.630"
                                        },
                                        "BudgetYearFour": {
                                            "val": "250.582"
                                        },
                                        "BudgetYearFive": {
                                            "val": "255.592"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive selection of most appropriate performers to fulfill science and technology development needs."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RI"
                    },
                    "ProjectTitle": {
                        "val": "Nuclear Survivability"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "184.812"
                        },
                        "PriorYear": {
                            "val": "22.632"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "207.444"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Beginning in FY 2020, efforts in this project are captured under project RD-Nuclear Technologies and Capabilities Development."
                        },
                        "ProjectMissionDescription": {
                            "val": "Efforts in this project include system vulnerability assessment, experimental capabilities, nuclear technology analysis, and human survivability.\n\nThe Nuclear Survivability project develops innovative technologies for the protection of mission-essential personnel, critical military and national defense capabilities, and associated control and support systems during a nuclear event. Research under this project supports the mission critical systems identified under Department of Defense Instruction 3150.09, Chemical, Biological, Radiological, and Nuclear Survivability Policy. The Defense Threat Reduction Agency is designated by the Department of Defense (DoD) as the center of excellence for electromagnetic pulse (EMP) survivability assessments. The System Vulnerability and Assessment effort develops nuclear assessment capabilities to support operational planning, weapons effects predictions, and strategic system design.  This activity also provides the DoD’s nuclear design and protection standards for new and existing systems, e.g., command and control facilities and aircraft. Key systems include the Nuclear Command and Control System, the net-centric thin-line, and both military and civilian satellites and associated support systems. Experimental Capabilities activities provide the warfighter with unique x-ray, gamma ray, and EMP test capabilities in support of system survivability development, certification, and sustainment. This effort leverages research from and coordinates with the National Nuclear Security Administration (United States) and the Atomic Weapons Establishment (United Kingdom) to develop enabling technologies for improved nuclear weapon effects experimentation capabilities. Nuclear technology analysis efforts support detailed planning related to policy, strategy, objectives, and programmatic integration. These efforts also support international collaboration, user groups, case study reviews, and the Joint Atomic Information Exchange Group. The human survivability effort conducts research to develop and validate mortality and morbidity models associated with radiological and nuclear weapon effects."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RI: Nuclear Survivability"
                                    },
                                    "Description": {
                                        "val": "Project RI provides the capability for DoD nuclear forces and their associated control and support systems and facilities to avoid, repel, endure, or withstand attack or other hostile action, to the extent that essential functions can continue or be resumed after the onset of hostile action."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.632"
                                            },
                                            "Text": {
                                                "val": "- Align nuclear detonation personnel casualty output from Defense Threat Reduction Agency's (DTRA's) Health Effects from Radiological & Nuclear Environments (HENRE) for Hazard Prediction and Assessment Capability (HPAC) to the Defense Health Agency’s Joint Medical Planning Tool.\n- Advance cold\/warm x-ray and laser experimentation in order to improve nuclear survivability.  For cold x-ray impulse, initiate ion beam and diagnostics development on PITHON, leading to high fluence x-rays for materials and full system impulse capability for Re-entry Vehicles\/Re-entry Bodies to improve radiation survivability.  Complete debris mitigation system for Double-EAGLE in support of cold x-rays for optics and thermostructural response efforts that support Missile Defense Agency (MDA) and satellite systems requirements\n- Translate radiation hardening basic mechanisms and physics of failure into engineering solutions to improve device and component hardening and survivability.\n- Update environment and protection standards on periodic five year intervals and respond to Service and Combatant Command requests for verification assessments, to include conduct of U.S. European Command\/ U.S. Pacific Command Operational Plan and mission critical systems analytical assessments.\n- Continue development of Radiation Hardened by Design (RHBD) neutron Single Event Effects mitigation techniques for strategic radiation hardened digital complementary metal-oxide-semiconductor and Analog Mixed Signal Devices.\n- Develop High Altitude Electro Magnetic Pulse (HEMP), atmospheric, and disturbed environment standards; conduct verification assessments for the Services and MDA; develop technology insertions; and provide subject-matter expert support to provide combat readiness and survivability status to leadership and feedback for Military Standards validity."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "29\/0603160BR\/RI"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Advanced Technology Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.583"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "8.583"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive selection of most appropriate performers to fulfill science and technology development needs.  Performer base includes best-of-breed researchers across the DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RL"
                    },
                    "ProjectTitle": {
                        "val": "Nuclear & Radiological Effects"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "215.561"
                        },
                        "PriorYear": {
                            "val": "27.643"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "243.204"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Beginning in FY 2020, efforts in this project are captured under project RD-Nuclear Technologies and Capabilities Development."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Nuclear and Radiological Effects project develops modeling tools to support military operational planning, weapons effects predictions, and strategic system design decisions; consolidate validated modeling tools into the Joint Information Environment for integrated functionality; predict system responses to nuclear and radiological weapons producing electromagnetic, thermal, blast, shock, and radiation environments; provide detailed adversary nuclear infrastructure characterization to enhance counterforce operations and hazard effects; and, develop foreign nuclear weapon outputs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RL: Nuclear & Radiological Effects"
                                    },
                                    "Description": {
                                        "val": "Project RL delivers nuclear weapons effects applications that enable effective targeting of U.S. nuclear weapons, and inform protection and response against adversary nuclear attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.643"
                                            },
                                            "Text": {
                                                "val": "- Develop system-generated electromagnetic pulse follow-on efforts and electromagnetic pulse coupling and response efforts to deliver high-fidelity early-time electromagnetic analysis and operational tools for US and Allied nuclear weapon effects stakeholders.\n- Publish updates to Weapons Output eBooks, delivering high-fidelity nuclear source terms and historical test data for use in, and validation of, modern weapon effects codes.  \n- Develop petroleum effects models for Consequences of Execution, linking higher order impacts to Political Military Economic Social Infrastructure Information (PMESII) analyses."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "29\/0603160BR\/RL"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Advanced Technology Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.947"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "2.947"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "128\/0605000BR\/RL"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Systems Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.203"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "1.203"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive selection of most appropriate performers to fulfill science and technology development needs.  Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RM"
                    },
                    "ProjectTitle": {
                        "val": "WMD Counterforce Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "118.311"
                        },
                        "PriorYear": {
                            "val": "11.342"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "129.653"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Beginning in FY 2020, efforts in this project are captured under project RG-Counter Weapons of Mass Destruction (WMD) Technologies and Capabilities Development."
                        },
                        "ProjectMissionDescription": {
                            "val": "The WMD Counterforce Technologies Project develops Countering Weapons of Mass Destruction (CWMD) weapon effects modeling algorithms, full and sub-scale test series required to investigate CWMD weapon effects and sensor performance, and visualization and situational awareness tools to support the next generation Defense Threat Reduction Agency (DTRA) technical reachback cell.  These activities are critical enablers for the development of advanced CWMD planning tools and include Advanced Energetics and Advanced Life Sciences.  Advanced Energetics develops energetic materials and weapon design technology providing advanced defeat capabilities for engaging hard and deeply buried targets that are well beyond current high explosive blast\/fragmentation warhead technology.  Advanced Life Sciences research develops technologies to find, locate, mitigate, and defeat WMD using bio-organisms or components."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RM: WMD Counterforce Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RM provides novel and enhanced weapons energetic materials and structures, full-scale testing of counter WMD weapon effects, weapon effects modeling, weapon delivery optimization, and technical reachback services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.342"
                                            },
                                            "Text": {
                                                "val": "- Transition Hellfire-sized structural reactive material warhead technology and design to the Military services to improve capabilities to hold targets at risk.\n- Advance technical capabilities or methods to detect, locate\/track, identify, characterize, monitor, assess, plan and protect against, deter, delay, disrupt, neutralize, or destroy WMD through special innovative research targeted at meeting capability gaps in CWMD.\n- Test biocide at larger scale to analyze prompt and persistent effects, improving capability to neutralize or destroy biological weapons or agents.\n- Develop CWMD weapon effects modeling algorithms and scaled test series leveraging machine learning and optimization for attack planning to investigate CWMD weapon effects, and enhance WMD defeat Modeling and Simulation planning tools."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "29\/0603160BR\/RM"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Advanced Technology Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "40.365"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "40.365"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive selection of most appropriate performers to fulfill science and technology development needs.  Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RR"
                    },
                    "ProjectTitle": {
                        "val": "CWMD Test and Evaluation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "99.424"
                        },
                        "PriorYear": {
                            "val": "14.204"
                        },
                        "CurrentYear": {
                            "val": "17.816"
                        },
                        "BudgetYearOne": {
                            "val": "18.156"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.156"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "18.451"
                        },
                        "BudgetYearThree": {
                            "val": "17.775"
                        },
                        "BudgetYearFour": {
                            "val": "18.131"
                        },
                        "BudgetYearFive": {
                            "val": "18.493"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Countering WMD Test and Evaluation project provides a unique national test capability for simulated WMD facilities and processes. This capability provides structured and systematic end-to-end test event planning, preparation, management, execution, and data analysis. It also offers test instrumentation (data acquisition systems and optics), scientific analysis and predictions, test article construction, test article\/test bed remediation, tunnel mining, architectural and engineering design, systems engineering and integration, and test data management. The project leverages 50 years of expertise in investigating weapons effects and target response across the spectrum of hostile environments that could be created by proliferant nations or terrorist organizations with access to advanced conventional weapons or WMD. Subject matter experts design full and sub-scale testing strategies focusing on weapon-target interaction with fixed soft and hardened facilities to include above ground facilities, cut-and-cover facilities, and deep underground tunnels. This capability does not exist anywhere else within the DoD and supports the counterproliferation pillar of the National Strategy to Counter WMD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RR:  Countering WMD Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Project RR provides a unique national test bed capability for the study of weapon-target interaction, simulated WMD facility characterization, and WMD facility defeat testing to evaluate the implications of WMD and other special weapon use against U.S. military and civilian assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.204"
                                            },
                                            "Text": {
                                                "val": "- Develop the use of seismo-acoustic arrays as test diagnostics (both hardware and algorithms) and tools for assessing decoupling\/coupling.\n- Continue reconstitution of instrumentation and diagnostics sensors infrastructure capabilities in support of Counter-WMD technology development projects.\n- Continue additional diagnostics, instrumentation, and explosives handling research in support of other testing and compliance initiatives.\n- Support Combatant Commands with development and testing of Chemical , Biological, Radiological, Nuclear, and High-Explosive (CBRNE) sensors and WMD countermeasures being developed to support Combatant Command requirements.\n- Support exercises and planning events at the Nevada Test Bed in order to develop existing defeat technologies, tools, and capabilities.  Further extend testing at the Nevada National Security Site in support of the National Center for Nuclear Security portfolio’s nonproliferation efforts.\n- Continue to design and build testbeds in small-, mid-, and large-scale environments capable of capturing data needed to improve and validate high-fidelity modeling and simulation tools used to predict weapons effects on WMD storage facilities.\n- Provide development, maintenance, upgrades, and testing for Autonomous Systems Test Development to support an adaptable test bed for standardized evaluation of autonomous systems in development for CWMD missions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.816"
                                            },
                                            "Text": {
                                                "val": "- Develop seismo-acoustic arrays as test diagnostics (both hardware and algorithms) and tools for assessing decoupling\/coupling.\n- Continue reconstitution of instrumentation and diagnostics of sensor infrastructure capabilities in support of CWMD technology development projects.\n- Conduct diagnostics, instrumentation, and explosives handling research in support of other testing and compliance initiatives.\n- Develop and test WMD and explosives sensors and WMD countermeasures to support Combatant Command (CCMD) requirements.\n- Expand existing defeat technologies, tools, and capabilities for signature characterization in support of exercises and planning events at the Nevada Test Bed.\n- Design and build testbeds in small-, mid-, and large-scale environments capable of capturing data needed to improve and validate high-fidelity modeling and simulation tools used to predict weapons effects on WMD storage facilities.\n- Provide development, maintenance, upgrades, and testing for Autonomous Systems Test\nDevelopment to support an adaptable test bed for standardized evaluation of autonomous systems in development for CWMD missions.\n- Develop the test infrastructure to test transportable system to identify signature characterization that supports existing defeat technologies, tools, and capabilities.\n- Design and develop a data architecture that provides for the integration of RD department data from multiple RDT&E programs into an enterprise storage solution, curate compiled data from T&E events and move to an existing data center, develop portals for interagency access to data, and execute three initial data analytics demonstrations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.156"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.156"
                                            },
                                            "Text": {
                                                "val": "- Develop seismo-acoustic arrays as test diagnostics (both hardware and algorithms) and tools for assessing decoupling\/coupling.\n- Continue reconstitution of instrumentation and diagnostics of sensor infrastructure capabilities in support of CWMD technology development projects.\n- Develop additional diagnostics, instrumentation, and explosives handling research in support of other testing and compliance initiatives.\n- Develop and test WMD and explosives sensors and WMD countermeasures to support CCMD requirements.\n- Develop existing defeat technologies, tools, and capabilities for signature characterization in support of exercises and planning events at the Nevada Test Bed.\n- Design and build testbeds in small-, mid-, and large-scale environments capable of capturing data needed to improve and validate high-fidelity modeling and simulation tools used to predict weapons effects on WMD storage facilities.\n- Provide development, maintenance, upgrades, and testing for Autonomous Systems Test Development to support an adaptable test bed for standardized evaluation of autonomous systems in development for CWMD missions.\n- Develop the test infrastructure to test transportable system to identify signature characterization that supports existing defeat technologies, tools, and capabilities.\n- Develop tools and data analytics for delivery to CCMDs in direct response to existing capability gaps.  \n- Complete data architecture implementation to enable interagency partnerships at an unclassified level.  \n- Complete development of portals for all identified external collaborations.\n- Perform two data analytics demonstrations and deliver two additional tools to the CCMDs."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2020 to FY 2021 is due to inflation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive selection of most appropriate performers to fulfill science and technology development needs."
                        }
                    }
                }
            ]
        }
    }
}