{
    "id": "2021-MissileDefenseAgency-PB-0400-MJBOOK-0-0-7d3286c6d6c83eae374988fa997ec69c221bc4f1bf396f11d118c2df880530ec-0",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-MDA-U_RDTE_MasterJustificationBook_Missile_Defense_Agency_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Missile_Defense_Agency_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Missile Defense Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603176C"
        },
        "ProgramElementTitle": {
            "val": "Advanced Concepts and Performance Assessment"
        },
        "R1LineNumber": {
            "val": "30"
        },
        "MdapCode": {
            "val": "362"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Missile Defense Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "58.079"
            },
            "PriorYear": {
                "val": "12.720"
            },
            "CurrentYear": {
                "val": "46.201"
            },
            "BudgetYearOne": {
                "val": "14.910"
            },
            "BudgetYearOneBase": {
                "val": "14.910"
            },
            "BudgetYearTwo": {
                "val": "15.178"
            },
            "BudgetYearThree": {
                "val": "16.205"
            },
            "BudgetYearFour": {
                "val": "16.879"
            },
            "BudgetYearFive": {
                "val": "17.300"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The increase from FY 2019 to FY 2020 and decrease from FY 2020 to FY 2021 reflects the FY 2020 Congressional add for advanced cyber capabilities and cybersecurity of left through right of launch."
        },
        "ProgramElementMissionDescription": {
            "val": "The Advanced Concepts and Performance Assessment (ACPA) Program Element delivers an integrated government concept definition, simulation, and analysis capability.  ACPA's focus is on the exploration of novel and\/or emerging capabilities that may have the potential to enhance the  Missile Defense System (MDS).  ACPA centralizes assessment of advanced missile defense technology and delivers insight into the performance of proposed concepts extending the Missile Defense Agency's (MDA) ability to address evolving threats for the Warfighter.\n\nSubject Matter Experts (SMEs) provide independent assessments of government, university, and industry technology concepts, used in concert with systems engineering requirements, to support acquisition strategy decisions and define technology focus areas.  The innovative structured concept definition and assessment methodology enables MDA to quickly validate focus areas, verify contractor technology solutions, and evaluate promising concepts in future MDS architectures. This methodology significantly enhances MDA's ability to assess technology concepts while decreasing the cost of development through:\n\n- Independent model-based simulations of industry technology concepts to inform the systems engineering process\n- Digital simulation and hardware-in-the-loop performance assessments of algorithms and hardware concepts prior to expensive live fire test events\n- End-to-end testing of technology concepts integrated with weapon systems and Command, Control, Battle Management and Communications (C2BMC)\n\nPerformance assessment of advanced concepts is the key enabler for Government evaluation of concepts in the earliest stages of technology development and maximizes the efficiency of technology investments.  Performance assessment is used to quantify capability expectations of innovative concepts to counter the expanding regional and homeland missile threats, including ballistic and cruise missiles, and hypersonic vehicles."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "13.017"
                },
                "CurrentYear": {
                    "val": "14.208"
                },
                "BudgetYearOne": {
                    "val": "14.904"
                },
                "BudgetYearOneBase": {
                    "val": "14.904"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "12.720"
                },
                "CurrentYear": {
                    "val": "46.201"
                },
                "BudgetYearOne": {
                    "val": "14.910"
                },
                "BudgetYearOneBase": {
                    "val": "14.910"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.297"
                },
                "CurrentYear": {
                    "val": "31.993"
                },
                "BudgetYearOne": {
                    "val": "0.006"
                },
                "BudgetYearOneBase": {
                    "val": "0.006"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "31.993"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.297"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Missile Defeat and Defense Enhancement"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.006"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.006"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase in FY 2020 reflects the Congressional add for advanced cyber capabilities and cybersecurity of left through right of launch."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MD71"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Concepts and Performance Assessments"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "55.660"
                        },
                        "PriorYear": {
                            "val": "11.350"
                        },
                        "CurrentYear": {
                            "val": "11.552"
                        },
                        "BudgetYearOne": {
                            "val": "11.637"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.637"
                        },
                        "BudgetYearTwo": {
                            "val": "11.872"
                        },
                        "BudgetYearThree": {
                            "val": "12.086"
                        },
                        "BudgetYearFour": {
                            "val": "12.444"
                        },
                        "BudgetYearFive": {
                            "val": "12.709"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "N\/A"
                        },
                        "ProjectMissionDescription": {
                            "val": "Advanced Concepts and Performance Assessments (ACPA) centralizes advanced technology concept modeling, simulation, software, and analysis.  Integrating models of promising disruptive technical solutions into  Missile Defense System (MDS) system-level simulations enables leadership to make data driven acquisition and technology investment decisions. Concepts that improve or adapt existing systems, that incorporate mobile sensors and interceptors that can be surged into zones of crisis or conflict are also deemed disruptive. Examples of efforts required to quantify the contribution of disruptive technologies may include, but not be limited to environmental experimentation and phenomenological characterization required for new sensor concepts, advanced weapon technologies, and emerging directed energy concepts.  Coupled with these characterization efforts, ACPA develops innovative left-through-right-of-launch modeling capabilities including physics-based representations in the areas of cyber, sensor technologies, lethality and survivability, communications, and sensor support.  ACPA is focusing on Science and Technology initiatives which increase interoperability and leverages expertise with Allied and Service partners.  \n\nACPA capitalizes on the innovation of small businesses, universities, Federally Funded Research and Development Centers (FFRDCs), and University Affiliated Research Centers (UARCs) to pursue a broad range of hardware, software, models, algorithms, trade studies, and analysis.  These innovations bring together government developed models representing existing and future missile defense architectures, technology concepts, and advanced algorithms to provide detailed assessments of concept performance and inform investment decisions. These innovations, combined with a robust high performance computing infrastructure, provide a unique in-house government capability to demonstrate and assess technology concepts for emerging technology risk reduction, to mature concepts with laboratory, ground, and flight test data, and where possible, apply concepts in simulated exercises with weapon systems across representative communication architectures."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Concepts and Performance Assessment"
                                    },
                                    "Description": {
                                        "val": "Provide quantitative assessments that define the benefits of technology investments and inform requirements using an integrated concept definition, simulation, and performance analysis capability.  A staff of diverse Subject Matter Experts (SMEs) delivers independent government performance evaluations which exercise kinetic and non-kinetic missile defense concept representations against the broad spectrum of evolving threats.  \n\n- Assess forward-and ground-based airborne electro-optical infrared and advanced sensors\n- Provide independent government assessments of industry sensor, directed energy and weapon system technology concepts\n- Evaluate lethality impacts from emerging concepts\n- Examine directed energy pathfinder solutions\n- Study low earth orbit satellite capabilities\n- Assess and identify promising boost phase intercept capabilities\n- Perform concept performance against emerging advanced threats including hypersonic threat testing scenarios\n- Mature advanced technology concepts through lab, ground, and flight test data\n- Apply concepts in simulated exercises with weapon systems \n- Work with the MDS Architect and Missile Defense Agency (MDA) Systems Engineer to design concepts, build models and assess technology concepts for the future MDS \n- Develop and extend modeling techniques\n- Focus research and engineering activities from university and small business partners to identify suitable technology and concepts that improve MDS performance through a rapid innovation model based on an engineering test bed\n- Assess multi-domain data fusion concept for current or future weapon systems.\n\nSpecific and\/or unique accomplishments to each FY are as follows:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.350"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.552"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Due to the evolving nature of the threat, ACPA's diverse staff of SMEs develops advanced concepts across a broad spectrum of missile defense technology initiatives.  Concept assessment initiatives identified above will be matured and coupled with increased emphasis on the following: \n\n- Quantify the contribution of emerging concepts by integrating representative performance with Command and Control, Battle Management, Communications (C2BMC) networks (eg. MDA C2BMC, Integrated Air and Missile Defense, Cooperative Engagement Capability, Artificial Intelligence (AI) enabling end-to-end capability demonstrations with weapon systems) \n- Develop the computing infrastructure for AI Test bed and the development of deep neural networks to exercise advanced algorithms and assess potential applications to machine learning\n- Extend the Government's capability to evaluate engagement decision timelines and evaluate concept of operations that could possibly expand engagement opportunities \n- Develop an initial integrated modeling and analysis capability to assess new technology concepts associated with the complex interactions between left through right of launch integration\n- Address the capability gap in testing\/simulation of advanced sensors in a credible environment by developing an advance photonics test bed capable of providing foundational truth for advanced sensor performance assessment of industry concepts\n- Develop Cyber test bed environment to enable the ability to model cyber-attacks and their impact on affected systems, understand the characteristics of cyber-attacks and how they come about, gain insight into network vulnerability and develop improved security strategies.\n- Identify cooperative initiatives to leverage Allied and Service Partners contributions and focus on expanding opportunities for collaboration on missile defense Science and Technology initiatives."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.637"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.637"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "See Above."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603178C"
                                    },
                                    "Title": {
                                        "val": "Weapons Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "13.400"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603180C"
                                    },
                                    "Title": {
                                        "val": "Advanced Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "42.100"
                                        },
                                        "CurrentYear": {
                                            "val": "27.674"
                                        },
                                        "BudgetYearOne": {
                                            "val": "18.687"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "18.687"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.883"
                                        },
                                        "BudgetYearThree": {
                                            "val": "18.975"
                                        },
                                        "BudgetYearFour": {
                                            "val": "19.720"
                                        },
                                        "BudgetYearFive": {
                                            "val": "20.222"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603294C"
                                    },
                                    "Title": {
                                        "val": "Common Kill Vehicle Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "55.549"
                                        },
                                        "CurrentYear": {
                                            "val": "13.600"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11.058"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11.058"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.996"
                                        },
                                        "BudgetYearThree": {
                                            "val": "11.052"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.290"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11.563"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Employ various contracting strategies in a flexible manner to maximize the contribution to MDA.  Execute through utilization of small businesses, leverage the Nation's engineering centers of excellence (FFRDCs and UARCs); generate cooperatives with other Government Agencies to provide concept modeling and assessment capability.  This strategy uses agency and partner SMEs and government model-based assessments to inform Better Buying Power acquisition decisions."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MD40"
                    },
                    "ProjectTitle": {
                        "val": "Program-Wide Support"
                    },
                    "SpecialProject": {
                        "val": "1"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "2.419"
                        },
                        "PriorYear": {
                            "val": "0.605"
                        },
                        "CurrentYear": {
                            "val": "0.605"
                        },
                        "BudgetYearOne": {
                            "val": "0.592"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.592"
                        },
                        "BudgetYearTwo": {
                            "val": "0.602"
                        },
                        "BudgetYearThree": {
                            "val": "0.652"
                        },
                        "BudgetYearFour": {
                            "val": "0.864"
                        },
                        "BudgetYearFive": {
                            "val": "0.944"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "PWS contains non-headquarters management costs in support of MDA functions and activities across the entire MDS. These functions include Government Civilians and Contract Support Services. This effort provides integrity and oversight of the MDS as well as supports MDA in the development and evaluation of technologies that will respond to the changing threat. Additionally, PWS includes personnel to support global deployments performing deployment site preparation and activation, and provides facility capabilities for MDA Executing Agent locations worldwide. Other MDA wide costs include: physical and technical security; civilian drug testing; audit readiness; the Science, Technology, Engineering, and Mathematics (STEM) program; legal services and settlements; travel and agency training; office, equipment, vehicle, and warehouse leases; utilities and base operations across multiple geographic locations; commercial and ancillary facility services; management of all facility aspects regardless of lifecycle stage; supplies and maintenance; compliance with statutory environmental requirements; data and unified communications support; materiel and readiness and central property management of equipment; Facilities Sustainment, Restoration and Modernization (FSRM) program, (formerly Real Property Maintenance) to keep the Department's inventory of facilities in good working order; and similar operating expenses. PWS is allocated on a pro-rata basis across most Agency PEs and therefore fluctuates per PE by fiscal year based on the total Agency budget in that fiscal year."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MC71"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Operations"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.765"
                        },
                        "CurrentYear": {
                            "val": "34.044"
                        },
                        "BudgetYearOne": {
                            "val": "2.681"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.681"
                        },
                        "BudgetYearTwo": {
                            "val": "2.704"
                        },
                        "BudgetYearThree": {
                            "val": "3.467"
                        },
                        "BudgetYearFour": {
                            "val": "3.571"
                        },
                        "BudgetYearFive": {
                            "val": "3.647"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "50.879"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "The increase from FY 2019 to FY 2020 and decrease from FY 2020 to FY 2021 reflects the Congressional add for advanced cyber capabilities and cybersecurity of left through right of launch."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports the monitoring and tracking of Cybersecurity mitigations as required in the Department of Defense (DoD) Instruction Number 8510.01 which establishes Risk Management Framework (RMF) requirements for DoD Information Technology (IT).  Funds in this project implement and sustain DoD-required RMF and associated Controls Validation Testing (CVT) activities, analysis of validation results, risk assessments and reviews of proposed Program Manager\/Information Assurance System Security Manager (ISSAM) Plans of Action and Milestones for enabling modeling and simulation mission systems.  This project captures the RMF documentation (artifacts, validation results, Information Assurance (IA) risk assessment results, and MDA authorizing official and chief information officer accreditation decisions) into the Defense Information Systems Agency's Enterprise Mission Assurance Support Service system.  Hardware and software upgrades required to meet DoD standards are supported by funding in this project. Independent verification and validation team actions ensure the availability, integrity, authentication, confidentiality and non-repudiation of the MDA mission, test and administrative systems.  Activities in the project are necessary to comply with the Federal Information Security Management Act."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Information Assurance \/ Cyber Network Defense"
                                    },
                                    "Description": {
                                        "val": "Funds network defense and ISSAM activities including: \n- Conduct cybersecurity\/IA engineering and architecture planning \n- Plan and test IA controls  \n- Develop DoD RMF certification and accreditation packages\n- Conduct controls validation testing of systems and provide plan of action and milestones to mitigate IA deficiencies \n- Conduct annual IA reviews to assess compliance in implementing and maintaining IA controls\n\nSpecific and\/or unique accomplishments to each FY are as follows:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.765"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "34.044"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "In addition to baseline efforts identified above emphasis in FY 2020 will be expanded to:\n- Explore cyber effects on emerging technology concepts\n- Sustain and improve IT toolsets, maintain hardware currency, and sustain the IT and IA workforce"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.681"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.681"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "See Above."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2020 to FY 2021 reflects the FY 2020 Congressional add for advanced cyber capabilities and cybersecurity of left through right of launch."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}