{
    "id": "2021-Army-PB-2040-JBOOK-8f7fdbb59cb85b132b0478715b87ff02c7eb359f73f79d73e48c9151ed5a28f2-8",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603015A"
        },
        "ProgramElementTitle": {
            "val": "Next Generation Training & Simulation Systems"
        },
        "R1LineNumber": {
            "val": "51"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "27.711"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "27.711"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year 2020 (FY20) this Program Element (PE) was realigned with continuity of effort to the following PE:\n?\t0603118A Soldier Lethality Advanced Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE matures and demonstrates tools to enable effective training capability for the Warfighter. Project S28 matures and demonstrates simulation technologies developed by the Institute for Creative Technologies (ICT) at the University of Southern California. Project S29 incorporates advanced modeling and simulation (M&S), training, and leader development technology into immersive training demonstrations as well as demonstrates a framework for future embedded training and simulation systems for future force combat and tactical vehicles, and dismounted Soldier systems. Project S31 develops, integrates and demonstrates an overarching M&S architecture that incorporates multi-resolution, entity-based models, simulations, and tools to enable Network-Centric Warfare M&S capability.  \n  \nWork in this PE complements and is fully coordinated with efforts in PE 0602308A (Advanced Concepts and Simulation), PE 0602785A (Manpower\/Personnel\/Training Technology), PE 0602787A (Medical Technology) and PE 0603007A (Manpower, Personnel and Training Advanced Technology). \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy. FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork is performed by the United States Army Futures Command."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "28.65"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "27.711"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.939"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.939"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S28"
                    },
                    "ProjectTitle": {
                        "val": "Immersive Learning Environments"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "3.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates immersive technologies that include the application of photorealistic synthetic environments, multi-sensory interfaces, virtual humans, and training applications on low-cost game platforms for Soldier training applications using simulation technologies. This Project uses advanced modeling, simulation, and leadership development techniques to leverage the emerging immersive technologies that are created at the Institute for Creative Technologies (ICT) University Affiliated Research Center (UARC) at the University of Southern California to develop training demonstrators. These demonstrators focus on urban operations, asymmetric warfare, resilience and rehabilitation to support Warfighting units and Army Institutions (Army Training and Doctrine Command (TRADOC) and Army Medical Command (MEDCOM)). Resilience and rehabilitation research will focus on Post Traumatic Stress Disorder (PTSD). The ICT's collaboration with its entertainment partners creates a true synthesis of creativity and technology that harnesses the capabilities of industry, and the research and development community to advance the Army's capabilities.\n\nThe cited work is consistent with the Science and Technology priorities of the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nIn Fiscal Year 2019 (FY19), this Project received a congressional add ($3.0 Million). There are no planned efforts beyond FY19 for this Project."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program increase - Immersive Learning Environments"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "3"
                                        },
                                        "Text": {
                                            "val": "Program increase - Immersive Learning Environments"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S29"
                    },
                    "ProjectTitle": {
                        "val": "Modeling & Simulation - Adv Tech Dev"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.495"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "16.495"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0603118A Soldier Lethality Advanced Technology:\n*Project BC8 Training Advanced Technology (Other than Synthetic Training Environment (STE))\n*Project BE9 Synthetic Training Environment (STE) technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates next generation training and simulation systems that integrate virtual threats, asymmetric warfare concepts, network-centric operations, and embedding training capabilities as well as technologies into operational go-to-war future force systems to include dismounted warrior systems. The synergy between these embedded training capabilities and the immersive training advanced technology development in Project S28 (Immersive Learning Environments) provides Army units with a set of complementary embedded as well as deploy-on-demand systems that provide just-in-time, dynamic, realistic training, and mission rehearsal capabilities. Demonstrations include technologies that form a framework for future training applications for the range of future force operations such as robotic control and other sensor operations; mission planning and rehearsal; maneuver; Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) network analysis to support distributed simulations; and vehicle system interface requirements. This Project creates a joint environment by synchronizing virtual and constructive simulated forces with the next generation and current training systems from the Army, Navy, Air Force, and Marine Corps forces.   \n\nThe cited work is consistent with the science and technology (S&T) priorities of the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY20 realignments are due to financial restructuring in support of Army Modernization Priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Training Effectiveness"
                                    },
                                    "Description": {
                                        "val": "This research addresses the effectiveness of training Soldiers and teams in immersive environments.  This effort will research and develop simulations to determine the interaction of realism, immersion, acceptance, and training effectiveness.  A baseline of the key dimensions of realism and immersion for current training systems will be developed and will be extended to generate guidelines for the development of future training technologies.  Cost effectiveness of these training components will also be considered."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.3"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated automated training performance assessment algorithms for individuals in virtual training environments; provided a baseline of measures and methods for use in assessing effectiveness of collective training for a subset of technologies used in various training environments (mixed reality and live); identified impacts and tradeoffs associated with effectiveness of collective training using current (training) simulation architectures and the expected effectiveness of collective training associated with using future training technologies (mixed reality and live)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mixed and Augmented Reality"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates mixed and augmented reality technologies that seamlessly blend synthetic and real environments to provide a more realistic training environment for Soldiers. Efforts matured by this effort transition to Program Executive Office Simulation, Training and Instrumentation (PEO-STRI)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.151"
                                            },
                                            "Text": {
                                                "val": "Matured and began internal demonstrations of Augmented Reality subcomponents such as advanced optics for the helmet mounted display, occlusion, and increased computational of the man-wearable computer to reduce size, weight, power, and cooling while also reducing logistics to enable a future augmented reality training environment that can represent the complexities of the future operational environment within which soldiers must operate."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mixed and Augmented Reality for Complex Environments"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates the models and simulations that enable immersive training in future complex operational environments involving megacity terrain and unmanned autonomous systems. These technologies support the Army capability needs for the soldier to have better asymmetric vision and decide faster for dismounted soldiers in a complex urban environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.144"
                                            },
                                            "Text": {
                                                "val": "Matured modeling and simulations for megacities environments that will be used for urban interactive immersive training capability, components included the simulated terrain environment representing complex and dense urban environments as well as manned\/unmanned teaming models; matured the components of the dismounted soldier augmented reality visual system and occlusion algorithms for manned\/unmanned teaming training operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Synthetic Training Environment Acceleration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates technologies to enable a Synthetic Training Environment which is a single, interconnected training system in which units from squad through ASCC can train in the most appropriate domain - live, virtual, constructive, and gaming, or in all four simultaneously."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.894"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated training simulation software technologies, which enable the representation of a relevant Multi Domain Battle (MDB) within a global terrain, in direct support of the Army?s synthetic training environment; optimized the use of distributed computing and cloud infrastructures to demonstrate dynamic content updates (e.g. terrain) and point-of-need training, including the maturation of human-machine interfaces; exploited the maturations in fidelity of the global terrain, the increase in simulated entities and increase concurrent role-players for demonstration in a relevant collective training exercise."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.006"
                                            },
                                            "Text": {
                                                "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S31"
                    },
                    "ProjectTitle": {
                        "val": "Modeling And Simulation Infrastructure Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.216"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "8.216"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0603118A Soldier Lethality Advanced Technology: \n*Project BC4 Soldier Decision Making & Comms Performance Advanced Technology\n*Project BC8 Training Advanced Technology (Other than Synthetic Training Environment (STE))\n*Project BE9 STE Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates a distributed modeling and simulation (M&S) environment that integrates a collection of multi-fidelity models and simulations and tools that map to an evolving architecture and M&S activities to support decisions throughout the acquisition life-cycle. This provides a unifying M&S architecture that synchronizes and integrates multi-resolution modeling applications such as Live, Virtual, and Constructive (LVC) experimentation. This effort focuses on researching cutting-edge M&S methods to enable the Army and the Department of Defense (DoD) to perform critical System of Systems (SoS) analysis, experimentation, technology tradeoffs, capability assessments, concept development, and training that saves time and resources while increasing the effectiveness of acquisition and training activities.  \n\nEfforts in this Project support the Under Secretary of Defense for Research and Engineering science and technology (S&T) priorities and the Army Modernization Strategy. \n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Simulation Tools and Models"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates M&S technologies and techniques that support training and experimentation to assess and support system acquisition and military planning decision-making and System of Systems architecture, technology tradeoffs, etc.  This research transitions to the United States Army Program Executive Office for Simulation, Training and Instrumentation (PEO STRI)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.216"
                                            },
                                            "Text": {
                                                "val": "Demonstrated simulation architecture technologies for a single synthetic environment that supports multiple M&S Communities in a relevant context; optimized composable modeling methods focused on broad model reuse; improved repeatable measurement methodologies for human behavior modeling; refined visualization and interaction technologies that improve human-computer interaction for training simulation; matured cyber data exchange models to enhance synthetic and live integrated training."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Early Human Systems Integration Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort will mature and demonstrate state of the art methods, tools and techniques to integrate human systems integration (HSI) early in the S&T and requirements analysis process to ensure effective and efficient design and development of future Soldier systems.  The goal of this effort is to demonstrate the effect early HSI can have on developing the most effective, efficient, and affordable design and on predicting and improving total system performance.  This effort is coordinated with the United States Army Human Systems Integration Directorate, G1."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Developed enhanced Soldier performance metrics and training development tools; identified technologies to improve early system design using Soldier-centered design tools and systems engineering architecture."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}