{
    "id": "2021-Army-PB-2040-JBOOK-8f7fdbb59cb85b132b0478715b87ff02c7eb359f73f79d73e48c9151ed5a28f2-26",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603466A"
        },
        "ProgramElementTitle": {
            "val": "Air and Missile Defense Advanced Technology"
        },
        "R1LineNumber": {
            "val": "69"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0"
            },
            "CurrentYear": {
                "val": "82.113"
            },
            "BudgetYearOne": {
                "val": "58.130"
            },
            "BudgetYearOneBase": {
                "val": "58.130"
            },
            "BudgetYearTwo": {
                "val": "53.396"
            },
            "BudgetYearThree": {
                "val": "56.188"
            },
            "BudgetYearFour": {
                "val": "46.280"
            },
            "BudgetYearFive": {
                "val": "46.600"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "342.707"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) continued efforts previously funded in the following PEs:\n* PE 0603004A Weapons and Munitions Advanced Technology\n* PE 0603313A Missile and Rocket Advanced Technology \n* PE 0603734A Military Engineering Advanced Technology \n* PE 0603772A Advanced Tactical Computer Science and Sensor Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "Work in this PE matures demonstrates technology in support of Army Modernization Priority Air and Missile Defense by maturating, demonstrating and conducting system level experimentation for the development of advanced air defense technologies that reduce the cost curve of missile defense, restore overmatch, survive volley-fire attacks, and operate within sophisticated Anti-Access\/Area Denial (A2\/AD) and contested domains.\n\nWork in this PE complements PE 0602150A (Air and Missile Defense Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. All FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork is performed by the U.S. Army Futures Command (AFC), the United States Army Space and Missile Defense Command\/Army Forces Strategic Command (SMDC\/ARSTRAT), and the Engineer Research and Development Center (ERDC), and the United States Army Rapid Capabilities and Critical Technologies Office (RCCTO)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "60.613"
                },
                "BudgetYearOne": {
                    "val": "60.98"
                },
                "BudgetYearOneBase": {
                    "val": "60.98"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "82.113"
                },
                "BudgetYearOne": {
                    "val": "58.13"
                },
                "BudgetYearOneBase": {
                    "val": "58.13"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "21.5"
                },
                "BudgetYearOne": {
                    "val": "-2.85"
                },
                "BudgetYearOneBase": {
                    "val": "-2.85"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "21.5"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.85"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.85"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY21 increase due to congressional adds of $21.000 Million"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "AC8"
                    },
                    "ProjectTitle": {
                        "val": "Low Cost Extended Range Air Defense Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "21.05"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "21.050"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20) this Project was realigned from:\nProgram Element (PE) 0603313A Missile and Rocket Advanced Technology\n* Project 704 Advanced Missile Demo\n\nIn FY21 this project is realigned to :\nPE 0603466A Air and Missile Defense Advanced Technology\n* Project AD4 Maneuver Air Defense Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project directly supports Army Modernization Priority Air and Missile Defense capabilities. Matures and demonstrates key missile technologies for a lower-cost interceptor system to address advanced air defense threats such as medium to large unmanned aerial systems (UAS) and sub-sonic cruise missile systems.\n\nWork in this Project complements missile Applied Research efforts within PE 0602150A (Air and Missile Defense Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. All FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the United States (U.S.) Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Low Cost Extended Range Air Defense (LowER AD) Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "Mature and demonstrate key missile technologies for a lower-cost interceptor system to address advanced air defense threats such as medium to large unmanned aerial systems (UAS) and sub-sonic cruise missile systems"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.05"
                                            },
                                            "Text": {
                                                "val": "Will integrate motor, airframe, mission computer, power supply, telemetry, and data link as an interceptor for demonstrating initial capability in two Ballistic Test Vehicle (BTV) flight tests. These tests will provide verification of component operation and aerodynamic parameters in a relevant environment. The control actuation system (CAS) and inertial measurement unit (IMU) will be integrated with the interceptor to demonstrate control authority and aerodynamic characterization in a Control Test Vehicle (CTV). Will continue maturation of guidance and fuzing algorithms, and verify Guidance Electronic Unit (GEU) performance from pre-flight predictions for CTV and guided test vehicle (GTV) in the Hardware-in the-Loop (HWIL)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY21 funding realigned into PE 0603466A (Air and Missile Defense Advanced Technology) \/ AD4 (Maneuver Air Defense Technology) to focus development of seeker and guidance technology in  and accelerate demonstration in support of Maneuver-Short Range Air Defense capabilities."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AD1"
                    },
                    "ProjectTitle": {
                        "val": "High Energy Laser Tactical Vehicle Demo Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "29.914"
                        },
                        "BudgetYearOne": {
                            "val": "27.241"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.241"
                        },
                        "BudgetYearTwo": {
                            "val": "27.68"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "84.835"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20) this effort was realigned from:\nProgram Element (PE) 0603004A Weapons and Munitions Advanced Technology\n* Project L96 High Energy Laser Technology Demo"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates a greater than 100 kW-class mobile high energy laser (HEL) weapon system on a tactical platform to protect fixed and semi-fixed sites from rocket, artillery and mortar (RAM), unmanned aerial system (UAS), and advanced air defense threats. The major effort under this Project is the phased approach for mobile high power solid state laser (SSL) technology demonstrations that are traceable to the form, fit, and function requirements for a HEL weapon. This effort utilizes open systems architecture to ensure  growth, interoperability, and opportunity for technology insertions for maturation of laser, beam control, sensor\/radar, integration of power and thermal management  subsystems, as well as Battle Management Command, Control, and Computers (BMC3).\n\nWork in this Project complements PE 0602150A (Air and Missile Defense Technology)\/ Project AC9 (High Energy Laser Tactical Vehicle Demonstrator Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, and the Army Modernization Strategy, and supports the Army's future capability opportunities for leap-ahead technology for directed energy.\n\nWork is performed by the United States (US) Army Rapid Capabilities and Critical Technologies Office (RCCTO)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Energy Laser Tactical Vehicle Demonstrator (HEL TVD) Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "This effort integrates and demonstrates HEL technologies on an Army tactical platform for transition to the future Indirect Fire Protection Capability Increment 2-Intercept Program of Record. Effort includes integrating technologies developed under PE 0602307A\/AC9 into HEL TVD and demonstrating the system against an array of RAM and UAS targets.  Technology and knowledge gained from demonstration will used to inform prototyping decisions by Army Rapid Capabilities and Critical Technologies Office and future material development decisions by Program Executive Office Missiles and Space."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "29.914"
                                            },
                                            "Text": {
                                                "val": "Will begin integration and laboratory checkout of the HEL TVD subsystems. Will integrate the electrical and thermal management subsystems into the HEL TVD platform, a family of medium tactical vehicles (FMTV). Will begin integration of system software to control all subsystems that will validate software functionality. Will begin test range coordination for HEL TVD FY22 demonstration to include range and non-range truth data sensors and purchase first RAM and UAS targets for system demonstrations and knowledge points."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.241"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.241"
                                            },
                                            "Text": {
                                                "val": "Will begin integration and checkout of the HEL TVD subsystems. Will integrate the electrical and thermal management subsystems into the HEL TVD platform.  Will begin integration of system software in preparation for FY22 HEL TVD demonstration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned life cycle of this effort"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AD4"
                    },
                    "ProjectTitle": {
                        "val": "Maneuver Air Defense Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "20.131"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.131"
                        },
                        "BudgetYearTwo": {
                            "val": "19.981"
                        },
                        "BudgetYearThree": {
                            "val": "22.67"
                        },
                        "BudgetYearFour": {
                            "val": "12.381"
                        },
                        "BudgetYearFive": {
                            "val": "12.382"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "87.545"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2021 (FY21) this Project was realigned from:\nProgram Element (PE) 0603466A Air and Missile Defense Advanced Technology\n* Project AC8 Low Cost Extended Range Air Defense Adv Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project directly supports Army Modernization Priority Air and Missile Defense capabilities. Matures and demonstrates key missile technologies for an affordable short range interceptor to defeat advanced Maneuver-Short Range Air Defense (M-SHORAD) threats (e.g. Rotary Wing, Fixed Wing, Tactical \/ Lethal Unmanned Aerial Systems, and Subsonic Cruise Missile.\n\nWork in this Project complements PE 0602150A (Air and Missile Defense Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. All FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Maneuver Air Defense Advanced  Technology"
                                    },
                                    "Description": {
                                        "val": "Mature and demonstrate missile technologies and components necessary for an affordable short range air defense interceptor capability to defeat Rotary Wing, Fixed Wing, Tactical \/ Lethal Unmanned Aerial System, and cruise missile threats."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.131"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.131"
                                            },
                                            "Text": {
                                                "val": "Will integrate a Guidance Electronics Unit (GEU) for missile hardware-in-the-loop (HWIL) maturation prior to integration with a testbed missile.  Will integrate GEU with a radome, airframe, motor, control actuation system for flight testing and demonstration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding realigned from Project AC8 (Low Cost Extended Range Air Defense Adv Tech) in this PE in FY21 to accelerate Maneuver Air Defense Technology TRL6 demonstration from FY24 to FY23. \n\nIntegrates a Guidance Electronics Unit for Missile Hardware-in-the-loop maturation prior to integration with a testbed missile."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AD6"
                    },
                    "ProjectTitle": {
                        "val": "Next Generation Fires Radar Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "7.729"
                        },
                        "BudgetYearOne": {
                            "val": "6.958"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.958"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "14.687"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from: \nProgram Element (PE) 0603772A Advanced Tactical Computer Science and Sensor Technology:\n* Project 243 Sensors and Signals Processing"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project directly supports Army Modernization Priority Air and Missile Defense capabilities by demonstrating scalable radar open systems architecture software allowing the insertion of modular software components.\n\nWork in this Project complements PE 0602150A (Air and Missile Defense Technology)\/ Project AD5 (Next Generation Fires Radar Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Next Generation Fires Radar Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates the architectures, processing and components necessary to deliver next generation capability, flexibility and supportability to the fires family of radar systems. Efforts focus on development of a modular and scalable open architecture that is extensible to multiple radar systems technologies in support of air defense and fixed- and semi-fixed site protection."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.378"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate Fires Radar Open System Technology architecture and back- end processing on the first version of Digital Array Radar Technology as well as other front end antenna configurations, as available, to verify scalability and modularity; Leverage the mode development efforts in FY19 (multi-mission, target identification, and multi-static) to complete a Mode Development Kit (MDK) that will be used to mature the interfaces of the open architecture backend; Continue development of the modes from FY19 to improve performance and optimize the multi-mission capability for future Fires radars; and Demonstrate additional Fires radar technology on different class (medium and light-weight) systems to provide multi-mode and multi-mission capabilities relevant to current and future radar systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.958"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.958"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate the complete Fires Radar Open System Technology architecture and back-end processing on the Full Digital Array Radar Testbed and other front end antenna configurations, as available, to verify scalability and modularity; will complete the MDK to improve the performance and optimize the multi-mission capability of next generation Fires radar system; will conduct final demonstrations of Fires radar technologies that will provide multi-mode and multi-mission capabilities relevant to current and future radar systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned life cycle of this effort"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.351"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AE1"
                    },
                    "ProjectTitle": {
                        "val": "Close Combat High Energy Laser Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "2.498"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.498"
                        },
                        "BudgetYearTwo": {
                            "val": "2.698"
                        },
                        "BudgetYearThree": {
                            "val": "31.32"
                        },
                        "BudgetYearFour": {
                            "val": "31.671"
                        },
                        "BudgetYearFive": {
                            "val": "31.99"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "100.177"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Fiscal Year 2021 (FY21) increase is the result of a Transition from:\nProgram Element (PE) 0602150A Air and Missile Defense Technology:\n* Project AD9 Close Combat High Energy Laser Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This funding matures and demonstrates technologies for compact, highly efficient lasers, and compact beam control for close-combat platforms. This project investigates and develops advanced technologies for High Energy Laser (HEL) weapon systems to enable more efficient laser systems with greater power output, which in-turn enables laser weapons on smaller platforms for additional missions. This includes technologies to support development of alternate laser sources, precision optical pointing and tracking components, adaptive optics to overcome laser degradation due to atmospheric effects, more compact and lighter weight energy generation and storage devices, and more efficient thermal management systems to remove excess heat. Work in this Project complements PE 0602150A (Air and Missile Defense Technology) \/ Project AD9 (Close Combat High Energy Laser Technology). \n\nWork in this Project complements PE 0602150A (Air and Missile Defense Technology)\/ Project AD9 (Close Combat High Energy Laser Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, and the Army Modernization Strategy, and supports the Army's future capability opportunities for leap-ahead technology for directed energy. \n\nWork is performed by the United States (US) Army Rapid Capabilities and Critical Technologies Office (RCCTO)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Close Combat High Energy Laser Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "This effort develops laser and beam control technologies with extremely low size, weight, and power (SWaP) requirements enabling high energy lasers in smaller, close combat platforms. Extremely low SWaP laser systems will expand the laser weapons mission set. Reduction in SWaP also benefits higher power systems on the large tactical vehicles to counter the current threat set as well as laser-hardened threats more quickly or at longer ranges."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.498"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.498"
                                            },
                                            "Text": {
                                                "val": "Will continue developing and validating laser and beam control technologies with extremely low SWaP to integrate on a risk reduction platform. Will perform systems engineering analyses, including beam director, environmental, and laser power trade studies; conduct modeling and simulation to inform system performance objectives; perform HEL lethality effectiveness analysis and static and live-fire testing against designated threats and\/or targets."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned life cycle of this effort"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AE3"
                    },
                    "ProjectTitle": {
                        "val": "Unconventional Countermeasures-Survivability ATech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "1.92"
                        },
                        "BudgetYearOne": {
                            "val": "1.302"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.302"
                        },
                        "BudgetYearTwo": {
                            "val": "3.037"
                        },
                        "BudgetYearThree": {
                            "val": "2.198"
                        },
                        "BudgetYearFour": {
                            "val": "2.228"
                        },
                        "BudgetYearFive": {
                            "val": "2.228"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "12.913"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20), this Project was realigned from:\nProgram Element (PE) 0603734A Military Engineering Advanced Technology \n* Project T08 Combat Eng Systems\n\nIn Fiscal Year 2021 (FY21), efforts in Applications of Environmentally-Inspired Unconventional Countermeasures are realigned from (PE) 0603119A (Ground Advanced Technology)\n* Project BM1 Protection from Advanced Weapon Affects Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates technologies to increase survivability of personnel and critical assets using integrated unconventional countermeasures. These countermeasures include tonedown concepts for signature management using novel materials, rapidly deployable, low-cost, multisprectral survivability enhancement technologies as well as intuitive decision support technologies to select and assess non-kinetic protective measures.\n\nWork in this Project complements PE 0602150A (Air and Missile Defense Technology) \/ Project AE2 (Unconventional Countermeasures Survivability Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Engineer Research and Development Center (ERDC) and coordinated with the Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Development of Unconventional Countermeasures for Enhanced Survivability (DeUCES) Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates countermeasures to detect and defeat near-peer advanced weapons through computational simulations and physical countermeasures and enhanced tonedown measures."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.897"
                                            },
                                            "Text": {
                                                "val": "Demonstrate novel tonedown techniques for critical fixed and semi-fixed assets to include novel application of commercial off the shelf materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.007"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.007"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate integrated unconventional countermeasure protection for fixed and semi-fixed Air and Missile Defense assets."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decrease due to realignment to support higher priority Army S&T efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Applications of Environmentally-Inspired Unconventional Countermeasures"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates rapidly-deployable, eco-friendly materials with spectral signatures that alter or obscure underlying target spectral signatures."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.295"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.295"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate a robust countermeasure spectral feature selection to detect and compare spectral vegetation ranges essential for the performance of unconventional countermeasures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change reflects planned life cycle of this effort"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.023"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BN7"
                    },
                    "ProjectTitle": {
                        "val": "Weapons Components Adv Technology (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "21.5"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "21.500"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional Interest Item funding provided for Weapons Components Advanced Technology."
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding provided for Weapons Components Advanced Technology.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Advanced Explosion Resistant Window Systems"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "2"
                                        },
                                        "Text": {
                                            "val": "Advanced Explosion Resistant Window Systems"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Silicon Carbide Power Electronics Packaging"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "2.5"
                                        },
                                        "Text": {
                                            "val": "Silicon Carbide Power Electronics Packaging"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enterprise Science and Technology Demonstration Prototyping"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "7"
                                        },
                                        "Text": {
                                            "val": "Enterprise Science and Technology Demonstration Prototyping"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High-Energy Laser Development for All-Terrain Vehicles"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "High-Energy Laser Development for All-Terrain Vehicles"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}