{
    "id": "2021-Army-PB-2040-JBOOK-7f1ee284016a103cbd6a4d63ea727aa617711f15268cf669f26149e7ae172ad5-31",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602782A"
        },
        "ProgramElementTitle": {
            "val": "Command, Control, Communications Technology"
        },
        "R1LineNumber": {
            "val": "37"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "51.685"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "51.685"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) is realigned, with continuity of effort realigned to the following PEs:\n* PE 0602146A Network C3I Technology\n* PE 0602213A C3I Applied Cyber"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE researches and investigates communications, mission command (MC), and electronics components, sub-components, software and protocols that provide the Army with enhanced capabilities for secure, mobile, networked communications, assured information delivery, and presentation of information that enables decision-making. Commercial technologies are continuously investigated and leveraged where possible. Project 779 researches and develops MC software, algorithms, protocols, architectures, and devices that enable management of information across the tactical and strategic battle space; provides automated cognitive reasoning and decision making aids; allows timely distribution, presentation\/display and use of MC data on Army platforms; and researches alternatives to Global Positioning System (GPS) for positioning, navigation and timing. Project CY2 investigates cyber electromagnetic activities (CEMA), cyber security devices, software and techniques to harden wireless communications networks against cyber-attacks and new mobile networking protocols that afford resilience within our networks to autonomically 'fight through' and\/or evade hostile cyber effects. Project H92 supports research in communications components, software, algorithms and protocols, which allow field commanders to communicate on-the-move to\/from virtually any location, through a seamless, secure, self-organizing, self-healing network.\n\nWork in this PE complements PE 0601104A (University and Industry Research Centers), PE 0602270A (EW Technology) , PE 0602705A (Electronics and Electronic Devices), PE 0603270A (EW Technology), PE 0603772A (Advanced Tactical Computer Science & Sensor Tech), and PE 0603794A (C3 Advanced Technology).\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "54.956"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "51.685"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.271"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.8"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.471"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "779"
                    },
                    "ProjectTitle": {
                        "val": "Command, Control And Platform Electronics Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.195"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "9.195"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned to:\nProgram Element (PE) 0602146A Network C3I Technology\n* Project AQ6 Command Applications of Machine Learning Technolog\n* Project AQ7 High Tempo Data Driven Decision Tools Technology\n* Project AQ9 Expeditionary Data to Decisions Technology\n* Project AV6 Airborne Engineering Support Technology\n* Project AW1 Autonomous Navigation Technology\n* Project AW3 DoD PNT M&S Collaborative Initiative (CI) Technology\n* Project AW5 Modular GPS Independent Sensors Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project researches moveable and mobile command post hardware and other components, software and algorithms that enable commanders at all echelons to have more accurate, useful, and timely information and allows them to execute mission command (MC) from anywhere on the battlefield. Emphasis is on advancements to MC computing platforms, with a specific emphasis on positioning, navigation, and timing (PNT); user\/computing platform interaction and cognitive burden reduction; informed operations; and commander-centric capabilities, including using automation to augment or supply staff capabilities. This Project researches technologies that support multi-modal man-machine interaction, battle space visualization, positioning and navigation in degraded environments (poor Global Positioning System (GPS) performance), automated cognitive decision aids, real-time collaborative tactical planning tools, open system architectures, and integration concepts which contribute to more efficient expeditionary and uninterrupted operations.\n\nWork in this Project is related to, and fully coordinated with PE 0603772A (Adv Tactical Computer Science & Sensor Technology) \/ Project 101 (Tactical Command and Control). \n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Assured Positioning, Navigation, and Timing (A-PNT)"
                                    },
                                    "Description": {
                                        "val": "This effort investigates positioning, navigation and timing sensor and sensor integration technologies to provide position, velocity, and time information to support operational and training requirements, especially in GPS denied\/degraded environments. This effort also designs PNT modeling and simulation (M&S) architectures, frameworks and models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.344"
                                            },
                                            "Text": {
                                                "val": "Researched and investigated new and novel GPS-independent sensors; investigate innovative ways to use exiting PNT sensors; designed and developed sensor fusion algorithms; developed portable sensor fusion core, allowing for a platform-agnostic solution for navigation in GPS denied or degraded environments that can be tailored based on mission or size, weight and power (SWAP) requirements; developed interfaces for GPS independent sensors, allowing connectivity with the portable sensor fusion core; investigated miniature inertial sensors to augment PNT in GPS denied environments; researched LIDAR odometry, visual navigation, and map building as potential sensor packages for use with the sensor fusion core; investigated new signals of opportunity for augmenting positioning and timing solutions on the battlefield; improved localization and movement of an autonomous vehicle using PNT sensors through a complex environment; and developed models of PNT sensors and conducted simulations of operational scenarios, especially under GPS challenged conditions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Mission Command Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs and codes software to enable a uniform MC capability and experience for the commander in the command post, on the move in vehicles, or dismounted, increases the situational awareness through software data architectures and algorithms that intelligently share data across low bandwidth networks and across dismounted, mounted and command post platforms, and improves decision making capacity across the battlefield by using software knowledge representation to model mission, enabling artificial intelligence techniques to use the model to automate staff tasks, correlate and analyze information and provide recommendations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.851"
                                            },
                                            "Text": {
                                                "val": "Designed software wireframes for a Cyber situational understanding common operational picture to allow the dynamic connection of information sources to decision tools."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CY2"
                    },
                    "ProjectTitle": {
                        "val": "Applied Defensive Cyber"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.955"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "7.955"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0602213A Network C3I Technology\n* Project 2CY Information Trust Technology\n* Project CY6 Autonomous Cyber Technology\n* Project CY8 Cyber Sec Applied Research and Exper Partner Tech\n* Project CY9 Decoy and Deterrence Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates cyber electromagnetic activities (CEMA), cyber security devices, software and techniques to harden wireless communications networks against cyber-attacks and new mobile networking protocols that afford resilience within our networks to autonomically 'fight through' and\/or evade hostile cyber effects. This Project also investigates and applies robust cyber security techniques and applications to advanced communications and networking devices, software, algorithms and protocols utilized within wireless tactical networks to protect against nation state level cyber effects and maintain Warfighter confidence in network information, resources, identities and mission partners by hardening the blue force attack surface.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defensive Cyber Operations"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and applies robust cyber security techniques and applications to advanced communications and networking devices, software, algorithms and protocols utilized within wireless tactical networks to protect against nation state level cyber effects and maintain Warfighter confidence in network information, resources, identities and mission partners by hardening the blue force attack surface. These capabilities will harden the attack surface by ensuring trustworthy software (SW), hardware (HW), information systems, communications and networks. This effort affords resilience within our networks to autonomically 'fight through' and\/or evade hostile cyber effects and provide situational understanding (SU) to enable effective mission planning and execution."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.49"
                                            },
                                            "Text": {
                                                "val": "Researched and validated cyber security technologies to improve the depiction, perception, and understanding of cyber space as it pertains to a commander?s operational environment to speed actionable decisions; researched cyber hardening methodologies for software, hardware, identities, and information to create trusted architectures and measures of provable identity, pedigree, and provenance; investigated robust built-in techniques that enable systems and networks to absorb, fight through, and adapt to adversary attacks; researched and designed autonomic techniques, models and algorithms to support convergence of defensive cyber, offensive cyber, Electronic Warfare (EW), and network\/spectrum management information to improve decision response; researched and validated block-chaining methodologies to trace and validate pedigree of tactical information as it traverses the network; researched and validated robust non-intrusive identity authentication techniques that supports tactical access control; and researched models and algorithms that can provably determine a confidence factor associated with software vulnerability prioritization."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Security Applied Research & Experimentation Partner (AREP) Technology (formerly called the Cyber Collaborative Research Alliance (CRA))"
                                    },
                                    "Description": {
                                        "val": "This effort will take innovative basic research theories from the Cyber CRA and experimentally validate the hypothesis and create proof-of-concept defensive cyber software implementations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.465"
                                            },
                                            "Text": {
                                                "val": "Investigated and validated artificial intelligence and machine learning models and methods for reasoning on real time vulnerability prediction\/analysis at a system-of-system perspective;  investigated use of modeling methodologies and techniques to capture and specify system properties (e.g., structural and behavioral), and characterized cybersecurity attributes (e.g., confidentiality, integrity and availability); investigated biological-inspired self-securing models and methods that can support capabilities to autonomously perform analytic monitoring, maintain dynamic representation, realign their resources as necessary, and be able to substantiate integrity; and investigated models and methods that can estimate what likely impact a vulnerability will cause to a system or network based on incomplete and inaccurate data."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H92"
                    },
                    "ProjectTitle": {
                        "val": "Communications Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "34.535"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "34.535"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned to:\nProgram Element (PE) 0602146A Network C3I Technology\n* Project AM6 Modular RF Communications Technology\n* Project AM8 Protected SATCOM Technology\n* Project AN3 Non Traditional Waveforms Technology\n* Project AN5 Protected SATCOM-WB Global SATCOM Inter Canc Tech\n* Project AN9 UNT - Every Receiver is a Sensor Technology\n* Project AO2 Stand-In Advanced RF Effects (STARE)\n* Project AP7 Comms\/Horiz Int for Army Mod Priorities Tech\nPE 0602143A Soldier Lethality Technology\n* Project AN1 Narrowband SATCOM Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and applies advanced communications and network devices, software, algorithms and services by leveraging and adapting commercial research and new communications and network sciences work by the Army Research Lab, Network Science Collaborative Technology Alliance or other Basic Research efforts. This Project leverages developments in wireless transport (e.g. mobile radio based communications systems) to design new techniques for improving communications in high radio frequency (RF) interference environments, such as in the presence of electronic warfare (EW), and to increase the communications capacity of terrestrial and satellite communications (SATCOM) systems. This Project also investigates antenna components, materials, designs and configurations to reduce the visual signature of antennas on Soldier, vehicular and airborne platforms and to reduce co-site interference on platforms with multiple transceivers, such as radios and jammers.  Additionally, this Project investigates defensive cyber, cyber security devices, software and techniques to harden wireless communications networks against cyber attacks and new mobile networking protocols to make wireless, on-the-move (OTM) communications networks more responsive to user needs. Beginning in FY19 cyber efforts are being reported in Project CY2. This Project also investigates software and techniques that improve the ability of the Soldier to manage and maintain complex, dynamic networks; and it designs spectrum management software tools to make more efficient use of the congested RF spectrum. This Project also designs new technology and techniques to lower the size, weight, power and cost of networking systems deployed on Army platforms.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Communications, Adaptive Networks to Improve Maneuver Operations, formerly Networking to Improve Maneuver and Expeditionary Operations"
                                    },
                                    "Description": {
                                        "val": "This effort investigates new capabilities to provide a range of robust, reliable, scalable, agile, interoperable and resource efficient communications capabilities to forces on the move. These capabilities allow forces to conduct maneuver operations, develop situational understanding, and sustain operations while maintaining freedom of movement."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.705"
                                            },
                                            "Text": {
                                                "val": "Designed and developed exquisite local communication techniques with inherent low probability of interception\/low probability of detection (LPI\/LPD) characteristics and high frequency reuse for spectrum supportability; investigated use of non-traditional networking methods for high bandwidth needs; design and develop techniques to extend the range of waveforms with propagation limitations and challenges operating through obstruction blockages (e.g. foliage, building, etc.) for line of sight networking; investigated technology with large channel bandwidths that support high data-rate transfer; designed and developed mature non-traditional transceiver components for increased capacity, and reduced interference; conducted experiments for high bandwidth, resilient communications for high data rate applications, with improved communications protection between nearby vehicles with LPI\/LPD; investigated improved methods to adapt LPI\/LPD techniques to mesh networks to counter contested threats in the spectrum environment; matured distributed dismounted beam forming algorithms that enable two distributed beam forming nets to communicate; designed and developed an architecture, and related protocols, for secure connection onto existing or third party transport infrastructure; investigated methods to utilize existing networks that will increase available network bandwidth and provide access to resources through a local network topology in which infrastructure nodes cooperatively connect directly, dynamically, and non-hierarchically; began the design and development of a system that integrates sensor data which is harvested from existing fielded receivers, and propagated across the network to enable improved situational understanding; designed and developed components that will help incorporate future radio systems into the sensing architecture; developed data analytics algorithms to identify, evaluate, and correlate specific events from available tactical and intelligence data, leveraging standard protocols and interfaces to current and future tactical receivers with associated visualization and data analytics tools; investigated components for low cost, unattended sensors that can be readily distributed, then discarded, within an area of interest; developed interfaces and methods to use existing tactical radios and receivers; and developed small, easily dispersible sensors to deliver large scale sensing over designated areas; and developed data consolidation and sampling methods to minimize bandwidth use of large scale sensing devices available through tasking existing receivers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communications, Robust Tactical Systems, formerly Uninterrupted Communications"
                                    },
                                    "Description": {
                                        "val": "This effort designs and matures components, software and algorithms that enable Army tactical wireless networks to provide assured uninterrupted access to critical communications and information links so that they operate more robustly in congested, contested and competitive electromagnetic environments. These capabilities will result in robust, reliable and secure terrestrial and SATCOM networks with greater survivability in austere, congested and hostile electromagnetic environments while ensuring that the capabilities are interoperable and resource efficient and will allow forces to develop SU and conduct operations to support mission command networks even under adverse operational conditions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.03"
                                            },
                                            "Text": {
                                                "val": "Designed and developed an agile network architecture that globally manages traffic from traditional and non-traditional networks; designed and developed algorithms and software to enable resilient controls to support network traffic over Commercial and Government satellite communications (SATCOM) systems; conducted experiments to develop methods for robust narrowband SATCOM with resilience against adversary jamming; researched resilient Mission Command designs that are transport agnostic; investigated and designed software-based algorithms for anti-jam, Low Probability of Interception and Deception (LPI\/LPD) high frequency communications that incorporate state of the art protection against threat systems and enable operation in a contested environment of High Frequency systems; designed and developed a standard interface specification to enable tactical Army units to interoperate with Navy and Air Force components; investigated components for a reliable, long range, and low data rate communications link to provide uninterrupted communications in a contested environment for the Army Tactical network; designed a proof of concept adaptive system that supports multiple simultaneous radio frequency connections, multiple types of interference cancellation, incorporating diverse paths and waveforms, beam forming, and power control; designed and developed a control modem supporting required connectivity, throughput, and protection to support resiliency functions in a contested environment; designed and developed a software based adaptive system that supports multiple types of Wideband SATCOM interference mitigation techniques; validated applicability of cognitive reasoning software to recognize interference signals and select the appropriate mitigation techniques and, through machine-learning, grow in responsiveness; conducted experiments to evaluate uninterrupted SATCOM configurations; conducted analysis to determine approach for developing and adding interference cancellation to the Army tactical modems; designed and developed algorithms for improved interference rejection and improved jammer stand-off distance to address the tactical Army threats; investigated and designed a decoy signal generator of multiple waveforms, capable of deceiving Intelligence, Surveillance, & Reconnaissance (ISR) systems; designed and developed obfuscator hardware, supporting sensor and policy-based dynamic spectrum access (DSA) and transmitting obfuscation (flooding) waveforms, and frequency obfuscation to hide troop?s radio frequency signatures and spend enemy resources;  conduct research to enable extended reach back, data link, and localized communications for long range precision fires; designed and developed a single, autonomous and intelligent network across the tactical Army, providing a common user interface and drawing on the available resilient links to maintain data flow; developed solutions to provide reliable voice\/data links for the next generation combat vehicles, and tele-operation and data links for Manned\/Unmanned-Teaming (MUM-T); developed components to improve resilience of Air-to-Air and Air-to-Ground links for future vertical lift and next generation unmanned aerial system; designed algorithms for intelligent networks to enable resilient links and data flow capability for Fire control, sensor data flow, and proximity\/distance networking for air and missile defense; and validated network-enabled mission command to the dismount soldier through intelligence and situational understanding-based routing of data over resilient communication links."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modular Radio Frequency"
                                    },
                                    "Description": {
                                        "val": "This effort enables connectivity in contested & congested environments by applying automated networking techniques to modular RF technology & networking techniques to adapt and continue operation under interference signals."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.8"
                                            },
                                            "Text": {
                                                "val": "Designed and developed product architectures based on a Modular Open System Architecture (MOSA) approach that incorporates components of network technologies into a unified solution; identified, validated, and developed standards for major internal interfaces and all external interfaces to product components and network capabilities and services; identified, developed, and validated quality attribute requirements that reflect a focus on resilience for autonomous networking to addresses critical product qualities that span a design space of feasible solutions that will allow high value services to maintain persistent network connectivity in congested and contested environments; investigated alternative requirement allocations for different network technology components that will incorporate identified technologies currently in use, and new network technologies, within an agile and resilient autonomous network; developed alternative solutions and validated selection criteria for autonomous networking approaches that provide agile detection and switching among available network connections in order to sustain the network in dense and hostile spectrum environments; investigated situation-adaptive communications to inform networks of current spectrum environment changes (e.g. interference, congestion) for the tactical network links, in an effort to optimize their performance based on available resiliency features, to implement mitigation techniques to maintain operation and inform the automated network of their status and any degradations; and investigated the methods for agile networking algorithms to detect network technologies available for inclusion in the automated network processing and determined techniques to minimize user input to establish the detections, authentications, and incorporation of the technologies into the automation."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}