{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-855515f7cbe1443b1cc76e32ff869263061a887974718017fcc8f688288c6578-25",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603699D8Z"
        },
        "ProgramElementTitle": {
            "val": "Emerging Capabilities Technology Development"
        },
        "R1LineNumber": {
            "val": "51"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "378.125"
            },
            "PriorYear": {
                "val": "59.350"
            },
            "CurrentYear": {
                "val": "109.411"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2021, all funding and project investment areas in the Emerging Capabilities Technology Development (ECTD) Program Element (PE) will transition to PE 0603338D8Z Defense Modernization and Prototyping (DM&P).  The new PE will continue to leverage the year of execution processes that have allowed ECTD to rapidly and effectively develop and transition capabilities to respond to emergent issues, time-sensitive threats, and innovation opportunities.  Through consolidation, the DM&P PE increases the Department’s ability to coordinate activities across the Services and Defense Agencies, reduces duplication of effort, enables rapid pivots to new threats, and provides the resources necessary to ensure a technological overmatch against future threats.  This realignment directly supports the Department’s modernization plans by streamlining investments, reducing the time from discovery to deployment, and enabling development of disruptive technologies to help realize the National Defense Strategy.   \n\nEmerging Capabilities Technology Development funds rapid prototyping efforts and experimentation in collaboration with the Services, government labs, academia, allied partner nations, and industry to support the National Defense Strategy, Joint Staff, DoD modernization priorities, and Combatant Command (CCMD) needs.  Completed ECTD projects transition to joint programs through fielded operationally relevant prototypes; technology adoption into programs of record; integration into system level, multi-year joint demonstrations; and through advanced research and engineering efforts like the Warfighting Lab Incentive Fund for further development of tactics, techniques, procedures, and concepts of operations.  Previously selected ECTD projects have been accelerated to complete in FY 2020 or will transition to Program Element 0603338D8Z in FY 2021."
        },
        "ProgramElementMissionDescription": {
            "val": "In alignment with the National Defense Strategy, the Emerging Capabilities Technology Development (ECTD) Program Element (PE) supports the Under Secretary of Defense for Research and Engineering (USD(R&E)) with experimentation and mid-term, mission-focused capability development that crosses functional domains and enhances warfighter lethality, technical superiority, adaptability, and resilience.  ECTD funding supports joint prototype development, joint experimentation for concept of operations (CONOPs) development, and red teaming validations that enable disruptive innovation to sustain the United States' operational superiority.  Joint demonstrations and ECTD-sponsored venues of defense-wide experiments provide opportunities for emerging technologies to succeed, or fail fast.  Demonstration venues include: Stiletto, a maritime experimentation and demonstration platform; Thunderstorm, a multi-domain venue focused on small and non-traditional businesses; Silent Hammer, an advanced electronic warfare venue; and, other tailored experimentation and demonstration events.  The red teaming funding line explores vulnerabilities in emerging technologies and enables USD(R&E), and the broader defense science and technology community, to make informed decisions before investing in new capabilities.  Red teaming enables adaptation to unforeseen vulnerabilities or opportunities early in capability development when design changes are cost effective and programs can be re-directed if developmental dead ends are discovered.  ECTD prototypes, demonstrations, experimentations, and red teaming validations enable developers to showcase new and maturing capabilities in realistic environments and against realistic threats with operational user involvement.\n\nECTD prototyping projects increase the speed of technology innovation by reducing technology risk for emerging capabilities.  With an emphasis on joint and interagency partnerships, ECTD matures capability options to anticipate and inform new acquisition pathways in addition to formal requirements and acquisition processes.  Project selection is guided by Department-level strategies and priorities, such as the National Defense Strategy, the Chairman’s Capability Gap Assessment, and Department of Defense (DoD) modernization priorities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "60.700"
                },
                "CurrentYear": {
                    "val": "80.911"
                },
                "BudgetYearOne": {
                    "val": "75.284"
                },
                "BudgetYearOneBase": {
                    "val": "75.284"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "59.350"
                },
                "CurrentYear": {
                    "val": "109.411"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.350"
                },
                "CurrentYear": {
                    "val": "28.500"
                },
                "BudgetYearOne": {
                    "val": "-75.284"
                },
                "BudgetYearOneBase": {
                    "val": "-75.284"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-7.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.340"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Transfer to Defense Modernization and Prototyping"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-75.284"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-75.284"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.010"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional adds"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "36.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2020 Congressional adjustment of $28.500 million is the net of a $10.000 million increase for high-altitude optical reconnaissance unit and sensors, a $3.000 million increase for open source intelligence, a $8.000 million increase for remote advise and assist technology development, a $5.000 million increase for disruptive air and missile defense, a $10.000 million increase for artificial intelligence enabled sensor network, and a $7.500 million reduction for program growth. \n\nThe FY 2021 baseline reduction is the transfer out of the ECTD Program Element funding to the Defense Modernization and Prototyping PE (0603338D8Z) to provide alignment, transparency and focus supporting development of key technologies within USD(R&E) identified modernization prototypes and capability thrust areas."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "795"
                    },
                    "ProjectTitle": {
                        "val": "Emerging Capabilities Technology Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "378.125"
                        },
                        "PriorYear": {
                            "val": "51.368"
                        },
                        "CurrentYear": {
                            "val": "99.440"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2021, all resources in this project are transferred to the Defense Modernization and Prototyping Program Element (0603338D8Z) to support development of key technologies within USD(R&E) identified modernization prototypes and capability thrust areas."
                        },
                        "ProjectMissionDescription": {
                            "val": "ECTD funding supports projects that reduce technology risk; create capabilities across functional domains; and, deliver increased lethality, resiliency, and adaptability through prototyping, demonstrations, experimentation, and red teaming.  Individual projects typically cost less than $6.000 million and focus on rapid prototyping, experimentation, and demonstration of emerging technologies.  ECTD funding also supports complementary demonstration venues that develop and mature emerging technologies."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Air Base Resilience Sensor"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "7.500"
                                        },
                                        "Text": {
                                            "val": "The Air Base Resilience Sensor project directly supports the National Defense Strategy’s priority for increased lethality through rapidly prototyping and integrating an advanced sensor system concept to enhance detection and tracking of threat systems.  Previous funding in FY 2016, FY 2017, and FY 2018 developed an advanced sensor chip assembly (SCA) and prototype test units incorporating the SCA to enable experimentation and validation of expected performance in a range of operationally relevant environments.  In FY 2019, work continued to mature prototype test unit designs for several operational concepts.  This technology area is a congressional interest item and additional resources were provided above the President's budget.  Details of this project are classified."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "In FY 2020, activities continue to integrate and test the prototype units against targets in operationally relevant environments prior to a system demonstration anticipated to occur in FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High-Altitude Optical Reconnaissance Unit and Sensor (HORUS)"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "HORUS designed, built, and evaluated a prototype capability for a high-altitude sensor system with military utility for the joint warfighter.  HORUS matured an electro-optical prototype system to support pattern of life analysis at extreme distance that is adaptable to multiple manned or unmanned aircraft.  The HORUS prototype supports day or night operations by providing multi-spectral, high-definition full motion video from extreme slant ranges.  In FY 2019, the sensor design was completed and fabrication of two prototype HORUS units continued.  This technology area is a congressional interest item and additional resources were provided above the President's budget."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Prototype fabrication will continue in FY 2020 followed by integrated system testing on an operationally representative platform.  The prototype units will transition to USSOCOM for final evaluation and operational use."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Open Source Intelligence"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "3.000"
                                        },
                                        "Text": {
                                            "val": "This project directly supports the National Defense Strategy for increased lethality through targeted application of DoD Joint Mission Capabilities.  The project leverages emerging tools and techniques to rapidly winnow down open source data to actionable intelligence.  In FY 2020, the project will demonstrate a novel Open Source Intelligence capability to support DoD modernization areas.  Specific demonstrations and activities will be finalized within the year of execution.  This technology area is a congressional interest item and additional resources were provided above the President's budget."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Remote Advise and Assist Technology Development"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8.000"
                                        },
                                        "Text": {
                                            "val": "This project directly supports critical decision and coordination processes enabling increased survivability for the joint warfighter and partners.  The project showcases remote advise and assist technology that can be integrated with future Joint Mission Capabilities.  In FY 2020, the project will develop and test remote advise and assist technology to support DoD processes.  Specific demonstrations and activities will be finalized within the year of execution.  This technology area is a congressional interest item and additional resources were provided above the President's budget."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Artificial Intelligence Enabled Sensor Network"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "This project directly supports the DoD Artificial Intelligence (AI) and Machine Learning (ML) modernization area.  Though coordination with the, Joint Artificial Intelligence Center, this project will mature and demonstrate commercial tools and techniques for an AI enabled sensor network.  In FY 2020, the project will demonstrate an AI enabled sensor network to inform future acquisition efforts.  Specific demonstrations and activities will be finalized within the year of execution.  This technology area is a congressional interest item and additional resources were provided above the President's budget."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Low Cost Innovative Projects (Projects less than one million dollars each)"
                                    },
                                    "Description": {
                                        "val": "Emerging Capabilities Technology Development (ECTD) funds rapid prototyping projects requiring less than one million dollars for execution. ECTD selected, executed, and transitioned low cost projects in the areas of: electronic warfare; fully networked command, control and communications; microelectronics; artificial intelligence\/machine learning; autonomy and other DoD Modernization Priorities or Joint Mission Capability areas. These projects delivered conceptual and proof-of-principle prototypes for evaluation or assessment by warfighters and other interagency users. In FY 2019, ECTD selected, executed, and transitioned multiple low cost projects, including:\n•  Cognitive Tools for Target Detection:  This project leveraged machine learning, mixed reality, and heads-up-display technologies to demonstrate enhanced situational awareness for semi-autonomous to fully-autonomous vehicles with human supervisory control.  This project successfully transitioned to the U.S. Army for further development.\n•  Additive Manufacturing for Low-Cost Unmanned Air Systems:  This project demonstrated novel additive manufacturing processes to rapidly produce parts that are 3-dimensionally complex at low cost. This project successfully transitioned to the U.S. Air Force for further development. \n•  Air-Launched Effects: This conceptual prototyping project explored novel designs for a multi-mission small-unmanned aerial system that can be deployed from a variety of fixed-wing aircraft.  This project successfully transitioned to the U.S. Air Force.\n•  Hydrodynamic Energy Efficiency:  Numerical simulation and experimentation to explore various designs for energy efficiency though conceptual prototyping. This project successfully transitioned to the U.S. Navy.\n•  Advanced Thermoelectric Power Generator and Cooler:  This project prototyped and tested multiple designs to identify low-cost, enhanced efficiency waste-heat recovering designs to generate power and on-board cooling of electronics and sensors. This project successfully transitioned to the U.S. Army, Navy, and Air Force for further development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.392"
                                            },
                                            "Text": {
                                                "val": "Raven Flash will develop a fully integrated, functionally-relevant prototype system.  Activities to design, fabricate, assemble, and test the Raven Flash prototype will be conducted.  The relative performance of the system will be characterized, assessed, and validated against a selected high-fidelity, relevant electronic system in a laboratory environment.  Using FY 2019 funding, Raven Flash will complete prototype integration on a representative platform and subsequent demonstrations before transition to a classified customer."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Distributed Collaborative Electronic Warfare & Radar (DISCOVER)"
                                    },
                                    "Description": {
                                        "val": "DISCOVER supports the National Defense Strategy’s priority for increased lethality and the DoD’s modernization priority for fully networked command and control.  DISCOVER developed and demonstrated a fully networked, integrated, multi-function prototype to support multiple radio frequency (RF) concepts of operation (CONOPS) in a small form factor prototype.  In FY 2019, DISCOVER completed algorithm development and hardware integration activities culminating in a series of field experiments to explore the DISCOVER prototype’s capabilities and its impact on squad level operations.  DISCOVER transitioned to the U.S. Marine Corps for continued CONOPS experimentation followed by further maturation by the U.S. Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.803"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Response Integrated and Collaborative (JRICO) Decision Support Tool"
                                    },
                                    "Description": {
                                        "val": "JRICO supports the National Defense Strategy’s priority of delivering performance at speed while creating a more lethal force.  JRICO demonstrates the use of artificial intelligence (AI) through autonomous machine learning (ML), a DoD modernization priority, to label and ingest data, exploit disparate and unstructured force management data, and create an interoperable and collaborative framework to improve time-critical decision making.  JRICO improves both joint and Defense Support of Civil Authority operational planning through big data analytics to perform rapid analysis and seamless information sharing with increased speed and fidelity.  In FY 2019, JRICO completed the data tagging strategy, developed Global Force Management services, finalized the application registry, and conducted a Military Utility Assessment at U.S. Indo-Pacific Command.  Work continues in FY 2020 using FY 2019 funds to identify, implement, and mature AI\/ML processes prior to executing the final demonstration.  The JRICO capability transitions to the Joint Staff in FY 2020."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.950"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Software-Defined Radar (SDRadar)"
                                    },
                                    "Description": {
                                        "val": "SDRadar leverages machine learning to help support the DoD modernization priority for missile defense.  This project demonstrates a prototype cognitive software-defined radar to inform the development and demonstration of joint solutions for a resilient radar capability in congested and contested electromagnetic environments.  The SDRadar prototype will demonstrate enhanced target detection and tracking in a variety of scenarios of interest to the U.S. Army and U.S. Air Force.  The SDRadar prototype matured in FY 2019 with a focus on innovations to the hardware and software subsystems.  Using FY 2019 funds, prototype integration and testing continues in FY 2020, culminating in an early FY 2020 demonstration prior to the prototype transitioning to the U.S. Army and U.S. Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.550"
                                            },
                                            "Text": {
                                                "val": "To support a FY 2019 field demonstration, DISCOVER will complete algorithm development then integrate and test final RF hardware and antennas.  Subsequent FY 2019 field experimentation will explore the DISCOVER prototype and impacts on squad level operations.  DISCOVER will transition to the U.S. Marine Corps for continued CONOPS experimentation followed by further maturation by the U.S. Army."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Situational Awareness Data Link (SADL) for Stand-Off Precision Guided Munitions (SOPGM)"
                                    },
                                    "Description": {
                                        "val": "SADL-SOPGM directly supports the National Defense Strategy’s priority for increased lethality and delivering performance at speed, by rapidly prototyping and integrating a miniaturized SADL radio into SOPGMs.  The resulting prototype system enables enhanced surgical strikes against high value and irregular warfare targets in multiple environments, including urban, GPS-denied, and adverse weather.  Integration of the data link radio into SOPGMs significantly enhances lethality, shortens kill-chains, and reduces collateral damage for the AC-130W\/J gunship, Special Operations Forces (SOF) MQ-9 Reaper, and SOF MQ-1C Gray Eagle.  In FY 2019, final integration of the SADL radio prototype into SOPGMs culminated in a series of live-fire test and evaluation events to characterize, assess, and validate system performance.  The SADL SOPGM capability transitioned to U.S. Special Operations Command (USSOCOM) with an initial operational capability planned for FY 2020."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.700"
                                            },
                                            "Text": {
                                                "val": "In FY 2019, CAB-T will demonstrate compact ballistic technology in parallel with refinement of the CAB-T user interface.  The project will also incorporate adaptable design elements into a modular plug-and-play prototype.  Final integration of compact ballistic technology with CAB-T user interface will be completed with FY 2019 funding followed by experimentation leveraging transition partner expertise.  The CAB-T prototype and final assessment with technical data package will transition to a classified user."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Polar Skywave Radar (PSR)"
                                    },
                                    "Description": {
                                        "val": "PSR directly supports the National Defense Strategy’s priority for increased lethality through persistent long range sensors to address the limitations of the current North Warning Systems and emerging threats.  PSR will mature and experiment with radio frequency (RF) hardware and advanced radar processing algorithms to validate that over-the-horizon skywave radar is viable for a future surveillance system in the polar region.  PSR is focused on ten major tasks to extend skywave radar to the polar region including deployment of high frequency (HF) radar hardware for a scaled model and refinement of signal processing techniques.  In FY 2019, PSR collected data and installed hardware to enable FY 2020 experimentation.  In particular, PSR procured the transmitter shelter; designed and modeled a wide band antenna; collected data and analyzed it with newly developed physics-based modeling to provide a better understanding on the polar ionosphere; and devised an arctic HF communication experimental plan."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.300"
                                            },
                                            "Text": {
                                                "val": "After demonstrating concept feasibility in FY 2018, FY 2019 funds and transition partner support enables adaption to the form, fit, and function of the terminal guidance sensor at a relevant military radar band.  The final prototype sensor will be integrated onto a sUAS platform specified by the Special Operations transition partner."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "FY 2020 tasks include continued data collection, radar signal processing refinement, HF communication experimentation, and evaluating predicted operational performance.  Leveraging Missile Defense Agency (MDA) funding, PSR will culminate in a real-time demonstration with targets of opportunity before these technologies transition to the Air Force Life Cycle Management Center (LCMC)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Polar Skywave Radar completed development in 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Tactical Power Generation (ATPG)"
                                    },
                                    "Description": {
                                        "val": "ATPG directly supports the National Defense Strategy’s priority for increased lethality by prototyping a vehicle centric, mobile, fast forming, secure, and intelligent microgrid.  The ATPG prototype provides ad hoc, resilient power for next generation EW, directed energy, and missile defense technologies and will enable: (1) on the move power generation to supply advanced protection system for maneuver forces; (2) improved logistics through reduced fuel consumption; and, (3) reduction in time required to setup, transport, and redeploy power generation systems.  In FY 2019, the project completed subsystem component fabrication and testing.  Using FY 2019 funds, on-vehicle integration activities continued in FY 2020 followed by integrated system testing.  The initial prototype will transition to U.S. Army Product Manager Terminal High Attitude Area Defense for operational testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.291"
                                            },
                                            "Text": {
                                                "val": "The JRICO prototype will demonstrate an application registry and big data analytics that includes building a visualization registry for applications and publishing across a cloud computing-based, collaborative, multi-domain environment.  JRICO will also conduct a military utility assessment with U.S. Indo-Pacific Command before transitioning to the Joint Capability Requirements Manager, the Preferred Force Generation, and the Joint Capability Support to National Emergencies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Printable Flexible Electronics with Nanomaterials Heterostructures (PFLEX)"
                                    },
                                    "Description": {
                                        "val": "PFLEX supports the National Defense Strategy’s priority to deepen defense cooperation between the United States and partner nations.  This project, conducted in partnership with India’s Defense Research and Development Organization, prototyped a wearable microelectronic sensor system for environmental monitoring of potentially hazardous confined spaces.  The PFLEX project demonstrated prototype units implementing a flexible electronic system architecture combined with oxygen and broad-band volatile organic compound sensors.  In FY 2019, fabrication of the prototype advanced flexible sensor was completed and underwent testing and experimentation to characterize performance.  The prototype units transitioned to the U.S. Air Force for testing and follow-on development activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "SDRadar prototype maturation will continue in FY 2019 focusing on innovations to the hardware and software to enhance target tracking in congested EMEs.  Using FY 2019 funds, SDRadar will culminate in an early FY 2020 demonstration transitioning into multiple Service programs of record."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid 3D (R3D) Data Generation"
                                    },
                                    "Description": {
                                        "val": "R3D directly supports the National Defense Strategy’s priority for increased lethality through advanced simulations, synthetic training environments, and by providing superior knowledge of the battlespace during mission preparation and execution.  R3D prototypes provide critical battlespace awareness to the warfighter, enabling rapid and accurate decision making at the tactical edge by closing the gap in terrain data for detailed tactical planning.  R3D enables the interoperability required for short notice, joint mission rehearsal in addition to creating a common domain for rapid experimentation with future operational concepts.   \n\nIn FY 2019, R3D continued to develop the architecture and groundwork for interoperability across SOF, conventional, and coalition forces.  Activities included technical risk reduction and capability gap assessments for the Services, Combatant Commands, and the National Geospatial-Intelligence Agency (NGA).  R3D also matured algorithms and the system architecture to deliver 3D terrain data on NIPR, SIPR, and JWICS.  End user assessments, joint exercises, and iterative test and evaluation activities were incorporated to mature the system concept and design."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2019, the project will complete integration of the SADL-SOPGM prototype system onto a platform.  Subsequent SADL-SOPGM demonstrations will culminate in live fire testing and evaluation.  The SADL SOPGM capability will transition to U.S. Special Operations Command (USSOCOM) with an expected initial operational capability in FY 2020."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020, R3D will speed the generation of 3D data with AI\/ML automation algorithms in a scalable cloud-hosted high performance computing environment.  R3D will also demonstrate baseline capabilities on all three networks in support of a multi-Service interoperability assessment and undergo final operational test and evaluation prior to transitioning to NGA, USSOCOM, and the Services to complete the joint architecture."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "R3D efforts will be completed at the end of FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Project 18"
                                    },
                                    "Description": {
                                        "val": "Project 18 directly supports the National Defense Strategy's priority for increased lethality by demonstrating an organic counter unmanned aircraft system (UAS) capability for use by small units.  This project integrated a novel non-kinetic capability to defeat adversary UAS onto existing operational platforms and experimented with the resulting prototype to inform concepts of operation (CONOPS).  Additional details are classified.  In FY 2019, the initial prototype completed fabrication and underwent testing and experimentation to characterize combat performance.  The prototypes transitioned to USSOCOM for final evaluation and operational use."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.918"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-domain Experimentation and Demonstration Venues"
                                    },
                                    "Description": {
                                        "val": "Agile and flexible experimentation and demonstration capabilities and venues that support the National Defense Strategy’s priority to increase the rate of innovation and enable Service, Combatant Command, and Agency user evaluation of emerging novel technologies in relevant environments.  Demonstration venues include the Thunderstorm venue for small and non-traditional businesses; the Stiletto maritime technology platform; and, other tailored multi-domain venues and ad-hoc demonstrations.  These experimentation and demonstration venues support the rapid discovery and transition of emerging technologies across the range of military operations.  The venues provide the DoD and interagency partners with an opportunity to identify and evaluate new and emerging technologies both from commercial and government sectors through a series of technology demonstrations, experiments, vignettes, and related activities.  The venues also offer a streamlined experimentation and demonstration process that encourages system developers to engage directly with the warfighter.  These engagements enable rapid innovation and adoption of new technologies to meet operational needs through the exploration of military utility, and identification of potential risks of emerging technologies. \n\nIn FY 2019, Thunderstorm, Stiletto, and other venues conducted 22 demonstration and experimentation events, which featured 193 innovative technologies from focus areas including, multi-domain operations in Megacities, ubiquitous sensors, near-field communications systems, machine learning on unmanned aerial systems, and security for critical ports and harbors.  Thirty-three of the technologies transitioned directly to DoD operational users or were leveraged by formal programs of record, including, persistent tethered unmanned autonomous vehicles (UAVs), augmented reality for small unit operations, and a sense-through-the-wall radar system.  The demonstration and experimentation venues also provided 79 small businesses and non-traditional innovators with warfighter feedback critical to rapidly mature their technologies into viable prototypes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Building on previous experience, six to eight demonstrations to accelerate innovation are planned for FY 2019.  These demonstrations will focus on operations in megacities, security for fully-networked command and control, building partnerships, and machine learning enabled sensors for detection of rare events.  Capabilities evaluated will include multi-domain operations, ubiquitous sensors and technologies for increased small unit lethality, diver detection in harbors, and other priorities identified through engagement with stakeholders."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Building on previous experience, six to eight demonstrations to accelerate innovation are planned for FY 2020.  These demonstrations will focus on cyber security using the synthetic environment, multi-domain operations in Megacities, and increasing small unit lethality.  Capabilities evaluated will include near-field communication systems, cyber security for the warfighter, enhanced technologies for underwater operations, and other priorities identified through engagement with stakeholders."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2021, the Multi-domain Experimentation and Demonstration Venues will transition to PE 0603338D8Z Defense Modernization and Prototyping to increase coordination and streamline transition of promising capabilities identified in demonstrations and field experiments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integration Support for Modernization of Joint Mission Capabilities"
                                    },
                                    "Description": {
                                        "val": "A conceptual prototyping effort to support engineering system design and integration of novel technologies into critical Joint Mission Capabilities.  Conceptual prototypes address DoD modernization areas by leveraging industrial base investments and rapid transition pathways to Service end users.  In FY 2019, about thirty individual concepts were explored across electronic warfare, integrated fire control, and rapid targeting and defeat of threats.  Each conceptual prototype fused expertise and constraints from multiple Services, traditional and non-traditional industry, and research and development centers.  Successful prototypes will be selected for rapid maturation through future development efforts leading to deployed Joint Mission Capabilities.  Depending on scale, application, and maturity future efforts may be funded from the ECTD Conceptual Prototyping to support DoD Modernization Priorities project, PE 0603648D8Z Joint Capability Technology Demonstration (JCTD), or PE 0604331D8Z Rapid Prototyping Program.  Further details are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.964"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Silent Hammer (SH)"
                                    },
                                    "Description": {
                                        "val": "SH is a multi-year, multi-agency, series of field experimentation activities.  SH explores and demonstrates new electronic warfare (EW) and cyber technologies and approaches through the use of large-scale, dynamic field experiments.  SH includes scripted and dynamic scenarios to experiment with the efficacy of both existing and new capabilities to engage emerging electromagnetic spectrum threats.  The EW Community of Interest, Executive Committees, and warfighters are involved in the selection of follow-on experimentation topics, technology demonstrations, and scoping of these efforts to ensure their maximum relevance and value.  In FY 2019, Silent Hammer completed the initial SH 1 field experiment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Building on the success of SH 1, FY 2020 activities focus on planning and preparation for SH 2, which is planned for early FY 2021."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2021, the Silent Hammer Demonstration Program will transition to PE 0603338D8Z Defense Modernization and Prototyping to increase coordination and streamline transition of promising capabilities identified in SH field experiments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Conceptual Prototyping to Support DoD Modernization Priorities"
                                    },
                                    "Description": {
                                        "val": "This effort prototypes cutting-edge land, sea, undersea, air, and space capabilities critical to the National Defense Strategy and DoD modernization priorities.  This effort matures and experiments with key component technologies and representative prototypes of fully networked command, control, and communications; space; autonomy; hypersonics; microelectronics; cyber; quantum science; directed energy; and, machine learning systems to accelerate development and adoption of cost effective and interoperable solutions for defense challenges.  Selected limited-duration projects design, mature, and deliver conceptual prototypes to reduce the time from idea to demonstrated capability; mitigate risk in DoD programs; and, help characterize potential CONOPS.  Conceptual prototyping activities seek to rapidly develop and demonstrate capabilities that can help maintain U.S. technological edge.  These prototypes will be delivered to joint Service users to evaluate operational capabilities and inform requirements and technical feasibility of future acquisition programs.  Potential venues for prototype assessment include the Stiletto Maritime Demonstration Program, Thunderstorm integration exercises, and multi-domain demonstration venues across the DoD.  Demonstration of advanced prototypes will involve partnerships with the Services, industry, academia, interagency, international, and non-traditional DoD partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Text": {
                                                "val": "This focus area will mature concepts and designs through conceptual prototyping that result in interoperable solutions.  While project determinations are generally made in the year of execution, projects to be considered will address challenges within the DoD modernization priorities.  Potential areas to investigate through conceptual prototyping include quantum sensing and processing; machine learning to gain a competitive military advantage; novel microelectronics and microelectromechanical systems; dismounted electromagnetic spectrum technologies for communications and distributed electronic warfare; implementation of directed energy on small, low-cost autonomous platforms; and component technologies with the potential to enable disruptive space capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "46.440"
                                            },
                                            "Text": {
                                                "val": "This focus area will mature concepts and designs through conceptual prototyping that result in interoperable solutions.  While project determinations are generally made in the year of execution, projects considered will address challenges within the DoD modernization priorities.  Potential areas to investigate through conceptual prototyping include quantum sensing and processing; machine learning to gain a competitive military advantage; novel microelectronics and microelectromechanical systems; distributed logistics in contested environments; dismounted electromagnetic spectrum technologies for communications and distributed electronic warfare; implementation of directed energy on small, low-cost autonomous platforms; and, component technologies with the potential to enable disruptive space capabilities.  FY 2020 projects will focus on efforts that complement, fill gaps, or align with the FY 2021 capability thrust areas identified in PE 0603338D8Z Defense Modernization and Prototyping."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2021, these efforts will transition to PE 0603338D8Z Defense Modernization and Prototyping to increase coordination and streamline transition of promising capabilities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "India Science and Technology (S&T) Partnerships Focus Area"
                                    },
                                    "Description": {
                                        "val": "The India S&T Partnerships Focus Area is a Secretary of Defense directed program designed to deepen defense cooperation between the United States and India.  By sharing research resources, capabilities, and expertise, the United States and India can jointly develop the technological innovations needed to enable our defense industrial bases to support our militaries now and in the future.  Further, development of vibrant S&T cooperation is a key step in building an enduring partnership."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Text": {
                                                "val": "The India Science and Technology Focus Area and related funding will continue to develop and execute cooperative S&T projects.  Additional cooperative S&T areas targeted include: munitions development, advanced manufacturing, micro-power grids, and other identified project areas.  Project selection is made during the year of execution in coordination with military representatives from India."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020, the India S&T Partnerships Focus Area and related funding will continue to develop and execute cooperative S&T projects.  Additional cooperative S&T areas targeted include munitions development, advanced manufacturing, micro-power grids, energy harvesting capabilities, air-launched UAVs, virtual reality capabilities, and other identified project areas.  Project selection is made during the year of execution in coordination with military representatives from India."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding for the India S&T Partnership Focus Area started in FY 2015 and concludes in FY 2020, with no additional funding currently allocated in FY 2021."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "ECTD leverages the Services’ and Defense Agencies' most efficient and effective acquisition approach for rapid prototyping.  This includes using Other Transaction Authorities and new or existing contract vehicles."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "717"
                    },
                    "ProjectTitle": {
                        "val": "Red Teaming"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.982"
                        },
                        "CurrentYear": {
                            "val": "9.971"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2021, all resources in this project are transferred to the Defense Modernization and Prototyping Program Element (0603338D8Z) to support development of key technologies within USD(R&E) identified modernization prototypes and capability thrust areas."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Red Teaming project supports assessments and demonstrations to stress and assess emerging systems with the intent of gaining or maintaining overmatch earlier in the life cycle.  The project helps assess the susceptibility and vulnerability of emerging technologies and newly developed systems, and helps identify unanticipated disruptive opportunities and technological dead ends.  The project improves systems by reducing vulnerabilities and providing a holistic understanding of employment risks in operationally-representative environments and against potential threats prior to full funding commitments.  The Red Teaming project supports three broad types of red teaming: 1) Early stage horizon scanning and assessments of weaknesses and opportunities of pre-development technologies from an adversary perspective; 2) Targeted, low-fidelity prototypes to assess utility and inform design choices prior to funding commitments; and 3) Red teams, war games, and field experiments with maturing technology to understand how to implement new technologies and adapt to adversary responses.  This effort leverages the innovative capabilities of other defense red teaming organizations within the Department, Federally Funded Research and Development Centers (FFRDCs), government laboratories, and academia.  Deliverables will inform requirements, new concepts of operations (CONOPS), and help accelerate technology acquisition pathways for joint missions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Red Teaming to Support DoD Modernization Priorities"
                                    },
                                    "Description": {
                                        "val": "Red Teaming to Support DoD Modernization Priorities funds efforts to explore new capabilities in a competitive environment.  Efforts include: 1) Early investigations and red teaming to identify and understand potential vulnerabilities and opportunities from emerging and conceptual technologies.  Projects will help define and anticipate impacts from new technologies, including current DoD investments and external technologies, to understand operational utility and identify threats from tangentially related sectors that can have significant negative impacts on current DoD investments.  2) Maturation of Service and Defense Agency identified prototypes to enable red teaming, demonstrations, experiments, and CONOPS earlier in the development cycle.  These prototypes increase agility and rate of innovation for emerging capabilities, while reducing cost and risk.  3) Exploring unconventional approaches to counter current DoD and adversary technologies through red teams, war games, simulation exercises, and studies that employ government laboratory scientists; subject matter experts; and, students of science, technology, engineering, and math disciplines.  Red teaming events range from distributed table-top games to simulated and live field exercises with non-traditional and operationally experienced participants.  Deliverables include characterizations of future prototypes, requirement definitions, recommendations on system operational employment, potential vulnerabilities, and likely countermeasures that could be taken by the threat as well as potential counter-countermeasures to increase functionality or operational effectiveness of the system.  The USD(R&E) will leverage these products to inform how technologies and integrated systems can perform in hostile environments and develop new CONOPS.\n\nIn FY 2019, red teaming efforts were conducted to support the National Defense Strategy’s priority for increased lethality and the Department of Defense’s modernization priorities for cyber and artificial intelligence\/machine learning.  An early stage investigation was conducted to explore inherent vulnerabilities in a conceptual, pre-development technology prior to full funding commitments.  A prototype was developed and assessed for utility by an associated red teaming event with operationally-experienced participants.  Maturing technologies were red teamed to, either understand how best to implement and adapt the technology into CONOPS, or determine how best to counter adversary responses to the technology.  Additional details are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.982"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.971"
                                            },
                                            "Text": {
                                                "val": "Investment decisions for red teaming are made during the execution year in response to Department, Combatant Command, Service, and other government organization priorities and as new threats emerge or new opportunities are presented.  In FY 2020, this project anticipants funding five to ten efforts to investigate red and blue impacts of technologies associated with DoD modernization priorities.  Potential projects include assessments and demonstrations of electronic warfare capabilities and weaknesses; operations with high-bandwidth over-the-horizon networked communications; emerging near-peer counters in the areas of fully networked, smart devices; quantum sensors; and other potential counters to future U.S. technology investments.  Project selection will be guided by the National Defense Strategy, and priorities and gaps identified by the Department, Combatant Commands, Services, other government organizations, FFRDCs, academia, and industry as new threats emerge or new opportunities are presented.  FY 2020 projects will focus on efforts that complement, fill gaps, or align with the FY 2021 capability thrust areas identified in PE 0603338D8Z Defense Modernization and Prototyping."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2021, these efforts will transition to PE 0603338D8Z Defense Modernization and Prototyping to increase coordination and streamline transition of promising capabilities."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}