{
    "id": "2021-DefenseAdvancedResearchProjectsAgency-PB-0400-MJBOOK-0-0-2716d21dbc896f45f0ab55d1cbc64884530e2bcd27618d8f0e40b216a43f556d-13",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-DARPA-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603767E"
        },
        "ProgramElementTitle": {
            "val": "SENSOR TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "59"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "174.094"
            },
            "CurrentYear": {
                "val": "158.903"
            },
            "BudgetYearOne": {
                "val": "200.220"
            },
            "BudgetYearOneBase": {
                "val": "200.220"
            },
            "BudgetYearTwo": {
                "val": "189.258"
            },
            "BudgetYearThree": {
                "val": "220.596"
            },
            "BudgetYearFour": {
                "val": "254.964"
            },
            "BudgetYearFive": {
                "val": "264.233"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Sensor Technology program element is budgeted in the Advanced Technology Development Budget Activity because it funds sensor efforts that will improve the accuracy and timeliness of our surveillance and targeting systems for improved battlefield awareness, strike capability and battle damage assessment.  \n\nThe Surveillance and Countermeasures Technology project funds sensor efforts that will improve the accuracy and timeliness of our surveillance and targeting systems for improved battlefield awareness, strike capability, and battle damage assessment.  Timely surveillance of enemy territory under all weather conditions is critical to providing our forces with the tactical information needed to succeed in future wars.  This operational surveillance capability must continue to perform during enemy efforts to deny and deceive the sensor systems, and operate, at times, in a clandestine manner.  This project will exploit recent advances in multispectral target phenomenology, signal processing, low-power high-performance computing, and low-cost microelectronics to develop advanced surveillance and targeting systems.  In addition, this project encompasses several advanced technologies related to the development of techniques to counter advanced battlefield threats.\n\nThe Sensors and Processing Systems project develops and demonstrates the advanced sensor and processing technologies and systems necessary for Intelligence, Surveillance, and Reconnaissance (ISR) missions.  Future battlefields will continue to be populated with targets that use mobility and concealment as key survival tactics, and high-value targets will range from specific individual insurgents and vehicles to groups of individuals and large platforms such as mobile missile launchers and artillery.  The Sensors and Processing Systems project is primarily driven by four needs: (a) providing day-night ISR capabilities against the entire range of potential targets; (b) countering camouflage, concealment, and deception of mobile ground targets; (c) detecting and identifying objects of interest\/targets across wide geographic areas in near-real-time; and (d) enabling reliable identification, precision fire control tracking, timely engagement, and accurate battle damage assessment of ground targets."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "183.101"
                },
                "CurrentYear": {
                    "val": "163.903"
                },
                "BudgetYearOne": {
                    "val": "269.619"
                },
                "BudgetYearOneBase": {
                    "val": "269.619"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "174.094"
                },
                "CurrentYear": {
                    "val": "158.903"
                },
                "BudgetYearOne": {
                    "val": "200.220"
                },
                "BudgetYearOneBase": {
                    "val": "200.220"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-9.007"
                },
                "CurrentYear": {
                    "val": "-5.000"
                },
                "BudgetYearOne": {
                    "val": "-69.399"
                },
                "BudgetYearOneBase": {
                    "val": "-69.399"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-5.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.850"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-6.157"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-69.399"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-69.399"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019:  Decrease reflects the reprogrammings and the SBIR\/STTR transfer.\nFY 2020:  Decrease reflects congressional reduction.\nFY 2021:  Decrease reflects rephasing of several programs in the Surveillance and Countermeasures Technology and Sensors and Processing Systems projects."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "SEN-01"
                    },
                    "ProjectTitle": {
                        "val": "SURVEILLANCE AND COUNTERMEASURES TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "37.926"
                        },
                        "CurrentYear": {
                            "val": "37.766"
                        },
                        "BudgetYearOne": {
                            "val": "33.281"
                        },
                        "BudgetYearOneBase": {
                            "val": "33.281"
                        },
                        "BudgetYearTwo": {
                            "val": "19.401"
                        },
                        "BudgetYearThree": {
                            "val": "8.401"
                        },
                        "BudgetYearFour": {
                            "val": "8.401"
                        },
                        "BudgetYearFive": {
                            "val": "8.401"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Surveillance and Countermeasures Technology project funds sensor efforts that will improve the accuracy and timeliness of our surveillance and targeting systems for improved battlefield awareness, strike capability, and battle damage assessment.  Timely surveillance of enemy territory under all weather conditions is critical to providing our forces with the tactical information needed to succeed in future wars.  This operational surveillance capability must continue to perform during enemy efforts to deny and deceive the sensor systems, and operate, at times, in a clandestine manner.  This project will exploit recent advances in multispectral target phenomenology, signal processing, low-power high-performance computing, and low-cost microelectronics to develop advanced surveillance and targeting systems.  In addition, this project encompasses several advanced technologies related to the development of techniques to counter advanced battlefield threats."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aerial Dragnet"
                                    },
                                    "Description": {
                                        "val": "Aerial Dragnet seeks to detect multiple small Unmanned Aerial Systems (UAS) in complex and\/or urban terrain before they are within Line-Of-Sight (LOS) of friendly assets.  Unlike traditional air targets, small UASs pose a special threat in urban terrain for several reasons: they can fly at low altitudes between buildings, they are small making them difficult to sense, and they move at slow speeds making them difficult to differentiate from other moving objects.  Moreover, the development of small UASs is driven by commercial technologies, which make them rapidly adaptable and very easy to use.  Building upon research conducted in the System of Systems Integration Technology and Experimentation (SoSITE) program (budgeted in PE 0603766E, Project NET-01), Aerial Dragnet will perform surveillance using an architecture consisting of networked sensors mounted on distributed aerial platforms.  The ability to see over and into urban terrain allows Aerial Dragnet to detect, track, and classify UAS incursions rapidly, thus enabling multiple defeat options.  This program focuses on the development of payloads to be hosted on unmanned aerial platforms, comprising of signal processing software, sensor hardware, and networking for distributed, autonomous operation.  The system will be scalable to provide cost-effective surveillance coverage from neighborhood to city-sized areas.  Aerial Dragnet technologies are expected to transition to the Army, Marine Corps, and Department of Homeland Security."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.508"
                                            },
                                            "Text": {
                                                "val": "-  Updated hardware sensor payloads to reduce size, weight, power, and cost.\n-  Analyzed sensor data to assess target tracking non-line-of-sight from sensor platform.\n-  Networked surveillance platforms to enable target tracking adapted to urban terrain.\n-  Demonstrated small UAS detection and tracking in sparse urban terrain."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.071"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate multiple UAS detection and tracking in a dense, multi-neighborhood-sized urban area.\n-  Improve classification algorithms to reduce false alarms.\n-  Develop autonomy algorithms to allow platforms to adapt to urban terrain.\n-  Engage transition partners to adopt developed systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.356"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.356"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate persistent UAS detection, classification, and tracking in a dense, city-sized urban area. \n-  Evaluate system performance in defense against a scripted, multi-UAS attack on an urban area."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects the transition from system development to test and evaluation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Shosty"
                                    },
                                    "Description": {
                                        "val": "Shosty seeks to develop and demonstrate enhanced capabilities for high frequency (HF) over-the-horizon-radar (OTHR) systems.  This program will develop techniques to characterize distributed skywave HF radar propagation channels and measure radar backscatter from the surface.  System signal processing, modeling, analysis, and over-the-air experimentation will be conducted to assess performance.  Technologies developed under the Shosty program will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.144"
                                            },
                                            "Text": {
                                                "val": "-  Began design and integration of multi-channel receive systems.\n-  Began development of waveforms and signal processing for distributed geometries.\n-  Performed system modeling to assess target detection performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.625"
                                            },
                                            "Text": {
                                                "val": "-  Complete HF transmit system integration.\n-  Conduct over-the-air field tests to assess propagation and backscatter characteristics.\n-  Confirm physical modeling and analysis using measured experimental data.\n-  Compare performance of distributed geometries through modeling and experimentation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.855"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.855"
                                            },
                                            "Text": {
                                                "val": "-  Design and procure multi-site receive system capable of handling advanced waveform design.\n-  Develop signal processing algorithms for coordinated, multi-site receive system.\n-  Perform end-to-end multi-site, multi-static over-the-horizon radar demonstration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects a shift from development and integration of the technologies to demonstrations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "All Source Combat Operations and Targeting (ASCOT)"
                                    },
                                    "Description": {
                                        "val": "The All Source Combat Operations and Targeting (ASCOT) program will allow maritime platforms to maintain robust battlespace awareness and survivability by combining data and coordinating operations using all available sensors.  The program will create methods for optimal balancing of battlespace awareness and survivability by leveraging existing networked sensor and local platform sensors.  The program builds upon technology developed as a part of the Resilient Synchronized Planning & Assessment Contested Environment (RSPACE) program, budgeted in PE 0603766E\/Project NET-01.  Key attributes of this program are survivability, information latency, reliability, and endurance.  Demonstrations on relevant platforms in relevant environments will be used to validate the technology.  Technologies from this program will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.274"
                                            },
                                            "Text": {
                                                "val": "-  Initiated the development of sensor fusion and data analysis tools.\n-  Initiated the development of payloads for networked sensor testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.070"
                                            },
                                            "Text": {
                                                "val": "-  Conduct testing of sensor fusion and data analysis tools in simulation and test environment.\n-  Analyze collected data to identify system performance and examine robustness.\n-  Conduct lab testing of payload designs.\n-  Initiate the development of adaptive combat control techniques."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.070"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.070"
                                            },
                                            "Text": {
                                                "val": "-  Conduct localization field testing with payload.\n-  Conduct performance review of payload design and sensor fusion\/data analysis tools. \n-  Initiate development of full payload and advanced targeting architecture.  \n-  Conduct initial sensor fusion and data analysis tests in support of an at-sea demonstration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects a shift from system design and development to architecture-level integration and field testing of payload."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "SEN-02"
                    },
                    "ProjectTitle": {
                        "val": "SENSORS AND PROCESSING SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "60.436"
                        },
                        "CurrentYear": {
                            "val": "67.237"
                        },
                        "BudgetYearOne": {
                            "val": "64.414"
                        },
                        "BudgetYearOneBase": {
                            "val": "64.414"
                        },
                        "BudgetYearTwo": {
                            "val": "78.014"
                        },
                        "BudgetYearThree": {
                            "val": "153.831"
                        },
                        "BudgetYearFour": {
                            "val": "235.563"
                        },
                        "BudgetYearFive": {
                            "val": "255.832"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Sensors and Processing Systems project develops and demonstrates the advanced sensor and processing technologies and systems necessary for Intelligence, Surveillance, and Reconnaissance (ISR) missions.  Future battlefields will continue to be populated with targets that use mobility and concealment as key survival tactics, and high-value targets will range from specific individual insurgents and vehicles to groups of individuals and large platforms such as mobile missile launchers and artillery.  The Sensors and Processing Systems project is primarily driven by four needs: (a) providing day-night ISR capabilities against the entire range of potential targets; (b) countering camouflage, concealment, and deception of mobile ground targets; (c) detecting and identifying objects of interest\/targets across wide geographic areas in near-real-time; and (d) enabling reliable identification, precision fire control tracking, timely engagement, and accurate battle damage assessment of ground targets.  The Sensors and Processing Systems project develops and demonstrates technologies and system concepts that combine novel approaches to sensing with emerging sensor technologies and advanced sensor and image processing algorithms, software, and hardware to enable comprehensive knowledge of the battlespace and detection, identification, tracking, engagement, and battle damage assessment for high-value targets in all weather conditions and combat environments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Dynamically Composed RF Systems"
                                    },
                                    "Description": {
                                        "val": "Dominance of the Radio Frequency (RF) spectrum is critical to successful U.S. military operations.  Radar systems, electronic warfare (EW) systems, and communication systems require custom software and hardware that is costly and time-consuming to build and integrate onto platforms.  The Dynamically Composed RF Systems program addresses these challenges by developing adaptive, converged RF array systems.  This enables enhanced operational capability by dynamically adapting the system for tasks to support radar, communications, and EW in a converged manner.  This program will design and develop: (1) a modular architecture for collaborative, agile RF systems; (2) advanced techniques for RF apertures and airframe integration and the associated wide-band agile electronics to support converged missions over those apertures; (3) a heterogeneous signal processing complex implementing hardware-agnostic RF operating modes (the RF Virtual Machine); (4) software tools for the control, coordination, and scheduling of RF functions and payloads at the element level to maximize overall task performance (a System and Sensor Resource Manager (SSRM)).  This capability can be adapted to address diverse missions.  Technology developed under this program will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.864"
                                            },
                                            "Text": {
                                                "val": "-  Initiated collaboration to support transition opportunities and develop approaches for integrating SSRM onto existing RF payloads.\n-  Completed interface control documents defining interfaces between the SSRM, the payload, and off-board controllers.\n-  Designed and began implementation of initial version of objective system SSRM software."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.972"
                                            },
                                            "Text": {
                                                "val": "-  Complete initial version of objective system SSRM software and payload interfaces.\n-  Integrate SSRM software onto two third-party payloads and conduct integration testing to validate ability of SSRM to control the third-party payloads.\n-  Develop upgraded version of SSRM software and conduct acceptance testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.758"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.758"
                                            },
                                            "Text": {
                                                "val": "- Conduct laboratory testing of the SSRM installed on the two third-party payloads to demonstrate the SSRM's ability to control the two payloads in concert. \n- Conduct flight tests of the SSRM controlling third-party payloads and demonstrate ability to control those payloads in flight."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects the transition from initial development of the SSRM software and integration onto third-party payloads to a focus on testing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Military Tactical Means (MTM)*"
                                    },
                                    "Description": {
                                        "val": "*formerly Cross-Domain Multi-Modality Sensing & Targeting\n\nThe Military Tactical Means (MTM) program will develop sensors and exploitation techniques capable of performing wide-area search to detect high-value targets in order to task engagement systems to close effects-chains.  Finding and prosecuting targets with distributed effects-chains requires the ability to detect, track, and maintain custody of targets across sensors with different modalities residing in various domains.  Building upon technologies from the Automatic Target Recognition (ATR) program, budgeted in this PE\/Project, this program will examine both the sensors and the exploitation needed to perform this wide-area search for missions in denied territories and maintain positive chain of custody hand-offs to one or more targeting sensors.  The sensors developed under this program will concentrate on sensor modalities that are mostly geometry-invariant and have the potential to be used in highly proliferated systems, such as small satellite constellations and small terrestrial platforms (e.g. class-I or II unmanned aerial system).  The exploitation portion of this program will develop algorithms to ensure consistency when passing chain of custody between sensors in different domains with possibly different sensing modalities and will also be designed to increase confidence and accuracy as targets are passed between sensors.  Technology developed by this program will transition to the Services and other government agencies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.806"
                                            },
                                            "Text": {
                                                "val": "-  Begin development of exploitation algorithms suitable for abstracted target characterization to enable consistent chain of custody.\n-  Begin development of multi-mode sensor modules.\n-  Begin modeling of processing algorithms with emulated and real data.\n-  Begin development of measures of performance (MOP) and measures of effectiveness (MOE)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.524"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.524"
                                            },
                                            "Text": {
                                                "val": "-\tContinue multi-mode sensor module design based on size, weight, power, and modality requirements.\n-\tConduct preliminary and critical design reviews of the senor modules to determine viability of the designs.\n-\tBegin building sensor modules and begin integration efforts into the host platform.\n-\tContinue development of exploitation algorithms to further refine the effectiveness of the modalities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects the shift from component-level research to system integration."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Military Tactical Means (MTM) Demo"
                                    },
                                    "Description": {
                                        "val": "The MTM Demo program will develop sensors and software automation capable of supporting future tactical Intelligence, Surveillance, and Reconnaissance (ISR) operations.  This scalable multi-modal ISR approach will allow tactical users to rapidly characterize, quantify and report battlespace environments and conditions.  Based on technologies developed in the Military Tactical Means (MTM) program (also budgeted in this PE\/Project), MTM Demo will demonstrate rapid signature discovery options for improving target discrimination and tracking while also providing key foundational information to support both rural and complex urban Military Stability Operations (MSO).  MTM Demo aims to rapidly develop and demonstrate a prototype system, the data from which will be used to optimize both Automated Target Recognition (ATRs) and MSO algorithms.  Technology developed by this program will transition to the Services and other government agencies."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.447"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.447"
                                            },
                                            "Text": {
                                                "val": "- Develop MSO concepts of operation with military partners. \n- Conduct system requirements review (SRR) and preliminary design review (PDR).\n- Develop demonstrations plans for tactical scenarios."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Non-Kinetic Effects (NKE)"
                                    },
                                    "Description": {
                                        "val": "The Non-Kinetic Effects (NKE) program will develop new systems for signal attack, sensing and protection.  Electronic warfare (EW) covers these three aspects when the signals are electromagnetic in nature.  The NKE program will include EW innovation as a subset of NKE's broader objectives where signal includes electromagnetics and other non-kinetic modes of operation.  A new paradigm will be employed in NKE focused on offensive measures, as opposed to the traditional approach that concentrates on protection with attacks that are typically defensive and\/or responsive in nature.  NKE will develop new technologies as required, but will primarily focus at the system level, where multi-system architectures will be developed.  System management and non-kinetic battle assessment technologies will be required to support the multi-mode NKE mission.  The NKE systems are applicable to force-on-force conflict, but will also provide new options for conducting hybrid operations at all scales of conflict.  Technologies will be transferred to the Services."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.527"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.527"
                                            },
                                            "Text": {
                                                "val": "- Begin development of offensive non-kinetic engagement techniques and phenomenologies.\n- Begin development of single- and multi-system techniques management and effectiveness assessment.\n- Identify options to modify existing systems for coordinated techniques to enable novel non-kinetic effects."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Coho"
                                    },
                                    "Description": {
                                        "val": "The Coho program will develop advanced signal processing technologies and techniques for future Radio Frequency (RF) systems.  These systems will create an asymmetric advantage for tactical operations in anti-access\/area-denial environments by extending the real-time operating bandwidth of tactical signal processing, underpinning the ability of U.S. and Allied Forces to accurately orient and beneficially maneuver in the electromagnetic spectrum.  Based on technologies developed under the All-Signal Tactical Real-time Analyzer (ASTRAL) program, budgeted in this PE and Project, the objective of Coho is to provide ultra wide-band RF signal detection and recognition capabilities in a form factor suitable for tactical platforms.  Coho seeks to provide capabilities for multiple mission areas.  These capabilities include (1) surveillance: combining wide operating bandwidth with noise isolation for background electromagnetic search in the low signal to noise ratio environment, (2) filtering: isolating signals based on modulation features to process signals in the presence of co-channel interference, and (3) localization: supporting low-latency execution of multi-aperture processing for discrimination of signals based on angle of bearing.  Technology from Coho will transition to the Services."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.158"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.158"
                                            },
                                            "Text": {
                                                "val": "- Define concept of employment for Coho signal detection and recognition.\n- Begin development of algorithms for signal recognition.\n- Simulate performance of Coho in the contested electromagnetic environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Seeker Cost Transformation (SECTR)"
                                    },
                                    "Description": {
                                        "val": "The Seeker Cost Transformation (SECTR) program will develop novel weapon terminal sensing and guidance technologies and systems for air-launched and air-delivered weapons that can: (1) find and acquire fixed and moving targets with only minimal external support, (2) achieve high navigation accuracy in a GPS-denied environment, and (3) be very small in size and weight and potentially low cost.  SECTR-developed systems and technologies will be small size, weight and power (SWaP), low recurring cost, and be applicable to a wide range of weapons and missions, such as small unit lethality, suppression of enemy air defenses, precision strike, and strike of time-sensitive targets.  Hardware technology will leverage passive Electro-Optical and Infrared (EO\/IR) sensors, which have evolved into very small and inexpensive devices in the commercial market, and a reconfigurable processing architecture.  SECTR will also develop a Government-owned open system architecture for the seeker with standardized interfaces between components (both hardware and software).  The technical approach to target recognition will start from \"deep learning\" and machine vision algorithms pioneered for facial recognition and the identification of critical image features.  Technologies developed under this program will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.210"
                                            },
                                            "Text": {
                                                "val": "-  Conducted prototype SECTR seeker and precision guided munition (PGM) captive-carry flight tests and hardware-in-the-loop (HWIL) tests for demonstration of navigation accuracy in GPS-denied environment.\n-  Completed laboratory HWIL algorithm assessment for navigation algorithm for GPS-denied environment and machine learning-based automatic target recognition algorithm for terminal homing and guidance against fixed and moving targets.\n-  Conducted GPS Denied Navigationfree-flight tests of integrated prototype SECTR seeker on multiple  guided PGMs and other platforms"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.626"
                                            },
                                            "Text": {
                                                "val": "-  Conduct additional free-flight tests of SECTR prototype seeker.\n-  Assess seeker performance and update hardware-in-the-loop (HWIL) models and assumptions as needed."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Satellite Sensors"
                                    },
                                    "Description": {
                                        "val": "The Small Satellite Sensors program will develop and space-qualify Electro-Optical Infrared (EO\/IR) sensor and inter-satellite communications technologies and establish feasibility for new DoD tactical capabilities to be implemented on small (< 100 kg) satellites.  Experimental payloads will be flown on small satellites, and data will be collected to validate new operational concepts.  Small satellites provide a low-cost and quick-turnaround capability for testing new technologies and experimental payloads.  Operationally, small and low-cost satellites enable the deployment of larger constellations, which can provide greater coverage, persistence, and survivability compared to a small number of more expensive satellites, as well as the possibility for launch-on-demand.  This program seeks to leverage rapid progress being made by the commercial sector on small satellite bus technology, as well as investments being made by DoD and industry on low-cost launch and launch-on-demand capabilities for small satellites.  The program will focus on developing, demonstrating, and validating key payload technologies needed by DoD that are not currently being developed for commercial space applications.  Technologies developed under this program will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.156"
                                            },
                                            "Text": {
                                                "val": "-  Launched first satellite and conducted on-orbit operations, including mission planning, payload testing, and image collection.\n-  Downlinked raw imagery for ground processing and pre-processed imagery for comparative analysis.\n-  Performed data collection campaigns and analyze experimental data from satellites.\n-  Performed initial inter-satellite communications link tests and coordinate multi-satellite operations.\n-  Demonstrated feasibility of novel real-time tactical operational concepts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.848"
                                            },
                                            "Text": {
                                                "val": "-  Continue space-based data collections.\n-  Continue user demonstration and field activities.\n-  Develop models and reports which quantify effectiveness of the sensor technology and the suite of processing algorithms.\n-  Transition key results and technologies to military users for use in operational constellations.\n-  Complete on-orbit operations, user demonstration, and field activities with satellites. \n-  Initiate design activities for next-generation prototypes designed for transition to a potential operational constellation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "All-Signal Tactical Real-Time Analyzer (ASTRAL)"
                                    },
                                    "Description": {
                                        "val": "The All-Signal Tactical Real-time Analyzer (ASTRAL) program will develop and demonstrate a system for radio frequency and optical electromagnetic signal surveillance and environment understanding.  Building on technologies explored under the Dynamically Composed RF Systems program, also budgeted in this PE\/Project, the objective of ASTRAL is to provide a factor of at least 1,000 times improvement over current signal awareness processing speed over broad spectral coverage.  The program will use technology that supports a development path leading to a mobile, tactical capability.  The development objectives of the ASTRAL program are to (1) develop a hybrid processor that provides real-time processing of the most challenging Low-Probability-of-Intercept (LPI) threat signals across a wide bandwidth, and (2) identify exploitation algorithms for military applications that are well-suited to this type of hybrid processor.  Several strategic and tactical spectrum awareness applications that may be addressed include, but are not limited to: (a) real-time exploitation of optical communications, (b) city-wide wireless device geo-location, (c) broadband LPI radar warning, and (d) theater-wide spread-spectrum LPI radio geo-location.  ASTRAL will transition to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.368"
                                            },
                                            "Text": {
                                                "val": "-  Identified hybrid processor architectures suited for a wide range of tactical military signal awareness applications.\n-  Integrated the brassboard hybrid signal processor system.\n-  Demonstrated LPI signal processing at broad bandwidth in a laboratory environment with simulated and real signal inputs.\n-  Selected hybrid processor architectures for specific tactical military application development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.832"
                                            },
                                            "Text": {
                                                "val": "-  Begin hybrid processor architecture development, identifying risks and risk mitigation approaches.\n-  Demonstrate execution of algorithms suitable for tactical applications with brassboard system in the laboratory environment.\n-  Define concept of operations plans for tactical applications of the hybrid processor architectures.\n-  Complete hybrid processor architecture development.\n-  Transition the ASTRAL technology to the Navy's Future Naval Capability effort."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Collection and Monitoring via Planning for Active Situational Scenarios (COMPASS)"
                                    },
                                    "Description": {
                                        "val": "The Collection and Monitoring via Planning for Active Situational Scenarios (COMPASS) program will build decision aids for gray zone scenarios, where adversaries attempt to manipulate a U.S.-allied nation through the use of both kinetic and non-kinetic means.  Based on research performed under the Resilient Synchronized Planning & Assessment Contested Environment (RSPACE) program, budgeted in PE 0603766E, Project NET-01, the purpose of the COMPASS program is to reduce ambiguity and reveal intent of gray zone actors who use techniques such as misinformation and intimidation to destabilize host nations and possibly produce advantageous conditions for military engagements. The tools produced by COMPASS will automate gray zone information operations and help U.S. forces adapt to changing conditions and adversary responses. Instead of relying on passive collection of sensory data, COMPASS will employ active sensing and recommend actions that U.S. Forces and allied partners can take to stimulate the environment and reveal any hostile strategies. To achieve this goal, COMPASS will build and demonstrate tools to: 1) develop a dynamic model of hostile activities in a gray zone environment, 2) assess the decision space to recommend which actions may provide the highest value information, and 3) monitor execution of these actions to assess incremental progress toward reducing the ambiguity of the operating environment and suggest adjustments.  COMPASS will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.158"
                                            },
                                            "Text": {
                                                "val": "-  Developed a taxonomy for COMPASS operations.\n-  Designed gray zone modeling, initial algorithms for action generation, and initial development of monitor and assessment tools.\n-  Built a library of real and synthetic data and a laboratory simulation test environment.\n-  Commenced development of technology to create a situational awareness picture when critical services of the operating environment are disrupted."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.153"
                                            },
                                            "Text": {
                                                "val": "-  Increase complexity of the gray zone environment and improve the effectiveness of the algorithms for action generation.\n-  Expand situational awareness to include social activities such as economic, political, and influence campaigns.\n-  Improve the functionality of the tool to account for adversaries that adapt their behavior.\n-  Conduct experiments and demonstrations for operational users to assess utility and explore transition."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Spatial, Temporal and Orientation Information for Contested Environments (STOIC)"
                                    },
                                    "Description": {
                                        "val": "The Spatial, Temporal and Orientation Information for Contested Environments (STOIC) program enabled precision cooperative effects by developing global time transfer and synchronization systems independent of GPS.  As a corollary to time synchronization, this program also enabled GPS-independent positioning to maintain precise time synchronization between collaborating mobile users.  Key attributes of this program are global availability, minimal and low cost infrastructure, anti-jamming capability, and performance equal to or better than GPS, achieved through recent advances in optical clocks and time transfer.  Demonstrations on relevant platforms in relevant environments were used to validate the technology.  Technologies from this program transitioned to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.056"
                                            },
                                            "Text": {
                                                "val": "-  Conducted field demonstrations of Very Low Frequency (VLF)-based positioning system with ionospheric modeling correction to validate performance in a relevant environment.\n-  Conducted evaluation and analysis of field test results.\n-  Transitioned VLF-based positioning system to the Navy."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Automatic Target Recognition (ATR) Technology"
                                    },
                                    "Description": {
                                        "val": "Automatic Target Recognition (ATR) systems provide the capability to detect, identify, and track high value targets from collected sensor data.  ATRs have typically been designed for specific sensors and provide only limited, static mission support due to pre-programmed target lists and operating modes.  Extending ATR technology to accommodate sensor upgrades or include new emerging targets has been costly and time-consuming.  The objective of the ATR Technology program was to develop technologies that reduce operational limitations while also providing significant performance improvements, dramatically reduced development times, and reduced life-cycle maintenance costs.  Breakthroughs in deep learning algorithms and embedded computing systems promised dramatic improvements in ATR utility.  The program focused on three core areas: (1) development of on-line adaptive algorithms that enabled performance-driven sensing and ATR utility; (2) algorithm training technology that enabled rapid incorporation of new targets; and (3) technologies that dramatically reduced required data rates, processing times, and the overall hardware and software demands of ATR systems.  ATR technology developed under the program transitioned to multiple agencies within the Department of Defense."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.624"
                                            },
                                            "Text": {
                                                "val": "-  Continued ATR algorithm development with the focus on significantly reducing training data requirements.\n-  Conducted additional flight demonstrations of ATR algorithms operating on an airborne platform to facilitate transition to the Services.\n-  Extended ATR applications to the National Geospatial-Intelligence Agency (NGA) Scale cloud computing environment and other Intelligence, Surveillance, and Reconnaissance (ISR) systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "SEN-06"
                    },
                    "ProjectTitle": {
                        "val": "SENSOR TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "75.732"
                        },
                        "CurrentYear": {
                            "val": "53.900"
                        },
                        "BudgetYearOne": {
                            "val": "102.525"
                        },
                        "BudgetYearOneBase": {
                            "val": "102.525"
                        },
                        "BudgetYearTwo": {
                            "val": "91.843"
                        },
                        "BudgetYearThree": {
                            "val": "58.364"
                        },
                        "BudgetYearFour": {
                            "val": "11.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds classified DARPA programs that are reported in accordance with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Classified DARPA Program"
                                    },
                                    "Description": {
                                        "val": "This project funds Classified DARPA Programs.  Details of this submission are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "75.732"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "53.900"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "102.525"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "102.525"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Details will be provided under separate cover."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}