{
    "id": "2021-Army-PB-2040-JBOOK-714ad55e40c208dd6daa0faf0cf32aa88e3bc8f15c4df77071b9706a36db953e-16",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA5A-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604760A"
        },
        "ProgramElementTitle": {
            "val": "Distributive Interactive Simulations (DIS) - Eng Dev"
        },
        "R1LineNumber": {
            "val": "134"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "8.423"
            },
            "CurrentYear": {
                "val": "7.801"
            },
            "BudgetYearOne": {
                "val": "7.892"
            },
            "BudgetYearOneBase": {
                "val": "7.892"
            },
            "BudgetYearTwo": {
                "val": "7.888"
            },
            "BudgetYearThree": {
                "val": "8.032"
            },
            "BudgetYearFour": {
                "val": "8.019"
            },
            "BudgetYearFive": {
                "val": "8.099"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "56.154"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The program element \"Distributive Interactive Simulations - Engineering Development\" applies to the Army's Advanced Simulation Program, which enables operational readiness and the development of concepts and systems for the Future Force through the application of new simulation technology and techniques.  The development and application of simulation technology will provide the means to link electronically a range of various simulation tools in a manner that is transparent to the user.  The amalgam of simulations and tools is linked together to enable execution of an event; to verify the scenarios, tactics\/techniques and procedures; to train testers on new hardware\/software; and to conduct trial test runs before costly live field tests. The tools developed are available for reuse by developers and users of simulations throughout the Army.  \n\nProject C74 funds the HQDA-chartered mission of the Simulation-to-Mission Command Interoperability (SIMCI) Overarching Integrated Product Team (OIPT) in support of Army Training and Readiness. The SIMCI OIPT mission is to provide policy recommendations to Army senior leadership to improve organizations by allowing Soldiers to fight in the same manner in which they train. This is accomplished by interoperability between Mission Command (MC) systems and the Modeling and Simulation (M&S) systems the Army uses to stimulate MC systems for training Soldiers and their Leaders. SIMCI also invests in targeted solutions to critical problem areas that exist between MC and Simulations. The SIMCI OIPT, led by Program Executive Office (PEO) Simulation, Training, and Instrumentation (STRI) and PEO Command Control Communications-Tactical (C3T), uses  focused collaborative processes among its 30+ Army organizations to identify key\/critical interoperability shortfalls and the required materiel solutions.\n\nProject C77, Army Geospatial Data Master Plan, focuses on activities that start with data acquisition from multiple sources and culminate in (1) accurate, robust and timely geospatial data and data management and (2) integration and conversion tools that support multiple battle command, training and mission-rehearsal applications. Project C77 continues development efforts associated with the Ground-Warfighter Geospatial Data Model (GGDM) and Geospatial Data Standards.\n\nOne Semi-Automated Forces (OneSAF) Project C78 develops and delivers a software application that represents activities of units and forces in simulation to support Army Training and Readiness. The application is used by Army agencies to support the concept evaluation, experimentation, materiel acquisition and training throughout the communities.  The focus of this project is systems\/software engineering and design for development and evolution of the architecture and software tools for a universal system of Army computer-generated forces -- OneSAF. OneSAF is a high fidelity brigade-and-below SAF that represents a full range of operations, systems and control processes in support of stand-alone and embedded training and Research, Development and Acquisition (RDA) simulation applications. OneSAF is fully interoperable with the Army's emerging virtual, live, and division-and-above constructive simulations and provides next-generation simulation products. OneSAF replaces a variety of legacy simulations used within the Army to support analytic and training simulation activities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.134"
                },
                "CurrentYear": {
                    "val": "7.801"
                },
                "BudgetYearOne": {
                    "val": "7.9"
                },
                "BudgetYearOneBase": {
                    "val": "7.9"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.423"
                },
                "CurrentYear": {
                    "val": "7.801"
                },
                "BudgetYearOne": {
                    "val": "7.892"
                },
                "BudgetYearOneBase": {
                    "val": "7.892"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.711"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-0.008"
                },
                "BudgetYearOneBase": {
                    "val": "-0.008"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.711"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.008"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.008"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "C74"
                    },
                    "ProjectTitle": {
                        "val": "Devel Simulation Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.241"
                        },
                        "CurrentYear": {
                            "val": "1"
                        },
                        "BudgetYearOne": {
                            "val": "0.999"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.999"
                        },
                        "BudgetYearTwo": {
                            "val": "0.999"
                        },
                        "BudgetYearThree": {
                            "val": "0.999"
                        },
                        "BudgetYearFour": {
                            "val": "0.999"
                        },
                        "BudgetYearFive": {
                            "val": "1.009"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "7.246"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project C74 funds the HQDA-chartered mission of the Simulation-to-Mission Command Interoperability (SIMCI) Overarching Integrated Product Team (OIPT) in support of Army Training and Readiness. The SIMCI OIPT mission is to provide policy recommendations to Army senior leadership to improve organizations by allowing Soldiers to fight in the same manner in which they train. This is accomplished by interoperability between Mission Command (MC) systems and the Modeling and Simulation (M&S) systems the Army uses to stimulate MC systems for training Soldiers and their Leaders. SIMCI also invests in targeted solutions to critical problem areas that exist between MC and Simulations. The SIMCI OIPT, led by Program Executive Office (PEO) Simulation, Training, and Instrumentation (STRI) and PEO Command Control Communications-Tactical (C3T), uses focused collaborative processes among its 30+ Army organizations to identify key\/critical interoperability shortfalls and the required materiel solutions.\n\nThe SIMCI OIPT provides the following: (1) Advisor to Army Leadership--improve MC and M&S interoperability programs, policies, directives, resourcing, and procedures; (2) Technical Investment--sponsor\/support initiatives that seek common solutions to critical interoperability issues surrounding MC and M&S systems; (3) Outreach--conduct & participate in interoperability outreach activities. SIMCI investments consist primarily of cost-sharing initiatives, leveraging initial system solutions of acquisition programs to enhance the interoperability of multiple systems in the Joint Operational Environment. SIMCI investments accelerate implementation within MC and M&S systems, of common data models and information exchanges that are used by other Services and coalition nations, thus enhancing the inherent ability of Army systems to interoperate seamlessly in a Joint, Interagency, Intergovernmental, and Multinational (JIIM) environment.  \n\nFY 2021 base funding in the amount of $0.999 million continues progress with embedding simulation into Mission Command Systems via the Ozone Widget Framework, continues management of the SIMCI OIPT's Army-wide collaborative, interoperability enhancement activities, including architecture alignment, data model alignment, common standards, components, and products. It is focused first on reducing costs and improving capabilities in the areas of automating Operational Plans, Orders, and Reports in support of Army, Joint, and Coalition operations.  Objectives are: identify and articulate to HQDA senior leadership specific standards that require Army-wide implementation; co-develop data standards, architecture standards, implementation specifications and Joint\/Coalition products; continue transition of SIMCI knowledge and proof-of-principle products to Army and Joint acquisition programs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Management for the SIMCI Overarching Integrated Product Team (OIPT) Projects."
                                    },
                                    "Description": {
                                        "val": "Program Management of the SIMCI OIPT's Army-wide collaborative, interoperability enhancement activities, including architecture alignment, data model alignment, common standards, components, and products.  The OIPT consists of a Product Director, engineers, and finance personnel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.241"
                                            },
                                            "Text": {
                                                "val": "Will continue management and support of the SIMCI OIPT'S Army-wide collaborative, interoperability enhancement activities, including architecture alignment, data model alignment, common standards, components, and products. Will continue focus on gap-analysis of the current model and simulation programs and capabilities in the areas of Live, Virtual, and Constructive (LVC) simulations.  This will support the Vice Chief of Staff of the Army's request to find redundancy within the Modeling and Simulation (M&S) community and reduce it.  Objectives are to compare the current M&S capabilities with what will be required in the upcoming LVC-Information Assurance (LVC-IA) and Integrated Training Environment (ITE) environments, which will eventually become the Simulated Training Environment (STE) in 2021.  This will be Army-wide, as well as, Joint combined interagency products.  Focus on ITE with the creation of the blueprint for STE, which is slated to be implemented in 2021."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.959"
                                            },
                                            "Text": {
                                                "val": "Will continue management and support of the SIMCI OIPT'S Army-wide collaborative, interoperability enhancement activities, including architecture alignment, data model alignment, common standards, components, and products. Will continue focus on gap-analysis of the current model and simulation programs and capabilities in the areas of Live, Virtual, and Constructive (LVC) simulations.  This will support the Vice Chief of Staff of the Army's request to find redundancy within the Modeling and Simulation (M&S) community and reduce it.  Objectives are to compare the current M&S capabilities with what will be required in the upcoming LVC-Information Assurance (LVC-IA) and Integrated Training Environment (ITE) environments, which will eventually become the Simulated Training Environment (STE) in 2021.  This will be Army-wide, as well as, Joint combined interagency products.  Focus on ITE with the creation of the blueprint for STE, which is slated to be implemented in 2021."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.999"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.999"
                                            },
                                            "Text": {
                                                "val": "Will continue management and support of the SIMCI OIPT'S Army-wide collaborative, interoperability enhancement activities, including architecture alignment, data model alignment, common standards, components, and products. Will continue focus on gap-analysis of the current model and simulation programs and capabilities in the areas of Live, Virtual, and Constructive (LVC) simulations.  This will support the Vice Chief of Staff of the Army's request to find redundancy within the Modeling and Simulation (M&S) community and reduce it.  Objectives are to compare the current M&S capabilities with what will be required in the upcoming LVC-Information Assurance (LVC-IA) and Integrated Training Environment (ITE) environments, which will eventually become the Simulated Training Environment (STE) in 2021.  This will be Army-wide, as well as, Joint combined interagency products.  Focus on ITE with the creation of the blueprint for STE, which is slated to be implemented in FY 2021."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 to FY 2021 increase due to economic adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.041"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "SIMCI uses other contract vehicles (internal\/external) and awards money to work on specific technical projects.  This provides the opportunity to leverage technical expertise from different agencies.  SIMCI chooses projects that enhance current capabilities, closes the gaps of existing capabilities, and makes the determination for future projects that affect both the Mission Command and Live, Virtual, Constructive simulations environment.  SIMCI only chooses those projects that meet specific requirements and criteria as stated above.  It is one of SIMCI's missions to locate, utilize, or upgrade those projects or specific products that do just that."
                        },
                        "AcquisitionStrategy": {
                            "val": "SIMCI Overarching Integrated Product Team (OIPT) resources are allocated to multiple organizations in both the Mission Command (MC) and Modeling and Simulation (M&S) Communities.  The funds are contracted to execute approved functions and to projects that advance the efforts of SIMCI and components-based architecture alignment.  Products developed transition to the lead or sponsor's program which then maintains the product for the cost savings of itself and other programs in both Communities.  The primary focus for these projects are the following:  Embedded simulations with current Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) systems, gap-analysis for current simulations, and the proper implementation of Next-Generation modeling and simulation capabilities in regards to the Synthetic Training Environment (STE)."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO STRI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.273"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.15"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.135"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.15"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.15"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SBIR\/STTR"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO STRI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.086"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.24"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.326"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.046"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.046"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Transition of simulation initialization capability"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.134"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Geospatial Initiative"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.388"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Data Model applications and reference implementations"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.363"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Implementation of Initialization Products"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.255"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Initialization Study Implementation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.038"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Mission Comand systems data mediation\/web services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.91"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Expanding MTOE System Architecture (SA) Data"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.821"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "C2 Adapter Web Services and Tools"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.66"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SIMCI Program\/OIPT Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.101"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.826"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.809"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.824"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.824"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Army Initialization Program and Technical Work Groups (TWG)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.706"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.025"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.01"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.025"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.025"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "5_C74_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Geospatial Initiative"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Implementation of Initialization Products"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Transition of simulation initialization capability"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Initialization Study Implementation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Data Model applications and reference implementations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "C2 Adapter Web Services and Tools"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Expanding MTOE System Architecture (SA) Data"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Quarterly SIMCI OIPT Meeting"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Annual Project Call"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "C77"
                    },
                    "ProjectTitle": {
                        "val": "Army Geospatial Data Master Plan"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.785"
                        },
                        "CurrentYear": {
                            "val": "0.767"
                        },
                        "BudgetYearOne": {
                            "val": "0.729"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.729"
                        },
                        "BudgetYearTwo": {
                            "val": "0.576"
                        },
                        "BudgetYearThree": {
                            "val": "0.584"
                        },
                        "BudgetYearFour": {
                            "val": "0.59"
                        },
                        "BudgetYearFive": {
                            "val": "0.596"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.627"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project C77 addresses the implementation and acceleration of objectives focused on geospatial standards that were identified in the Army Geospatial Data Integrated Master Plan (AGDIMP), approved by the Chief of Staff, Army in April 2005 and newer guidance and directives including the Army's Geospatial Information Office (GIO) GIO Charter, Army Regulation for Geospatial Information and Services updated in 2014 (AR 115-11), and Army COE (Common Operating Environment Implementation Plan's Geospatial Annex). The AGDIMP and the GIO charter, Geospatial Annex to COE IP, and AR 115-11 require the establishment of an enterprise architecture framed around geospatial standards that address geospatial\/GEOINT data, services, and applications to enable the Army Geospatial Enterprise (AGE). This Army Geospatial Enterprise serves the Army's Programs\/Systems, Organizations (most importantly our soldiers) to provide the geospatial foundation of accurate, robust, and timely geospatial data, robust tools and services that support mission command, intelligence, training, mission-rehearsal and other mission-applications. Project C77 addresses a geospatial\/GeoINT standard-base framework that supports the ground-warfighter. This geospatial standard framework must also fit within the broader National System for Geospatial-Intelligence (NSG) and Allies Systems for GeoINT (ASG) architecture and standards.  The establishment of a ground-warfighter, standards-based framework support the management, dissemination, and update of geospatial data and services from National systems and organization to tactical systems and ground-warfighter in an enterprise fashion that will minimal translation into unique and often proprietary data formats and internal application databases.  \n\nFY 2021 funding continues development efforts associated with the Ground-Warfighter Geospatial Data Model (GGDM) and integration of Geospatial Data Standards into the U.S. Army Geospatial Enterprise (AGE) and the Army M&S Enterprise."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ground-Warfighter Geospatial Data Model (GGDM)"
                                    },
                                    "Description": {
                                        "val": "The GGDM incorporates common data elements that conform to standards mandated by the Department of Defense Information Technology Standards Registry (DISR) for the National System for Geospatial Intelligence (NSG). Incorporating common geospatial data standards into the GGDM makes the Programs of Record (POR) consistent with new DISR-mandated geospatial intelligence standards for the NSG.  The implementation of GGDM across the Army increases system-interoperability at the geospatial data level."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.245"
                                            },
                                            "Text": {
                                                "val": "Initiate development of the next version of GGDM based upon new information and revisions to the National System for Geospatial-Intelligence (NSG) Application Schema (NAS) as well as new requires from the US Army, USMC, and ABCANZ Allies.  Provide GGDM training classes to Army and USMC personnel.  Ensure major Army PORs are implementing the GGDM (I.E. DCGS-A and SECORE)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.127"
                                            },
                                            "Text": {
                                                "val": "Initiate development of the next version of GGDM based upon new information and revisions to the National System for Geospatial-Intelligence (NSG) Application Schema (NAS) as well as new requires from the US Army, USMC, and ABCANZ Allies.  Provide GGDM training classes to Army and USMC personnel.  Ensure major Army PORs are implementing the GGDM (I.E. DCGS-A and SECORE)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.139"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.139"
                                            },
                                            "Text": {
                                                "val": "Initiate development of the next version of GGDM based upon new information and revisions to the National System for Geospatial-Intelligence (NSG) Application Schema (NAS) as well as new requires from the US Army, USMC, and ABCANZ Allies.  Provide GGDM training classes to Army and USMC personnel.  Ensure major Army PORs are implementing the GGDM (I.E. DCGS-A and SECORE)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase from FY 2020 to FY 2021 due to economic adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Geospatial Data Standards"
                                    },
                                    "Description": {
                                        "val": "Army Geospatial Standards including data standards and standards for services to manage, process and disseminate and utilize geospatial data.  Alignment of industry and Open geospatial standards from organizations such as the Open Geospatial Consortium (OGC) and others into the Army Geospatial Enterprise (AGE)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.54"
                                            },
                                            "Text": {
                                                "val": "Will initiate work in collaboration with industry and other agencies to develop new geospatial data and services standards, DOD Profiles of these standards, and technology implementations of these standards.  Focus on standards to support 2D raster tiled maps, 3D globe standards, and initial assessment about vector tile maps.  Additionally, cont. to develop modifications\/updates elevation data formats and services.  Maintain Geospatial Standards compliance matrix, Std-V1, in alignment with quarterly updated NSG standards and DoD Information Technology Standards and Profile Registry (DISR) cycle updates of GeoINT standards and coordinate results with Army CIO\/G6 and ASA(ALT) Programs. Will continue to provide SME support on geospatial data and technology standards to Army PORs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.605"
                                            },
                                            "Text": {
                                                "val": "Will initiate work in collaboration with industry and other agencies to develop new geospatial data and services standards, DOD Profiles of these standards, and technology implementations of these standards.  Focus on standards to support 2D raster tiled maps, 3D globe standards, and initial assessment about vector tile maps.  Additionally, cont. to develop modifications\/updates elevation data formats and services.  Maintain Geospatial Standards compliance matrix, Std-V1, in alignment with quarterly updated NSG standards and DoD Information Technology Standards and Profile Registry (DISR) cycle updates of GeoINT standards and coordinate results with Army CIO\/G6 and ASA(ALT) Programs. Will continue to provide SME support on geospatial data and technology standards to Army PORs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.59"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.59"
                                            },
                                            "Text": {
                                                "val": "Will initiate work in collaboration with industry and other agencies to develop new geospatial data and services standards, DOD Profiles of these standards, and technology implementations of these standards.  Focus on standards to support 2D raster tiled maps, 3D globe standards, and initial assessment about vector tile maps.  Additionally, cont. to develop modifications\/updates elevation data formats and services.  Maintain Geospatial Standards compliance matrix, Std-V1, in alignment with quarterly updated NSG standards and DoD Information Technology Standards and Profile Registry (DISR) cycle updates of GeoINT standards and coordinate results with Army CIO\/G6 and ASA(ALT) Programs. Will continue to provide SME support on geospatial data and technology standards to Army PORs.  Utilize the AGDIMP resource to perform integration of multiple geospatial standards (both 2d and 3d).  Specifically in support of extending the One World Terrain (OWT) capabilities into non-training like applications, such as mission planning, mission rehearsal, and Army operations.  The integration of the geographic 2D world and the capabilities of the polygon based 3D world will provide the soldier with cutting-edge geospatial capabilities and over match moving forward.  Increased support to Army Futures Command is anticipated to drive increased funding requirements starting in FY 2021 and an increase in programming starting in FY 2022."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decrease from FY 2020 to FY 2021 due to economic adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.035"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Resources are allocated to several critical geospatial projects in support of the Army Geospatial Data Integrated Master Plan (AGDIMP) and the Army Geospatial Enterprise (AGE)."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.035"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.035"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Army Geospatial Model and Data Standards"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.258"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.785"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.732"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.729"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.729"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.504"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "5_C77_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Ground Warfighter Geospatial Data Model"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Geospatial Data Standards"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "C78"
                    },
                    "ProjectTitle": {
                        "val": "One Semi-Automated Forces"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.397"
                        },
                        "CurrentYear": {
                            "val": "6.034"
                        },
                        "BudgetYearOne": {
                            "val": "6.164"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.164"
                        },
                        "BudgetYearTwo": {
                            "val": "6.313"
                        },
                        "BudgetYearThree": {
                            "val": "6.449"
                        },
                        "BudgetYearFour": {
                            "val": "6.43"
                        },
                        "BudgetYearFive": {
                            "val": "6.494"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "44.281"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "One Semi-Automated Forces (OneSAF) develops and delivers a software application that represents activities of units and forces in simulation to support Army Training and Readiness. The application is used by Army agencies to support the concept evaluation, experimentation, materiel acquisition and training throughout the communities.  The focus of this project is systems\/software engineering and design for development and evolution of the architecture and software tools for a universal system of Army computer-generated forces -- OneSAF. OneSAF is a high fidelity brigade-and-below SAF that represents a full range of operations, systems and control processes in support of stand-alone and embedded training and Research, Development and Acquisition (RDA) simulation applications. OneSAF is fully interoperable with the Army's emerging virtual, live, and division-and-above constructive simulations and provides next-generation simulation products. OneSAF replaces a variety of legacy simulations used within the Army to support Acquisition, Analysis, Experimentation, Intelligence, Test & Evaluation, and Training simulation activities.  \n\nFY 2021 base funding in the amount of $6.164 million allows for continued development of the software product line by addressing OneSAF Pre-Planned Product Improvements (P3Is) as prioritized and approved by the Training and Doctrine Command (TRADOC). This funding also provides for the management of the infrastructure, equipment, laboratories, and processes needed to develop, test, and release the required product baseline."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activities for the One Semi-Automated Forces program."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the OneSAF program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.971"
                                            },
                                            "Text": {
                                                "val": "Continued the development of software capabilities based on OneSAF P3Is as prioritized and approved by TRADOC. Will continue the software development of functionality that enhances architectural services, components, synthetic environment and infrastructure of the OneSAF Product Line and will provide for software integration, test and release of required software refreshes and Version 8.9"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.492"
                                            },
                                            "Text": {
                                                "val": "Will continue the development of software capabilities based on OneSAF P3Is as prioritized and approved by TRADOC. Will continue the software development of functionality that enhances architectural services, components, synthetic environment and infrastructure of the OneSAF Product Line and will provide for software integration, test and release of required software refreshes and Version 10.0."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.714"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.714"
                                            },
                                            "Text": {
                                                "val": "Will continue the development of software capabilities based on OneSAF P3Is as prioritized and approved by TRADOC. Will continue the software development of functionality that enhances architectural services, components, synthetic environment and infrastructure of the OneSAF Product Line and will provide for software integration, test and release of required software refreshes and Version 10.0."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from FY 2020 to FY 2021 funding is a result of incorporating additional P3I capabilities into OneSAF Software Baseline Version 10.0"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Government System Test and Evaluation for the One Semi-Automated Forces (OneSAF) program."
                                    },
                                    "Description": {
                                        "val": "Government System Test and Evaluation for the OneSAF program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.1"
                                            },
                                            "Text": {
                                                "val": "Provided for the conducting of software, test, integration and release for Version 8.9.  Will provide support to the user community in conducting experiments, analyses, and validation events for integration into the Home Station Training Federation, Network Integration Events (NIE), Battle Lab Collaborative Simulation Environment (BLCSE), Multi Resolution Federation- Brigade (MRF-B) Enhanced, and other LVC applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.009"
                                            },
                                            "Text": {
                                                "val": "Will provide for the conducting of software, test, integration and release for Version 10.0.  Will provide support to the user community in conducting experiments, analyses, and validation events for integration into the Home Station Training Federation, Network Integration Events (NIE), Battle Lab Collaborative Simulation Environment (BLCSE), Entity Simulation Service (ESS) in support of Joint Land Component Constructive Training Capability (JLCCTC), and other LVC applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.1"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.1"
                                            },
                                            "Text": {
                                                "val": "Will provide for the conducting of software, test, integration and release for Version 10.0.  Will provide support to the user community in conducting experiments, analyses, and validation events for integration into the Home Station Training Federation, Network Integration Events (NIE), Battle Lab Collaborative Simulation Environment (BLCSE), Entity Simulation Service (ESS) in support of Joint Land Component Constructive Training Capability (JLCCTC), and other LVC applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from FY2020 to FY2021 due to overall increase in program funding and lack of SBIR\/STTR reduction."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Government Program Management for the One Semi-Automated Forces (OneSAF) program."
                                    },
                                    "Description": {
                                        "val": "Government Program Management for the One Semi-Automated Forces (OneSAF) program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.326"
                                            },
                                            "Text": {
                                                "val": "Provided a portion of program management, engineering and technical oversight, contract support, and travel for support of site surveys and Subject Matter Experts for the development of OneSAF."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.259"
                                            },
                                            "Text": {
                                                "val": "Will provide a portion of program management, engineering and technical oversight, contract support, and travel for support of site surveys and Subject Matter Experts for the development of OneSAF."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.35"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.35"
                                            },
                                            "Text": {
                                                "val": "Will provide a portion of program management, engineering and technical oversight, contract support, and travel for support of site surveys and Subject Matter Experts for the development of OneSAF."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from FY2020 to FY2021 due to overall increase in program funding and lack of SBIR\/STTR reduction."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.274"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "OneSAF continues to manage two Task Orders for the Development, Integration, Interoperability, and Support (I2S) of capabilities products, data, and documentation that fully serves the current and evolving needs of the user community.  \n\nThe enhancements will be executed within the development line as modifications to the released baseline via Engineering Change Proposals (ECPs); Change Requests (CRs): Pre-Planned Product Improvements (P3I); and correction of deficiencies identified as Problem Test Reports (PTRs) and Deficiency Reports (DRs) by the user community.\n\nIn FY 2021, the program will continue with yearly releases of the OneSAF Software versions containing performance enhancements resulting from the development and integration of Pre-Planned Product Improvements (P3I), concurrency enhancements, user feedback, corrections of deficiencies identified as Problem Test Reports (PTR) and Deficiency Reports (DR) and Co-Developers handovers. The OneSAF program will continue to manage the single award contract for the continuing development and maintenance of the software baseline as well as continue to manage the Integrated Development Environment (IDE)."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO STRI, Orlando, FL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "28.556"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.326"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.304"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.35"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.35"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SBIR\/STTR"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO STRI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.46"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.460"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.274"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.274"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Architecture Dev & System Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Science Applications International Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "51.466"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "51.466"
                                                    },
                                                    "TargetValue": {
                                                        "val": "51.466"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Model and Tools Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Science Applications International Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "27.625"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "27.625"
                                                    },
                                                    "TargetValue": {
                                                        "val": "27.625"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Environmental Runtime Component"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Science\nApplications"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.981"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.981"
                                                    },
                                                    "TargetValue": {
                                                        "val": "7.981"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "OneSAF Component Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.648"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.648"
                                                    },
                                                    "TargetValue": {
                                                        "val": "9.648"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Integrated Environment Dev"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Advanced Systems Technology, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.702"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.702"
                                                    },
                                                    "TargetValue": {
                                                        "val": "11.702"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "OneSAF Bridge Contract"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Science Applications International Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.797"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.797"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.797"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Integration, Interoperability, and Support (I2S) & Logical Follow On (LFO)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Cole Engineering Services, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.29"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Development & Production Logical Follow On (LFO)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Leidos"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "19.985"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Riptide"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.135"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.061"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.079"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.244"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.244"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "System Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.597"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Domain Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.285"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.15"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.104"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.15"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.15"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Integrated Development Environment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.936"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Architecture Engr & Tech Spt"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE FFRDC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen Proving Ground, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.759"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.3"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.264"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.32"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.32"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "OneSAF integration, evaluation and test"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "13.729"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.9"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.855"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.9"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.9"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "OneSAF Verification, Validation & Accreditation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.447"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.2"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.154"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.2"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.2"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "5_C78_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "P3I Requirements Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2006"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OneSAF Version Release 5.1.1  (Concurrency Updates)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OneSAF Version Release 5.5  (Concurrency Updates)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OneSAF Version Release 6.0  (Concurrency Updates)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OneSAF Version Release 7.0"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OneSAF Version Release 8.0  (Concurrency Updates)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OneSAF Version Release 8.8  (Concurrency Updates)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OneSAF Version Release 8.9  (Concurrency Updates)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OneSAF Version Release 9.0  (Concurrency Updates)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OneSAF Version Release 10.0  (Concurrency Updates)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OneSAF Version Release 11.0  (Concurrency Updates)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OneSAF Version Release 12.0  (Concurrency Updates)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OneSAF Version Release 13.0  (Concurrency Updates)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OneSAF Version Release 14.0  (Concurrency Updates)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OneSAF Support"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2006"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}