{
    "id": "2021-Navy-PB-1319-MJBOOK-0-0-744c7ee94c2cc798fbfd935e35baade9caa8a86b67e6f22ecedd75220314848f-16",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603123N"
        },
        "ProgramElementTitle": {
            "val": "Force Protection Advanced Technology"
        },
        "R1LineNumber": {
            "val": "17"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "32.140"
            },
            "CurrentYear": {
                "val": "40.286"
            },
            "BudgetYearOne": {
                "val": "24.410"
            },
            "BudgetYearOneBase": {
                "val": "24.410"
            },
            "BudgetYearTwo": {
                "val": "21.723"
            },
            "BudgetYearThree": {
                "val": "17.080"
            },
            "BudgetYearFour": {
                "val": "17.423"
            },
            "BudgetYearFive": {
                "val": "17.773"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This PE addresses advanced technology development associated with providing the capability of Platform and Force Protection for the U.S. Navy. This program supports the development of technologies associated with mission capable, persistent and survivable Naval platforms (surface, subsurface, terrestrial and air) in the areas of Platform Design & Engineering, Power, Energy & Propulsion, and Materials. The program develops technologies for enhanced capability of Naval aviation aircraft platforms in terms of mission effectiveness, platform range, responsiveness, survivability, observability, readiness, safety and life cycle cost. It also develops new Naval air vehicle concepts and high impact, scalable Naval air vehicle technologies. The program also develops advanced technologies, critical to protecting naval installations, to provide seamless full spectrum protection against asymmetric attack by improving the ability to: detect and identify developing and immediate threats; shape our responses through improved situational awareness and decision making; shield personnel, mission critical facilities, infrastructure, and operating fleet assets; maintain essential functions; and sustain and restore critical services in the aftermath of an incident.\n\nToday's Sailors and Marines are enabled by naval Science and Technology (S&T). Since 1946, the Office of Naval Research (ONR) has fostered scientific research related to the maintenance of maritime superiority and national defense.  ONR manages the Department of the Navy's (DON) portfolio of naval Basic and Applied research, and Advanced Technology Development investments to ensure naval forces can effectively deter conflict, but when called upon, fight, win and come home safe. Current investments hedge against uncertainty, providing solutions to commanders today, and options for the future. The Naval S&T budget supports higher guidance defined by the National Defense Strategy, and responds to requirements identified by the Secretary of the Navy through research priorities set by the Chief of Naval Research, coordinated across the Naval Research Enterprise (NRE), and outlined in the Naval R&D Framework. \n\nThis Program Element (PE) funds Advanced Technology Development (ATD) that includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment. Efforts in this PE generally have Technology Readiness Levels TRL) of 4 (component and\/or breadboard validation in laboratory environment.), 5 (component and\/or breadboard validation in relevant environment.), or 6 (system\/subsystem model or prototype demonstration in a relevant environment).\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "32.615"
                },
                "CurrentYear": {
                    "val": "35.286"
                },
                "BudgetYearOne": {
                    "val": "24.410"
                },
                "BudgetYearOneBase": {
                    "val": "24.410"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "32.140"
                },
                "CurrentYear": {
                    "val": "40.286"
                },
                "BudgetYearOne": {
                    "val": "24.410"
                },
                "BudgetYearOneBase": {
                    "val": "24.410"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.475"
                },
                "CurrentYear": {
                    "val": "5.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "5.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.475"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "funding: No significant change."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2912"
                    },
                    "ProjectTitle": {
                        "val": "Force Protection Advanced Technology"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "29.787"
                        },
                        "CurrentYear": {
                            "val": "32.839"
                        },
                        "BudgetYearOne": {
                            "val": "21.907"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.907"
                        },
                        "BudgetYearTwo": {
                            "val": "19.205"
                        },
                        "BudgetYearThree": {
                            "val": "14.519"
                        },
                        "BudgetYearFour": {
                            "val": "14.810"
                        },
                        "BudgetYearFive": {
                            "val": "15.107"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project addresses advanced technology development associated with providing the capability of Platform and Force Protection for the U.S. Navy. This project supports the development of technologies associated with mission capable, persistent and survivable Naval platforms (surface, subsurface, terrestrial, and air) in the areas of Platform Design & Engineering, Power, Energy & Propulsion, and Materials.  This project develops technologies for enhanced capability of Naval aviation aircraft platforms in terms of mission effectiveness, platform range, responsiveness, survivability, observability, readiness, safety and life cycle cost. It also develops new Naval air vehicle concepts and high impact, scalable Naval air vehicle technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Surface Ship and Submarine Hull Mechanical and Electrical (HM&E)"
                                    },
                                    "Description": {
                                        "val": "This project addresses advanced technology development associated with providing the capability of Platform and Force Protection for the U.S. Navy. This project supports the development of technologies associated with mission capable, persistent and survivable naval platforms (surface, subsurface and terrestrial) in the areas of Platform Design & Engineering, Power, Energy & Propulsion and Materials. The primary research efforts within this activity are focused on advanced technology development for Unmanned Sea Surface Vehicles in support of Naval S&T Focus Area on Autonomy and Unmanned Vehicles, At-Sea Vertical Launch System rearming and Advanced Materials Development. Unmanned Sea Surface Vehicle (USSV) technology development includes autonomous navigation for USSVs. Also funded in this activity is the Energy System Technology Evaluation Program (ESTEP), which promotes innovation and entrepreneurial opportunities for naval personnel and student veterans through advanced technology development and demonstration projects at naval facilities and laboratories."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.536"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.703"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct advanced research related to critical S&T for development of autonomous navigation for Unmanned Sea Surface Vehicles from host ship. \n \n- Continue ESTEP project efforts, including assessment of advanced energy technologies; development of cyber-physical security for energy networks; and utilization of autonomous systems, artificial intelligence and advanced manufacturing to address operational challenges in logistics and readiness.\n\n- Continue efforts for prototype and operational FY22 demonstration of At-Sea Rearm of Vertical Launch System (ASRV) capability in a relevant environment including crane, mooring system, strike-up\/strike-down system fabrication and testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.770"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.770"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Autonomous Unmanned Surface Vessel (USV): advance research related to the development of planing hull platforms. The technologies resulting from these efforts are being moved forward for use on unmanned surface vessels.\n\n- Energy Systems Technology Evaluation Program (E-STEP): project efforts focus on assessing advanced energy technologies, developing cyber-physical security for energy networks, and utilizing autonomous systems, artificial intelligence and advanced manufacturing to address operational challenges in logistics and readiness. Program goals include: advance dual-use and naval-unique technologies that increase operational capabilities and efficiencies; leverage commercial technologies and private investments to provide warfighter capability at reduced cost; and evaluate innovative technologies from naval laboratories and startup companies.\n\n- At-Sea Rearm of Vertical Launch System (ASRV): efforts will focus on further adapting and integrating seabasing technologies into a single system to demonstrate the ASRV capability in Sea State 4 in FY2022. This will include increasing the number of potential rearming sites and reduce off station time associated with rearming at known geographic locations.\n\n- Quality Metal Additive Manufacturing (Quality MADE): conduct research to do a final parts demonstration for accelerated qualification of materials and manufacturing processes for structural components.  This effort is expected to complete in FY2022."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2020 to FY 2021 is due to the (ASRV) moving beyond subsystem hardware purchases (completed in FY19 and FY20) to testing and integration in support of the demonstration in FY 2022."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft Technology"
                                    },
                                    "Description": {
                                        "val": "The Aircraft Technology activity develops technologies for enhanced capability of Naval aviation aircraft platforms in terms of mission effectiveness, platform range, responsiveness, survivability, observability, readiness, safety and life cycle cost. It also develops new Naval air vehicle concepts and high impact, scalable Naval air vehicle technologies, such as helicopter and tiltrotor rotor drive systems, aerodynamics, propulsion systems, materials and structures for future and legacy air vehicles. This activity directly supports the Naval Research and Development Framework Priorities of Operational Endurance and Scalable Lethality."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.251"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.136"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct advanced technology development efforts and demonstrations of the Variable Cycle Advanced Technology (VCAT) Program which will enable the Navy's Next Generation Air Dominance (NGAD) carrier aircraft. Critical technology development efforts continue with major engine manufacturers and to develop\/mature the highest priority, long lead propulsion system technologies, including variable\/adaptive cycle engine controls, variable area turbines, Ceramic Matrix Composites (CMC), Polymer Matrix Composites (PMC), and Integrated Propulsion, Power and Thermal Management Systems (IPPTMS) architectures and technologies. These efforts will support the Navy's planned NGAD Technology Maturation and Risk Reduction program for the engine design and development, and Integrated Propulsion, Power and Thermal Management System."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.137"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.137"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Further development of advanced technology for the Navy's (NGAD) carrier aircraft enabling technologies.  NGAD, previously known as VCAT, Critical Technology development efforts will continue with major engine manufacturers to develop\/mature the highest priority, long lead propulsion system turbine engine technologies, including:\n\t- variable\/adaptive cycle engine controls and variable area turbines, \n\t- Ceramic Matrix Composites (CMC) and Polymer Matrix Composites (PMCs),\n\t- Integrated Propulsion, Power and Thermal Management Systems (IPPTMS) architectures, \n\t- advanced casing treatments, splitted rotors and slatted rotors,\n\t- advanced compression system technologies and compact combustors,  \n\t- improved robustness in austere environment (sand, dust and salt ingestion). \n\n- These Critical Technology Elements will feed into the NGAD Tech Maturity and Risk Reduction (TMRR) Program and increase the aircraft's range, speed and endurance."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no significant changes from FY 2020 to FY 2021."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3049"
                    },
                    "ProjectTitle": {
                        "val": "Force Protection"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "2.353"
                        },
                        "CurrentYear": {
                            "val": "2.447"
                        },
                        "BudgetYearOne": {
                            "val": "2.503"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.503"
                        },
                        "BudgetYearTwo": {
                            "val": "2.518"
                        },
                        "BudgetYearThree": {
                            "val": "2.561"
                        },
                        "BudgetYearFour": {
                            "val": "2.613"
                        },
                        "BudgetYearFive": {
                            "val": "2.666"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Develop advanced technologies, critical to protecting naval installations, to provide seamless full spectrum protection against asymmetric attack by improving the ability to: detect and identify developing and immediate threats; shape our responses through improved situational awareness and decision making; shield personnel, mission critical facilities, infrastructure, and operating fleet assets; maintain essential functions; and sustain and restore critical services in the aftermath of an incident. Technologies developed will also seek to reduce the required manpower and skill levels devoted to the force protection mission, improving performance and reducing costs for the Navy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Emerging Threats"
                                    },
                                    "Description": {
                                        "val": "Naval Installations are a critical component in support of Navy global force projection.  These installations, and the Navy ships, submarines, and aircraft located on them, are under increasing risk from asymmetric attack, including from new threat vectors such as unmanned air, surface, and subsurface vehicles.  This project is focused on the development advanced technologies necessary for the protection of Naval Installations.  Technical efforts address the detect -to-engage-to-assess requirements for Naval Installations by improving the ability to:  sense and identify threats; support improved situational awareness and decision making; and develop effective countermeasures. Technologies developed will also seek to reduce the required manpower and skill levels devoted to the force protection mission."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.353"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.447"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development, and conduct interim demonstration, of the Autonomous Maritime Asset Protection System (AMAPS) capability including integration of unmanned response technologies. Develop capability to detect and Counter small Unmanned Underwater Vehicles (C-UUV) in the harbor environment and integrate into AMAPS. Develop technologies to detect and counter small unmanned air threats within the constraints and parameters associated with Commander Naval Installations (CNIC) and NAVFAC requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.503"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.503"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- (AMAPS): conduct a final demonstration, which will include unmanned response capabilities and a fully integrated Rocket Propelled Grenada (RPG) of the Sea (RPG-S) (C-UUV) capability. \n\n- Day\/night all weather sensors: conduct an interim demonstration, which will include multi-static radar, Passive Millimeter Wave (PMMW) and Dual Band Infrared electro-optic sensors, to detect small unmanned air threats and surface threats in Degraded Visual environments (DVE). Demonstrate the capability for these DVE sensors to accurately cue counter measures systems and assess their effect in real time.\n\n- Automated Target Recognition algorithms: conduct an interim demonstration to assist operations center personnel in detecting and identifying threats."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no significant changes from FY 2020 to FY 2021."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "5.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Additive manufacturing for functional delays"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conduct technology development in Additive manufacturing for functional delays."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}