{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-855515f7cbe1443b1cc76e32ff869263061a887974718017fcc8f688288c6578-13",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603225D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint DOD\/DOE Munitions Technology Development"
        },
        "R1LineNumber": {
            "val": "33"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "17.959"
            },
            "PriorYear": {
                "val": "17.941"
            },
            "CurrentYear": {
                "val": "18.773"
            },
            "BudgetYearOne": {
                "val": "18.873"
            },
            "BudgetYearOneBase": {
                "val": "18.873"
            },
            "BudgetYearTwo": {
                "val": "19.285"
            },
            "BudgetYearThree": {
                "val": "19.621"
            },
            "BudgetYearFour": {
                "val": "20.125"
            },
            "BudgetYearFive": {
                "val": "20.535"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The mission of the Department of Defense (DoD)\/Department of Energy (DOE) Joint Munitions Technology Development Program (JMP) is to develop new and innovative warhead, advanced and disruptive explosive, fuzing, weapons effects, and lifecycle technologies and tools to enable significant improvements in conventional munitions.  The JMP supports the development and exploration of advanced munitions concepts and enabling technologies that precede Service-specific system engineering.  A Memorandum of Understanding signed in 1985 by DoD and DOE provides the basis for the cooperative effort and for cost-sharing the long-term commitment.  The DoD JMP funds budgeted in this justification are matched, at a minimum, dollar for dollar by DOE funds.  Through this interdepartmental cooperation, DoD’s relatively small investment leverages DOE’s substantial investments in intellectual capital and highly specialized skills, advanced scientific equipment and facilities, and computational tools not available within DoD.  Under the auspices of the JMP, the integration of DOE technologies with Joint and Individual Services’ needs has provided major advances in warfighting capabilities over many years and continues to play a crucial role in the exploration, development, and transition of new technologies needed by the Services.\n\nThe JMP has established a successful collaborative community of DoD and DOE scientists and engineers that develop technologies of interest to both Departments within a structured framework of technical reviews and scheduled milestones.  The JMP is administered and monitored by the Office of the Undersecretary of Defense for Research and Engineering (OUSD(R&E)) and reviewed annually by the Munitions Technical Advisory Committee (TAC), which is comprised of munitions laboratory technical directors and senior executives from the Army, Navy, Air Force, OUSD, DOE, and the National Nuclear Security Administration (NNSA).  Projects are organized in five Technology Coordinating Groups (TCG) that bring together the disciplines necessary to properly evaluate technical content, relevance, and progress.  The TCGs conduct semi-annual technical peer reviews of JMP projects and plans.  DoD Service laboratory technical experts lead each of the TCGs to ensure that the technologies under development address high-priority DoD gaps, needs, and challenges.  The The JMP is a focal point for collaborative work by nearly 600 DoD and DOE scientists and engineers.  Technical leaders from both Departments consider the JMP a model of cooperation, both within their respective departments and between departments.  The highly challenging technical objectives of the 30 current projects require multi-year efforts and sustained, long-term investments to achieve success."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "18.602"
                },
                "CurrentYear": {
                    "val": "18.773"
                },
                "BudgetYearOne": {
                    "val": "19.048"
                },
                "BudgetYearOneBase": {
                    "val": "19.048"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "17.941"
                },
                "CurrentYear": {
                    "val": "18.773"
                },
                "BudgetYearOne": {
                    "val": "18.873"
                },
                "BudgetYearOneBase": {
                    "val": "18.873"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.661"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.175"
                },
                "BudgetYearOneBase": {
                    "val": "-0.175"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.658"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.003"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.156"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.156"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.019"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.019"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "225"
                    },
                    "ProjectTitle": {
                        "val": "Joint DOD\/DOE Munitions"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "17.959"
                        },
                        "PriorYear": {
                            "val": "17.941"
                        },
                        "CurrentYear": {
                            "val": "18.773"
                        },
                        "BudgetYearOne": {
                            "val": "18.873"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.873"
                        },
                        "BudgetYearTwo": {
                            "val": "19.285"
                        },
                        "BudgetYearThree": {
                            "val": "19.621"
                        },
                        "BudgetYearFour": {
                            "val": "20.125"
                        },
                        "BudgetYearFive": {
                            "val": "20.535"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Munitions Program (JMP) seeks to develop technological advances in several munitions subject areas aligned with key objectives of the National Defense Strategy (NDS), namely to build a more lethal force by increasing the lethality of munitions while preparing for a sustained investment in conventional munitions technology.  These include:  1) improved modeling and simulation tools for munitions and system design and evaluation, including evaluation of lethality, vulnerability and the design of energetic materials (EM), 2) novel experimental techniques and material property databases to support modeling and simulation, 3) higher power and more thermally stable explosives, 4) miniaturized, lower-cost, and higher reliability fuzes, initiators, power systems, and sensors, 5) design tools to enable development of higher performance warheads and weapons, such as penetrators, that are hardened against high impact loads, and 6) tools to assess the health and reliability of the munitions stockpile.  The supporting experimental research requires the development of new technologies related to the synthesis, processing, formulation, and characterization of advanced munition materials, components, and systems.  This involves energetic material research, new fuzing concepts, dynamic testing of munition materials, and advanced characterization including high-rate in-situ diagnostics.\n\nThe JMP projects are divided into five technical focus areas:  1) Computational Mechanics and Material Modeling, 2) Energetic Materials, 3) Initiators, Fuzes, and Sensors, 4) Warhead and Penetration Technology, and 5) Munitions Lifecycle Technologies.\n\nEach of the 30 projects has a detailed five year plan with objectives, tasks, deliverables and milestones that is approved annually by a group of 20-plus SES members from the DoD munitions laboratories."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint DoD\/DOE Munitions Technology Development"
                                    },
                                    "Description": {
                                        "val": "DoD\/DOE Munitions Technology Development focuses on the following key areas:\n• Computational Mechanics and Material Modeling - develops physics-based computational tools, material models, and calibration and validation databases that support the design and development of weapon systems.\n• Energetic Materials (EM) technical area - develops new ingredients and formulations and supporting technologies to satisfy the competing requirements for smaller, more lethal, and less sensitive munitions.  \n• Initiators, Fuzes, and Sensors - develop new materials, components, diagnostic techniques, and modeling and simulation tools for fuzing systems.\n• Warhead and Penetration Technology - supports the development of new warheads and penetrator weapons through advances in materials processing and characterization, instrumentation, and computational codes.  \n• Munitions Lifecycle Technologies - supports improving the Department’s ability to understand measure, predict, and mitigate safety and reliability problems caused by materials aging and degradation in weapons systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.941"
                                            },
                                            "Text": {
                                                "val": "Release CTH Version 13.0.\nRelease Sierra Mechanics Version 4.52.\nDetermine the effects of thermodynamic non-equilibrium under high strain rate considered using the multi-scale methods in Carta Blanca. \nComplete Ignition\/violence characterization tests on pedigreed PBXN-9, Comp B, and Plastic Bonded eXplosive (PBX) 9501.\nRelease ALE3D Version 4.30.\nTransfer key portions of Lawrence Livermore National Laboratory’s Siboka workflow tools to one or more DoD platforms (Army Armament Research, Development & Engineering Center and Air Force Research Laboratory) for the development of warhead design optimization tools.\nContinue to improve and release the MIDAS material database to the DoD and the DOE."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.773"
                                            },
                                            "Text": {
                                                "val": "In FY2020 the JMP will reorganize its technical area structure to broaden its applicability to meet the Department of Defense’s needs in weapons system technology development and more efficiently leverage Department of Energy investments in beneficial technology development.  The new technical coordination groups (TCGs) reflecting this reorganization are:\n- TCG I: Decision Tools: Computations and Material Modeling - Physics-based computational tools, material models, and calibration and validation databases that support the design and development of weapon systems\n- TCG II: Delivery:  Munition Systems and Delivery – Development of  new architectures, materials, diagnostic techniques, and modeling and simulation applications for weapon delivery\n- TCG III: Munition Controls:  Munitions Command, Control, and Communication – Development of new designs, materials, diagnostic techniques, sensors, modeling, and algorithms for munitions command, control, and communication\n- TCG IV: Lethal Effects:  Ordnance and Target Effects - Develop new materials, components, diagnostic techniques, and modeling and simulation tools for improved lethality and energy release efficiency in weapons systems\n- TCG V: Readiness: Munition Lifecycle Science and Technology – Methodology to quantify, predict, and mitigate safety, reliability, and readiness complications resulting from materials aging and degradation in weapons systems.\n\nThe portfolio of projects will be realigned under the new structure beginning in FY20. \n\n• Computational Mechanics and Material Modeling – develop equations-of-state for additively manufactured polymers and extrudable explosives.    \n   - Release the following M&S code updates:  CTH Version 13.1; Sierra-Zapotec; Sierra\/SM; ALE3D version 4.34; and MIDAS version 2.0.  \n   - Integrate machine learning methodologies to enable automated ensemble generation and for Fast Running Model (FRM) development and validation.  \n   - Complete (1) simulations of Dynamic Recrystallization (DRX) within ABAQUS and transfer to CCDC-ARL\n   - Complete multi-material and multi-velocity code development in Carta Blanca.  \n   - Develop improved ignition and mechanics models for high explosives \n\n• Energetic Materials (EM) technical area - \n  - Develop a JWL reactive model parameterization for LLM-210 from CYLEX tests.\n  - Deliver thin film characterization data to AFRL at Eglin AFB. \n - Deliver CL-20 ink performance models to China Lake and AFRL at Eglin AFB.\n\n• Initiators, Fuzes, and Sensors - \n  - Perform integrated battery testing of conformal, thin-film thermal batteries.  \n  - Release Thermally Activated Battery Simulator (TABS) v6.0 with full battery thermal\/electrical capability.  \n  - Develop unreacted and reacted equations of state for CL-20 powders\n  - Develop GaN and AlGaN based transistors for high voltage, high current, high di\/dt solid state switches (1-2 kV, 50 A\/ns) for compact firing sets\n  - Demonstrate 3D exploding foil initiator (EFI) simulations using GPU-based modeling; \n  - Demonstrate Inertial Terrain Aided Guidance (iTAG) modeling and simulation to provide real-time processing solution for weapons guidance; \n\n• Warhead and Penetration Technology - \n  - Generate synthetic fragment data set for improvement and testing of fragment tracking software.  \n  - Add a granular temperature model to ALE3D for improved modeling of MBX.\n  - Complete the development of the embedded fiber solver in GEOS-MPM to allow evaluation of failure and softening responses of damaged UHPC.\n\n• Munitions Lifecycle Technologies -\n  - Characterization of novel coating technologies as thermal protection systems and their performance under thermal cycling.   \n  - Create model for electrochemical kinetics\/damage of aluminum and alloys under humidity and chloride-loading conditions.  \n  - Transition material aging and reliability tools and data on DoD ignitors \n  - Develop predictive model for adhesive joint strength  \n  - Complete a study on tantalum capacitor failures in COTS devices\n  - Deliver specifications for detonator-suitable CL-20 based plastic bonded explosive."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.873"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.873"
                                            },
                                            "Text": {
                                                "val": "In FY2021 the portfolio will be completely aligned with the TCG structure with a new Statement of Need process to identify and prioritize DoD S&T gaps and leverage DOE investment.  This process is fully coordinated with OUSD(R&E) Hypersonics efforts and will be utilized to develop technology solutions for hypersonic weapons developments and existing and future conventional weapons systems.  \n• TCG 1 – Decision Tools will employ machine learning code development to support lethality assessments, Develop multi-physics modeling code development and updates (ALE3D, CTH), and corresponding experimental verification and validation to inform hypersonics warhead design.  \n• TCG 2 – Delivery will advance energetic material 3D printing for complex charges to inform hypersonic propulsion concepts.  \n• TCG 3 – Munition Controls will advance thin film thermal battery development and performance modeling for reduced munition footprint and stability in hypersonics environments, develop new initiation systems and characterization tools to reduce SWaP with increased thermal stability, mechanical survivability, and intelligent fuzing\/firing response time, and develop new sensors (GPS-denied environments, proximity sensors) for extreme environments.  \n• TCG 4 – Lethal Effects will develop new high performance, low sensitivity energetic ingredients and new formulations, and characterization techniques to develop materials capable of withstanding demanding hypersonic environments (high temperatures, shock, vibration) while coupling these efforts with approaches for advanced warhead architectures and processing methods (additive manufacturing) to support hypersonic warhead design.  Focus will also be put toward penetrator impact event modeling  (terminal ballistics) and high strength concrete modeling code development to inform target effects.  \n• TCG 5 – Readiness will evaluate and quantify COTS device reliability studies to inform in-use and storage readiness for hypersonic components"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Small changes reflect minor budget fluctuations."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}