{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-855515f7cbe1443b1cc76e32ff869263061a887974718017fcc8f688288c6578-83",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0606100D8Z"
        },
        "ProgramElementTitle": {
            "val": "Budget and Program Assessments"
        },
        "R1LineNumber": {
            "val": "175"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "34.281"
            },
            "PriorYear": {
                "val": "5.544"
            },
            "CurrentYear": {
                "val": "8.017"
            },
            "BudgetYearOne": {
                "val": "13.173"
            },
            "BudgetYearOneBase": {
                "val": "13.173"
            },
            "BudgetYearTwo": {
                "val": "15.330"
            },
            "BudgetYearThree": {
                "val": "13.372"
            },
            "BudgetYearFour": {
                "val": "11.562"
            },
            "BudgetYearFive": {
                "val": "11.755"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program supports the Office of the Director, Cost Assessment & Program Evaluation (CAPE) by funding assessments that help to resolve budget and programmatic issues across the full range of the Department’s activities.  Projects that support this effort help to inform the leadership on program alternatives, capability concept development, design and cost, as well as the appropriate balance of capabilities across the force, and also to identify how well the Department’s expenditures are meeting its goals, and how well the force can implement the National Defense Strategy. These RDT&E resources support critical studies and analyses to assist senior DoD leaders in optimally balancing the lethality, partnership, and reform levels of effort to carry out the National Defense Strategy.  \n\n\nThis program provides for analytical research across the entire spectrum of  defense issues and concerns.  The research agenda focuses on near to long-term problems identified by the Secretary of Defense,  addressing difficult and complex questions linked to program alternatives for current and future capabilities and forces in order to enhance the senior leadership's deliberations and decision-making.\n\nThis program provides the scientific and technical engineering services needed for research studies in the development of models and simulations and the evaluation of current analytical tools and scientific methods used to evaluate and assess weapons systems and warfighting capabilities for warfighting environments and scenarios, and related force structure.  Deliverables from this program will include reports, briefings, and analyses designed to illuminate critical issues facing the Department.  Outcomes include recommendations for new modeling techniques, programmatic alternatives, and scenario development.\n\nIn FY 2019 CAPE received increased funding from the DoD Joint Service Provider to support the migration, implementation, and sustainment of its DoD Non-Classified Internet Protocol Router Network Demilitarized Zone (DMZ) efforts. In addition to the one-year increased RDT&E funding for FY 2019 itemized in this exhibit, CAPE also received additional Procurement and Operation and Maintenance (O&M) funding throughout the FY 2019-2023 FYDP to support the migration and sustainment of these developmental solutions. CAPE's  funds are included in the total Internet DMZ Migration amount transferred from JSP to OSD so that CAPE and three other affected OSD Principal Staff Assistants (PSAs) can execute their own long-term solutions outside of the JSP DMZ.\n\nThe FY 2021 budget proposal includes additional resources to support the Enterprise Visiability and Maintainability of Operation and Support Costs (EVAMOSC). This was a new project in FY 2020. EVAMOSC supports CAPE's responsibility to develop and maintain a database of actual operating and support (O&S) costs for major weapons systems, as required in 10 USC Ch. 137, Sec. 2337a and further refined by Sec. 832 of the 2019 NDAA.  Additionally, the EVAMOSC data capability will directly support development and reporting of readiness metrics associated with implementation of the National Defense Strategy. In FY 2021 CAPE will continue to design and develop an enterprise data platform to serve as the authoritative source of Operating and Support (O&S) cost data for major weapon systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.755"
                },
                "CurrentYear": {
                    "val": "8.017"
                },
                "BudgetYearOne": {
                    "val": "9.823"
                },
                "BudgetYearOneBase": {
                    "val": "9.823"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.544"
                },
                "CurrentYear": {
                    "val": "8.017"
                },
                "BudgetYearOne": {
                    "val": "13.173"
                },
                "BudgetYearOneBase": {
                    "val": "13.173"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.211"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "3.350"
                },
                "BudgetYearOneBase": {
                    "val": "3.350"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.001"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.210"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Inflation Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.010"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.010"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Directed Adds"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "4.042"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.042"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Defense Wide Review Studies Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.682"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.682"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Outyear numbers reflect fiscal guidance, revised inflation guidance, and programmatic changes. The FY 2021 funding increase reflects direction for CAPE to continue work started in FY 2020 to develop and maintain a database of actual operating and support costs for major weapons systems, known as EVAMOSC. In addition to the RDT&E funding for EVAMOSC described in this exhibit, CAPE also received additional Operation and Maintenance (O&M) funding in FY 2023, FY 2024, and FY 2025 to support EVAMOSC operational efforts. These funds will enable CAPE to develop and maintain a reference database of actual operating and support (O&S) costs for major weapons systems. Finally the Defense Wide Review realigned RDT&E study funding to provide additional resources directly to CAPE for budget and program assessments."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "101"
                    },
                    "ProjectTitle": {
                        "val": "Budget and Program Assessments"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "34.281"
                        },
                        "PriorYear": {
                            "val": "3.752"
                        },
                        "CurrentYear": {
                            "val": "4.017"
                        },
                        "BudgetYearOne": {
                            "val": "7.176"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.176"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "7.334"
                        },
                        "BudgetYearThree": {
                            "val": "7.375"
                        },
                        "BudgetYearFour": {
                            "val": "7.566"
                        },
                        "BudgetYearFive": {
                            "val": "7.678"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program supports the Office of the Director, Cost Assessment & Program Evaluation (CAPE).  It funds assessments that help to resolve budget and programmatic issues across the full range of the Department’s activities.  Projects that support this effort help to inform the leadership on program alternatives, capability concept development, design and cost, the appropriate balance of capabilities across the force, and also to identify how well the Department’s expenditures are meeting its goals, and how well the force can implement the Defense strategy.\n\nThis program provides for analytical research across the entire spectrum of  defense issues and concerns.  The research agenda focuses on near to long-term problems identified by the Secretary of Defense, and addresses difficult and complex questions linked to program alternatives for current and future capabilities and forces in order to enhance DoD senior leadership's deliberations and decision-making.\n\nThis program provides the scientific and technical engineering services needed for research studies in the development of models and simulations and the evaluation of current analytical tools and scientific methods used to evaluate and assess weapons systems and warfighting capabilities for warfighting environments and scenarios, and related force structure.  Deliverables from this program will include reports, briefings, and analyses designed to illuminate critical issues facing the Department.  Outcomes include recommendations for new modeling techniques, programmatic alternatives, and scenario development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "OSD Support for Programming Budget"
                                    },
                                    "Description": {
                                        "val": "This program provides for analytical research across the entire spectrum of  defense issues and concerns.  The research agenda focuses on near to long-term problems identified by the Secretary of Defense, and addresses difficult and complex questions linked to program alternatives for current and future capabilities and forces in order to enhance senior leadership deliberations and decision-making."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.752"
                                            },
                                            "Text": {
                                                "val": "Studies, analyses, and assessments will be focused on:\n-\tImproving cost analysis tools to inform program, budget, and Defense Acquisition Board reviews.\n-\tIn support of the Weapon System Acquisition Reform Act (WSARA), independently assessing, analyzing, and where appropriate, updating cost indices, inflation rates, and escalation rates used in preparing the President’s Budget for major acquisition programs.\n-\tDeveloping, assessing, and enhancing databases that provide cost data for major weapon systems.\n-\tImproving estimates produced by the Defense Employment and Purchases Projection System (DEPPS) and Defense Translator, which are used to support decision briefs to the President, Congress, Secretary of Defense, and Deputy Secretary of Defense. \n-\tModeling and analyzing aircraft survivability against various threat detection approaches and in various operational environments. Assessing the ability of aircraft and weapons to operation in anti-access\/area denial regions.\n-\tModeling logistical vulnerabilities against various threats and in various operational environments. Assessing the cost and mission effectiveness of proposed improvements.\n-      Modifying and supporting a wargaming repository. \n-      Expanding analysis of OCO funding data to determine how funding was actually spent as distinguished from DoD base budget resources. Provide normalization information that can be applied to existing Defense Resources Data Warehouse (DRDW) data for the current budget position."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.017"
                                            },
                                            "Text": {
                                                "val": "Studies, analyses, and assessments will focus on:\n-\tImproving cost analysis tools to inform program, budget, and Defense Acquisition Board reviews.\n-\tsupporting the Weapon System Acquisition Reform Act (WSARA) requirements by independently assessing, analyzing, and where appropriate, updating cost indices, inflation rates, and escalation rates used in preparing the President’s Budget for major acquisition programs.\n-\tDeveloping, assessing, and enhancing databases that provide cost data for major weapon systems. This includes the development and maintenance of a database of actual operating and support (O&S) costs for major weapon systems as required in Title 10 United States Code and further refined by the FY 2019 National Defense Authorization Act.\n-\tImproving estimates produced by the Defense Employment and Purchases Projection System (DEPPS) and Defense Translator, which are used to support decision briefs to the President, Congress, Secretary of Defense, and Deputy Secretary of Defense. \n-\tModeling and analyzing aircraft survivability against various threat detection approaches and in various operational environments. Assessing the ability of aircraft and weapons to operation in anti-access\/area denial regions.\n-\tModeling logistical vulnerabilities against various threats and in various operational environments. Assessing the cost and mission effectiveness of proposed improvements.\n-      Expanding analysis of OCO funding data to determine how funding was actually spent as distinguished from DoD base budget resources. Provide normalization information that can be applied to existing Defense Resources Data Warehouse (DRDW) data for the current budget position."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.176"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.176"
                                            },
                                            "Text": {
                                                "val": "Studies, analyses, and assessments will be focused on:\n-\tImproving cost analysis tools to inform program, budget, and Defense Acquisition Board reviews.\n-\tSupporting the Weapon System Acquisition Reform Act (WSARA) requirements by independently assessing, analyzing, and where appropriate, updating cost indices, inflation rates, and escalation rates used in preparing the FY 2021 President’s Budget for major acquisition programs.\n-\tDeveloping, assessing, and enhancing databases that provide cost data for major weapon systems. This includes the development and maintenance of a database of actual operating and support (O&S) costs for major weapon systems as required in Title 10 United States Code and further refined by the FY 2019 National Defense Authorization Act.\n-\tImproving estimates produced by the Defense Employment and Purchases Projection System (DEPPS) and Defense Translator, which are used to support decision briefs to the President, Congress, Secretary of Defense, and Deputy Secretary of Defense. \n-\tModeling and analyzing aircraft survivability against various threat detection approaches and in various operational environments. Assessing the ability of aircraft and weapons to operation in anti-access\/area denial regions.\n-\tModeling logistical vulnerabilities against various threats and in various operational environments. Assessing the cost and mission effectiveness of proposed improvements.\n-      Expanding analysis of OCO funding data to determine how funding was actually spent as distinguished from DoD base budget resources. Provide normalization information that can be applied to existing Defense Resources Data Warehouse (DRDW) data for the current budget position."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 funding levels resources directed to develop and maintain an enterprise database of actual operating and support costs. CAPE RDT&E resources will fund a mix of research activities to carry out the plans stated above. As a result of the Defense Wide Review, additional resources are also provided to CAPE for studies and assessments that were previous funded through USD(A&S)."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "A mix of competitive contracts with commercial firms and research provided by university-affiliated research centers (UARCs), and Federally Funded Research and Development Centers (FFRDCs)."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "107"
                    },
                    "ProjectTitle": {
                        "val": "Internet DMZ Migration"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.792"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Internet DMZ Migration reflects CAPE activities as part of a broader DoD effort to provide additional funds to Office of the Secretary of Defense (OSD) Principal Staff Assistants to enable them to migrate, implement, and sustain their DoD Non-classified Internet Protocol Router Network Demilitarized Zones (DMZ) efforts. CAPE's RDT&E funds supported initial cloud development and conversion costs in FY 2019. This RDT&E funding was for FY 2019 only."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Internet DMZ Migration"
                                    },
                                    "Description": {
                                        "val": "In FY 2019 CAPE received increased funding from the DoD Joint Service Provider to support the migration, implementation, and sustainment of its DoD Non-Classified Internet Protocol Router Network Demilitarized Zone (DMZ) efforts. In addition to the increased RDT&E funding described in this exhibit, CAPE also received additional Procurement and Operation and Maintenance (O&M) funding to support the migration and ongoing sustainment of these developmental efforts. CAPE's  funds were included in the total Internet DMZ Migration amount transferred from JSP to OSD so that CAPE and three other affected OSD Principal Staff Assistants (PSAs) could execute their own long-term solutions outside of the JSP DMZ."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.792"
                                            },
                                            "Text": {
                                                "val": "Initial cloud development and conversion."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A for FY 2020 and beyond"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "118"
                    },
                    "ProjectTitle": {
                        "val": "Enterprise VAMOSC"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "4.000"
                        },
                        "BudgetYearOne": {
                            "val": "5.997"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.997"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "7.996"
                        },
                        "BudgetYearThree": {
                            "val": "5.997"
                        },
                        "BudgetYearFour": {
                            "val": "3.996"
                        },
                        "BudgetYearFive": {
                            "val": "4.077"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Enterprise VAMOSC addresses CAPE's responsibility to develop and maintain a database of actual operating and support (O&S) costs for major weapons systems, as required in 10 USC Ch. 137, Sec. 2337a and further refined by Sec. 832 of the 2019 National Defense Authorization Act (NDAA).  Additionally, the EVAMOSC data capability will directly support development and reporting of readiness metrics associated with implementation of the National Defense Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enterprise Visibility and Maintainability of Operating and Support Costs"
                                    },
                                    "Description": {
                                        "val": "Enterprise VAMOSC addresses CAPE's responsibility to develop and maintain a database of actual operating and support (O&S) costs for major weapons systems, as required in 10 USC Ch. 137, Sec. 2337a and further refined by Sec. 832 of the 2019 NDAA.  Additionally, the EVAMOSC data capability will directly support development and reporting of readiness metrics associated with implementation of the National Defense Strategy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "This is a new project in FY 2020"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "•\tAnalyze gaps in current weapons system O&S data and refine the DoD’s enterprise-level O&S data map\n•\tDevelop business rules, data dictionaries, and governance to support collection and reporting of enterprise-level O&S cost data\n•\tIdentify and develop processing, data analysis, general functionality, and system use requirements for an enterprise-level O&S cost data capability"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.997"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.997"
                                            },
                                            "Text": {
                                                "val": "•     Design and develop an enterprise data platform to serve as the authoritative source of O&S cost data for major weapon systems\n•     Develop data ingestion pipelines, business rules, logic models, and data catalogues to support collection, reporting, and analysis of enterprise-level O&S cost data\n•     Develop system administration, security, and user management functionality for an enterprise data asset anticipated to provide services to over 3,000 users across the DoD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 funding reflects increased resources provided specifically for EVAMOSC in order to meet Title 10 requirements."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "A mix of competitive contracts with commercial firms and research provided by university-affiliated research centers (UARCs) and Federally Funded Research and Development Centers (FFRDCs)."
                        }
                    }
                }
            ]
        }
    }
}