{
    "id": "2021-Navy-PB-1319-MJBOOK-3-0-744c7ee94c2cc798fbfd935e35baade9caa8a86b67e6f22ecedd75220314848f-9",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605853N"
        },
        "ProgramElementTitle": {
            "val": "Management, Technical & Intl Supt"
        },
        "R1LineNumber": {
            "val": "180"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "84.378"
            },
            "CurrentYear": {
                "val": "113.844"
            },
            "BudgetYearOne": {
                "val": "94.297"
            },
            "BudgetYearOneBase": {
                "val": "94.297"
            },
            "BudgetYearTwo": {
                "val": "104.904"
            },
            "BudgetYearThree": {
                "val": "103.791"
            },
            "BudgetYearFour": {
                "val": "103.094"
            },
            "BudgetYearFive": {
                "val": "105.151"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "International Cooperative RDT&E: provide program management, execution, and support to implement a broad range of cooperative Naval Research and Development, Test and Evaluation initiatives to improve coalition interoperability, harmonize US Navy requirements with allied and friendly nations, and identify cooperative international opportunities, and improve coalition interoperability.  In addition, it develops coherent approaches, coordinating with partner nations, to sea-based missile defense, command, control, communications, computers and intelligence (C4I), and cooperative acquisition programs while also identifying technology to support the Global Maritime Partnership initiative.\n\nNaval War College Strategic Studies Support:  \n\nProvides research, analysis and gaming activities which serve as a focal point, stimulus, and major source of strategic and operational thought within the Navy, joint and interagency communities.  These efforts generate strategic and operational alternatives, quantitative analysis, war gaming and political military assessments, and provide recommendations regarding the formulation and execution of maritime options .  The War Gaming Department plans, designs, executes, analyzes and reports on the Navy's Title 10 war games.  These war games provide analytical input to the Navy's Strategic Plan, assessments of future concepts, and recommendations to the Navy's Quadrennial Defense Review, force design, and strategy process.  The War Gaming Department also designs, executes and analyzes war games for theater security cooperation plans and operational war fighting issues.  \n\nAssessment Program: \n\nThe Navy Assessment Program provides capability-based planning assessment for Joint Capabilities Integration and Development System (JCIDS), conducts analysis to affect war fighting capability trades and enterprise resources, identifies needs, gaps, and overlaps, and assesses alternative solutions to Joint needs.  The program supports both the development and use of modeling, simulation and analytically-based warfare and provides business analyses and analytic tools that provide the basis for decision making with respect to concepts of operations (CONOPS), Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) Systems (Information Dominance); warfare systems (Sea Strike, Sea Shield, and Sea Basing) and analytical underpinnings\/basis for programmatic decisions of the Navy's top leadership regarding their architectures, force structure, and the Navy's core \"organize, train, and equip mission\" (the warfare and provider Enterprises).  The program provides overarching Planning, Programming, Budgeting and Execution System (PPBES) analyses and guidance for PPBES which provides gap analysis and investment strategy and total obligation authority allocation.  It provides independent capability analysis and assists in structuring follow-on Navy analyses.  The program coordinates Navy's position for the enhanced planning process and conducts net assessments.  It serves as the lead campaign analysis to approve Navy warfare and support requirements.  The program supports \"A Cooperative Strategy for 21st Century Seapower 21\" as modified by the Maritime Strategy which charts a course for the Navy, Coast Guard and Marine Corps to work collectively with each other and international partners to prevent crises from occurring or reacting quickly should one occur to avoid negative impact to the United States.  It serves as an independent assessor providing a broad-view perspective across the Navy staff apart from resource sponsors, with an integrated look at both war fighting and war fighting support programs.  The program supports the world class modeling efforts to attain a level of Modeling and Simulation (M&S) capability that is world class and establishes the Navy as a leader in the Department of Defense (DoD) M&S community.  It provides Navy alternatives in assessing the implications embedded within resource decisions in a quantified context of costs versus capability versus risk.  The program provides independent analytic support to Navy leadership in conjunction with various executive level decision forums.  It develops tools and analytical methodologies that assist in evaluating Navy programs and provides technical leadership for the analysis functional area of Naval Modeling and Simulation.\n\n\nOperations Integration Group:  Classified\n\nNaval Research Laboratory (NRL)Facilities Modernization: This program has been established to provide a systematic and planned approach to improve vital in-house science and technology (S&T) laboratory facilities which are reaching or have reached critical stages of deterioration.  The program includes restoration and modernization (R&M) initiatives for about 350,000 net square feet, where the average age of the buildings is 67 years old.\n\nThe Joint Information Environment (JIE) initiative provides the supporting IT capability framework comprised of shared information technology infrastructure, enterprise services, interoperability with coalition partners and a single security architecture that enables mission commanders to execute mission partnered operations.  JIE provides the U.S. configuration controls necessary for enterprise capabilities.  By utilizing a U.S enterprise-wide secure Identity and Access Management system, JIE ensures that authorized users at the right classification level gain access to only the data and services they are entitled.  The continued development and refinement of a Joint Information Environment will provide for a significant improvement in data sharing within, and between, coalition maritime elements.\n\nMTMD - Maritime Theater Missile Defense Forum:\n\nThis project funds participation in Maritime Integrated Air and Missile Defense projects with other nations through the Maritime Missile Defense Projects Framework Memorandum of Understanding of 2004 (as amended 2009, 2015, and 2016).Known as the Maritime Theater Missile Defense (MTMD)Forum, it promotes interoperability with the Navies of eleven participating nations (Australia, Canada, Denmark, France, Germany, Italy, Netherlands, Norway, Spain, United Kingdom and the United States).  This project funds participation in multiple Projects and includes a maritime contribution to\nthe NATO Active Layered Theater Ballistic Missile Defense (ALTBMD) project, now known as NATO Ballistic Missile Defense (BMD). Engineering analysis and recommendations from MTMD activities are provided to European, Pacific and\nCentral Combatant Commands to influence present day operations. Specifically, the MTMD Forum is addressing challenges with \"Maritime Allied Air Defense in Support of Ballistic Missile Defense Operations\" that face the Combatant Commanders during present day operations.  The MTMD Forum is leveraging At-Sea Demonstration (ASD) test events and operational Fleet Exercises  to integrate technology with concepts of operations developed within MTMD Forum working groups.\n\nThe MTMD Forum develops systems and techniques that enhance protection and defense against the proliferation of short, medium and long-range Ballistic Missile (BM) and Advanced Anti-Ship Cruise Missile (ASCM) threats through the development of interoperable sea-based Integrated Air and Missile Defense (IAMD) capability among coalition nations.  This includes protection across the full spectrum of these threats through the enhanced utilization of existing sea-based systems to protect against current threats while progressively improving and developing systems and system-of- systems to effectively counter evolving threats. \n\nThis project supports USN participation in several Maritime IAMD related Project Arrangements and Working Groups including:\n\n(1)  Battle Management Command, Control, Communications, Computers, and Intelligence (BMC4I) to define and develop architectures as well as to perform engineering to address coalition capability gaps. \n(2)  Modeling & Simulation (M&S) to establish and maintain a maritime coalition M&S testbed and to perform legacy and future systems simulation testing.\n(3)  Coalition Distributed Engineering Plant (CDEP) to establish and maintain a maritime coalition Hardware-in-the-Loop Testbed and to conduct CDEP testing.\n(4)  Open Architecture (OA) to develop Interface Standards and Data Models.\n(5)  Test Planning and Execution (TPEX) to develop Test Plans, oversee exercise participation and conduct post event data analysis and reporting.\n(6)  Operational Requirements (OR) to develop a Coalition Maritime Missile Defense Operational Concept Document and to identify operational constraints and tactical constructs surrounding coalition maritime missile defense activities.\n(7)  Reciprocal Use of Test Facilities agreements with other nations to support Maritime IAMD and MTMD related demonstrations.\n(8) Tactical Advancement for Next Generation (TANG) to work with our Allies and International Partners using human-centered design methodologies to identify solutions to technology and sailor performance issues that have been cited during previously conducted experiments, exercises, and demonstrations.  This process will seek to leverage R&D investments and risk reduction research commercial companies are making today that can provide potential \"dual use\" technology and process solutions to complex problems.\n\n\nAnti-Tamper (AT): The AT program performs as the Navy Technical Process Owner for the Anti-Tamper systems engineering activity that is intended to prevent and\/or delay the exploitation of critical technologies in U.S. systems; manages the research, design, development, implementation, and testing of AT measures and coordinates with Department of Defense AT Executive Agent.  Starting in FY19, funding for AT is realigned to PE 0605024N Anti-Tamper Technology Support.\n\nJUSTIFICATION FOR BUDGET ACTIVITY: This program is funded under RESEARCH, DEVELOPMENT, TEST and EVALUATION MANAGEMENT SUPPORT because it supports efforts directed toward sustaining or modernizing installations or operations required for general research, development, test and evaluation."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "86.932"
                },
                "CurrentYear": {
                    "val": "102.401"
                },
                "BudgetYearOne": {
                    "val": "100.981"
                },
                "BudgetYearOneBase": {
                    "val": "100.981"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "84.378"
                },
                "CurrentYear": {
                    "val": "113.844"
                },
                "BudgetYearOne": {
                    "val": "94.297"
                },
                "BudgetYearOneBase": {
                    "val": "94.297"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.554"
                },
                "CurrentYear": {
                    "val": "11.443"
                },
                "BudgetYearOne": {
                    "val": "-6.684"
                },
                "BudgetYearOneBase": {
                    "val": "-6.684"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-3.557"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "15.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.243"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.311"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-6.109"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-6.109"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.575"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.575"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "PRJ 2221 JT Mission Assessment Studies:\nThe FY2021 funding request was reduced by $3.079 million to account for the availability of prior year execution balances. \n\nPRJ 3027 Defense Critical Infrastructure Program:\nThe FY2021 funding request was reduced by $1.165 million to account for the availability of prior year execution balances. \n\n\nPRJ 3363 - PACOM Initiative:\nThe FY2021 funding request was reduced by $2.410 million to account for the availability of prior year execution balances."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0149"
                    },
                    "ProjectTitle": {
                        "val": "International Coop RDT&E"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "3.199"
                        },
                        "CurrentYear": {
                            "val": "3.658"
                        },
                        "BudgetYearOne": {
                            "val": "3.511"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.511"
                        },
                        "BudgetYearTwo": {
                            "val": "3.547"
                        },
                        "BudgetYearThree": {
                            "val": "3.621"
                        },
                        "BudgetYearFour": {
                            "val": "3.694"
                        },
                        "BudgetYearFive": {
                            "val": "3.769"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Provides funding for program management, execution, and support activities to implement a broad range of cooperative naval Research and Development, Test and Evaluation (RDT&E) initiatives to improve coalition interoperability, harmonize US Navy requirements with allied and friendly nations,and identify cooperative international opportunities.   The funding is used to develop approaches to international cooperation consistent with combatant commanders (COCOMs), Chief of Naval Operations (CNO), and Secretary of the Navy (SECNAV) priorities in the maritime domain.\n\nVarious cooperative RDT&E programs, projects and exchanges are pursued to identify cooperative acquisition programs, enhance Overseas Contingency Operations (OCO) efforts, fill capability gaps, improve US\/coalition interoperability, and standardize defense capabilities with international partners. Such efforts have resulted in:\n1. Negotiating and developing approximately 57 international RDT&E Agreements annually with allied and friendly nations;\n2. Executing Information Exchange Annexes (IEAs) with foreign partners;\n3. Improving IEA information dissemination with allied and friendly countries and within Department of the Navy (DON);\n4. Coordinating Navy inputs to the Office of the Under Secretary of Defense (OUSD) Acquisition, Technology, and Logistics (AT&L) Foreign Comparative Test (FCT) Program, and Coalition Warfare Program (CWP) as well as the DON Technology Transfer Security Assistance Review Boards (TTSARB). \n5. Represent the US Navy in Office of the Secretary of Defense (OSD) directed Armaments Cooperation Forums, including the Conference of NATO Armaments Directors' groups {NATO Naval Armaments Group (NNAG)}, and Senior National Representative (SNR);\n6.  Funding of various international RDT&E support databases including Technical Project Officer (TPO), International Agreement Generators, Information\/Data Exchange Agreements, and Project Agreements\/Memorandums of Understanding;\n7. Funding for Engineering and Scientist Exchange Program (ESEP)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "International Coop RDT&E"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.199"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.658"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all efforts from prior FYs.\n-Continue and increase support for an international Theater ASW Forum with foreign partners, including expansion of international participation in technical discussions.\n-Continue execution and support in placement of U.S. Navy and partner nation engineers and scientists under OSD's\nEngineer and Scientist Exchange Program (ESEP), with a focused increase (~4-5 additional\/year) on ESEP placements in Five Eye's nations, such as Australia and the United Kingdom.\n-Continue execution of approximately 150 Information Exchange Agreements\/Data Exchange Agreements (IEA\/DEA) with more than 30 countries.\n-Continue to coordinate U.S. Navy participation in OUSD (AT&L) Coalition Warfare Program (CWP) selection processes to meet emerging military capability requirements.\n-Support U.S.-India Defense Technology and Trade Initiative Working Groups, including the Joint Working Group on Aircraft Carrier Technology Cooperation (JWGACTC), the Jet Engine Technology Joint Working Group (JETJWG), and the Joint Working Group on Naval Systems (JWGNS).\n-Support U.S.-India Defense Technology and Trade Initiative Information Exchange and Terms of Reference (TOR) exchanges to promote cooperative opportunity development.\n-Continue to execute Above Water Working Group (AWWG)activities.\n-Continue to support NATO Naval Armaments Group (NNAG) and Five Power Groups on cooperative programs.\n-Provide contract support for Senior National Representative (SNR) and Navy International Programs Office for international outreach, development, and administrative activities\n-Provide travel support for SNR participation in Senior Naval National Representative (SNNR) meetings with key foreign partners, and for select NATO meetings in support of CNO priorities"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.511"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.511"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all efforts from prior FYs.\n-Continue and increase support for an international Theater ASW Forum with foreign partners, including expansion of international participation in technical discussions.\n-Continue execution and support in placement of U.S. Navy and partner nation engineers and scientists under OSD's Engineer and Scientist Exchange Program (ESEP), with a focused increase (~4-5 additional\/year) on ESEP placements.\n-Continue execution of approximately 150 Information Exchange Agreements\/Data Exchange Agreements (IEA\/DEA) with more than 30 countries.\n-Continue to coordinate U.S. Navy participation in OUSD (AT&L) Coalition Warfare Program (CWP) selection processes to meet emerging military capability requirements.\n-Support U.S.-India Defense Technology and Trade Initiative Working Groups, including the Joint Working Group on Aircraft Carrier Technology Cooperation (JWGACTC), the Jet Engine Technology Joint Working Group (JETJWG), and the Joint Working Group on Naval Systems (JWGNS).\n-Support U.S.-India Defense Technology and Trade Initiative Information Exchange and Terms of Reference (TOR) exchanges to promote cooperative opportunity development.\n-Continue to execute Above Water Working Group (AWWG) activities.\n-Continue to support NATO Naval Armaments Group (NNAG) and Five Power Groups on cooperative programs.\n-Provide contract support for Senior National Representative (SNR) and Navy International Programs Office for international outreach, development, and administrative activities.\n-Provide travel support for SNR participation in Senior Naval National Representative (SNNR) meetings with key foreign partners, and for select NATO meetings in support of CNO priorities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor decrease from FY2020 to FY2021 reflects a reduction to travel support funding."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "1767"
                    },
                    "ProjectTitle": {
                        "val": "Naval War Col Strategic Studies Supt"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "5.060"
                        },
                        "CurrentYear": {
                            "val": "5.658"
                        },
                        "BudgetYearOne": {
                            "val": "5.765"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.765"
                        },
                        "BudgetYearTwo": {
                            "val": "5.875"
                        },
                        "BudgetYearThree": {
                            "val": "5.987"
                        },
                        "BudgetYearFour": {
                            "val": "6.108"
                        },
                        "BudgetYearFive": {
                            "val": "6.230"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Naval War College (NWC) research, analysis and gaming activities serve as a focal point, stimulus, and major source of strategic and operational thought within the Navy, Joint and Interagency communities.  These efforts generate strategic and operational alternatives, tactical imperatives, quantitative analysis, war gaming, political-military assessments, and provide recommendations to the Chief of Naval Operations (CNO), Fleet Commanders and numbered Fleet Commanders regarding the formulation and execution of maritime options for the President of the United States."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Strategic Studies"
                                    },
                                    "Description": {
                                        "val": "Naval War College (NWC) conducts research in strategic studies in response to tasking from the Secretary of the Navy (SECNAV), Chief of Naval Operation (CNO), Fleet Commanders, numbered Fleet Commanders, and Combatant Commanders.  NWC research includes strategic documents produced by its Chinese Maritime Studies Institute (CMSI), Russia Maritime Studies Institute (RMSI), Center for Cyber Conflict Studies (C3S), and Institute for Future Warfare Studies (IFWS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.714"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct research and analysis projects and provide supporting events for OPNAV, the numbered Fleets, Navy Component Commanders, and Combatant Commanders.\n- Continue to support OPNAV Staff on tasked research projects.  \n- Conduct research into Chinese, Russian, and Future maritime capabilities and affairs in order to enhance understanding of global developments and provide studies and advice for CNO and Fleet.\n- Continue research on cyber capabilities, focusing on deterrence.\n- Continue Mahan Program research on deterrence capabilities with increased focus on Navy contribution to national nuclear deterrence missions and future Navy capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.728"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.728"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct research and analysis projects and provide supporting events for OPNAV, the numbered Fleets, Navy Component Commanders, and Combatant Commanders.\n- Continue to support OPNAV Staff on tasked research projects.  \n- Conduct research into Cyber, Chinese, Russian, and Future maritime capabilities and affairs to enhance understanding of global developments and provide studies and advice for CNO and Fleet.\n- Continue research on cyber capabilities, focusing on deterrence.\n- Continue Mahan Program research on deterrence capabilities with increased focus on Navy contribution to national nuclear deterrence missions and future Navy capabilities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY2020 to FY2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Naval War Gaming Support"
                                    },
                                    "Description": {
                                        "val": "Naval War College (NWC) conducts strategic and operational war gaming and research for Office of the\nChief of Naval Operations (OPNAV), the numbered Fleets, Fleet Commanders, and the Combatant Commanders. Each\nyear, 45-60 major war games and associated events provide support to efforts that explore and analyze military, political,informational and economic aspects of differing strategic and operational scenarios and tactical imperatives.\nNWC continues to expand its capability and capacity to execute war games of increased scope, magnitude and complexity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.733"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.304"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct 55-60 major war games and related events in support of OPNAV, the numbered Fleets, and the Combatant Commands.  \n- Conduct 8 Executive Committee submitted and CNO approved war games and Navy Title X war games, directed research, and analysis.  \n- Continue to foster cooperative relationships with international partners through use of war gaming, research, analysis and education.\n- Refine capstone war gaming exercises that support the International Maritime Staff Operators Course.\n- Execute Fleet Synchronization Conferences. \n- Execute capstone war game exercise for the Joint Force Maritime Component Commander (JFMCC) Course.\n- Resource and provision life cycle maintenance requirements for networks, communications, and modeling and simulation capacity.\n- Resource and provision required manpower and equipment for the High Security Research and Wargaming Facility."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.385"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.385"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct 55-60 major war games and related events in support of OPNAV, the numbered Fleets, and the Combatant Commands.  \n- Conduct 35 events supporting 8 Executive Committee and CNO approved war games and Navy Title X war games, directed research, and analysis.  \n- Continue to foster cooperative relationships with international partners through use of war gaming, research, analysis and education.\n- Refine capstone war gaming exercises that support the International Maritime Staff Operators Course.\n- Execute Fleet Synchronization Conferences. \n- Execute capstone war game exercise for the Joint Force Maritime Component Commander (JFMCC) Course. Fleet Synchronization Conferences.\n- Resource and provision life cycle maintenance requirements for networks, communications, and modeling and simulation capacity.\n- Resource and provision required manpower and equipment for the High Security Research and Wargaming Facility."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased funding from FY20 to FY21 continues to resource the Naval War College expansion to execute high security war gaming and research."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warfare Analysis and Research"
                                    },
                                    "Description": {
                                        "val": "Naval War College (NWC) supports senior decision-makers from the Department of Defense, Department of the Navy, the numbered Fleets, Fleet Commanders and Combatant Commanders in reaching well-informed, objective decisions on strategic, operational and programmatic issues through collaborative research which integrates traditional research and analysis with advanced decision support tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.544"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.555"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue conducting major decision events in support of OPNAV, the numbered Fleets, Fleet Commanders, and the Combatant Commanders.\n- Continue warfighting analysis requirements for numbered Fleet commanders.  \n- Continue analytical research on key strategic and operational challenges such as maritime ballistic missile defense, proliferation security initiative, global maritime security, maritime situational awareness, maritime operations headquarters, interconnectivity, and multi-service force deployment.  \n- Continue evaluation of concepts and decision events in conjunction with war gaming center.\n- Continue research targeted at the strategic and policy level decision making within China and Russia.\n- Continue providing direct support to NWC student research groups and war gaming.\n- Execute approximately 20 major decision events in support of these efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.566"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.566"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue conducting major decision events in support of OPNAV, the numbered Fleets, Fleet Commanders, and the Combatant Commanders.                                                                                                              - Continue warfighting analysis requirements for numbered Fleet commanders.  \n- Continue analytical research on key strategic and operational challenges such as maritime ballistic missile defense, proliferation security initiative, global maritime security, maritime situational awareness, maritime operations headquarters, interconnectivity, and multi-service force deployment.  \n- Continue evaluation of concepts and decision events in conjunction with war gaming center.\n- Continue research targeted at the strategic and policy level decision making within China and Russia.\n- Continue providing direct support to NWC student research groups and war gaming.\n- Execute approximately 20 major decision events in support of these efforts."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY2020 to FY2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NWC Student Research Projects"
                                    },
                                    "Description": {
                                        "val": "Selected top performing Naval War College (NWC) students to conduct focused research and analysis of current and future strategic and operational challenges and tactical imperatives.  These students are organized under the supervision of the Mahan Scholars Program and the Halsey Group Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.083"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.085"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct focused research, analysis and war gaming of current and future strategic\/operational challenges and tactical imperatives by the Halsey Groups and Mahan Scholars programs.\n- Research groups continue to conduct focused research, analysis and free-play war gaming of current and future operational challenges and tactical imperatives arising from regional threats, homeland defense and access denial efforts at the high end of the conflict spectrum in the Pacific, European Command (EUCOM), Central Command (CENTCOM) and Northern Command (NORTHCOM) area of responsibility (AOR). Research and analysis efforts continue in those areas above, and will be expanded to include a detailed focus on counter-targeting, operational deception, and countering information denial and missile defense at the theater joint operational level."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.086"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.086"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct focused research, analysis and war gaming of current and future strategic\/operational challenges and tactical imperatives by the Halsey, Gravely and Holloway Group Programs and Mahan Scholars.\n- Research groups continue to conduct focused research, analysis and free-play war gaming of current and future operational challenges and tactical imperatives arising from regional threats, homeland defense and access denial efforts at the high end of the conflict spectrum in the Pacific, European Command (EUCOM), Central Command (CENTCOM) and Northern Command (NORTHCOM) area of responsibility (AOR).  Research and analysis efforts continue in those areas above, and will be expanded to include a detailed focus on counter-targeting, operational deception, and countering information denial and missile defense at the theater joint operational level."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant increase from FY2020 to FY2021."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2098"
                    },
                    "ProjectTitle": {
                        "val": "Navy Postgraduate School (NPS) Studies Support"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "11.142"
                        },
                        "CurrentYear": {
                            "val": "10.840"
                        },
                        "BudgetYearOne": {
                            "val": "11.467"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.467"
                        },
                        "BudgetYearTwo": {
                            "val": "11.544"
                        },
                        "BudgetYearThree": {
                            "val": "11.720"
                        },
                        "BudgetYearFour": {
                            "val": "11.944"
                        },
                        "BudgetYearFive": {
                            "val": "12.175"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Navy Postgraduate School (NPS) research and analysis activities serve as a focal point, stimulus, and major source of strategic, tactical and operational thought within the Navy communities.  These efforts generate strategic and operational alternatives, tactical imperatives, quantitative analyses, technical developments and assessments, and political-military assessments.  Also, provide recommendations to the Chief of Naval Operations (CNO), Fleet Commanders and numbered Fleet Commanders regarding the formulation and execution of maritime options for the President of the United States.  Research will be conducted that will enhance graduate education for Naval Officers and potentially provide students with areas of studies for theses and faculty projects. These research activities also serve as a means for OPNAV Resource Sponsors and Major Commands to have analysis and decision support research conducted in the uses of the applied, soft, and hard sciences in solving diverse and complex resource allocation and strategic issues facing the Navy today and envisioned in the future."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Faculty and Student Studies, Analysis and Research"
                                    },
                                    "Description": {
                                        "val": "Navy Postgraduate School (NPS) research and analysis activities serve as a focal point, stimulus, and major source of strategic, tactical and operational alternatives, tactical imperatives, quantitative analyses, technical developments and assessments, and political-military assessments. Also, provide recommendations to the Chief of Naval Operations (CNO), Fleet Commanders and numbered Fleet Commanders regarding the formulation and execution of maritime options for the President of the United States. Research will be conducted to support graduate students theses determination and completion as part of Faculty projects. These research activities also serve as a means for OPNAV Resource Sponsors and Major Commands to have analysis and decision support research conducted in the uses of the applied, soft, and hard sciences in solving diverse and complex resource allocation and strategic issues facing the Navy today and envisioned in the future."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.142"
                                            },
                                            "Articles": {
                                                "val": "76"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.840"
                                            },
                                            "Articles": {
                                                "val": "74"
                                            },
                                            "Text": {
                                                "val": "Continue Studies planned in the following areas:\n\n- 1 in the area of Applied Mathematics\n- 15 in the area of Executive Education\n- 24 in the area of Computer Science\n- 97 in the area of Defense Analysis\n- 7 in the area of Electrical and Computer Engineering\n- 14 in the area of Energy Academic Group\n- 76 in the area of Business & Public Policy\n- 112 in the area of Information Sciences\n- 31 in the area of Information Sciences and Modeling, Virtual Environments and Simulation (MOVES)\n- 25 in the area of Mechanical and Aerospace Engineering\n- 10 in the area of Meteorology\n- 20 in the area of National Security Affairs\n- 12 in the area of Oceanography\n- 275 in the area of Operations Research\n- 32 in the area of Physics\n- 3 in the area of  Space Systems\n- 135 in the area of Systems Engineering"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.467"
                                            },
                                            "Articles": {
                                                "val": "77"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.467"
                                            },
                                            "Articles": {
                                                "val": "77"
                                            },
                                            "Text": {
                                                "val": "Continue Studies planned in the following areas:\n\n- 1 in the area of Applied Mathematics\n- 15 in the area of Executive Education\n- 24 in the area of Computer Science\n- 97 in the area of Defense Analysis\n- 7 in the area of Electrical and Computer Engineering\n- 14 in the area of Energy Academic Group\n- 76 in the area of Business & Public Policy\n- 112 in the area of Information Sciences\n- 31 in the area of Information Sciences and Modeling, Virtual Environments and Simulation (MOVES)\n- 25 in the area of Mechanical and Aerospace Engineering\n- 10 in the area of Meteorology\n- 20 in the area of National Security Affairs\n- 12 in the area of Oceanography\n- 276 in the area of Operations Research\n- 32 in the area of Physics\n- 3 in the area of  Space Systems\n- 138 in the area of Systems Engineering"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding has increased from FY2020 to FY2021 due to approximately 5 more research projects being executed. Average NRP research project size is approximately $130K."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2221"
                    },
                    "ProjectTitle": {
                        "val": "JT Mission Assessment Studies"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "24.457"
                        },
                        "CurrentYear": {
                            "val": "25.799"
                        },
                        "BudgetYearOne": {
                            "val": "22.423"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.423"
                        },
                        "BudgetYearTwo": {
                            "val": "27.867"
                        },
                        "BudgetYearThree": {
                            "val": "27.743"
                        },
                        "BudgetYearFour": {
                            "val": "27.085"
                        },
                        "BudgetYearFive": {
                            "val": "27.627"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This exhibit has been updated to reflect the establishment of the Navy Analytic Office (NAO), which is responsible for the executive oversight of Navy studies and analysis.  The NAO was stood up to better align the annual Analytic Agenda to CNO's strategic priorities while also providing for study of the more tactical requirements of the Fleet and Navy writ large.  The outcome will be synchronized modeling, simulation, assessments, wargames, experiments and exercises providing rich, shared data to support and refine warfighting concepts and to inform budget decisions. \n \nThe Navy Annual Studies Program supports the Analytic Agenda by providing both the development and use of modeling, simulation and analytically-based warfare, business analyses and analytic tools that provide the basis for decision making with respect to concepts of operations (CONOPS), Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) Systems; warfare systems, and analytical underpinnings\/basis for programmatic decisions of the Navy's top leadership regarding their architectures, force structure, and the Navy's core \"organize, train, and equip mission\" (the warfare and provider Enterprises).  The program provides capability-based planning assessment for Joint Capabilities Integration and Development System (JCIDS), conducts analysis to affect warfighting capability trades and enterprise resources, identifies needs, gaps and overlaps, and assesses alternative solutions to Joint needs.  The program provides overarching Planning, Programming, Budgeting and Execution System (PPBES) analyses and guidance for PPBES which provides gap analysis and investment strategy and total obligation authority allocation.  It provides independent capability analysis and assists in structuring follow-on Navy analyses.  The program coordinates Navy's position for the enhanced planning process and conducts net assessments.  It serves as the lead campaign analysis to approve Navy warfare and support requirements.  The program supports the Maritime Strategy which charts a course for the Navy, Coast Guard and Marine Corps to work collectively with each other and international partners to prevent crises from occurring, or reacting quickly should one occur to avoid negative impact to the United States.  The Studies Program provides a broad-view perspective across the Fleet and Navy staff, with an integrated look at both warfighting and warfighting-support programs.  It provides Navy alternatives in assessing the implications embedded within resource decisions in a quantified context of costs versus capability versus risk.  The program provides independent analytic support to Navy leadership in conjunction with various executive level decision forums.\n\nThis project funds concept development engineering, mission effectiveness analysis, and other analyses for formulation of future surface ship and associated platform force structure along with development of the tools to accomplish these efforts. Advanced platform concept studies and systems technology assessments will be conducted as will the development and upgrade of concept design and engineering tools, methods, and criteria. Concept Formulation (CONFORM)\/Concept Development and Experimentation (CDE) for ships, boats and unmanned maritime vehicles must be continuously exercised to remain viable. It takes years to train competent practitioners, and knowledge currency is quickly lost without practice. Evolving threats and technologies drive concepts (and the tools, processes, and skills needed to produce them) towards obsolescence without constant attention. Capability Based Assessments and Analysis of Alternatives (AoA) timelines are insufficient for establishing potential material solution cost versus capability relationships without significant concept formulation work beforehand. Active collaboration between the Office of the Chief of Naval Operations requirement sponsors, Program Offices, and the various System Commands (Naval Sea Systems Command, Naval Air Systems Command and Space and Naval Warfare Systems Command) engineers is critical for fully exploring the trade space by conducting analysis for affordability, effectiveness and risk.  The majority of Total Ownership Cost (TOC) is locked into a design before it is even a program. In the later stages of a program it becomes much more costly to make changes that will significantly impact TOC. Investment up front in concept design can have a high payoff in TOC reduction over the life of a platform class. Outputs include concept costing and performance parameterization for comparative assessment against capability objectives and synthesis to quantify overall (Fleet) capabilities. These products (expressions of cost vs. capability) will serve as the basis of requirements and Joint Capabilities Integration and Development System analysis, define the trade space for AoA efforts, and underpin discussion of force architecture\/structure during Quadrennial Defense Review, Long Range Shipbuilding Strategy builds, and Joint Requirements Oversight Council reviews.\nCapabilities-Based Assessment (CBA) is the Joint Capabilities Integration and Development System (JCIDS) analysis process that includes three phases: Functional Area Analysis (FAA), Functional Needs Analysis (FNA), and Functional Solution Analysis (FSA). The results of the CBA are used to develop a joint capabilities document (based on the FAA and FNA) or initial capabilities document (based on the full analysis). CBA funding provides the resource sponsors the means to develop the analytic underpinning required by Chairman of the Joint Chiefs of Staff Instruction 3170.01G to support the determination of Naval warfighting capabilities and force structure needed to support the Joint Requirements Oversight Council (JROC)\/JCIDS requirements validation process and to inform Program Objective Memorandum programming decisions. This analysis includes evaluation of integration and interoperability gaps of both current and future Navy platforms and systems capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Navy Studies & Analysis"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.965"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.404"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to develop, update and maintain detailed level Navy Standard scenarios based on DPG.\n-Continue to develop alternative scenarios in support of Defense Review guidance, Joint studies, and Navy resource analyses.\n-Continue to develop, update and maintain analytic baselines for the MCO based on DPG.\n-Continue to develop details required to execute analysis of designated Defense Planning Scenarios and their respective Multi-Service Force Deployment Plans.\n-Continue to develop and maintain a framework and common set of processes to ensure that essential elements of warfare analyses, including scenarios, operational concepts, tactics, capabilities of platforms and systems (for Navy, Joint, coalition and threat forces), key assumptions and input data are defined and traceable to government approved\/provided source material.\n-Continue to develop scenarios and operational concepts based on government inputs that are sufficiently detailed for use in naval and joint campaign analyses.\n\n-At the mission level, continue to script Operational Situations (OPSITS) or Tactical Situations (TACSITS) for use in effectiveness analyses in specific warfare mission areas.\n-Continue to provide analytically-based decision recommendations to CNO for both warfighting and support areas.\n-Continue to develop CNO investment strategy recommendations and assessments for Program Review and Program Objective Memorandum.\n-Continue to perform rigorous, time critical naval and joint campaign and mission-level analyses, usually based on modeling and simulation that illuminated complex warfare issues which support decision-making in the PPBE process.\n\n-Continue to conduct ISR and METOC assessments to determine the optimal mix of Naval ISR and METOC sensors, platforms, and processing, analysis and fusion disposition to support MCOs, the OCO, and intelligence preparation of the environment for both MCOs and OCO.\n-Continue to develop and maintain common baselines from which campaign excursions and mission-level analyses are executed.\n-Continue to identify, develop and improve data and modeling, and broker agreements upon assumptions, CONOPS, scenarios, and data.\n-Continue to lead campaign analysis for OPNAV and lead Navy's participation in OSD\/Joint Staff analytic agenda, baseline development, and collection of data.\n-Continue to conduct modeling and simulation support for ongoing OPNAV missile defense analysis requirements.\n-Continue to provide analytically-based decision recommendations to OPNAV for joint warfighting and support areas.\n-Continue to develop new analytic models and techniques for informing resource allocation decisions; conduct all campaign and warfare mission-level analyses and develop investment strategies.\n-Continue to develop and improve the Navy's analysis capabilities which support Joint and Navy analytic agendas and resource-allocation decision making by refining the linkages between cost and performance in performance-modeled programs in support of Navy analysis and assessment. Areas of tool development and improvement included mission and campaign-level warfighting models, active and reserve manpower, afloat and ashore readiness, and medical capabilities.\n -Continue to focus on integrated analysis capabilities that cut across business and program accounts. Specific efforts address cyber warfare and security, optimizing the training pipeline, integrating ship maintenance and operations price performance models, and improving mission- and campaign-level C5ISR models and representations.\n-Continue to develop medical analysis that links to campaign analysis including movement of injured between care facilities, life-saving treatment of injured and recuperation support of injured to support Navy Medical Program decisions.\n-Continue to update the high-level readiness model that fully integrates all aspects of warfighting support (operational utilization, training cycles, training centers, depots, etc.) and personnel (recruitment, training, development, deployment, retention, etc.) across the Navy's warfighting platforms (aircraft, ships, submarines, etc.), facilities and personnel development centers.\n-Continue to conduct ship, boat, and unmanned marine vehicle concept studies in preparation for Capabilities Based Assessments (CBAs) and Analysis of Alternatives (AoAs). Studies will be performed in a continuous manner to support future recapitalization of Surface Combatants, Amphibious Ships, Carriers, Auxiliary Ships and other emerging program requirements.\n-Continue to collaborate with Warfare Systems design experts to perform continuous Warfare Systems analysis at the ship and fleet level. Warfare Systems effectiveness assessment tools are being continually developed and enhanced as required to address future concepts and to incorporate improvements in information technology systems. Additionally, collaborate\nwith aircraft, C4ISR, and networks by continuing dialog and collaboration between NAVSEA, NAVAIR, and SPAWAR systems commands which refines fleet level requirements.\n-Continue to conduct future force structure concept formulation. Fleet synthesis and analysis will be conducted, which includes capabilities requirements, platform design and cost and quantitative tracking of the long-term evolution of the fleet as new platforms are introduced and old ones are retired. Areas to be examined include interoperability concepts, force architecture impact studies, and operational employment concept studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.637"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.637"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to develop, update and maintain detailed level Navy Standard scenarios based on DPG.\n-Continue to develop alternative scenarios in support of Defense Review guidance, Joint studies, and Navy resource analyses.\n-Continue to develop, update and maintain analytic baselines for the MCO based on DPG.\n-Continue to develop details required to execute analysis of designated Defense Planning Scenarios and their respective Multi-Service Force Deployment Plans.\n-Continue to develop and maintain a framework and common set of processes to ensure that essential elements of warfare analyses, including scenarios, operational concepts, tactics, capabilities of platforms and systems (for Navy, Joint, coalition and threat forces), key assumptions and input data are defined and traceable to government approved\/provided source material.\n-Continue to develop scenarios and operational concepts based on government inputs that are sufficiently detailed for use in naval and joint campaign analyses.\n-At the mission level, continue to script Operational Situations (OPSITS) or Tactical Situations (TACSITS) for use in effectiveness analyses in specific warfare mission areas.\n-Continue to provide analytically-based decision recommendations to CNO for both warfighting and support areas.\n-Continue to develop CNO investment strategy recommendations and assessments for Program Review and Program Objective Memorandum.\n-Continue to perform rigorous, time critical naval and joint campaign and mission-level analyses, usually based on modeling and simulation that illuminated complex warfare issues which support decision-making in the PPBE process.\n-Continue to conduct ISR and METOC assessments to determine the optimal mix of Naval ISR and METOC sensors, platforms, and processing, analysis and fusion disposition to support MCOs, the OCO, and intelligence preparation of the environment for both MCOs and OCO.\n-Continue to develop and maintain common baselines from which campaign excursions and mission-level analyses are executed.\n-Continue to identify, develop and improve data and modeling, and broker agreements upon assumptions, CONOPS, scenarios, and data.\n-Continue to lead campaign analysis for OPNAV and lead Navy's participation in OSD\/Joint Staff analytic agenda, baseline development, and collection of data.\n-Continue to conduct modeling and simulation support for ongoing OPNAV missile defense analysis requirements.\n-Continue to provide analytically-based decision recommendations to OPNAV for joint warfighting and support areas.\n-Continue to develop new analytic models and techniques for informing resource allocation decisions; conduct all campaign and warfare mission-level analyses and develop investment strategies.\n-Continue to develop and improve the Navy's analysis capabilities which support Joint and Navy analytic agendas and resource-allocation decision making by refining the linkages between cost and performance in performance-modeled programs in support of Navy analysis and assessment. Areas of tool development and improvement included mission and campaign-level warfighting models, active and reserve manpower, afloat and ashore readiness, and medical capabilities.\n -Continue to focus on integrated analysis capabilities that cut across business and program accounts. Specific efforts address cyber warfare and security, optimizing the training pipeline, integrating ship maintenance and operations price performance models, and improving mission- and campaign-level C5ISR models and representations.\n-Continue to develop medical analysis that links to campaign analysis including movement of injured between care facilities, life-saving treatment of injured and recuperation support of injured to support Navy Medical Program decisions.\n-Continue to update the high-level readiness model that fully integrates all aspects of warfighting support (operational utilization, training cycles, training centers, depots, etc.) and personnel (recruitment, training, development, deployment, retention, etc.) across the Navy's warfighting platforms (aircraft, ships, submarines, etc.), facilities and personnel development centers.\n-Continue to conduct ship, boat, and unmanned marine vehicle concept studies in preparation for Capabilities Based Assessments (CBAs) and Analysis of Alternatives (AoAs). Studies will be performed in a continuous manner to support future recapitalization of Surface Combatants, Amphibious Ships, Carriers, Auxiliary Ships and other emerging program requirements.\n-Continue to collaborate with Warfare Systems design experts to perform continuous Warfare Systems analysis at the ship and fleet level. Warfare Systems effectiveness assessment tools are being continually developed and enhanced as required to address future concepts and to incorporate improvements in information technology systems. Additionally, collaborate\nwith aircraft, C4ISR, and networks by continuing dialog and collaboration between NAVSEA, NAVAIR, and SPAWAR systems commands which refines fleet level requirements.\n-Continue to conduct future force structure concept formulation. Fleet synthesis and analysis will be conducted, which includes capabilities requirements, platform design and cost and quantitative tracking of the long-term evolution of the fleet as new platforms are introduced and old ones are retired. Areas to be examined include interoperability concepts, force architecture impact studies, and operational employment concept studies."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 funding request was reduced by $2.324 million to account for the availability of prior year execution balances in addition to a reduction of $443K for rate adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Mission Assessment Studies"
                                    },
                                    "Description": {
                                        "val": "Capabilities-Based Assessment (CBA) is the JCIDS analysis process that includes three phases: the Functional Area Analysis (FAA), the Functional Needs Analysis (FNA), and the Functional Solution Analysis (FSA). The results of the CBA are used to develop a joint capabilities document (based on the FAA and FNA) or initial capabilities document (based on the full analysis). CBA funding provides the resource sponsors the means to develop the analytic underpinning required by Chairman of the Joint Chiefs of Staff Instruction 3170.01G to support the determination of Naval war fighting capabilities and force structure needed to support the JROC\/JCIDS requirements validation process and to inform Program Objective Memorandum programming decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.492"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.395"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "CBA such as advanced Naval surface fires and Naval aviation training to identify future capability requirements. Develop metrics to describe the effectiveness of solutions, and evaluate current and programmed systems ability to meet capability requirements to determine capability gaps. Expand warfighting gap assessments addressing interaction of mission area kill chain platforms, sensors, and weapons in a system-of-system construct."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.786"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.786"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "CBA such as advanced Naval Warfare fires and Naval aviation integrated analysis to identify future capability requirements. Develop metrics to describe the effectiveness of solutions, and evaluate current and programmed systems ability to meet capability requirements to determine capability gaps. Expand warfighting gap assessments addressing interaction of mission area kill chain platforms, sensors, and weapons in a system-of-system construct."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 funding request was reduced by $0.609 to account for the availability of prior year execution balances."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3017"
                    },
                    "ProjectTitle": {
                        "val": "Enterprise Information Systems"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.932"
                        },
                        "BudgetYearOne": {
                            "val": "0.954"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.954"
                        },
                        "BudgetYearTwo": {
                            "val": "0.972"
                        },
                        "BudgetYearThree": {
                            "val": "0.993"
                        },
                        "BudgetYearFour": {
                            "val": "1.013"
                        },
                        "BudgetYearFive": {
                            "val": "1.033"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds the Office of Naval Research (ONR) Next Generation Enterprise Network (NGEN) Information Technology  corporate costs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Next Generation Enterprise Network (NGEN)"
                                    },
                                    "Description": {
                                        "val": "This project funds the Office of Naval Research (ONR) Next Generation Enterprise Network (NGEN) Information Technology corporate costs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.932"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This project funds Next Generation Enterprise Network (NGEN) Corporate information technology requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.954"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.954"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This project funds Next Generation Enterprise Network (NGEN) Corporate information technology requirements."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2020 to FY 2021"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3027"
                    },
                    "ProjectTitle": {
                        "val": "Defense Critical Infrastructure Program"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "5.632"
                        },
                        "CurrentYear": {
                            "val": "7.743"
                        },
                        "BudgetYearOne": {
                            "val": "5.772"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.772"
                        },
                        "BudgetYearTwo": {
                            "val": "7.767"
                        },
                        "BudgetYearThree": {
                            "val": "7.658"
                        },
                        "BudgetYearFour": {
                            "val": "7.330"
                        },
                        "BudgetYearFive": {
                            "val": "7.477"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Funds received pursuant to the transfer of budget authority from OUSD Policy (OUSD (P)) Homeland Defense Mission Assurance Directorate will be used for infrastructure analysis, assessment, and research required to support execution of the Defense Critical Infrastructure  and Mission Assurance Program (DCIP \/ MA). Additionally, the transferred budget authority will be used to provide in-depth\/cross-cutting analysis to the Mission Assurance (MA)\/DCIP programs at the Office of the Secretary of Defense (OSD), Joint Staff, Military Departments\/Services, Defense Agencies, and Combatant Commands. NSWCDD-A40 will also perform cyber mission assurance research and provide expertise in infrastructure mitigation techniques and solutions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mission Assurance Risk Management System (MARMS) Technical Support"
                                    },
                                    "Description": {
                                        "val": "Provide capabilities to meet the technical requirements in support of the developmental efforts for the current and future common operating picture for Mission Assurance supporting Joint Staff MARMS development team, program office and A40 mission assurance database organization.\n\nThe OSD (P) Mission Assurance Directorate and the Joint Staff provide oversight for funding that will be used for infrastructure analysis, assessment, and research required in support of Mission Assurance and Defense Critical Infrastructure (DCI) programs at the Joint Staff and OSD (P)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.371"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.530"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1\tMARMS TWG guidance & requirements traceability tracking and enforcement upon anticipated FY 2019 contract award\n2\tMARMS programmatic acquisition support to Joint Staff and DTRA Program Office based on milestone decision authority phase entry and anticipated system engineering support\n3\tMARMS Architecture (DoDAF) tracking and incorporating data registry scheme between existing Joint Staff portals and MARMS developed user interface (EPRM)\n4\tDatabase mapping and analysis for MARMS and update of data from emerging analysis and assessment data for initial operational capability for MARMS use and implementation"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.530"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.530"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1\tMARMS TWG guidance & requirements traceability tracking and enforcement upon anticipated FY 2020 contract award\n2\tMARMS programmatic acquisition support to Joint Staff and DTRA Program Office based on milestone decision authority phase entry and anticipated system engineering support\n3\tMARMS Architecture (DoDAF) tracking and incorporating data registry scheme between existing Joint Staff portals and MARMS developed user interface (EPRM)\n4\tDatabase mapping and analysis for MARMS and update of data from emerging analysis and assessment data for initial operational capability for MARMS use and implementation - Data Librarian & Mission Mapping task"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no change from FY2020 to FY2021"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission Assurance Assessments (MAA) Support"
                                    },
                                    "Description": {
                                        "val": "Provide analysis and characterization of Defense Critical Infrastructure through research and study of existing assessment data and incoming assessment data to analyze trends, provide feedback, and significant impacts to defense missions and assets during events, exercises, and planning efforts.\n\nThe OSD (P) Mission Assurance Directorate and the Joint Staff will provide oversight to A40 for funding that will be used for infrastructure analysis, assessment, and research required in support of Mission Assurance and Defense Critical Infrastructure (DCI) programs at the Joint Staff and OSD (P)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.884"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.365"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1  Mission Assurance Trends Analysis Methodology continue refinement of data inputs from latest assessment results \n2  Annual trends analysis on MAA reports conducted to ensure common vulnerabilities are identified, tracked, and enterprise solutions offered to enhance efficient use of limited budgets and funding for risk mitigations\n3  Review of Joint Staff quantitative processes in Mission Assurance Assessments to ensure viable and verified risk estimates are defendable within the budget process and gain attention for immediate resolution from cyber and physical threats\n4  Incorporate NAVSEA 00I assessment needs into existing Mission Assurance methods and execute two Mission Assurance \/ Cyber Network Assurance combined assessments at NAVSEA laboratory as pilot and shipyard as initial rollout."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.697"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.697"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1  Mission Assurance Trends Analysis Methodology continue refinement of data inputs from latest assessment results \n2  Annual trends analysis on MAA reports conducted to ensure common vulnerabilities are identified, tracked, and enterprise solutions offered to enhance efficient use of limited budgets and funding for risk mitigations\n3  Review of Joint Staff quantitative processes in Mission Assurance Assessments to ensure viable and verified risk estimates are defendable within the budget process and gain attention for immediate resolution from cyber and physical threats\n4  Incorporate NAVSEA 00I assessment needs into existing Mission Assurance methods and execute two Mission Assurance \/ Cyber Network Assurance combined assessments at NAVSEA laboratory as pilot and shipyard as initial rollout."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY2020 to FY2021 reflects the incorporation of lessons learned from previous year tasking developing methodologies of pilot assessments and realizing efficiencies among assessment team planning and hiring"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Mission Assurance"
                                    },
                                    "Description": {
                                        "val": "Analysts will investigate cyber impacts to missions and infrastructure associated with DoD assets.  This information will be conveyed in assessments, memorandums, and white papers to inform senior leaders and teams about the significance of cyber infrastructure and the interdependencies with physical infrastructure.\n\nThe OSD (P) Mission Assurance Directorate and the Joint Staff will provide oversight to A40 for funding that will be used for infrastructure analysis, assessment, and research required in support of Mission Assurance and Defense Critical Infrastructure (DCI) programs at the Joint Staff and OSD (P)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.624"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.498"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1\tBest Practices report for risk reduction to Platform Information Technology - Control Systems (PIT-CS) will be edited to encompass weapons platform IT constructs and other critical infrastructure platforms on which DoD has dependencies\n2\tAnnual ICS update to Best Practices Report will be conducted to identify enhanced methods and metrics to monitor progress and accomplishment towards categorizing entire inventory of critical DoD control systems and their known vulnerabilities\n3\tResearch and develop cyber-specific infrastructure assessment methods to complement assessment teams and data incoming from ongoing assessments across DoD and Services, with particular focus on NAVSEA Red Team enhancement\n4\tTechnical Liaison Support to Cyber MA Enterprise will continue to identify paths for engaging MA partners on a collaborative tool that identifies cyber mission risks from assets identified as part of ongoing assessment efforts across multiple missions and cyber domains"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.849"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.849"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1\tBest Practices report for risk reduction to Platform Information Technology - Control Systems (PIT-CS) will be edited to encompass weapons platform IT constructs and other critical infrastructure platforms on which DoD has dependencies\n2\tAnnual ICS update to Best Practices Report will be conducted to identify enhanced methods and metrics to monitor progress and accomplishment towards categorizing entire inventory of critical DoD control systems and their known vulnerabilities\n3\tResearch and develop cyber-specific infrastructure assessment methods to complement assessment teams and data incoming from ongoing assessments across DoD and Services, with particular focus on NAVSEA Red Team enhancement\n4\tTechnical Liaison Support to Cyber MA Enterprise will continue to identify paths for engaging MA partners on a collaborative tool that identifies cyber mission risks from assets identified as part of ongoing assessment efforts across multiple missions and cyber domains"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY020 to FY2021 is based on the plan to incorporate funding for NAVSEA Red Team support into separate funding line for assessment team sustainment planning. Task 4"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense Critical Electric Infrastructure (DCEI)"
                                    },
                                    "Description": {
                                        "val": "Provide electric power analysis and characterization of defense installations at the request of senior leaders engaged with energy security and resilience efforts for national security with interagency representatives from industry utilities, DHS, and DoE.\n\nThe OSD (P) Mission Assurance Directorate and the Joint Staff will provide oversight to A40 for funding that will be used for infrastructure analysis, assessment, and research required in support of Mission Assurance and Defense Critical Infrastructure (DCI) programs at the Joint Staff and OSD (P)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.494"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.494"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1\tUpdate installation peak power methodology and primary EP infrastructure pathways in support of interagency FAST act collaboration\n2\tUpdate DCEI analysis as requested per ongoing interagency collaborations in DoD cluster areas\n3\tAnalyzing post table top exercise feedback (Constrained Eagle) to enhance leadership understanding of commercial electric power grid dependencies for DoD Missions\n4\tProvide recommendations on what DoD processes may be appropriate to use to engage with utilities to discuss analysis findings\n5\tEngage with other federal and private industry agencies to deepen understanding of utility operations and grid operations (FERC, NERC, NRECA, etc.)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.494"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.494"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1\tUpdate installation peak power methodology and primary EP infrastructure pathways in support of interagency FAST act collaboration\n2\tUpdate DCEI analysis as requested per ongoing interagency collaborations in DoD cluster areas\n3\tAnalyzing post table top exercise feedback (Constrained Eagle) to enhance leadership understanding of commercial electric power grid dependencies for DoD Missions\n4\tProvide recommendations on what DoD processes may be appropriate to use to engage with utilities to discuss analysis findings\n5\tEngage with other federal and private industry agencies to deepen understanding of utility operations and grid operations (FERC, NERC, NRECA, etc.)"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no change from FY2020 to FY2021"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission Assurance Program Management"
                                    },
                                    "Description": {
                                        "val": "Monitor, track and report on all budget related inquiries and task planning and execution for the Mission Assurance \/ DCIP programs including data calls, weekly budget reports, and deliverables.\n\nThe OSD (P) Mission Assurance Directorate and the Joint Staff will provide oversight to A40 for funding that will be used for infrastructure analysis, assessment, and research required in support of Mission Assurance and Defense Critical Infrastructure (DCI) programs at the Joint Staff and OSD (P)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.839"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.900"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1 Enhance program management support to OSD  and NAVSEA to include financial tracking and updates to support reclama notices or budget execution data calls\n2 Offer options for enhanced information sharing to MA community and related entities, potentially in support of Combatant Command (CCMD) exercises or real world events that showcases A40 expertise\n3 Continue to discover ways to save funding via IT footprint consolidation and efficient use of network resources and database files"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.770"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.770"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1 Enhance program management support to OSD  and NAVSEA to include financial tracking and updates to support reclama notices or budget execution data calls\n2 Offer options for enhanced information sharing to MA community and related entities, potentially in support of Combatant Command (CCMD) exercises or real world events that showcases A40 expertise\n3 Continue to discover ways to save funding via IT footprint consolidation and efficient use of network resources and database files"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY2020 to FY2021 reflects anticipated savings from licensing of virtual tools and network resource management \/ consolidation of hardware footprint currently being planned"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense Critical Infrastructure"
                                    },
                                    "Description": {
                                        "val": "Provide mission assurance assessment and support for characterization of defense critical infrastructure and supporting links to commercial industry and equipment.  Analysis and research will provide details on critical links to defense missions and assets and support risk management decision planning for installations, services, and COCOMS.\n\nThe OSD (P) Mission Assurance Directorate and the Joint Staff will provide oversight to A40 for funding that will be used for infrastructure analysis, assessment, and research required in support of Mission Assurance and Defense Critical Infrastructure (DCI) programs at the Joint Staff and OSD (P)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.527"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1  Maintain Global Mission Assurance Portal (GMAP) portal documentation requirements and continue development of database solution and provide best practices \/ option in support and coordination with MARMS effort\n2  DCI criticality assessments and nominations will continue to flow in and be reviewed \/ analyzed for completeness and prioritized for review\n3  Mission Mitigation and Risk Reduction Plan coordination and review of new or existing nominated assets and need for budget prioritization of vulnerability solutions\n4  Risk Management Plan draft summaries will be coordinated, edited, and reviewed for correctness, completeness and identified appropriate vulnerabilities and threats to justify risk management plan efforts cover the issues\n5  Continue nomination package preparation for biannual update and finalization of critical defense assets and infrastructure\n6  Revalidation packages for Defense Critical Assets (DCAs) will be reviewed and nominated based on previous mission plan inputs and current Joint Staff and OSD defense planning guidance updates\n7  Development and support of Defense Industrial Base pilot assessment \"Supporting Eagle\" will be executed and feedback gained from exercise execution to implement in future policy documents"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.396"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.396"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1  Maintain Global Mission Assurance Portal (GMAP) portal documentation requirements and continue development of database solution and provide best practices \/ option in support and coordination with MARMS effort\n2  DCI criticality assessments and nominations will continue to flow in and be reviewed \/ analyzed for completeness and prioritized for review\n3  Mission Mitigation and Risk Reduction Plan coordination and review of new or existing nominated assets and need for budget prioritization of vulnerability solutions\n4  Risk Management Plan draft summaries will be coordinated, edited, and reviewed for correctness, completeness and identified appropriate vulnerabilities and threats to justify risk management plan efforts cover the issues\n5  Continue nomination package preparation for biannual update and finalization of critical defense assets and infrastructure\n6  Revalidation packages for Defense Critical Assets (DCAs) will be reviewed and nominated based on previous mission plan inputs and current Joint Staff and OSD defense planning guidance updates\n7  Development and support of Defense Industrial Base pilot assessment \"Supporting Eagle\" will be executed and feedback gained from exercise execution to implement in future policy documents"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease from FY20 to FY21 due to availability of prior year execution balances."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense Critical Mission (DCM)"
                                    },
                                    "Description": {
                                        "val": "Conduct research and provide expertise on the defense critical missions nominated by the Joint Staff and Mission Assurance community for development of mitigations and solutions to vulnerabilities discovered as part of mission assurance assessment processes.  Analysts will provide expertise and knowledge in multiple areas of engineering and infrastructure to provide robust and resilient plans and projects to enhance installation infrastructure and planning to increase successful support of critical missions.\n\nThe OSD (P) Mission Assurance Directorate and the Joint Staff will provide oversight to A40 for funding that will be used for infrastructure analysis, assessment, and research required in support of Mission Assurance and Defense Critical Infrastructure (DCI) programs at the Joint Staff and OSD (P)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.526"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.526"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1 Continue update of Mission Maps to maintain awareness of existing and new DCMs and the assets supporting multiple AORs and across mission owners (and de-conflict)\n2 Provide DCM process briefings to MA community to enhance awareness of critical mission assets and their common vulnerabilities within domains and across operational areas to enhance enterprise solutions and identify funding dollars to fix vulnerabilities\n3 Support Mission Assurance Senior Steering and Executive Steering Group briefings and papers to Joint Staff led initiatives incorporating the DCM concept into doctrine or best practices\n4 Continued update of Defense Critical Mission Methodology Brief to include Plan of Action and Milestones and execute tasks to provide a more holistic concept of mission assurance and protection of assets in support of multiple missions"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.326"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.326"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1 Continue update of Mission Maps to maintain awareness of existing and new DCMs and the assets supporting multiple AORs and across mission owners (and de-conflict)\n2 Provide DCM process briefings to MA community to enhance awareness of critical mission assets and their common vulnerabilities within domains and across operational areas to enhance enterprise solutions and identify funding dollars to fix vulnerabilities\n3 Support Mission Assurance Senior Steering and Executive Steering Group briefings and papers to Joint Staff led initiatives incorporating the DCM concept into doctrine or best practices\n4 Continued update of Defense Critical Mission Methodology Brief to include Plan of Action and Milestones and execute tasks to provide a more holistic concept of mission assurance and protection of assets in support of multiple missions"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease from FY20 to FY21 due to availability of prior year execution balances."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Outside the Wire (OTW) Infrastructure Reports"
                                    },
                                    "Description": {
                                        "val": "Provide infrastructure characterization reports on non-DoD owned supporting infrastructure at DoD installations on the same schedule as the Defense Threat Reduction Agency (DTRA) mission assurance assessments"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.614"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.620"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Up to 16 OTW reports anticipated to be provided by A40 Dahlgren to DTRA teams ahead of pre-site scheduled visit"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Up to 16 OTW reports anticipated to be provided by A40 Dahlgren to DTRA teams ahead of pre-site scheduled visit"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decrease reflects the transition of this tasking from a mostly government civilian supported effort to a contracted team with government oversight and editing \/ management \/ distribution team overseeing the work."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NAVSEA Mission Assurance Cyber Assessments (MACA) Pilot"
                                    },
                                    "Description": {
                                        "val": "NAVSEA MACA Pilot is a combination mission decomposition of programs and assets combined with NAVSEA Red Team cyber assurance techniques on associated navy, program, and asset networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.753"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.210"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct 2-3 assessments and NAVSEA designated priority sites in combination with Red Team and Mission Assurance experts"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.210"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.210"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Grow team from FY2020 to 3-4 assessments per year on a steady periodic basis through FY2021.  Provide cyber and mission assurance analysis and expertise to assets, infrastructure, and networks and provide reporting to senior leadership to mitigate found vulnerabilities; grow local expertise and persistent cyber awareness based on initial assessment team survey"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no change from FY2020 to FY2021"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3312"
                    },
                    "ProjectTitle": {
                        "val": "MTMD-Maritime Theater Missile Defense Forum"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "6.983"
                        },
                        "CurrentYear": {
                            "val": "10.601"
                        },
                        "BudgetYearOne": {
                            "val": "16.251"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.251"
                        },
                        "BudgetYearTwo": {
                            "val": "15.028"
                        },
                        "BudgetYearThree": {
                            "val": "14.308"
                        },
                        "BudgetYearFour": {
                            "val": "14.486"
                        },
                        "BudgetYearFive": {
                            "val": "14.776"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds participation in Maritime Integrated Air and Missile Defense projects with other nations through the Maritime Missile Defense Projects Framework Memorandum of Understanding of 2004 (as amended 2009, 2015, and 2016). Known as the Maritime Theater Missile Defense (MTMD) Forum, it promotes interoperability with the Navies of eleven participating nations (Australia, Canada, Denmark, France, Germany, Italy, Netherlands, Norway, Spain, United Kingdom and the United States).  This project funds participation in multiple Projects and includes a maritime contribution to the NATO Active Layered Theater Ballistic Missile Defense (ALTBMD) project, now known as NATO Ballistic Missile Defense (BMD). Engineering analysis and recommendations from MTMD activities are provided to European, Pacific and Central Combatant Commands to influence present day operations. Specifically, the MTMD Forum is addressing challenges with \"Maritime Allied Air Defense in Support of Ballistic Missile Defense Operations\" that face the Combatant Commanders during present day operations.  The MTMD Forum is leveraging At-Sea Demonstration (ASD) test events and operational Fleet Exercises  to integrate technology with concepts of operations developed within MTMD Forum working groups.\n\nThe MTMD Forum develops systems and techniques that enhance protection and defense against the proliferation of short, medium and long-range Ballistic Missile (BM) and Advanced Anti-Ship Cruise Missile (ASCM) threats through the development of interoperable sea-based Integrated Air and Missile Defense (IAMD) capability among coalition nations.  This includes protection across the full spectrum of these threats through the enhanced utilization of existing sea-based systems to protect against current threats while progressively improving and developing systems and system-of- systems to effectively counter evolving threats. \n\nThis project supports USN participation in several Maritime IAMD related Project Arrangements and Working Groups including:\n\n(1)  Battle Management Command, Control, Communications, Computers, and Intelligence (BMC4I) to define and develop architectures as well as to perform engineering to address coalition capability gaps. \n(2)  Modeling & Simulation (M&S) to establish and maintain a maritime coalition M&S testbed and to perform legacy and future systems simulation testing.\n(3)  Coalition Distributed Engineering Plant (CDEP) to establish and maintain a maritime coalition Hardware-in-the-Loop Testbed and to conduct CDEP testing.\n(4)  Open Architecture (OA) to develop Interface Standards and Data Models.\n(5)  Test Planning and Execution (TPEX) to develop Test Plans, oversee exercise participation and conduct post event data analysis and reporting.\n(6)  Operational Requirements (OR) to develop a Coalition Maritime Missile Defense Operational Concept Document and to identify operational constraints and tactical constructs surrounding coalition maritime missile defense activities.\n(7)  Reciprocal Use of Test Facilities agreements with other nations to support Maritime IAMD and MTMD related demonstrations.\n(8) Tactical Advancement for Next Generation (TANG) to work with our Allies and International Partners using human-centered design methodologies to identify solutions to technology and sailor performance issues that have been cited during previously conducted experiments, exercises, and demonstrations.  This process will seek to leverage R&D investments and risk reduction research commercial companies are making today that can provide potential \"dual use\" technology and process solutions to complex problems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MTMD-Martime Theater Missile Defense Forum"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.983"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.601"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "(1) BMC4I will continue engineering analysis and multi-national interoperability gap assessment for the Target Architecture utilizing test results from project events and complete development of the Target Architecture based on additional request for information inputs from member nations. BMC4I will evaluate emergent Possible Point Solutions and provide recommendations for implementation in correcting coalition interoperability gaps. BMC4I will update information exchange requirements in preparation for at-sea demonstrations. BMC4I will develop updates to MTMD Coalition Capabilities and Interoperability (CCI) publications as appropriate.\n\n(2) M&S will continue analysis of Target Architectures and conduct further assessments in support of providing recommendations to improve information exchange requirements identified by BMC4I and the SET. M&S will model future Target Architectures and provide analysis in support of future at-sea demonstrations. The M&S team will continue development of the test bed and add additional computing power to the test environment to provide faster and more powerful analytical capability to the Forum System Engineering Team. The M&S Working Group will continue development of Mission Models in support of capability development to illustrate operational impact of proposed solutions to complex Integrated Air and Missile Defense (IAMD) problems.\n\n(3) CDEP will continue to assess interoperability of joint air and land assets in Annual Test Event (ATE) 2020. CDEP will also characterize risks of future at-sea events such as at-sea demo (ASD) 2020 and ASD 2021. CDEP will work with BMC4I and OR working groups to update the Coalition Capabilities and Interoperability (CCI) gaps document and develop test plans to assess capabilities suitable for land-based testing. CDEP will prepare for and conduct hardware-in-the-loop tests with allied partners, and will provide assessments and recommendations to improve information exchanges required to conduct at-sea demos or to evaluate performance as an effective and efficient alternative to at-sea events. CDEP will undertake early-look testing of Identification Friend or Foe Mode 5 and Mode S systems between U.S. and Coalition partners and the impacts to interoperability. CDEP will continue to align with the stated objectives in the MTMD Forum Capability Roadmap. CDEP will continue to improve a hardware-in-the-loop (HWIL) suite that can supplement live testing and facilitate a robust engineering evaluation of integrated air and missile defense performance for coalition interoperability.\n\n(4) Open Architecture will model and extend the component interfaces for additional Force Level Functions (FLFs), such as Engageability Assessment and Effector Management. The Force Data Model will be updated to support the information exchange of additional FLFs. A Force Threat Evaluation and Weapons Assignment (FTEWA) prototype will be identified and work will begin implementing a Force Level Open Architecture Technical Standard (FLOATS) in order to test and debug the standard, and exercise the interfaces within an M&S and CDEP environment. These exercises will demonstrate various operational methodologies for distributing data within the Force and identify performance parameters for the FLOATS standard. The OAWG will continue to collaborate with BMC4I, OR, CDEP and the System Experts Meeting (SEM) to ensure these interfaces align with the Target and Reference Architectures as well as selected Possible Point Solutions (PPSs). The OAWG will collaborate with the FTEWA Workshops and Subject Matter Experts (SMEs) to ensure the FLF component interfaces align with FTEWA and operational requirements. The OAWG will monitor the OARIS Industry Group as required.\n\n(5) TPEX will continue preparations for MTMD participation in its ongoing at-sea test event series. ASD 2020 will execute in Q4 of FY20. Three live-fire Integrated Air and Missile Defense (IAMD) events are planned to be conducted. These at-sea demonstrations will include live tracking events and a combination of live and simulated engagements within a fleet exercise, focused on interoperability assessment. Planning for At-Sea Demonstrations and follow-on at-sea testing will continue into future years and include ballistic target procurement. Future planning activity in FY20 will include ASD 21\/FS-21 (Exercise Formidable Shield 21), Pacific Dragon 22, and FS-23, which will serve as risk reduction for future ASD events and provide data that enables interoperability assessments.\n\n(6) Operational Requirements group will continue to provide operator's perspective and recommendations to the engineering and test activity conducted in the other working groups.\n\n(7) TANG will lead projects that solve mission focused, human-centered challenges using innovation and systems engineering methods for the Navy and USMC. For each project, TANG will tailor the research and solution generation methods to the respective topic and scope. Methods may include ethnographic research, synthesis of findings into opportunities, leading, facilitation and conduct of workshops, development of strategy and solution roadmaps, and support of prototyping and experimentation. TANG will continue to investigate trends, share lessons learned, and grow the TANG capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.251"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.251"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "(1) BMC4I will continue engineering analysis of multi-national interoperability gap assessment for the Target Architecture utilizing test results from project events and complete development of the Target Architecture based on additional request for information inputs from member nations. BMC4I will evaluate emergent Possible Point Solutions and provide recommendations for implementation in correcting coalition interoperability gaps. BMC4I examination of allied capabilities and limitations, and follow-on production of a capabilities \/ limitations database, is critical to the success of At-Sea Demonstration \/ Formidable Shield 2021 (ASD\/FS21). BMC4I will develop updates to MTMD Coalition Capabilities and Interoperability (CCI) publications that contribute to alignment of requirements among the participating nations of the MTMD-F. \n\n(2) M&S will continue analysis of Target Architectures and conduct further assessments in support of providing recommendations to improve information exchange requirements identified by BMC4I and the System Engineering Team (SET). M&S will refresh equipment and software that was procured in the 2013 timeframe and ensure all associated authorities to operate are in place for continued coalition modeling and simulation.  The technical refresh is required in order to maintain compatibility with allied M&S systems.  M&S will model future Target Architectures and provide analysis in support of future at-sea demonstrations. The M&S team will continue development of the test bed and add additional computing power to the test environment to provide faster and more powerful analytical capability to the Forum System Engineering Team. The M&S Working Group will continue development of Mission Models in support of capability development to illustrate operational impact of proposed solutions to complex Integrated Air and Missile Defense (IAMD) problems.\n\n(3) CDEP will continue to assess interoperability of joint air and land assets in Annual Test Event (ATE) 2021.  The controlled test environment offers greater repeatability than the at-sea events.  Three additional nations have fielded their national Hardware in the Loop (HWIL) capabilities in the last two years, requiring more frequent connection testing by the U.S. CDEP Team.  CDEP will also characterize risks of future at-sea events such as at-sea demo (ASD) 2021 and ASD 2022. CDEP will work with BMC4I and OR working groups to update the Coalition Capabilities and Interoperability (CCI) gaps document and develop test plans to assess capabilities suitable for synthetic-based testing. CDEP will prepare for and conduct hardware-in-the-loop tests with allied partners, and will provide assessments and recommendations to improve information exchanges required to conduct at-sea demos or to evaluate performance as an effective and efficient alternative to at-sea events. CDEP will allow for early-look testing that assesses  Identification Friend or Foe (IFF) Mode S interoperability between the US and Coalition partners and the impacts to interoperability. CDEP is planned to test integrated Link 22 between the US and its Coalition partners to characterize possible interoperability impacts during future ASD events. CDEP will continue to align with the stated objectives within the MTMD Forum Capability Roadmap. CDEP will continue to improve a hardware-in-the-loop (HWIL) suite that can supplement live testing and facilitate a robust engineering evaluation of integrated air and missile defense performance for coalition interoperability. \n\n(4) Open Architecture will model and extend the component interfaces for additional Force Level Functions (FLFs), such as Network and Track Management. The Force Data Model will be extended to support the information exchange of additional FLFs. The Force Threat Evaluation and Weapons Assignment (FTEWA) prototype with a FLOATS implementation will be finalized and exercised via scenarios within an M&S and CDEP environment. In addition to identifying errors and deficiencies in the standard, these exercises will demonstrate various operational methodologies for distributing data within the Force as well as identifying performance parameters for updating FLOATS. The OAWG will continue to collaborate with BMC4I, OR, CDEP and the System Experts Meeting (SEM) to ensure these interfaces align with the Target and Reference Architectures as well as selected Possible Point Solutions (PPSs). The OAWG will collaborate with the FTEWA Workshops and Subject Matter Experts (SMEs) to ensure the FLF component interfaces align with FTEWA and operational requirements. The OAWG will monitor the OARIS Industry Group as required. \n\n(5) TPEX will continue preparations for MTMD participation and support for ongoing at-sea test event series. t-Sea Demonstration 21 \/ Exercise Formidable Shield 2021 (ASD\/FS21) will execute in Q3 of FY21. The exercise is specified and endorsed by the Joint Chiefs of Staff Joint Exercise Program, and incorporated into U.S. European Command schedule for FY 21 activity. Further, the event is specified and scheduled in NATO's Master Training Exercise Program for FY 21 conduct.  Live-fire Integrated Air and Missile Defense (IAMD) events are planned to be conducted with MTMD Forum nations bringing ships, aircraft, and ground based sensors. These at-sea demonstrations will include live tracking events and a combination of live and simulated engagements within a fleet exercise, focused on interoperability assessment. The MTMD Forum Project is the sponsor for the supersonic target associated activity and responsible for the integration efforts of ground-launched supersonic targets at the Ministry of Defence Hebrides Range. Planning for At-Sea Demonstrations and follow-on at-sea testing will continue into future years and include ballistic target procurement. The data analysis effort contained within the TPEX line of effort provides the linkage and measures of success between the various MTMD-F supported at sea demonstrations that enabled key policy makers and leaders to understand capability gaps \/ possible solutions with quantified metrics.  Future planning in FY21 will include Pacific Dragon 22, and FS-23 which will be risk reduction for future ASD events.\n\n(6) Operational Requirements group will continue to provide operator's perspective and recommendations to the engineering and test activity conducted in the other working groups.  This critical cooperation with Surface Mine Warfare Development Command (SMWDC) enables the allied linkage into the established relationship between SMWDC and NAVSEA.\n\n(7) TANG will lead projects that solve mission focused, human-centered challenges using innovation and systems engineering methods for the Navy and USMC. Planned projects in FY21 include Surface Bridge Redesign partly in response to the collisions in the 7th Fleet; improved approach to the PEO COLUMBIA commitments process; Submarine Advanced Development process strategy; NAVSEA Digital Engineering effort; development of USMC Future Vertical Lift design requirements; exploration of Surface Training and Readiness concepts to assess tactical proficiency on surface ships; and other potential projects for the Department of the Navy."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 21 increase will fund the required levels of effort needed to support and conduct the dual-purpose At-Sea Demonstration 21 \/ Exercise Formidable Shield 2021 (ASD\/FS21) event planned for Q3 of FY 21. The increase in funding is required to support both the exercise and a perpetual supersonic testing capability in the UK for deployed US forces to use. Major elements of the increased effort include: ballistic and supersonic target shipping and buildup; test planning and Aegis weapons system analysis; and combat system integration testing within the Tactical Data Link architecture that supports and enables the exercises. The exercise will involve the first use of the GQM-163A Supersonic Sea Skimming Target at the Hebrides Range and there are significant demands that attach to the use of this high-end target safely and successfully, including range safety engineering to ensure safe and successful integration of the target into existing range systems and procedures.  \n\nTANG increase from FY 2020 to FY 2021 supports additional projects to include Surface Bridge Redesign partly in response to the collisions in the 7th Fleet; improved approach to the PEO COLUMBIA commitments process; Submarine Advanced Development process strategy; NAVSEA Digital Engineering effort; development of USMC Future Vertical Lift design requirements; and exploration of Surface Training and Readiness concepts to assess tactical proficiency on surface ship."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3330"
                    },
                    "ProjectTitle": {
                        "val": "Naval Research Laboratory (NRL) Facilities Modernization"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "15.379"
                        },
                        "CurrentYear": {
                            "val": "19.026"
                        },
                        "BudgetYearOne": {
                            "val": "16.441"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.441"
                        },
                        "BudgetYearTwo": {
                            "val": "16.837"
                        },
                        "BudgetYearThree": {
                            "val": "16.460"
                        },
                        "BudgetYearFour": {
                            "val": "16.788"
                        },
                        "BudgetYearFive": {
                            "val": "17.124"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program has been established to provide a systematic and planned approach to improve vital in-house science and technology (S&T) laboratory facilities at the Naval Research Laboratory (NRL) which are reaching or have reached critical stages of deterioration.  The program includes restoration and modernization (R&M) initiatives for about 350,000 net square feet, where the average age of the buildings is 67 years old."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NRL Facilities Modernization"
                                    },
                                    "Description": {
                                        "val": "Critical Science and Technology research cannot be sustained or succeed in deteriorated facilities. World class research can only be accomplished in facilities that are at a minimum \"adequate\", but preferably \"state-of-the-art.\" Due to their advanced age and deterioration, funds are planned to restore\/modernize various laboratory facilities at the Naval Research Laboratory."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.379"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.026"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to address planned and emergent studies, evaluations, and modernization projects of laboratory facilities and infrastructure modernization of laboratories to meet future technological threats.  Execute planned Corporate Facility Investment Plan (CFIP) actions which include continuing laboratory consolidation efforts and relocation of highly sensitive, highly specialized equipment into refurbished buildings. Projects planned for FY 2020 include but are not limited to the replacement of existing duct work and control systems for multiple air handlers that support materials science research into the synthesis, processing, characterization, and implementation of advanced materials; the renovation of additional laboratory space to support research of electronic materials including semiconductors, heterostructures, and superconductors as well as materials characterization and properties; and the replacement of 50 year old chilled water lines that service multiple facilities, laboratories, and critical equipment located within these laboratories."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.441"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.441"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The Naval Research Laboratory plan to undertake numerous planned and emergent studies, evaluations, and modernization projects of laboratory facilities and infrastructure modernization of laboratories to meet future technological threats. Plans in FY 2021 include providing upgrades to current facilities to increase effectiveness as well as critical facilities and equipment repairs.\n \nUpgrades to facilities planned for in FY 2021 include:\n\n- Fire suppression system in laboratory space utilized by the Naval Center for Space Technology. This project is planned to be funded fully in FY 2021.\n\nFacility repair projects planned for in FY 2021 include:\n\n- Replacement of numerous transformers and switchgears to ensure NRL main-site is able to meet the electrical power needs to conduct S&T work. This project is planned to be funded fully in FY 2021.\n- Replacement and repair of numerous air handling units to ensure that proper regulation and circulation of air in the heating, ventilating, and air-conditioning (HVAC). This project is planned to be funded fully in FY 2021.\n- Repair of numerous roofs to ensure laboratory space is not impacted by weather. This project is planned to be funded fully in FY 2021."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease in FY 2021 is due to the re-phasing of projects from FY 2019 to FY 2020. Projects such as the replacement of multiple transformers, switchgears, and electric feeders at numerous facilities, such as the Beam Physics Center for Computational Science, were delayed due to accommodate further planning of the replacement these critical improvements. The re-phasing of FY 2019 to FY 2020 will put NRL back on their planned schedule for facility improvements and thus planned execution will commence in FY 21."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "None"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3363"
                    },
                    "ProjectTitle": {
                        "val": "PACOM Initiative"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "12.526"
                        },
                        "CurrentYear": {
                            "val": "14.587"
                        },
                        "BudgetYearOne": {
                            "val": "11.713"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.713"
                        },
                        "BudgetYearTwo": {
                            "val": "15.467"
                        },
                        "BudgetYearThree": {
                            "val": "15.301"
                        },
                        "BudgetYearFour": {
                            "val": "14.646"
                        },
                        "BudgetYearFive": {
                            "val": "14.940"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "China Strategic Initiative (CSI) (LI 0605853N). The CSI became a DoD RDTE program in FY 2014. The CSI program is INDOPACOM's first Asia Rebalance initiative and provides critical support to planning efforts across the Command addressing Secretary of Defense's # 1 priority. CSI is a command-directed program that provides the Commander, INDOPACOM, and his staff vital support at all levels of planning and decision-making within the INDOPACOM Area Of Responsibility. The CSI program provides: cutting-edge research on adversary approaches to warfare, monitoring and analysis of adversary social media and censorship, unique understanding of effects of U.S. actions at the strategic and operational levels, sponsorship of Track 1.5\/2 Strategic Nuclear Dialogue with China, etc. This funding is for a classified effort and details can be provided at a higher classification level."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "INDOPACOM Initiative"
                                    },
                                    "Description": {
                                        "val": "China Strategic Initiative (CSI) (LI 0605853N). The CSI became a DoD RDTE program in FY 2014. The CSI program is INDOPACOM's first Asia Rebalance initiative and provides critical support to planning efforts across the Command addressing Secretary of Defense's # 1 priority. CSI s a command-directed program that provides the Commander, INDOPACOM, and his staff vital support at all levels of planning and decision-making within the PACOM Area Of Responsibility. The CSI program provides: cutting-edge research on adversary approaches to warfare, monitoring and analysis of adversary social media and censorship, unique understanding of effects of US actions at the strategic and operational levels, sponsorship of Track 1.5\/2 Strategic Nuclear Dialogue with China, etc. This funding is for a classified effort and details can be provided at a higher classification level."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.526"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.587"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development and refinement of: deeper analysis of Chinese war theory and planning, increase in the overall number of critical vulnerabilities assessments and methodology, increase in the number of effects testing events, and continued expansion of China media analysis to all Combatant Commands. Integration with routine policy and planning processes will mature, alongside efforts to consolidate knowledge management of high-output data yields that generate unique insights into adversary intentions and methodologies in warfare approaches; research\/analysis on China's economy (aerospace and medicine, other areas requiring high levels of R&D and human capital) and assess their Made in China 2025 plan and potential key policy implications for US and INDOPACOM allies and partners."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.713"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.713"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development and refinement of: deeper analysis of Chinese war theory and strategic planning; increase in the overall number of critical vulnerabilities assessments and methodology, increase in the number of effects testing events at both strategic and operational levels; expansion and sustainment of China media analysis to all Combatant Commands; research\/analysis on China's economy and short\/long-term effects of U.S. Integration with routine policy and planning processes will mature, alongside efforts to consolidate knowledge management of high-output data yields that generate unique insights into adversary intentions and methodologies in warfare approaches; continue to monitor\/analyze Chinese economy and Made in China 2025 plan."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease from FY20 to FY21 due to availability of prior year execution balances."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "15.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "15.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Funds execution of DoD's Executive Agent (EA) for Printed Circuit Board (PrCB) Technologies as established by the 2009 National Defense Authorization Act (Section 256, PL 110-417).  The primary deliverable from this effort will be a PrCB and Interconnect Technology Roadmap, or strategic plan, identifying domestic technology gaps, future research and development needs, and any policy changes required to ensure that the DoD has access to PrCB manufacturing capabilities and technical expertise necessary to meet future military requirements.  As mandated, the EA will also address DoD PrCB supply chain issues, including diversity and vulnerabilities, and develop trustworthiness requirements for PrCBs used in defense systems."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Printed Circuit Board Executive Agent"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "15.000"
                                        },
                                        "Text": {
                                            "val": "- Coordinate executive agent activities, receive and assess Service\nComponent PCB R&D activities, and establish DoD Cross-Service Advisory Panel\n- Conduct Organic Substrate Risk & Gap Analysis\n- Implement and maintain PCB Trust Specification (IPC-1791)\n- Monitor\/Assess\/Evaluate Technology Development Issues & Topics \n- Conduct DoD PCB manufacturing capability projects\n- Develop processes for Embedded Devices, Additive Manufacturing, and\nPrinted Electronics\n- Coordinate with Department of Commerce and Industry Organizations to\nresolve Industrial Base Supply Chain Issues\n- Develop & Implement SCRM Solutions & Tools\n- Conduct Research, Development, and Assessment in support of PCB Roadmap\ncreation\n- Coordinate Knowledge and Capability efforts across DoD to avoid\nduplication and ensure appropriate technology focus\n- Develop PCB-related Training Modules"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}