{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-9035d21372bc28631c31031b85da2fbd962d290bf8d6ca6eecbc49021508de49-71",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605104D8Z"
        },
        "ProgramElementTitle": {
            "val": "Technical Studies Support and Analysis"
        },
        "R1LineNumber": {
            "val": "152"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "174.883"
            },
            "PriorYear": {
                "val": "21.281"
            },
            "CurrentYear": {
                "val": "18.079"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "214.243"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program is a key source of funding for the Office of the Secretary of Defense (OSD) to manage studies, analyses, strategic planning, and technical support efforts to improve and support policy development, decision making, management and administration of DoD programs and activities. Studies and analyses are predominantly performed by independent sources outside of the government such as universities, Federally Funded Research and Development Centers, and other private not-for-profit sources.  Research requirements will examine current and alternative policies, plans, operations, strategies and budgets, providing essential means for managing and responding to the shifting and complex international, political, technological, economic, military, and acquisition environments in which national security planning decisions are made.  Independent analyses from subject matter experts are instrumental for senior defense planners in making informed choices regarding requirements for force planning and strategic deployment of assets taking into account technological challenges and resource constraints, and there is a strong need to incorporate the findings of operational analysis in force planning requirements and projections. With the complexities of present and emerging advanced security threats in the current geopolitical environment, these investments in knowledge to inform senior leadership and support planning for the mid and long-term is vital to remaining strategically competitive."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "22.525"
                },
                "CurrentYear": {
                    "val": "18.079"
                },
                "BudgetYearOne": {
                    "val": "18.255"
                },
                "BudgetYearOneBase": {
                    "val": "18.255"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.281"
                },
                "CurrentYear": {
                    "val": "18.079"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.244"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-18.255"
                },
                "BudgetYearOneBase": {
                    "val": "-18.255"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.740"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Funding realigned to other budget lines for studies"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-5.985"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.985"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Cancelled Accounts"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.004"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Defense Wide Review"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-12.270"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-12.270"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "This program was reduced by $12.270 million dollars as a result of the FY 2021 Defense Wide Review (DWR).  The DWR focused on the Secretary's guidance to streamline operations, increase efficiency, and promote greater affordability within the OSD and Defense Agencies and Field Activities in order to ensure the Department's optimum alignment to the National Defense Strategy and DoD strategic guidance, with particular focus on building a more lethal, resilient, agile, and ready force while strengthening alliances, prioritizing cyber and space capabilities, and focusing on innovation to maintain the technological advantage.\"    \n\nAn additional reduction in program funds in the amount of $5.985 million reflects realignment of budget authority to other programs for studies and analyses within the Office of the Under Secretary of Defense for FY 2021 and beyond."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "421"
                    },
                    "ProjectTitle": {
                        "val": "Technical Studies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "174.883"
                        },
                        "PriorYear": {
                            "val": "21.281"
                        },
                        "CurrentYear": {
                            "val": "18.079"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "214.243"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program is a key source of funding for the Office of the Secretary of Defense (OSD) to manage studies, analyses, strategic planning, and technical support efforts to improve and support policy development, decision making, management and administration of DoD programs and activities. Studies and analyses are predominantly performed by independent sources outside of the government such as universities, Federally Funded Research and Development Centers, and other private not-for-profit sources.  Research requirements will examine current and alternative policies, plans, operations, strategies and budgets, providing essential means for managing and responding to the shifting and complex international, political, technological, economic, military, and acquisition environments in which national security planning decisions are made.  Independent analyses from subject matter experts are instrumental for senior defense planners in making informed choices regarding requirements for force planning and strategic deployment of assets taking into account technological challenges and resource constraints, and there is a strong need to incorporate the findings of operational analysis in force planning requirements and projections.  With the complexities of present and emerging advanced security threats in the current geopolitical environment, these investments in knowledge to inform senior leadership and support planning for the mid and long-term is vital to remaining strategically competitive."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Technical Studies and Analyses Support for the Office of the Secretary of Defense (OSD)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.281"
                                            },
                                            "Text": {
                                                "val": "Technical Support for the USD(Acquisition and Sustainment):\nStudies and analyses of:\n\nElectromagnetic spectrum battle management, technological capabilities requirements planning, nuclear forensics capabilities, countering short-range missile threats, munitions portfolio requirements, strategic communications capabilities, strategic materials industrial infrastructure, space systems requirements, macroeconomic impacts on the defense industrial base, defense manufacturing requirements, cyber assurance, supply chain risk management, global defense industry developments, international armaments cooperation, strategic basing requirements, acquisition data management capabilities, DoD installations planning, and improving integration of the acquisition process with operational needs.\n\nTechnical Support for the Director, Cost Assessment and Program Evaluation:\nStudies and analyses regarding the following areas:\n\nVarious analytic requirements for promoting an effective force with increased lethality such as developing plans for force modernization, sustainment of the nuclear stockpile and strategic forces, modernization of nuclear infrastructure, force projection capabilities, strategic cyber defense, maintaining full spectrum conventional and unconventional capabilities, capability planning resulting from scenario analyses, technical studies and analyses to support independent cost estimates and economic research, and continuation of development of critical management instruments for measuring the long-term trends, strength and affordability of the defense program and supporting development of the Future Years Defense Program. \n\nTechnical Support for the USD(Policy):\nStudies, analyses, and activities in the following areas:\n\nRequirements regarding national security geopolitical posture and policies such as regional defense strategies, defense against biological warfare and pandemics, strengthening regional defense partnerships and alliances, strategic defense policy, detection and defense against weapons of mass destruction, counter proliferation policy, global health security capabilities, eliminating terrorist safe havens and transnational terrorist organizations, space and cyber strategic guidance planning, strategic implications of global energy trends, homeland defense capabilities, and strategic-level simulations of areas of interest for legislative and executive branch decision-makers.\n\nTechnical Support for the USD(Personnel & Readiness):\nStudies and analyses in the following areas:\n\nStrengthening close combat capabilities, sustainment and planning for the force of the future such as active and reserve recruiting and retention issues, training requirements, maintaining strategic readiness, compensation and quality of life matters and retention, identifying critical personnel requirements, reserve component readiness and sustainability, health and medical issues, crisis and contingency readiness, diversity management and equal opportunity, and strategies for managing the Total Force portfolio.\n\nTechnical Support for the Joint Staff conducting joint research with OSD:\n\nJoint Studies and analyses with OSD based upon operations research, intelligence capabilities, command and control requirements, mobility capabilities, supply chain and support requirements, joint testing and training requirements, civil support capabilities, force programming planning, and basing requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.079"
                                            },
                                            "Text": {
                                                "val": "Technical Support for the USD(Acquisition and Sustainment):\nStudies and analyses of:\n\nReadiness of major weapons systems, strategic capabilities modernization, software development and sustainment capabilities, countering weapons of mass destruction, artificial intelligence and autonomous systems, digital engineering implementation strategies, mitigating defense acquisition program risk, foreign defense acquisition, manufacturing and supply chain integration, depot operations readiness, global defense industry developments, strategic basing requirements, strengthening allied defense capabilities, DoD installations planning, supply chain and energy source protection, contract financing effects, performance of other transaction authority, effectiveness of technology transfer from small businesses, and methods to sustain small business and non-traditional industrial sources.\n\nTechnical Support for the Director, Cost Assessment and Program Evaluation:\nStudies and analyses regarding the following areas:\n\nVarious analytic requirements for maintaining a balanced portfolio of defense capabilities through investment and resource planning such as emerging strategic and tactical systems requirements, developing innovative operational concepts, joint lethality in contested environments, mobility and logistical support capabilities, maintaining force readiness and personnel planning requirements, capability planning resulting from scenario analyses, contingency and conventional force requirements, technical studies and analyses to support independent cost estimates and economic research, and continuation of development of critical management instruments for measuring the long-term trends, strength and affordability of the defense program and supporting development of the Future Years Defense Program. \n\nTechnical Support for the USD(Policy):\nStudies, analyses, and activities in the following areas:\n\nRequirements regarding national security geopolitical posture and policies such as regional and strategic defense strategy, countering weapons of mass destruction, global strategic affairs, defense capabilities continuity, countering coercion and subversion, homeland defense support of civil authorities, planning, technological and other external effects on strategic requirements, space and cyber strategic guidance planning, protection of defense critical infrastructure, contingency and stability operations, nuclear planning, and strategic-level simulations of areas of interest for legislative and executive branch decision-makers.\n\nTechnical Support for the USD(Personnel & Readiness):\nStudies and analyses in the following areas:\n\nRebuilding readiness, sustainment and planning for the force of the future such as active and reserve recruiting and retention issues, training requirements, maintaining strategic force depth, compensation and quality of life matters and retention, identifying critical personnel requirements, reserve component readiness and sustainability, health and medical issues, crisis and contingency readiness, diversity management and equal opportunity, and strategies for managing the Total Force portfolio."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "No funding is requested for this program element in FY 2021."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The budget reflects realignment of budget authority to other programs for studies and analyses within the Office of the Under Secretary of Defense for FY 2021 and beyond as a result of defense-wide review initiatives."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}