{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-9035d21372bc28631c31031b85da2fbd962d290bf8d6ca6eecbc49021508de49-32",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603924D8Z"
        },
        "ProgramElementTitle": {
            "val": "High Energy Laser Advanced Development"
        },
        "R1LineNumber": {
            "val": "64"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "71.819"
            },
            "CurrentYear": {
                "val": "80.723"
            },
            "BudgetYearOne": {
                "val": "105.410"
            },
            "BudgetYearOneBase": {
                "val": "105.410"
            },
            "BudgetYearTwo": {
                "val": "108.663"
            },
            "BudgetYearThree": {
                "val": "108.484"
            },
            "BudgetYearFour": {
                "val": "110.634"
            },
            "BudgetYearFive": {
                "val": "112.376"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element funds High Energy Laser (HEL) advanced technology development aimed at translating technology solutions for broadly defined military problems into demonstrated performance pay-offs, increased capabilities, increased supportability, and\/or increased affordability.  HEL weapons systems have many potential advantages, including speed-of-light time-to-target, high precision, nearly unlimited magazine depth, low cost per kill, and reduced logistics requirements because of no need for stocks of munitions or warheads.  As a result, HELs have the potential to perform a wide variety of military missions.  Activities conducted under this program element will develop and demonstrate the technology necessary to enable HEL missions across the Department of Defense (DoD)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "74.364"
                },
                "CurrentYear": {
                    "val": "85.223"
                },
                "BudgetYearOne": {
                    "val": "81.152"
                },
                "BudgetYearOneBase": {
                    "val": "81.152"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "71.819"
                },
                "CurrentYear": {
                    "val": "80.723"
                },
                "BudgetYearOne": {
                    "val": "105.410"
                },
                "BudgetYearOneBase": {
                    "val": "105.410"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.545"
                },
                "CurrentYear": {
                    "val": "-4.500"
                },
                "BudgetYearOne": {
                    "val": "24.258"
                },
                "BudgetYearOneBase": {
                    "val": "24.258"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-4.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.532"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.013"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.663"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.663"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Increase for Laser Scaling"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "25.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "25.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.079"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.079"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The increase in FY 2021 will enable investigation of a fourth laser scaling approach as well as the creation of an integrated and validated database of operational laser lethality effects."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "924"
                    },
                    "ProjectTitle": {
                        "val": "High Energy Laser Initiative"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "71.819"
                        },
                        "CurrentYear": {
                            "val": "80.723"
                        },
                        "BudgetYearOne": {
                            "val": "105.410"
                        },
                        "BudgetYearOneBase": {
                            "val": "105.410"
                        },
                        "BudgetYearTwo": {
                            "val": "108.663"
                        },
                        "BudgetYearThree": {
                            "val": "108.484"
                        },
                        "BudgetYearFour": {
                            "val": "110.634"
                        },
                        "BudgetYearFive": {
                            "val": "112.376"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program element is part of an overall Defense strategy in High Energy Laser (HEL) science and technology development focused on scaling the output power of HELs to reach operationally effective power levels applicable to broad mission areas across the DoD.  Efforts will also pursue improvements in common HEL system components such as efficient power and\/or thermal management approaches, effective power supplies, and beam combining\/beam director designs.  This program element complements, and will be closely coordinated with, other DoD HEL efforts directed at specific Service and Agency missions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Energy Laser Power Scaling"
                                    },
                                    "Description": {
                                        "val": "This effort is focused on scaling the capabilities of high energy laser (HEL) weapons up to the level needed for multi-Service missions, both tactical and strategic, such as (but not limited to) integrated air and missile defense against hard targets. It leverages and\/or builds upon other investments in HEL development, such as laser scaling and propagation and beam control."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "71.819"
                                            },
                                            "Text": {
                                                "val": "Implement a research strategy to scale the output power of HEL to meet Department-wide mission area needs based on findings from the DoD HEL Roadmap Assessment and other technical sources.  Establish key performance metrics based on power, power-in-the-bucket (beam quality), electrical-optical efficiency, including size and weight constraints.  Determine appropriate technologies and initiate the development efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "80.723"
                                            },
                                            "Text": {
                                                "val": "- Laser Scaling: Continue the base effort of scaling HELs to the 300 kW-class power level. First, the overall the overall system architecture for each candidate HEL will be designed and tested.  Second, the high risk elements of each architecture, such as the fiber laser modules, the spectral beam combining fiber arrays, and the grating will be tested to ensure they satisfy system requirements. An additional novel approach to 300 kW laser scaling will be initiated. \n- Propagation and Beam Control: Nonlinear atmospheric propagation effects such as thermal blooming will be modeled and simulated.  Experimental data on HEL atmospheric propagation will be collected.  The experimental data will be compared to the modeling and simulation results. \n- High Energy Laser lethality: Collect additional data on laser damage effects experimentation from the services, including modeling and simulation results.  Once this data is collected, it will be organized into to a unified database which can be accessed by the operational HEL laser community for integrated air and missile defense (IAMD) mission planning, including transferring the results into a Directed Energy Joint Munition Effectiveness Manual for those missions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "105.410"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "105.410"
                                            },
                                            "Text": {
                                                "val": "- Laser Scaling:  Designs for 300 kW class HELs will be finalized and the system elements will be integrated into prototype 300 kW lasers.  Architectures will be developed for laser scaling from 300 kW to achieve 500 kW.\n- Propagation and Beam Control:  Continue research on thermal blooming of 300-500 kW class lasers, including data collection, modeling and simulation, and scaled field experiments.\n- High Energy Laser lethality: Collect additional data on laser damage effects experimentation from the services, including modeling and simulation results.  Once this data is collected, it will be integrated into the unified database developed in FY 2020."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase funding in FY 2021 will enable investigation of a fourth laser scaling approach as well as the creation of an integrated and validated database of operational laser lethality effects."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}