{
    "id": "2021-Army-PB-2040-JBOOK-2ce7b76ca8f41dbc06183380f90728d4a8e40b9122c9effab5b4a02fdffb364e-10",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605702A"
        },
        "ProgramElementTitle": {
            "val": "Meteorological Support to RDT&E Activities"
        },
        "R1LineNumber": {
            "val": "196"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "9.495"
            },
            "CurrentYear": {
                "val": "6.233"
            },
            "BudgetYearOne": {
                "val": "6.488"
            },
            "BudgetYearOneBase": {
                "val": "6.488"
            },
            "BudgetYearTwo": {
                "val": "6.694"
            },
            "BudgetYearThree": {
                "val": "6.756"
            },
            "BudgetYearFour": {
                "val": "7.208"
            },
            "BudgetYearFive": {
                "val": "7.349"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "50.223"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) provides meteorological support to research, development, test, and evaluation (RDTE) activities and provides standard and specialized weather forecasts and data to satisfy Army\/Department of Defense (DoD) RDTE test requirements for modern weaponry.  Types of support include:  (1) unique atmospheric analysis and sampling to include atmospheric transmittance, extinction, optical scintillation, infrared temperature, aerosol\/smoke cloud dispersion characteristics, and ballistic meteorological measurements; (2) test event forecasting to include prediction of sound propagation for ballistic firing tests, specialized prediction of light levels and target-to-background measurements, and predictions for electro-optical testing and ballistic artillery\/mortar firing; and (3) advisory and warning products such as go\/no-go test recommendations for ballistic and atmospheric probe missiles, smoke\/obscurant tests, hazard predictions for chemical agent munitions disposal, monitoring dispersion of simulant clouds for chemical\/biological detector tests, simulated nuclear blasts, and weather warnings for test range safety.  This PE provides technical weather support to Army and Joint Program Executive Officers (PEOs), Project Managers (PMs), and the Army test ranges and sites at: White Sands Test Center (WSTC), White Sands Missile Range, New Mexico; Electronic Proving Ground (EPG), Fort Huachuca, Arizona; West Desert Test Center (WDTC), Dugway Proving Ground, Utah; Aberdeen Test Center (ATC), Aberdeen Proving Ground, Maryland; Redstone Test Center (RTC), Redstone Arsenal, Alabama; Yuma Test Center (YTC), Yuma Proving Ground, Arizona (including the Cold Regions Test Center (CRTC), Fort Greely, Alaska); Operational Test Command (OTC), Fort Hood, Texas and Fort Bragg, North Carolina. This PE develops methodologies and acquires instrumentation and systems that allow meteorological teams to support current and future Army\/DoD RDTE requirements. It finances indirect meteorological support operating costs not billable to customers along with replacement\/ upgrade of meteorological instrumentation and support systems. Direct costs for meteorological support services are not funded by this PE, but are borne by the customer (i.e., materiel\/weapons developers and project\/product managers) in accordance with DoD Directive 7000.14R (Department of Defense Financial Management Regulations).  This PE enables more effective test scheduling and execution, and is essential to the accomplishment of the Army's developmental and operational test mission in that precise weather modeling and measurements directly influence test item performance and quantify test item weather dependencies and vulnerabilities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.759"
                },
                "CurrentYear": {
                    "val": "6.233"
                },
                "BudgetYearOne": {
                    "val": "6.42"
                },
                "BudgetYearOneBase": {
                    "val": "6.42"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "9.495"
                },
                "CurrentYear": {
                    "val": "6.233"
                },
                "BudgetYearOne": {
                    "val": "6.488"
                },
                "BudgetYearOneBase": {
                    "val": "6.488"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.264"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0.068"
                },
                "BudgetYearOneBase": {
                    "val": "0.068"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.264"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.068"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.068"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "128"
                    },
                    "ProjectTitle": {
                        "val": "Meteorological Support To RDT&E Activities"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.495"
                        },
                        "CurrentYear": {
                            "val": "6.233"
                        },
                        "BudgetYearOne": {
                            "val": "6.488"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.488"
                        },
                        "BudgetYearTwo": {
                            "val": "6.694"
                        },
                        "BudgetYearThree": {
                            "val": "6.756"
                        },
                        "BudgetYearFour": {
                            "val": "7.208"
                        },
                        "BudgetYearFive": {
                            "val": "7.349"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "50.223"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project provides meteorological support to research, development, test, and evaluation (RDTE) activities and provides standard and specialized weather forecasts and data to satisfy Army\/Department of Defense (DoD) RDTE test requirements for modern weaponry. Types of support include: (1) unique atmospheric analysis and sampling to include atmospheric transmittance, extinction, optical scintillation, infrared temperature, aerosol\/smoke cloud dispersion characteristics, and ballistic meteorological measurements; (2) test event forecasting to include prediction of sound propagation for ballistic firing tests, specialized prediction of light levels and target-to-background measurements, and predictions for electro-optical testing and ballistic artillery\/mortar firing; and (3) advisory and warning products such as go\/no-go test recommendations for ballistic and atmospheric probe missiles, smoke\/obscurant tests, hazard predictions for chemical agent munitions disposal, monitoring dispersion of simulant clouds for chemical\/biological detector tests, simulated nuclear blasts, and weather warnings for test range safety. This Project provides technical weather support to Army and Joint Program Executive Officers (PEOs), Project Managers (PMs), and the Army test ranges and sites at: White Sands Test Center (WSTC), White Sands Missile Range, New Mexico; Electronic Proving Ground (EPG), Fort Huachuca, Arizona; West Desert Test Center (WDTC), Dugway Proving Ground, Utah; Aberdeen Test Center (ATC), Aberdeen Proving Ground, Maryland; Redstone Test Center (RTC), Redstone Arsenal, Alabama; Yuma Test Center (YTC), Yuma Proving Ground, Arizona (including the Cold Regions Test Center (CRTC), Fort Greely, Alaska); Operational Test Command (OTC), Fort Hood, Texas and Fort Bragg, North Carolina. This PE develops methodologies and acquires instrumentation and systems that allow meteorological teams to support current and future Army\/DoD RDTE requirements. It finances indirect meteorological support operating costs not billable to customers along with replacement\/ upgrade of meteorological instrumentation and support systems. Direct costs for meteorological support services are not funded by this PE, but are borne by the customer (i.e., materiel\/weapons developers and project\/product managers) in accordance with DoD Directive 7000.14R (Department of Defense Financial Management Regulations). This PE enables more effective test scheduling and execution, and is essential to the accomplishment of the Army's developmental and operational test mission in that precise weather modeling and measurements directly influence test item performance and quantify test item weather dependencies and vulnerabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Civilian Pay and Support Costs"
                                    },
                                    "Description": {
                                        "val": "Funding related to Civilian Pay and associated indirect costs for meteorological support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.067"
                                            },
                                            "Text": {
                                                "val": "Provided indirect costs (personnel salaries) for generating weather forecasts, severe weather warnings and advisories; staff meteorological services; and atmospheric measurements in support of Army\/DoD tests and projects at eight Army test sites and alternate test sites as required.  Provided program management for meteorological support to the Army RDTE community and technical review\/assistance to ranges and meteorological support teams.  Provided technical meteorological support to the Army RDTE community including collaboration between Army meteorologists and the NCAR toward improvements to the 4DWX System and associated system administration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.078"
                                            },
                                            "Text": {
                                                "val": "Will provide indirect costs (personnel salaries) for generating weather forecasts, severe weather warnings and advisories; staff meteorological services; and atmospheric measurements in support of Army\/DoD tests and projects at eight Army test sites and alternate test sites as required. Will provide program management for meteorological support to the Army research, development, test and evaluation community and technical review\/assistance to ranges and meteorological support teams. Will provide technical meteorological support to the Army RDTE community including collaboration between Army meteorologists and the National Center for Atmospheric Research (NCAR) toward improvements to the Four Dimensional Weather System (4DWX) and associated system administration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.16"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.16"
                                            },
                                            "Text": {
                                                "val": "Will provide indirect costs (personnel salaries) for generating weather forecasts, severe weather warnings and advisories; staff meteorological services; and atmospheric measurements in support of Army\/DoD tests and projects at eight Army test sites and alternate test sites as required. Will provide program management for meteorological support to the Army RDTE community and technical review\/assistance to ranges and meteorological support teams. Will provide technical meteorological support to the Army RDTE community including collaboration between Army meteorologists and NCAR toward improvements to the 4DWX System and associated system administration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due inflation for civilian pay and routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Four Dimensional Weather System and Instrumentation"
                                    },
                                    "Description": {
                                        "val": "Provides funding for meteorological instrumentation and technology to support RDTE activities at Army test sites. Includes funding for sustainment and enhancement of the 4DWX system, an advanced meteorological support system that provides high-resolution weather forecasts and analyzes.  The 4DWX analyzes and forecasts the 3-dimensional structure of the atmosphere over time (4th dimension) and is used in test planning, conduct, and forensic analyses."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.425"
                                            },
                                            "Text": {
                                                "val": "Continued 4DWX system sustainment and modernization to improve forecast accuracy in support of Army RDTE mission requirements, including development of a full-grid climatography using 4DWX final-analysis data, and further development of probabilistic modeling; improved data assimilation procedures, and configuration of 4DWX to optimize test range-specific accuracy. Instrumentation funding was used to continue a multi-year effort to replace\/upgrade obsolete instrumentation, including upper-air sounding systems, surface atmospheric meteorological system, and radar wind profilers at several Army Test and Evaluation Command (ATEC) sites."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.001"
                                            },
                                            "Text": {
                                                "val": "Will continue 4DWX system sustainment and modernization to improve forecast accuracy in support of Army RDTE mission requirements, including development of a full-grid climatography using 4DWX final-analysis data, and further development of probabilistic modeling; improved data assimilation procedures, and configuration of 4DWX to optimize test range-specific accuracy. Instrumentation funding will be used to continue a multi-year effort to replace\/upgrade obsolete instrumentation, including upper-air sounding systems, surface atmospheric meteorological system, and radar wind profilers at several test centers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.328"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.328"
                                            },
                                            "Text": {
                                                "val": "Will continue 4DWX system sustainment and modernization to improve forecast accuracy in support of Army RDTE mission requirements, including development of a full-grid climatography using 4DWX final-analysis data, and further development of probabilistic modeling; improved data assimilation procedures, and configuration of 4DWX to optimize test range-specific accuracy. Instrumentation funding will be used to continue a multi-year effort to replace\/upgrade obsolete instrumentation, including upper-air sounding systems, surface atmospheric meteorological system, and radar wind profilers at several ATEC sites."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program funding aligns 4DWX and Instrumentation requirements with Army modernization priorities in support of the National Defense Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 National Defense Authorization Act (NDAA) Section 825 Major Defense Acquisition Program (MDAP) Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA Section 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.003"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.154"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}