{
    "id": "2021-AirForce-PB-3600-JBOOK-92b46cd12ef50ea764b60089f2b7a79948671e66250d4f7c6be7e00a142e885b-26",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-AIRFORCE_V1-U_RDTE_JustificationBook_Air_Force_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603270F"
        },
        "ProgramElementTitle": {
            "val": "Electronic Combat Technology"
        },
        "R1LineNumber": {
            "val": "27"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "53.704"
            },
            "CurrentYear": {
                "val": "48.408"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops and demonstrates technologies to support Air Force electronic combat warfighting capabilities. The program focuses on developing components, subsystems, and technologies with potential aerospace, special operations, and airlift electronic combat applications. It develops and demonstrates technologies for integrating electronic combat sensors and systems into a fused and seamless whole. It integrates and focuses research efforts in electronic warfare and cyber warfare to rapidly demonstrate a capability for rapid fielding. It develops and demonstrates technologies for navigation and timing in radio frequency (RF) contested and denied environments. It develops and demonstrates advanced technologies for radio frequency electronic combat suites and advanced warning and countermeasure technologies to defeat electro-optical, infrared, and laser threats to aerospace platforms. It also develops and demonstrates technologies that will enable mission systems to be more resilient, agile, autonomous, and be able to operate in multiple domains. This program has been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.\n\nIn the FY 2021, the Air Force is consolidating its existing thirteen Advanced Technology Development (ATD), Research Development Test and Evaluation (RDT&E), Budget Activity 03 (BA 03) PEs into five new capability focused RDT&E BA 03 PEs to better align with the Air Force Science and Technology (S&T) Strategy signed by the SECAF in April 2019. This consolidation will improve and accelerate delivery of integrated transformational, multidisciplinary, collaborative technology solutions necessary to enable new Air Force warfighting capabilities that support of the National Defense Strategy. This new structure will provide the Air Force and Congress with a clearer understanding and increased transparency of integrated technology solutions and demonstrations key to enabling the Air Force future force design.\n\nIn FY 2021, the entirety of Project 633720, EW Quick Reaction Capabilities, and Project 63691X, EO\/IR Warning & Countermeasures Tech, will be transferred from PE 0603270F, Electronic Combat Technology, to PE 0603035F, Next Gen Effects Dev\/Demos, Project 633720, EW Quick Reaction Capabilities.  \n\nIn FY 2021, Project 63431G, RF Warning & Countermeasures Tech, non-Vanguard efforts and activities will be transferred from PE 0603270F, Electronic Combat Technology, to PE 0603035F, Next Gen Effects Dev\/Demos, Project 63431G, RF Warning & Countermeasures Tech. Navigation Technology Satellite-3 (NTS-3) Vanguard activities under this Project will be consolidated and transferred in FY 2021 from PE 0603270F, Electronic Combat Technology, to the PE 0603032F, Future Air Force Integrated Tech Demos, Project 630320, Air Force Vanguards.\n\nIn FY 2021, the entirety of Project 634335, Cyber Concepts, will be transferred from PE 0603270F, Electronic Combat Technology, to PE 0603034F, Persistent Knowledge, Awareness, & C2 Tech, Project 634335, Cyber Concepts.\n\nAll of these transfers detailed above are part of the Air Force RDT&E BA 03 PE consolidation to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept, and Air Force S&T Strategy, April 2019. This is an administrative realignment and not a new start.  This work will continue to be executed by the Air Force Research Laboratory Sensors Technology Directorate located in Wright Patterson Air Force Base, Ohio.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver science & technology capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0601102F, 0602102F, 0602201F, 0602202F, 0602203F, 0602204F, 0602602F, 0602605F, 0602788F, 1206601SF, and 0602298F.\n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "55.054"
                },
                "CurrentYear": {
                    "val": "48.408"
                },
                "BudgetYearOne": {
                    "val": "47.116"
                },
                "BudgetYearOneBase": {
                    "val": "47.116"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "53.704"
                },
                "CurrentYear": {
                    "val": "48.408"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.350"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-47.116"
                },
                "BudgetYearOneBase": {
                    "val": "-47.116"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.350"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-47.116"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-47.116"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2021 of $47.116 million is due to the following:\n\n1) Entirety of Project 634335, Cyber Concepts, transferring to PE 0603034F, Persistent Knowledge, Awareness, & C2 Tech.\n\n2) Entirety of Project 633720, EW Quick Reaction Capabilities and Project 63691X, EO\/IR Warning & Countermeasures Tech, transferring to PE 0603035F, Next Gen Effects Dev\/Demos.\n\n3) Project 63431G, RF Warning & Countermeasure Tech, non-Vanguard efforts and activities transferring to PE 0603035F, Next Gen Effects Dev\/Demos, Project 63431G, RF Warning & Countermeasure Tech. \n\n4) Navigation Technology Satellite-3 Vanguard activities under Project 63431G, RF Warning & Countermeasure Tech, transferring to PE 0603032F, Future Air Force Integrated Tech Demos, Project 630320, Air Force Vanguards.\n\nThese transfers in FY 2021 are part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and Air Force S&T Strategy, April 2019."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "633720"
                    },
                    "ProjectTitle": {
                        "val": "EW Quick Reaction Capabilities"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "32.885"
                        },
                        "CurrentYear": {
                            "val": "29.454"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project establishes a capability to rapidly assess, develop and demonstrate new electronic warfare concepts, techniques, and capabilities as well as the required position navigation and timing (PNT) technologies and capabilities in the context of systemic electronic warfare (EW) effects (electronic warfare threat interactions) in a congested\/contested electromagnetic spectrum, system-of-systems (SoS) environment of the future. It develops disruptive electronic warfare and countermeasures concepts specifically selected for high-impact, game-changing effects; evaluates them in high fidelity virtual and hardware evaluation settings; and demonstrates them in an operationally relevant environment.  It establishes and maintains an all-source, physics-based, threat-to-countermeasures electronic warfare systems engineering methodology. It develops a core analytic function, supported by simulation-based wargaming and interactive engineering modeling capabilities to evaluate advanced countermeasures concepts.\n\nIn FY 2021, the entirety of Project 633720, EW Quick Reaction Capabilities, will be transferred to PE 0603035F, Next Gen Effects Dev\/Demos, Project 633720, EW Quick Reaction Capabilities, as part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and Air Force Science and Technology Strategy, April 2019.  The Project and associated efforts will continue to be executed by the Air Force Research Laboratory Sensors Technology Directorate located in Wright-Patterson Air Force Base, Ohio. This is an administrative realignment for consolidation, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Radio Frequency Electronic Warfare"
                                    },
                                    "Description": {
                                        "val": "Develop electronic warfare focused knowledge databases, engineering models, mission simulations, analysis tools and assessment environments which enable the development of multi-domain electronic warfare technologies.  The primary focus is on emulating complex battlespace radio frequency environments, electronic attack effects against emerging, networked weapon systems, and assessing flexible, software-defined electronic warfare systems with non-deterministic performance (for example, utilizing cognitive algorithms)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.289"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.503"
                                            },
                                            "Text": {
                                                "val": "Continue expansion of simulations to accommodate advanced electronic warfare systems, and to emulate the complex radio frequency threats and signal environments for which they're designed.  Continue development of higher fidelity threat system and signal propagation models. Continue developing the tools, methods and demonstrations to assess both the performance of future electronic warfare systems as well as their effectiveness including cognitive and autonomous technologies.  Continue the development and demonstration efforts to prove the concepts for full spectrum countermeasures capabilities. Continue the select development of threat seeker surrogates with which to test emerging electronic warfare technologies.  Continue expansion of software-in-the-loop and hardware-in-the-loop environments to achieve closed-loop system performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2021, this work is performed under the Radio Frequency Electronic Warfare effort in PE 0603035F, Next Gen Effects Dev\/Demos, Project 633720, EW Quick Reaction Capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $10.503 million. Funding decreased due to the transfer and realignment of this work to the Radio Frequency Electronic Warfare effort in PE 0603035F, Next Gen Effects Dev\/Demos, Project 633720, EW Quick Reaction Capabilities, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Position, Navigation and Timing for Contested\/Denied Environments"
                                    },
                                    "Description": {
                                        "val": "Develop and transition robust Global Navigation Satellite System capabilities; resilient complementary position, navigation and timing techniques; precise position, navigation and timing technologies for distributed sensing\/effects; position, navigation and timing technology to provide position, navigation and timing electronic warfare situational awareness and training; and position, navigation and timing architectures to enable resiliency against the rapidly evolving threat. Efforts will include prototypes and relevant Open Architecture standards where applicable to enable timely technology transition."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.111"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.336"
                                            },
                                            "Text": {
                                                "val": "Continue to further research techniques to securely certify Global Navigation Satellite System software defined radio technology and methods to trust Global Navigation Satellite System and integrate into the Navigation Technology Satellite-3 flight experiment.  Develop advanced reconfigurable software defined radio navigation receivers to enable spectrum agile systems and integrate into the Navigation Technology Satellite-3 flight experiment. Develop alternative position, navigation and timing techniques which increase the availability of the position, navigation and timing solution as well as increase the precision for radio frequency coherent sensing and electronic warfare. Evolve open architecture standards to allow for integration of Global Navigation Satellite System and alternative position, navigation and timing into future systems. Demonstrate integration of Global Navigation Satellite System position, navigation and timing and datalink-based complementary position, navigation and timing into a resilient embedded Global Positioning System inertial (R-EGI) government reference architecture."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2021, this work is performed under the Position Navigation and Timing for Contested\/Denied Environments effort in PE 0603035F, Next Gen Effects Dev\/Demos, Project 633720, EW Quick Reaction Capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $16.335 million. Funding decreased due to the transfer and realignment of this work to the Position Navigation and Timing for Contested\/Denied Environments effort in PE 0603035F, Next Gen Effects Dev\/Demos, Project 633720, EW Quick Reaction Capabilities, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electro-Optical\/Infrared Threat Warning and Countermeasures"
                                    },
                                    "Description": {
                                        "val": "Develop next generation countermeasure techniques to address the complete range of multispectral (for example, dual band infrared) threats including advanced techniques versus advanced man portable air defense system and air-to-air threats with multimode capabilities.  Develop capabilities for situational awareness and countermeasure to integrated air defense systems and associated multispectral threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.485"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.615"
                                            },
                                            "Text": {
                                                "val": "Continue at range evaluation of next generation high sensitivity focal plane array for proactive detection. Start requirements definition and evaluate acquisition alternatives for a proactive advanced technology demonstration. Start laboratory tests and continue modeling and simulation efforts to support the multispectrum electro-optical\/radio frequency countermeasures. Continue advance technique countermeasure at range tests to support requirements definition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2021, this work is performed under the Electro-Optical\/Infrared Threat Warning and Countermeasures effort in PE 0603035F, Next Gen Effects Dev\/Demos, Project 633720, EW Quick Reaction Capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $2.615 million. Funding decreased due to the transfer and realignment of this work to the Electro-Optical\/Infrared Threat Warning and Countermeasures effort in PE 0603035F, Next Gen Effects Dev\/Demos, Project 633720, EW Quick Reaction Capabilities, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "63431G"
                    },
                    "ProjectTitle": {
                        "val": "RF Warning & Countermeasures Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.113"
                        },
                        "CurrentYear": {
                            "val": "11.691"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates advanced technologies for radio frequency electronic combat suites, including the required navigation technologies and capabilities, to enhance the survivability of aerospace vehicles and to provide crew situational awareness. The research addresses technologies for missile\/threat warning, radio frequency receivers, electronic combat pre-processors, advanced sorting\/pre-processing algorithms, and expert software for applications on existing and future electronic combat systems. The research also focuses on the development and demonstration of subsystems and components for generating on-board\/off-board radio frequency countermeasure techniques. This includes the development of electronic countermeasures techniques, as well as advanced electronic countermeasures technologies such as antennas, power amplifiers, and preamplifiers.\n\nIn FY 2021, Project 63431G, RF Warning & Countermeasure Tech, will be transferred from PE 0603270F, Electronic Combat Technology to PE 0603035F, Next Gen Effects Dev\/Demos, Project 63431G, RF Warning & Countermeasure Tech with the exception of the work and funding that is associated with the Navigation Technology Satellite-3 Vanguard demonstration which will be realigned to PE 0603032F, Future Air Force Integrated Tech Demos, Project 630320, Air Force Vanguards. These transfers are part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas that better support the National Defense Strategy, Air Force Future Operating Concept, and Air Force Science and Technology Strategy, April 2019. This is an administrative realignment for consolidation, and not a new start. This Project and associated non-Vanguard efforts and activities will continue to be executed by the Air Force Research Laboratory Sensors Technology Directorate located in Wright Patterson Air Force Base, Ohio."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Electronic Attack"
                                    },
                                    "Description": {
                                        "val": "Develop aerospace platform jamming concepts, technologies and techniques to counter advanced radio frequency threats associated with current and future aerospace weapon systems. Provide position, navigation and system resilience via open architecture solutions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.113"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.691"
                                            },
                                            "Text": {
                                                "val": "Continue research into radio frequency receiver technologies that will better detect threats, measure more radio frequency features with greater accuracy, identify or classify signals more reliably, track and predict signals, and use reasoning algorithms to reduce ambiguities and errors, and deduce greater knowledge from the radio frequency spectrum.  Continue development of countermeasures toward explicit, underserviced threat weapon systems, with an emphasis on chamber and field testing for validation.  Continue research and development of novel multi-domain electronic attack methods and tactics to include distributed operations.  Continue expansion of modeling, simulation and laboratory assessment environments commensurate with technologies being researched, developed and tested including cognitive and autonomous electronic warfare technologies.  Continue the study, research and\/or development of merged autonomy and electronic warfare technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2021, non-Vanguard work is performed under the Electronic Attack effort in PE 0603035F, Next Gen Effects Dev\/Demos, Project 63431G, RF Warning & Countermeasures Tech. Navigation Technology Satellite 3 activities are performed under the Navigation Technology Satellite 3 effort in PE 0603032F, Future Air Force Integrated Tech Demos, Project 630320, Air Force Vanguards."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $11.691 million. Funding decreased due to realignment to PE 0603035F, Next Gen Effects Dev\/Demos, Project 63431G, RF Warning & Countermeasures Tech, Electronic Attack effort; and PE 0603032F, Future Air Force Integrated Tech Demos, Project 630320, Air Force Vanguards, Navigation Technology Satellite 3 effort, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "634335"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Concepts"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.309"
                        },
                        "CurrentYear": {
                            "val": "2.903"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates methods to discover cyber susceptibilities, assess avionics systems, formulate mitigation strategies, and investigate use of tools and technologies to automate this process. It is designed to apply developed vulnerability discovery, vulnerability mitigation, and cyber protection technology to avionics systems and components and embedded systems. This involves technologies for trusted sensors and trusted systems that deter exploitation of our critical hardware and software. This project aims to develop cyber resilience and protect systems through adaptation of the system to the threat.  It demonstrates these technologies in open and adaptable architectures for system integration in field demonstrations and proves out the technologies through rapid integration of sensors and architectures for technology transition. It integrates research efforts in electronic and cyber warfare to rapidly demonstrate a capability for rapid fielding.\n\nIn FY 2021, the entirety of Project 634335, Cyber Concepts, will be transferred to PE 0603034F, Persistent Knowledge, Awareness, C2 Tech, Project 634335, as part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and Air Force Science and Technology Strategy, April 2019.  The Project and associated efforts will continue to be executed by the Air Force Research Laboratory Sensors Technology Directorate located in Wright Patterson Air Force Base, Ohio. This is an administrative realignment for consolidation, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Avionics Cyber Vulnerabilities"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate methods, techniques, and technical tools to enable, assist, and improve the vulnerability discovery processes. Use developed tools and techniques to assess avionics boxes, systems, busses, and components. Investigate techniques to mitigate discovered vulnerabilities.  Develop and demonstrate mitigation and protection technologies on future concept platforms for adaptability and resilience."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.980"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.613"
                                            },
                                            "Text": {
                                                "val": "Continue to transition vulnerability mitigation technologies to address enduring issues with legacy weapon systems.  Increase efforts to demonstrate next-generation architecture capabilities, providing integration support for emerging technologies such as autonomy, alternative-navigation technologies, open system architecture standards and approaches, and multispectral and distributed intelligence surveillance and reconnaissance and electronic warfare.  Transition next-generation architectures to adopting programs\/platforms, and open architecture approaches to rapidly integrate advanced mission system capability for next-generation architectures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2021, this work is performed under the Avionics Cyber Vulnerabilities effort in PE 0603034F, Persistent Knowledge, Awareness, & C2 Tech, Project 634335, Cyber Concepts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $1.613 million. Funding decreased due to the transfer and realignment of this work to the Avionics Cyber Vulnerabilities effort in PE 0603034F, Persistent Knowledge, Awareness, & C2 Tech, Project 634335, Cyber Concepts, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Avionics Cyber Protections"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate advanced automated analysis tools and protection techniques to prevent exploitation of cyber susceptibilities in avionics systems.  This strategy would include discovery and mitigation of likely attack vectors, remediation of susceptibilities, and safeguards to assure the integrity of embedded software."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.329"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.290"
                                            },
                                            "Text": {
                                                "val": "Enhance and extend cyber protection tools, techniques and test beds for manned and unmanned air vehicles, mission and support equipment. Demonstrate a cyber defense-in-depth by integrating software, firmware and hardware-assisted protection technologies.  Develop system integration laboratory capabilities to develop, integrate, and test real-time cyber protections for avionics; intelligence, surveillance, and reconnaissance; positioning, navigation, and timing; and other systems.  Develop test samples to demonstrate the effectiveness of cyber protections. Flight test and demonstrate advanced cyber protection capabilities to reduce the risk to programs of record.  Collaborate with program offices and end-users to transition cyber protection technologies.  Leverage open system architecture standards and approaches to demonstrate cyber protections for current and next-generation architectures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2021, this work is performed under the Avionics Cyber Protections effort in PE 0603034F, Persistent Knowledge, Awareness, & C2 Tech, Project 634335, Cyber Concepts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $1.290 million. Funding decreased due to the transfer and realignment of this work to the Avionics Cyber Protections effort in PE 0603034F, Persistent Knowledge, Awareness, & C2 Tech, Project 634335, Cyber Concepts, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "63691X"
                    },
                    "ProjectTitle": {
                        "val": "EO\/IR Warning & Countermeasures Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.397"
                        },
                        "CurrentYear": {
                            "val": "4.360"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates the advanced warning and countermeasure technologies required to negate electro-optical\/infrared and laser threats to aerospace platforms.  Develops off-board (decoys and expendables) and on-board countermeasure technologies for aircraft self-protection to provide robust, affordable solutions for protection against infrared missiles with autonomous seekers, multi-spectral threats, laser-guided weapons, and electro-optical\/infrared tracking systems used to direct electro-optical\/infrared and radar-guided missiles.\n\nIn FY 2021, the entirety of Project 63691X, EO\/IR Warning & Countermeasures Tech, will be transferred to PE 0603035F, Next Gen Effects Dev\/Demos, Project 63691X, EO\/IR Warning & Countermeasures Tech, as part of the Air Force RDT&E BA 03 PE consolidation in order to realign technology areas to better support the National Defense Strategy, Air Force Future Operating Concept and Air Force Science and Technology Strategy, April 2019.  The Project and associated efforts will continue to be executed by the Air Force Research Laboratory Sensors Technology Directorate located in Wright Patterson Air Force Base, Ohio. This is an administrative realignment for consolidation, and not a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Electro-Optical\/Infrared Warning and Countermeasure Technologies"
                                    },
                                    "Description": {
                                        "val": "Analyze the vulnerabilities of current infrared missile systems and future imaging infrared sensors. Develop advanced countermeasure system techniques to exploit vulnerabilities for use against infrared and electro-optical guided missile threats. Develop advanced optical and infrared sensor systems for airborne and space situational awareness and threat warning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.397"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.360"
                                            },
                                            "Text": {
                                                "val": "Continue threat characterization and countermeasures development and field testing of new threats to include new jam codes and countermeasure techniques.  Continue to work with customers to determine impacts on current systems.  Continue flight test of the low cost missile warning capabilities.  Conduct critical experiments of long range missile warning technologies. Start incorporation of Modeling System for Advanced Investigation of Countermeasures and Radio Frequency engagement model development to meet the multispectral and multispectrum threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2021, this work is performed under the Advanced Electro-Optical\/Infrared Warning and Countermeasure Technologies effort in PE 0603035F, Next Gen Effects Dev\/Demos, Project 63691X, EO\/IR Warning & Countermeasures Tech."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 decreased compared to FY 2020 by $4.360 million. Funding decreased due to the transfer and realignment of this work to the Advanced Electro-Optical\/Infrared Warning and Countermeasure Technologies effort in PE 0603035F, Next Gen Effects Dev\/Demos, Project 63691X, EO\/IR Warning & Countermeasures Tech, as part of the Air Force RDT&E BA 03 PE consolidation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}