{
    "id": "2021-Army-PB-2040-JBOOK-8f7fdbb59cb85b132b0478715b87ff02c7eb359f73f79d73e48c9151ed5a28f2-2",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603003A"
        },
        "ProgramElementTitle": {
            "val": "Aviation Advanced Technology"
        },
        "R1LineNumber": {
            "val": "45"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "165.035"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "165.035"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year 2020 (FY20)this Program Element (PE)was realigned with continuity of effort to PE:\n* 0603465A Future Vertical Lift Advanced Technology."
        },
        "ProgramElementMissionDescription": {
            "val": "This PE matures and demonstrates manned and unmanned air vehicle technologies to enable Army aviation modernization.  Within this PE, aviation technologies are advanced and integrated into realistic and robust demonstrations.  Project 313 matures, demonstrates and integrates enabling component, subsystems and systems in the following areas: rotors and, structures.  Project 436 matures, integrates and demonstrates air launched weapons systems, mission equipment packages to enable control of unmanned systems and advanced teaming capabilities.  Project 447 matures and demonstrates affordable and efficient engines and drive trains.  \n\nWork in this PE contributes to the Army Science and Technology (S&T) Air Systems portfolio and is related to and fully coordinated with PE 0602211A (Aviation Technology), PE 0603313A (Missile and Rocket Advanced Technology), PE 0603710A (Night Vision Advanced technology), and PE 0603270A (Electronic Warfare Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering S&T focus areas and the Army Modernization Strategy. Work in this PE is performed by the  United States (U.S.) Army Futures Command (AFC).\n\nFY20 realignments are due to financial restructuring in support of the Army Modernization Priorities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "169.411"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "165.035"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.376"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-4.376"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "313"
                    },
                    "ProjectTitle": {
                        "val": "Adv Rotarywing Veh Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "109.61"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "109.610"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned to:\nProgram Element (PE) 0603465A Future Vertical Lift Advanced Technology: \n* Project AI4 Joint Multi-Role (JMR) Demonstration Advanced Tech\n* Project AI6 Next Gen Tactical UAS TD Advanced Technology\n* Project AJ3 Next Generation Rotorcraft Transmission Adv Tech\n* Project AJ5 Digital Vehicle Management & Control Advanced Tech\n* Project AJ7 Advanced Rotors Advanced Technology\n* Project AJ9 Integ Mission Equipment for Vert Lift Systems Adv Tech\n* Project AK3 Aviation Survivability Advanced Technology\n* Project AK8 Air Launched Effects Advanced Technology\n* Project AL6 Degraded Visual Environment Mitigation (DVE-M) Adv Tech\n* Project AM3 Aircraft and Aircrew Protection Advanced Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures, demonstrates and integrates components, subsystems and systems for vertical lift and unmanned air systems that provide improved aircraft and occupant survivability, reduced maintenance and sustainment costs, and greater performance through improved rotors, drives, vehicle management systems and platform design and structures. Systems demonstrated include rotors and robust airframe structures. A major effort in this Project is the Joint Multi-Role (JMR) Technology Demonstrator (TD) in support of the Future Vertical Lift (FVL) family of aircraft.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering Science and Technology focus areas and the Army Modernization Strategy. \n\nWork in this Project is coordinated with Program Executive Office Aviation (PEO Aviation) and PEO Intelligence, Electronic Warfare, and Sensors (PEO IEW&S).\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Platform Design & Structures Systems"
                                    },
                                    "Description": {
                                        "val": "Provide demonstration of FVL platform configurations that address multi domain battle capability needs.  Determine optimum vehicle attributes that meet future force capability needs for increased system speed, range, payload, and reduced operating costs, to inform and reduce future aviation materiel acquisitions.  Flight demonstrate operational capabilities of technology demonstrators."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "80.337"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated integrated, fastenerless advanced structural assemblies that enable future vertical lift platforms with crashworthy, damage tolerant, lightweight and sustainable solutions. Continued flight demonstrations of two Joint Multi-Role (JMR) Technology Demonstrator (TD) aircraft to collect data and assess the capabilities of advanced rotary-wing configurations (an advanced tilt rotor and lift-offset, co-axial helicopter with a pusher prop) and enabling component technologies.  Demonstrated advanced flight control technologies. Demonstrated on a ground test stand a Single Rotor Tiedown (SRT) test of the two-speed gearbox, Independent Blade Control (IBC) and rotors critical to realizing the performance capabilities of an Optimum Speed Tilt Rotor (OSTR). Finalized development a mission systems architecture from a representative architecture specification using JCA, model-based engineering tools, virtual integration methods and open systems architecture in a Mission Systems Architecture Capstone Demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rotors & Vehicle Management Systems"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the performance benefits of advanced rotors through the assessment of alternative designs aimed to satisfy future force capability needs for increased system durability, speed, range and payload.  This effort also integrates advanced flight controls with real-time aircraft state information into vehicle management systems to enable safe, low-effort maneuvering and real-time adaptation to aircraft state changes (degradation, damage, mission, etc.)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.292"
                                            },
                                            "Text": {
                                                "val": "Conducted trade studies to identify reliable technologies that enable highly efficient aircraft performance throughout the flight envelope."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rotorcraft Drive Systems"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates advanced rotorcraft drive technologies with the potential to: increase the horsepower-to-weight ratio; reduce drive system noise; reduce production, operating and support costs; and provide automatic component impending failure detection. The drive system demonstrators for this effort will be applicable to FVL platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.037"
                                            },
                                            "Text": {
                                                "val": "Continued fabrication of advanced multi-speed drive train hardware and initiated development testing of demonstrator hardware under the Next Generation Rotorcraft Transmission program to enable greater aircraft speed\/range in support of Future Vertical Lift."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability for Degraded Visual Environment (DVE) Operations"
                                    },
                                    "Description": {
                                        "val": "Develop and mature advanced sensor cueing and flight controls to provide ability to maintain terrain and obstacle situational awareness during all DVEs both aircraft induced (brown-out & white-out) and environmentally induced (fog, rain, snow etc.)   Flight testing on fleet aircraft is an integral component of the demonstration. Work in this area is being done in coordination with efforts at United States (U.S.) Army Communications-Electronics Research, Development, and Engineering Center (CERDEC), PE 0603710A (Night Vision Advanced Technology). The program presents an opportunity to North Atlantic Treaty Organization (NATO) nations, global industry, and academia to participate with their own assets in order to foster information exchange and collaboration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.377"
                                            },
                                            "Text": {
                                                "val": "Conducted multiple research focused trials and demonstrations while seeking opportunities to spin off and transition research to programs that will provide capability to the warfighter.  Physically integrated sensor fusion engine onto test aircraft and conducted engineering flight test of integrated system.  Implemented approaches for multi ship networking and operations in DVE.  Conducted capstone demonstration in government SIL that validates optimal cueing symbology, sensor driven guidance, flight control configuration, and optimum presentation of sensor data through augmented and virtual reality."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft & Occupant Survivability Systems"
                                    },
                                    "Description": {
                                        "val": "This effort increases rotorcraft survivability by reducing platform signatures, providing the means to more efficiently counter enemy detection and tracking systems, and also increases protection to the aircraft and aircrew against ballistic munitions, crash landings, and post-crash fire events. This effort enhances air crew situational awareness, allowing manned\/unmanned aircraft to avoid enemy air threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.532"
                                            },
                                            "Text": {
                                                "val": "Developed aircraft survivability correlator algorithms that take into account aircraft signatures, vulnerable areas, maneuverability, terrain, threat understanding, and available countermeasures to provide an appropriate response for an increased level of threat aircraft protection.  Developed ownship and team based survivability behaviors and continued integration of rotorcraft threat protection technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Tactical UAS Technology Demonstration (NGTUAS)"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate transformational air vehicle technologies that overcome key barriers to meet the Army?s future Unmanned Aircraft System (UAS)  performance, survivability, and reliability requirements and operational capabilities. Work in this area is being done in coordination with efforts at the Aviation and Missile Research, Development, and Engineering Center (AMRDEC)  PE 0602211A (Aviation Technologies)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.888"
                                            },
                                            "Text": {
                                                "val": "Refined air vehicle technologies maturation, integration and system level test and demonstration strategies.  Validated new design and assessment methodologies relevant to UAS-scaled platforms through demonstration.  Developed an informed Model Performance Specifications (MPS) and provide quantifiable metrics and key attributes for the NGTUAS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.147"
                                            },
                                            "Text": {
                                                "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "436"
                    },
                    "ProjectTitle": {
                        "val": "Rotarywing MEP Integ"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.192"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "7.192"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0603465 Future Vertical Lift Advanced Technology \n* Project AL1 Adv Teaming for Tactical Aviation Oper Adv Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and validates man-machine integration and mission equipment software and hardware technologies for unmanned and optionally manned aircraft systems and integrated threat protection systems. Efforts focus on artificial intelligence, intelligent agents, cognitive decision aiding, sensors, avionics, communications, and pilot vehicle interfaces. This Project improves the overall mission execution by demonstrating manned and unmanned system teaming, enhanced aircraft pilotage capability, improved crew workload distribution, and new capabilities for both manned and unmanned aircraft. This Project supports Army transformation by providing mature technology to greatly expand the capabilities of unmanned aircraft, in current operating roles and future unmanned wingman roles. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unmanned and Optionally Manned Systems"
                                    },
                                    "Description": {
                                        "val": "Mature and apply tactical behavior algorithms and safe-flight technologies to enable unmanned and optionally manned aircraft to maintain safe, responsive, flexible, and tactical formation flight with manned helicopters for unmanned wingman applications in re-supply, reconnaissance, surveillance and attack missions.  Develop, mature, apply, and integrate advanced decision aiding, autonomy, and human-machine interface technologies to enable the helicopter flight crew to make full use of the capabilities of an unmanned aircraft system (UAS) without requiring continuous attention. Efforts include development of intelligent algorithms that aid decisions and actions in order to increase situation awareness, maximize use of on-board and off-board sensors, efficiently manage a team of manned and unmanned vehicles and their mission systems, and develop and execute effective and appropriate offensive and defensive responses."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.674"
                                            },
                                            "Text": {
                                                "val": "Continued the development, integration and demonstration of third party vendor software and advanced human machine interface technologies in simulations to enable increased manned and unmanned teaming capabilities and to inform crew station development programs for both legacy fleet aircraft upgrades and future aircraft procurements. Continued to demonstrate software and hardware integration within an open systems, modular architecture based system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Teaming"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate teaming behaviors and autonomous decision making for mixed platform formations in combined arms operations.  Focus areas include:  resilient autonomous algorithms; self-organizing unmanned formations; distributed command and control; and navigation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.518"
                                            },
                                            "Text": {
                                                "val": "Developed and matured teaming algorithms focused on resupply, reconnaissance and surveillance mission areas. Integrated and demonstrated sensor and processing technology to support teaming behavior for heterogeneous platform formations."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "447"
                    },
                    "ProjectTitle": {
                        "val": "ACFT Demo Engines"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.633"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "3.633"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned to:\nProgram Element (PE) 0603465A Future Vertical Lift Advanced Technology\n* Project AI8 Alternative Concept Engine Advanced Technology\n* Project AJ1 Future UAS Engine Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates power system technologies through design, fabrication, and evaluation of advanced engine components in order to improve the performance of turbine engines and drive systems for vertical lift aircraft and Unmanned Aerial Systems (UAS) vehicles  This Project supports Army modernization by demonstrating mature technologies for lighter turbine engines and drives that provide increased power, increased fuel efficiency, improved sustainability and reduced maintenance. These advanced engine designs and drives will significantly improve the overall aircraft performance characteristics and reduce the logistical footprint of Army Aircraft.    \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Alternative Concept Engine (ACE)"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates alternative, adaptive, and intelligent engine technologies to provide improved \/ mission-optimized performance, readiness, and affordability across an expanding engine envelope for increased operational capability for Army Aviation manned and unmanned platforms.  The alternative concept engine technology demonstrations planned for this effort are applicable to current and future platforms. Work in this project is coordinated with efforts in PE 0602211A (Aviation Technology) \/  Project 47A (AERON & ACFT Wpns Tech)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.633"
                                            },
                                            "Text": {
                                                "val": "Continued fabrication and initiated component test of innovative\/adaptive engine component technologies such as variable speed power turbine. Continued component design integration efforts and perform fabrication of hardware for full system demonstration to enable greater aircraft performance and engine durability in support of Future Vertical Lift."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BA7"
                    },
                    "ProjectTitle": {
                        "val": "AVIATION ADVANCED TECHNOLOGY INITIATIVES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "44.6"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "44.600"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Aviation advanced technology development."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Stretch Broken Composite Material Forms"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4"
                                        },
                                        "Text": {
                                            "val": "Stretch Broken Composite Material Forms"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Helicopter Seating System"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Advanced Helicopter Seating System"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data Refinement and Optimization for Aviation Sustainment"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "1.6"
                                        },
                                        "Text": {
                                            "val": "Data Refinement and Optimization for Aviation Sustainment"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Surface Tolerant Adhesive for Bonded Airframe Structure"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Surface Tolerant Adhesive for Bonded Airframe Structure"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Tactical Aerial Supply Vehicle"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "3"
                                        },
                                        "Text": {
                                            "val": "Joint Tactical Aerial Supply Vehicle"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rotorcraft Automated Compenent Tracking"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "6"
                                        },
                                        "Text": {
                                            "val": "Rotorcraft Automated Compenent Tracking"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Future Vertical Lift (FVL) Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "20"
                                        },
                                        "Text": {
                                            "val": "Future Vertical Lift (FVL) Research"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}