{
    "id": "2021-Navy-PB-1319-JBOOK-29075b3c2af92ab5fcca1096cf65ecac9cc771240d227e79d45bc59626cdea42-13",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602782N"
        },
        "ProgramElementTitle": {
            "val": "Mine and Expeditionary Warfare Applied Research"
        },
        "R1LineNumber": {
            "val": "14"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "37.399"
            },
            "CurrentYear": {
                "val": "54.074"
            },
            "BudgetYearOne": {
                "val": "30.715"
            },
            "BudgetYearOneBase": {
                "val": "30.715"
            },
            "BudgetYearTwo": {
                "val": "31.326"
            },
            "BudgetYearThree": {
                "val": "31.968"
            },
            "BudgetYearFour": {
                "val": "32.611"
            },
            "BudgetYearFive": {
                "val": "33.264"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Sea mines remain a significant threat to ships. In fact, fifteen U.S. Navy ships have been sunk or damaged by mines since World War II, almost four times more than any other weapon. The Mine and Expeditionary Warfare Applied Research Program Element (PE) provides technologies for Naval Mine Countermeasures (MCM), Expeditionary Warfare, U.S. Naval sea mining, Naval Special Warfare (NSW), and Joint Tri-Service Explosive Ordnance Disposal (EOD) as well as continuing support to research vessels of the U.S. Academic Research Fleet for operations and maintenance that enable applied research at sea. This program strongly aligns with the Joint Chiefs of Staff Joint Warfighting Capability Objectives through the development of technologies to achieve military objectives with minimal casualties and collateral damage. This investment will enable Ship-to-Objective Maneuver (STOM) and focus on technologies that will provide the Naval Force with the capability to dominate the battlespace, project power from the sea, and support forces ashore with particular emphasis on rapid MCM operations. These efforts concentrate on the development and transition of technologies for the MCM-related and Urban Asymmetric\/Expeditionary Warfare Operations (UAEO)-related Future Naval Capabilities (FNC) Enabling Capabilities (ECs). \n\nThe Mine and Obstacle Detection and Neutralization efforts include technologies for clandestine and overt minefield reconnaissance, organic ship self-protection, organic mine hunting and neutralization\/breaching. The Urban Asymmetric Operation effort includes critical warfighting functions such as Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR), fires, maneuver, sustainment, etc. The Naval Special Warfare and Explosive Ordnance Disposal technology efforts concentrate on the development of technologies for safe near-shore mine detection, diver mobility and survivability, and ordnance disposal operations. The activities described in this PE address future Navy and Marine Corps capabilities needed to maintain maritime superiority and ensure national security. They are based on input from Naval Research Enterprise stakeholders including the Naval enterprises, the combatant commands, Office of the Chief of Naval Operations (OPNAV) and Headquarters Marine Corps and are designed to exploit breakthroughs in science and technology in order to deliver maximum warfighting benefit to our sailors and Marines. These efforts align with shared priorities throughout the whole of RDT&E in order to quickly advance new capabilities from discovery to deployment across the warfighting domains. \n\nToday's Sailors and Marines are enabled by naval Science and Technology (S&T). Since 1946, the Office of Naval Research (ONR) has fostered scientific research related to the maintenance of maritime superiority and national defense.  ONR manages the Department of the Navy's (DON) portfolio of naval Basic and Applied research, and Advanced Technology Development investments to ensure naval forces can effectively deter conflict, but when called upon, fight, win and come home safe. Current investments hedge against uncertainty, providing solutions to commanders today, and options for the future. The Naval S&T budget supports higher guidance defined by the National Defense Strategy, and responds to requirements identified by the Secretary of the Navy through research priorities set by the Chief of Naval Research, coordinated across the Naval Research Enterprise (NRE), and outlined in the Naval R&D Framework. \n\nThis Program Element (PE) funds Applied Research, which is the systematic study to understand the means to meet a recognized and specific need. Most of the work in this PE can be classified between Technology Readiness Level (TRL) 2 (technology concept and\/or application formulation) and TRL 4 (component and\/or breadboard validation in laboratory environments).\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "38.214"
                },
                "CurrentYear": {
                    "val": "36.074"
                },
                "BudgetYearOne": {
                    "val": "30.298"
                },
                "BudgetYearOneBase": {
                    "val": "30.298"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "37.399"
                },
                "CurrentYear": {
                    "val": "54.074"
                },
                "BudgetYearOne": {
                    "val": "30.715"
                },
                "BudgetYearOneBase": {
                    "val": "30.715"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.815"
                },
                "CurrentYear": {
                    "val": "18.000"
                },
                "BudgetYearOne": {
                    "val": "0.417"
                },
                "BudgetYearOneBase": {
                    "val": "0.417"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "18.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.815"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.417"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.417"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable.\n\nFunding: FY21 Program increase supports increased investment in Mine\/Obstacle Detection."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Mine and Expeditionary Warfare Applied Research"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "35.468"
                        },
                        "CurrentYear": {
                            "val": "36.074"
                        },
                        "BudgetYearOne": {
                            "val": "30.715"
                        },
                        "BudgetYearOneBase": {
                            "val": "30.715"
                        },
                        "BudgetYearTwo": {
                            "val": "31.326"
                        },
                        "BudgetYearThree": {
                            "val": "31.968"
                        },
                        "BudgetYearFour": {
                            "val": "32.611"
                        },
                        "BudgetYearFive": {
                            "val": "33.264"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project focuses on reducing the time involved in conducting Mine Countermeasure (MCM) operations and increasing safe standoff from minefields. It develops and transitions technologies for MCM-related and UAEO-related Future Naval Capabilities (FNC). The MCM effort includes technologies for clandestine and overt minefield reconnaissance, organic ship self-protection, organic mine-hunting, neutralization\/breaching and clearance. The Littoral Warfare effort includes critical warfighting functions such as C4ISR, fires, maneuver, sustainment. The sea mining effort emphasizes technologies for future sea mines. The Naval Special Warfare and Explosive Ordnance technology efforts concentrate on the development of technologies to enhance diver capabilities including: safe near-shore mine sensing, mobility and survivability, and ordnance disposal operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mine Technology"
                                    },
                                    "Description": {
                                        "val": "This activity primary focuses on developing and demonstrating technologies to support on-demand battlespace shaping through advanced undersea weapons and next generation mining concepts. Efforts include Command & Control to support remote control, advanced sensing technologies, compatibility with options for unmanned delivery, detection & classification, and targeting solutions. Modular Undersea Effectors (MUSE) research supports Fleet demand for capability and prototype development for next generation naval mining concepts.  MUSE also develops and investigates flexible, scalable, and asymmetric technologies to deliver next generation naval mining effects for legacy programs of record. This program provides critical Science and Technology (S&T) for development and capability in new acquisition programs of record."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.962"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.635"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct advanced technology development in advanced mining technologies for clandestine, flexible, and scalable minefield deployment, longevity, and endurance, to include remote control, advanced sensing for detection and classification, command & control (C2), and more discriminative targeting solutions.  Efforts in this thrust include prototyping and demonstration of advanced sensors and sensor configuration technologies for improved discrimination as well as communications, command, and control technologies. Continue prototyping and demonstration for next-generation target detection devices and mine effects.\n\nJoint Service Explosive Ordnance Disposal (EOD):\nConduct applied technology development and demonstration in electro-optic & acoustic technologies for buried mine detection, robotic manipulation for ordnance exploitation & neutralization, standoff detection and classification for ordnance, and identification of explosives. Efforts in this thrust include prototype and demonstration of laser interferometric sensor\/systems for detection of buried objects, highly dexterous dual manipulator systems (manipulators, controllers) for EOD robots for precision render safe and neutralization missions, technologies for low-observable underwater ordnance neutralization and technologies for the inspection of underwater explosive threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.116"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.116"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Target Detection Devices (Mine & Expeditionary Warfare): Further efforts in developments in advanced sensors and algorithmic capabilities that are applicable toward existing target detection devices (TDDs), development of concepts for remote controlled mines, and assessment of sea mine technologies in order to maintain a level of expertise in naval mines.  Specific effort will include advanced sensing modalities for improved discrimination.  The objective is to achieve a miniaturized, highly capable TDD to advance legacy mine capacity.  \n\n- Minefield Concepts (Mine & Expeditionary Warfare): Conclude applied research, algorithm development, early prototypes, and experimentation on intermediate and deep-water minefield concepts.\n\n- Naval Mine Subcomponents (Mine & Expeditionary Warfare): Initiate efforts in alternative packaging and miniaturization of naval mine subcomponents.  Specific effort will include advanced sensing, remote control and communications, and advanced energetics.  The objective is to achieve alternative capability to incrementally advance legacy mine capacity, and find new capability within legacy delivery mechanisms."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2020 to FY 2021 is due to the reduced investment and conclusion of applied research in intermediate and deep-water minefield concepts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mine\/Obstacle Detection"
                                    },
                                    "Description": {
                                        "val": "This activity focuses on applied research to enable longer detection ranges and precise detection and mine location with fewer false alarms in a variety of challenging environments. It supports Mine Countermeasures (MCM) related Future Naval Capabilities (FNCs). Efforts include novel sonar technologies for longer range detection and classification of mine-like targets, magnetic gradiometer sensing, electro-optic (EO) technology for buried mine identification, and sensor integration onto Unmanned Underwater Vehicles (UUVs). EO sensor research develops algorithms to enable image processing for rapid overt reconnaissance from an Unmanned Aerial Systems (UAS). Efforts include the development of processing, classification and data fusion techniques to reduce operator workload, and an expert system used to predict mine burial. Efforts also support development of MCM Mission Modules for Littoral Combat Ships. \n\nThe program is strongly aligned with the Oceanographer of the Navy (N2\/N6E) and the research topics addressed by this activity reflect the priorities for improved forecasts of the operational environment and the development and use of autonomous systems for the collection of environmental observations and continuing support to research vessels of the U.S. Academic Research Fleet for operations and maintenance that enable science at sea. Field research within this activity that uses active acoustic transmissions requires modeling of the acoustic effects of sound on marine life in order to meet Navy environmental requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.233"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.329"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct applied research in novel mine hunting technologies to enable unmanned systems to operate flexibly across a wide range of dynamic and unstructured environments and operations. \n\nResearch thrusts include the development of new algorithms, innovative processing schemes, prototype hardware, studies of acoustic communications between unmanned Mine Countermeasure (MCM) systems in dynamic environments; new transducer designs and sensors for miniaturizing MCM capabilities onto smaller unmanned systems and operating with increased autonomy; novel algorithmic approaches and hardware designs that consolidate and optimize sensing, navigation, and communications for smaller autonomous mine hunting and neutralization systems. Conduct investigations of joint sensing and communication approaches for multi-vehicle mine hunting; and, performance estimation for automatic target recognition on non-imaging systems. \n\nLaboratory, field, and theoretical\/numerical studies will provide new solutions to enable more rapid and effective mine detection and classification. Emphasis will be placed on reducing timelines, or even eliminating post-mission analysis through enhanced scene understanding derived from acoustic and\/or other sensing modalities. \n\nSpecific research activities include; the development of Unmanned Underwater Vehicle (UUV's) autonomy to exploit the ambient environmental conditions to optimize performance; extend the reach of MCM UUVs to operate at deeper depths; characterization of the flow generated by various propulsion approaches; measurements and modeling of the physics associated with the acoustic interactions with targets and the environment, which can be exploited for detection and classification; investigations that lead to new parameterizations of the ocean seabed applicable to modern mine hunting systems; investigations that link observable impacts on acoustic scattering and\/or propagation with the underlying phenomenology that affects the environment, including oceanographic and biologic processes; investigations aimed at linking target scattering physics modalities to specific properties in the feature space domain used for Automatic Target Recognition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.834"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.834"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Autonomous Vehicles (Mine & Expeditionary Warfare): Conduct efforts to develop approaches for coupling between autonomous vehicles and their sensor payloads. Continue efforts to characterize flow generated by biomimetic propulsion approaches. - Mine & Expeditionary Warfare (Target Recognition and Signal Processing): Conclude efforts in non-environmentally adaptive automatic target recognition and associated signal processing approaches.\n\n-Mine Countermeasures (MCM) Data (Mine & Expeditionary Warfare): Initiate efforts to aggregate, curate and interrogate real and simulated data sets for in-situ algorithm adaptation, optimization, and performance assessment. The objective is to enable unmanned systems to operate flexibly across a wide range of dynamic and unstructured environments. \n\n- MCM Sensor (Mine & Expeditionary Warfare): Initiate development of next-generation small, highly capable MCM sensors. Specific efforts include sensors, electronics, and computing technology. The objective is to increase deployment options for unmanned systems. \n\n- Threat Detection\/Robotic Techniques (Mine & Expeditionary Warfare: Initiate development of robotic technologies to respond to detected threats. Specific effort will include dexterity, haptics and algorithms to achieve human-like behaviors. The objective is to sense and interact with the environment and threats."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2020 to FY 2021 is due to initiation and further development of Mine Countermeasures(MCM) sensors, threat detection\/robotic techniques and to develop approaches for coupling between autonomous vehicles and their sensor payloads."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mine\/Obstacle Neutralization"
                                    },
                                    "Description": {
                                        "val": "This activity includes applied research to support selected Mine Countermeasures-related Future Naval Capabilities (FNC) for the rapid neutralization of mines and obstacles, and sea mine jamming techniques to increase surface ship safe standoff from threat mines. It includes computational tools and models to assess mine and obstacle vulnerability and lethality of novel approaches for neutralization to support various far-term Surf Zone and Beach Zone mine and obstacle breaching system concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.435"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.435"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct applied research to support rapid mine and obstacle neutralization and mine sweeping techniques to enable maneuver of joint forces and increase the safe standoff of various tactical platforms and surface ships from the threat of mines.  Research thrusts include development of lethality, vulnerability models, technology concept assessments, and algorithmic approaches to support neutralization of mines and obstacles in all water depths and on the beach, which includes Surf Zone and Beach Zone mine and obstacle breaching concepts; novel approaches for neutralization of buried mines; advanced techniques for emulation sweep; and methods to enable precision neutralization of buried mines. Conclude assessment of preliminary methods for emulation sweep.  Conclude investigation of coupling of reacquire and identify capabilities with precision neutralization of buried mines."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.435"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.435"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Rapid Neutralization of Mines and Obstacles: Maintain effort in rapid neutralization of mines and obstacles including development of lethality and vulnerability models, technology concept assessments, and approaches for neutralization of mines and obstacles in all water depths, the surf zone, beach and inland. The objective is to enable maneuver of joint forces from ship to inland objective. \n\n- Advanced Minesweeping: Conduct effort in advanced minesweeping including development of compact, efficient approaches for sweeping advanced influence mines. The objective is to increase the safe standoff of various tactical platforms and surface ships. \n\n- Mine-setting Mode Techniques: Conclude applied research on mine-setting-mode techniques for emulation minesweeping\n\n- Robotics: Initiate development of robotic technologies to respond to detected targets including work on dexterity, haptics and algorithms to achieve human-like behaviors. The objective is to interact with the mine and\/or obstacle to achieve neutralization, clearance, render-safe or removal for exploitation."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Special Warfare\/EOD"
                                    },
                                    "Description": {
                                        "val": "The goal of this effort is to develop technologies to extend stand-off of special operations and Explosive Ordnance Disposal (EOD) forces in clandestine hydrography, mine clearance and port security missions while increasing the range and effectiveness of divers. Advanced technologies are needed to gain access to areas contaminated by area-denial sensors and\/or booby traps. Developed technologies will transition to the Joint Service EOD Program, the Naval EOD Program, or the DOD Technical Response Group. This activity includes applied research in sensor technology for Naval Special Warfare (NSW) and EOD autonomous and handheld sonar systems to increase detection range and accuracy in harsh environments. Other efforts include such mission support technology improvements as communications, navigation and life support for UUVs and human divers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.838"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.675"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct applied research in sensor, render-safe and neutralization technologies for NSW and EOD autonomous and handheld systems, mission support technology enhancements for manned and unmanned platforms (air, surface or undersea) and new concepts to increase the efficiency and mobility of unmanned platforms and divers (e.g., communications, propulsion, navigation, and life support), and threat identification, exploitation, and remediation technologies.  Efforts include development of technologies which will: excavate buried Improvised Explosive Device; use advanced robotic manipulators for complex underwater EOD missions; support Joint Service Explosive Ordnance Disposal (JSEOD) applied research; detect trace and bulk explosive materials at extended standoff distances; detect buried improvised explosive devices, explosive threats and mines using handheld or unmanned platforms;  inspect explosive threats from safe standoff, enhance diver situational awareness and autonomous inspection of structures; conduct vessel interdiction; allow tagging, tracking and locating of targets; conduct characterization, inspection, surveillance and reconnaissance of denied and under canopy areas.  Conclude assessment of excavation techniques."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.330"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.330"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Advanced Robotic Techniques: Maintain efforts in advanced robotic technologies including development of human-like manipulators and haptics. \n\n- Platforms: Further development of air, surface and subsurface platforms to conduct operations in the littorals to improve diver mobility and safety, address drag reduction, diver propulsion, communications, navigation, thermal envelope, life support and contamination protection. \n\n- Ordinance Detection: Conclude efforts for sensors to detect buried improvised explosive devices. Specific effort includes technologies for compact, held-hand radar concepts. The objective is to improve the performance of hand-held radar technology to achieve a low false alarm rate.\n\n- Sensor Techniques: Initiate effort to develop compact sensor technologies to diagnose explosive threats and unexploded ordnance including the development of hand-held or robot deployable sensor technologies. The objective is to determine the status of explosive threats and unexploded ordnance. \n\n- Neutralization Explosive Threats: Initiate effort to develop technologies to enable render-safe or neutralization of explosive threats and unexploded ordnance. - Unmanned Systems Situational Awareness: Initiate onboard processing in unmanned systems to enable environmental situational awareness (SA) in the littorals."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.931"
                        },
                        "CurrentYear": {
                            "val": "18.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "19.931"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Unmanned Aerial and Deep Submersible Platforms"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "1.931"
                                        },
                                        "Text": {
                                            "val": "Funds will be used to further development of autonomous aerial and submersible platforms in cluttered environments."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Underwater mine defeat capabilities urgent operational need"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research in Underwater mine defeat capabilities urgent operational need."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Clandestine mine neutralization"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research in Clandestine mine neutralization."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}