{
    "id": "2021-AirForce-PB-3600-JBOOK-52117659cde5b66f9481fd2e0957295e8c3577bb57ee19c9d86f2af599cd13cd-24",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-AIRFORCE_V3A-U_RDTE_JustificationBook_Air_Force_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0207133F"
        },
        "ProgramElementTitle": {
            "val": "F-16 Squadrons"
        },
        "R1LineNumber": {
            "val": "187"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "182.190"
            },
            "CurrentYear": {
                "val": "193.013"
            },
            "BudgetYearOne": {
                "val": "223.437"
            },
            "BudgetYearOneBase": {
                "val": "223.437"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "229.066"
            },
            "BudgetYearThree": {
                "val": "157.064"
            },
            "BudgetYearFour": {
                "val": "128.717"
            },
            "BudgetYearFive": {
                "val": "127.869"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "185.864"
                },
                "CurrentYear": {
                    "val": "193.013"
                },
                "BudgetYearOne": {
                    "val": "186.850"
                },
                "BudgetYearOneBase": {
                    "val": "186.850"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "182.190"
                },
                "CurrentYear": {
                    "val": "193.013"
                },
                "BudgetYearOne": {
                    "val": "223.437"
                },
                "BudgetYearOneBase": {
                    "val": "223.437"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.674"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "36.587"
                },
                "BudgetYearOneBase": {
                    "val": "36.587"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.674"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "36.587"
                                },
                                "BudgetYearOneBase": {
                                    "val": "36.587"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY19: $3.674M  net decrease, SBIR reduction. \nFY21: $36.587M net increase, including +$70.376M DRWR, +$0.171M Comm Suite, -$9.844M Simulator Training Program Re-Phase, -$2.247M Flight Test, -$17.445M AESA Radar, -$4.263M MMC\/PDG, and -$0.161M OFP."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "672671"
                    },
                    "ProjectTitle": {
                        "val": "F-16 Squadrons"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "182.190"
                        },
                        "CurrentYear": {
                            "val": "193.013"
                        },
                        "BudgetYearOne": {
                            "val": "223.437"
                        },
                        "BudgetYearOneBase": {
                            "val": "223.437"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "229.066"
                        },
                        "BudgetYearThree": {
                            "val": "157.064"
                        },
                        "BudgetYearFour": {
                            "val": "128.717"
                        },
                        "BudgetYearFive": {
                            "val": "127.869"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The F-16 Fighting Falcon is the world's premier fixed-wing, high performance, single engine multi-mission fighter aircraft that comprises 48% of the AF fighter inventory.  Operational since 1980, the F-16 has proven itself in combat in a variety of air-to-air and air-to-surface missions, such as, offensive and defensive counter-air, close air support, forward air control, air interdiction (day\/night and all-weather) and Suppression of Enemy Air Defenses (SEAD)\/destruction of enemy air defenses (DEAD).  The F-16 remains the USAF's primary SEAD\/DEAD platform.  The aircraft has evolved its capabilities by capitalizing upon advancements made in computers, avionics systems, engines, and structures technologies to meet emerging warfighter requirements and combat current and evolving enemy threats. These computer processing and avionics upgrades are critical to building a modernized architecture that promotes current open, agile, and digital concepts to enable future technological growth of the F-16's capabilities well into the 2040s and beyond. Furthermore, the F-16 provides the capacity called for in the NDS by supplying the USAF the highest readiness rates at the lowest operating costs of any US fighter.  The F-16 programs listed below also support the NDS's call to strengthen alliances by being the DoD's largest Foreign Military Sales (FMS) program servicing over 26 countries and growing.  The funding described in this document directly maps to the NDS as it provides upgrades to the F-16 platform enabling the delivery of joint lethality in contested environments in the coming decades.  The specific modification programs listed below directly contribute to accomplishing the mission objectives as described in the NDS.\n\nModification programs include: Operational Flight Program (OFP) development required to integrate new precision weapons, advanced targeting pods, improved avionics, hardware (HW) and software (SW) mods to meet Home Land Defense (HLD) Mission, DoD mandates, and maintain updates on the respective F-16 training simulators, and other hardware subsystems; EMD Hardware\/Advanced capability improvements require funding to develop, test, and qualify, weapon systems, aircraft subsystems replaced or modified due to requirements changes, pre-planned product improvements (P3I), Diminishing Manufacturing Sources (DMS) and parts obsolescence; Modular Mission Computer (MMC) Upgrade\/Display Generator Upgrade resolves shortfalls in mission computer memory and throughput brought on by the addition of incremental combat capability addresses cyber-security and includes Non-Recurring Engineering (NRE), design, development, integration, and ground\/flight test for fielding; F-16 Training Simulator updates enable the USAF to exercise\/train using the most current F-16 OFP available to all block configurations, to include both aircrew and maintenance trainers; Joint Air-to-Surface Standoff Missile-Extended Range (JASSM-ER) on F-16 aircraft, and includes NRE, test assets, SEEK EAGLE, integration, and flight test; Comm Suite Radio Upgrade (CSU) improved satellite communication (SATCOM) radio upgrade with Mobile User Objective System (MUOS) capability to meet next-gen tactical narrow band SATCOM with better crypto capabilities; an Active Electronically Scanned Array (AESA) Radar capable on all blocks that offers enhanced lethality, advanced electronic protection capabilities, as well as, improved reliability and maintainability on F-16 aircraft; Multi-functional Information Distribution System-Joint Tactical Radio System (MIDS-JTRS) provides a real-time, jam resistant and secure information system for the transfer of combat data, voice and navigation information between widely dispersed battle elements; Hybrid Flight Control Computer (HFLCC) Auto Ground Collision Avoidance System (AGCAS) development and integration prevents most controlled flight into terrain (CFIT) accidents using terrain database and prediction algorithms for aircraft trajectory recovery and executes an automated fly-up maneuver to avoid collision; Advanced Identification Friend or FOE (AIFF-Mode5) on F-16 aircraft provides improved airspeed and location info to ground stations and other equipped aircraft in vicinity; Digital Radar Warning Receiver (DRWR) improves existing radar warning receiver performance and Electronic Warfare (EW) threat detection range, azimuth, detection time, and allows reduction of radio frequency compatibility (RFC) issues with other on board transmitters.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver F-16 weapon system capability. The use of such program funds would be in addition to the civilian pay expenses budgeted in program element 0605831F \n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2019 Air Force penalty total is $50.0M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "OFP Updates on all F-16 aircraft"
                                    },
                                    "Description": {
                                        "val": "OFP tapes are updated continually to integrate new weapons, targeting pods, and improved avionics.  \n\nBoth M-Series and Software Capability Upgrade (SCU) programs enable the design and coding of software for integration efforts. OFPs are required to integrate new precision weapons, advanced targeting pods, improved avionics, and hardware and software modifications to meet DoD mandates and build a modern avionics architecture in order to keep the F-16 current. OFP enhancements enable the F-16's ability to operate in contested environments and defend the homeland, which directly maps to NDS requirements. The OFPs are developed organically by the 309th Software Engineering Group (SWEG) at Hill AFB, UT. Systems Integration Labs (SIL) are required to integrate software into the host hardware and validate user requirements and check out system safety and security prior to release to flight test.\n\nThe OFP effort also contains Program Management Administration (PMA) support activities to include travel, office supplies, training courses, Video Teleconferencing (VTC) and support contractors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "99.283"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "86.110"
                                            },
                                            "Text": {
                                                "val": "Per approved OFP Inc I ADM (29 Apr 19), OFPs will be released at a cadence not to exceed 30 months, providing greater flexibility to release on demand working with the customers. With this in place, the following is the projected release schedule for F-16 OFPs. Release M7.2+ to field in early CY2020. Begin M7.3\/M8.03 SIL & combined Developmental Flight and Operational Flight test. Continue M8.1 software development. Continue to update M-Series requirements for future OFPs through Warfighter Council. SCU10 will field late CY2020. M\/SCU are continuing to pursue Agile Software Development Transformation to improve software delivery to the warfighter."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "87.858"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "87.858"
                                            },
                                            "Text": {
                                                "val": "Field M7.3\/M8.0.3 and continue development of M8.1 and SCU 11."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase based on cost estimate\/inflation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Flight Test"
                                    },
                                    "Description": {
                                        "val": "Development Test and Evaluation (DT&E) at Edwards AFB and Development Test\/Operational Test (DT\/OT) at Eglin AFB, Edwards AFB, Nellis AFB, and Air National Guard Air Force Reserve Test Center (AATC), including integration tests of associated subsystems and weapons, as well as, maintain test schedule for F-16 MMC OFPs, weapons integration, Radio Frequency compatibility (RFC), and sub-systems to ensure capabilities meet CAF's fielding schedule."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.845"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.613"
                                            },
                                            "Text": {
                                                "val": "Increase support of DT&E infrastructure to account for growing test requirements from new modification programs.\nInitiate combined Developmental flight and Operational flight test with M7.3\/M8.03 OFP (M7.2+ baseline running on MMCU legacy cards with basic Ethernet load, MIDS-JTRS (if not fielded with M7.2+) and SCU OFP, Correlation (small fixes), and AESA.\nPhase 3 - Step 1, SATURN and RFC, and support out-of-cycle regression testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.675"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.675"
                                            },
                                            "Text": {
                                                "val": "Increase support of DT&E infrastructure to account for growing test requirements from new modification programs. \nInitiate combined Developmental flight and Operational flight test with M7.3\/M8.03 OFP (M7.2+ baseline running on MMCU legacy cards with basic Ethernet load, MIDS-JTRS (if not fielded with M7.2+) and SCU OFP, Correlation (small fixes), AESA.\nPhase 3 - Step 1, SATURN and RF Compatibility), and support out-of-cycle regression testing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to cost estimate\/inflation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EMD HW\/Advanced Capabilities Improvements"
                                    },
                                    "Description": {
                                        "val": "Advanced Capability Improvements includes, but not limited to sensor upgrades, Radar updates and other self- protection\/electronic protection (EP) enhancements, 4th\/5th gen fighter network communications, Radio Frequency (RF) compatibility, requirements analysis and studies analysis, lab and\/or on-aircraft evaluation of potential subsystem changes\/ capability improvements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.010"
                                            },
                                            "Text": {
                                                "val": "Continue support to develop, test, and qualify aircraft weapons systems including F-16 subsystems replaced or modified due to requirements changes, P3I, DMS and\/or parts obsolescence. Radio Frequency Compatibility (RFC) development efforts to minimize and understand the EMI on the F-16."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Continue support to develop, test, and qualify aircraft weapons systems including F-16 subsystems replaced or modified due to requirements changes, P3I, DMS and\/or parts obsolescence. Radio Frequency Compatibility (RFC) development efforts to minimize and understand the EMI on the F-16."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to re-phasing of requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MMC Upgrade \/ Display Generator Upgrade on F-16 aircraft"
                                    },
                                    "Description": {
                                        "val": "The MMC upgrade on the F-16 post-block aircraft, (Blk 40, 42, 50, 52) resolves shortfalls in mission computer memory and throughput. Funding includes NRE, design, development, integration, and ground\/flight test for fielding of improved MMC capabilities with the M8.0.3 OFP and fielding of PDG upgrade with the M8.1 OFP. The addition of an Ethernet High Speed Data Network (HSDN) facilitates future increments of combat capability with the OFP and system compatibility\/interoperability (e.g., digital targeting pod video).  \nThe Programmable Display Generator (PDG) upgrade allows a fully integrated multifunction display solution including Hands On Throttle and Stick (HOTAS) integration with Sensor of Interest (SOI), format swapping and high definition video on 4x4 displays; provides improved display formats during dynamic maneuvers; resolves symbol freezing issues due to throughput constraints; and provides a sustainable approach to address growing DMS concerns with the current Programmable Display Generator.\nBoth the MMC and PDG directly map to the NDS as critical enabling technologies required for the F-16 to operate in contested environments and defend the homeland.  Additionally, MMC upgrade, PDG upgrade, and High Speed Data Network make up critical elements to building a modern F-16 avionics architecture while promoting current technology concepts of open, agile, and digital."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.298"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.587"
                                            },
                                            "Text": {
                                                "val": "Continue NRE activities for HSDN, MMC Upgrade and PDG Upgrade for design, development, integration, deliver test assets for SIL and flight test for fielding with the M8.0.3 and 8.1 OFPs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.846"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.846"
                                            },
                                            "Text": {
                                                "val": "Continue NRE activities for HSDN, MMC Upgrade and PDG Upgrade for design, development, integration, deliver test assets for SIL and flight test for fielding with the M8.0.3 and 8.1 OFPs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease based on re-phase of requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Simulator Trainers Program"
                                    },
                                    "Description": {
                                        "val": "F-16 Simulator Training Programs (Simulators) supports the development, acquisition, fielding and integration of F-16 Simulators. Enables the USAF to exercise and train using the latest F-16 capabilities available to multiple aircraft configurations, while reducing the overall cost of maintenance and aircrew training. In order to maintain concurrency with the aircraft OFP, this funding support development, test and integration of simulator upgrades.  Funds may be used to address emerging and short notice Diminishing Manufacturing and Material Shortage (DMSMS) issues. DMS efforts to include removal of end-of-life software\/hardware within simulators systems and move to a modular, common open system architecture that is sustainable and cyber-resilient. Implement requirements and standards defined under the Simulator Common Architecture Requirements and Standards (SCARS) initiative. This program element may include necessary civilian pay expenses required to manage, execute, and deliver F-16 weapon system capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.323"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.894"
                                            },
                                            "Text": {
                                                "val": "Continue contract efforts for managing and maintaining F-16 simulator trainers, to include tech order development. This funding also supports development, test, and integration of simulator upgrades to include new aircraft OFPs. Begin supporting development efforts for the F-16 MTC trainer."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.469"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.469"
                                            },
                                            "Text": {
                                                "val": "Continue contract efforts for managing and maintaining F-16 simulator trainers, to include tech order development. This funding also supports development test, and integration of simulator upgrades to include new aircraft OFPs. Supporting development efforts for the F-16 STP trainers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease based on re-phase of requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AIFF Mode 5"
                                    },
                                    "Description": {
                                        "val": "Modify Pre-Block F-16's with Advanced Identification Friend or Foe (AIFF) to comply with DOD Mode 5 mandate. AIFF system provides positive identification for Air Traffic Control reporting, combat targeting, and fratricide prevention"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.250"
                                            },
                                            "Text": {
                                                "val": "Initiate development and testing efforts and contract award for hardware, software, and firmware updates to the Combined Interrogator Transponder (CIT) and GPS card on F-16 aircraft to resolve DMS issues."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease based on phasing of requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AESA Radar"
                                    },
                                    "Description": {
                                        "val": "This is a continuation of the Active Electronically Scanned Array (AESA) Radar congressional add funding line in FY16 and FY17. The AESA Program provides an upgrade from the current APG-68 system to an AESA radar that offers advanced electronic protection capabilities as well as improved reliability and maintainability to support the Aerospace Control Alert (ACA) mission for Homeland Defense (HLD) and includes the Phase III development for full capability development document (CDD) implementation, as well as Radio Frequency (RF) compatibility with other systems. This program directly maps to the NDS as it provides the most critical upgrade to the F-16's ability to successfully defend the homeland against attack."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.994"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "59.149"
                                            },
                                            "Text": {
                                                "val": "Continue Phase I & II JEON fielding; continue Phase III development efforts for full CDD radar capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "38.842"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "38.842"
                                            },
                                            "Text": {
                                                "val": "Conclude Phase I & II JEON fielding; continue Phase III development efforts for full CDD radar capabilities.  (Increase Statement): Increase based on warfighter addition of 150 radars to Phase III plan."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease based on phasing of Phase 3 full CDD development and test asset buy schedule"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Comm Suite Radio Upgrade Aircraft"
                                    },
                                    "Description": {
                                        "val": "Provides mandatory CJCS updates to the ARC-210 satellite communication (SATCOM) radios on F-16 aircraft including Second Generation Anti-Jam Tactical radio for NATO (SATURN) with Mobile User Objective System (MUOS) and improved crypto capability and the addition of a Cockpit Communication Control Panel (C3PO), and Digital Comm Matrix (DCM)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.899"
                                            },
                                            "Text": {
                                                "val": "Continue NRE efforts for integration and Group A development, procure Group B test assets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.171"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.171"
                                            },
                                            "Text": {
                                                "val": "Continue NRE efforts, procure Group B test assets."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decreased due to cost estimate\/program phasing and ramp down of development."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Digital Radar Warning Receiver"
                                    },
                                    "Description": {
                                        "val": "Digital Radar Warning Receiver improves on existing radar warning receiver performance and improves Electronic Warfare (EW) threat detection range. The DRWR program also facilitates Radio Frequency Compatibility (RFC) with associated systems. This program includes execution of a Section 804 Rapid Prototyping effort to evaluate next-gen electronic warfare options that meet the DRWR requirements as part of a DRWR performance risk mitigation effort. This program is necessary for the F-16 to meet the NDS requirement of operating in current and future contested environments. This digital radar warning receiver upgrade provides improved radio frequency threat situational awareness to aircrew, and increases the performance in dense signal areas of operation as seen within contested environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "32.719"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.001"
                                            },
                                            "Text": {
                                                "val": "Continue efforts for Digital Radar Warning Receiver, continue NRE efforts for Group A and Group B Hardware for all components of the DRWR which includes millimeter wave (mmW), continue DRWR Software and any associated OFP updates. Seek CDR approval. Prepare for Trial Vehicle Install (TVI) on Blk 50C. Initiate Force Development Evaluation (FDE) Flight testing. Build kits for TVI installs. Expand mission data file (MDF) lab and complete test bench. RFC will have prototype hardware, F-16 SIL testing with DRWR and AESA and Blk 42C aircraft TVI and flight testing.  Section 804 will have prototype hardware available to complete Integrated Defense Avionics Laboratory (IDAL) and Electronic Warfare Avionics Integrated Support Facility (EWAISF) demonstrations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "70.376"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "70.376"
                                            },
                                            "Text": {
                                                "val": "Continue NRE efforts to complete remaining Group A (Blk 40\/42C, All D models, Blk 25C & D) designs and finalize Group B Hardware (EMI CE-102 & DMS ECP). DRWR Software and associated OFPs to be released upon successful FDE. Blk 30\/32C and Blk 50\/52C Kit-proofs.  Receive Milestone C approval.  Section 804 will have prototype hardware available to complete a Chamber test."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to cost estimate\/rephase of program requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multifunctional Information Distribution System Joint Tactical Radio System (MIDS-JTRS)"
                                    },
                                    "Description": {
                                        "val": "Multifunctional Information Distribution System Joint Tactical Radio System (MIDS-JTRS) provides real time, jam-resistant and secure information system for the transfer of combat data, voice and navigation information between widely dispersed battle elements.  MIDS-JTRS enhances situational awareness by exchanging digital data over a common communication link that is continuously and automatically updated in real time. Additionally MIDS-JTRS's enhanced capabilities provide concurrent multi-netting which enables Link 16 by adding capability to receive four messages in a single time slot and allows for greater network design flexibility along with concurrent contention receive capabilities and J-voice. The F-16 MIDS-JTRS effort is developing Ethernet connectivity within the terminal. This program maps to the NDS by providing crypto modernization for tactical networks and more secure command and control, which enable increased interoperable\ncommunications across the joint force. This critical communications capability generates a more lethal force to defeat enemies and achieve sustainable outcomes that protect the American people and vital US interests."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.728"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decreased due to cost estimate\/program phasing and completion of development."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF 05 Line Item F01600"
                                    },
                                    "Title": {
                                        "val": "F-16 Aircraft Modifications"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "267.424"
                                        },
                                        "CurrentYear": {
                                            "val": "281.476"
                                        },
                                        "BudgetYearOne": {
                                            "val": "615.760"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "615.760"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "625.394"
                                        },
                                        "BudgetYearThree": {
                                            "val": "640.375"
                                        },
                                        "BudgetYearFour": {
                                            "val": "567.791"
                                        },
                                        "BudgetYearFive": {
                                            "val": "636.898"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 07 Line Item F0160P"
                                    },
                                    "Title": {
                                        "val": "F-16 Post Production Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.918"
                                        },
                                        "CurrentYear": {
                                            "val": "11.402"
                                        },
                                        "BudgetYearOne": {
                                            "val": "14.163"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "14.163"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.664"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.128"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.611"
                                        },
                                        "BudgetYearFive": {
                                            "val": "10.285"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 06 Line Item F01600"
                                    },
                                    "Title": {
                                        "val": "F-16 Initial Spares"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "11.223"
                                        },
                                        "CurrentYear": {
                                            "val": "30.463"
                                        },
                                        "BudgetYearOne": {
                                            "val": "27.930"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "27.930"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "41.796"
                                        },
                                        "BudgetYearThree": {
                                            "val": "17.534"
                                        },
                                        "BudgetYearFour": {
                                            "val": "21.076"
                                        },
                                        "BudgetYearFive": {
                                            "val": "21.648"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The F-16 Program acquisition strategy is to improve capability, maintenance and safety mods through OFP development\/flight test, enhanced weapons integration, structural upgrades, and simulator concurrency.\n\nF-16 OFP SW updates will continually bring new capabilities to the warfighter. OFP SW development effort is now completely developed at Hill AFB (309 SWEG). Numerous Integration contracts (CPFF, FFP) are required to allow for Improved Avionics, Weapon, AIFF Mode 5, MIDS-JTRS integration to successfully field with each OFP.\n\nMMC Upgrade awarded to Raytheon on 22 Nov 2016. PDG Upgrade awarded to General Dynamics Mission Systems on 17 Apr 2017. The EMD HW\/Advanced capability improvements will develop, test, and qualify aircraft weapons systems, including subsystems and uses various contract types (Cost Plus and Fixed Price).\n\nThe Active Electronically Scanned Array (AESA) Joint Emergent Operational Need (JEON) contract for development and production of the APG-83 radar awarded to Northrop Grumman on 31 May 2017. The US Government is the prime integrator and a separate contract is established for Lockheed Martin to provide integration support.\n\nAIFF Mode 5 program uses numerous contracts for DMS resolution, integration, production, support and installs. Funding will be awarded on the following contracts: Harness IDIQ, Bracket IDIQ, Falcon 2020, Mode 5 IDIQ, and SASSM\/EGI IDIQ.\n\nAutomatic Ground Collision Avoidance System (AGCAS) development will accomplish test and evaluation of the AGCAS system on F-16 Block 25\/30\/32 aircraft. Contracts with LM, flight test, and engineering contractor were awarded in 2018.\n\nDRWR is organically being integrated on the F-16 by F-16 System Program Office (AFLCMC\/WWM) and the Electronic Warfare and Avionics (EW&A) System Program Office (AFLCMC\/ WNY) at Robins AFB, GA. The ALR-69A production contract (managed by AFLCMC\/WNY) was awarded on 30 March 2018 to Raytheon, Goleta, CA (CAGE CD 06129).\n\n\nThe ALR-69A software is organically managed by AFLCMC\/WNY utilizing the 579 SWES (Software Maintenance) team and the OEM Raytheon, Goleta, CA. The ALR-69A hardware is sustained by the 408 SCMS (Supply Chain) and 402 AMXG (Hardware Maintenance) at Robins AFB, GA.\n\nFlight Test requires both organic test range support and various contract support for integration test of F-16 subsystems to ensure capabilities meet CAF fielding schedule, which includes Radio Frequency Compatibility (RFC)."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "OFP Updates on F-16 aircraft"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "309th SMG"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hill AFB, UT"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "86.221"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "73.369"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "74.484"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "74.484"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "MMC Upgrade \/ Display Generator Upgrade"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "14.298"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.837"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.846"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.846"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "EMD HW \/ Advanced Capabilities"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-08"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-08"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Simulator Trainers"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "13.323"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "14.594"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.469"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.469"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "AESA Radars"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.994"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "65.149"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "38.842"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "38.842"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Digital Radar Warning Receiver"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "32.719"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.001"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "70.376"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "70.376"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Comm Suite Radio Upgrade"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.099"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.171"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.171"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "MIDS JTRS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.728"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Flight Tests"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "16.845"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "17.613"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "15.675"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "15.675"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Management Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Mgmt Administrative (PMA) Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "13.062"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "13.151"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "13.374"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "13.374"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "F-16 Development Efforts"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "MMC Upgrade Trial Vehicle Install C Model"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "M7.2 OFP Field"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Communication Suite Upgrade Pre-block Fielding"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2025"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "AESA JEON Initial Fielding"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Digital Radar Warning Receiver Flt Test Complete"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SCU 11 OFP Fielding"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Digital Radar Warning Receiver Fielding Recommendation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "M7.3\/8.03 OFP Fielding"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "M8.1 OFP Fielding"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}