{
    "id": "2021-Navy-PB-1319-JBOOK-29075b3c2af92ab5fcca1096cf65ecac9cc771240d227e79d45bc59626cdea42-4",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602123N"
        },
        "ProgramElementTitle": {
            "val": "Force Protection Applied Res"
        },
        "R1LineNumber": {
            "val": "5"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "175.857"
            },
            "CurrentYear": {
                "val": "215.517"
            },
            "BudgetYearOne": {
                "val": "122.281"
            },
            "BudgetYearOneBase": {
                "val": "122.281"
            },
            "BudgetYearTwo": {
                "val": "124.750"
            },
            "BudgetYearThree": {
                "val": "127.298"
            },
            "BudgetYearFour": {
                "val": "129.854"
            },
            "BudgetYearFive": {
                "val": "132.450"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "America is a maritime nation with global responsibilities that require U.S. naval forces be respected around the world and decisive when it matters. The Office of Naval Research (ONR) was established to guide ongoing research to ensure the technical superiority of the U.S. Navy and Marine Corps. This Program Element (PE) addresses applied research associated with providing the capability of Platform and Force Protection for the U.S. Navy. This program supports the development of technologies associated with all naval platforms (surface, subsurface, terrestrial, and air) and the protection of those platforms. The goal is to provide the ability to deter, or avoid engagements, and if necessary, fight and win against adversary naval platforms or weapons. In the event of conflict, naval platforms must be able to resist and control damage while preserving operational capability. Research is focused on providing technologically superior defense of naval assets and delivering warfighting capabilities at reduced total ownership costs for surface and subsurface platforms through investments in applied research in: a) Power, Energy & Propulsion and b) Platform Design and Engineering. This program develops technologies for reduced observables technology and enhanced capability of naval aviation aircraft platforms in terms of mission effectiveness, platform range, responsiveness, survivability, observability, readiness, safety and life cycle cost. The program addresses technology development to provide substantial improvements in energetic material systems and subsystems, primarily in terms of performance, but also addressing safety, reliability, and affordability concerns. The program supports mission-driven problem solving within the Naval Research and Development Establishment (NR&DE) through agile and rapid prototyping processes, while also promoting implementation of a common, effective innovation process and language.\n\nToday's Sailors and Marines are enabled by naval Science and Technology (S&T). Since 1946, the Office of Naval Research (ONR) has fostered scientific research related to the maintenance of maritime superiority and national defense.  ONR manages the Department of the Navy's (DON) portfolio of naval Basic and Applied research, and Advanced Technology Development investments to ensure naval forces can effectively deter conflict, but when called upon, fight, win and come home safe. Current investments hedge against uncertainty, providing solutions to commanders today, and options for the future. The Naval S&T budget supports higher guidance defined by the National Defense Strategy, and responds to requirements identified by the Secretary of the Navy through research priorities set by the Chief of Naval Research, coordinated across the Naval Research Enterprise (NRE), and outlined in the Naval R&D Framework. \n\nThis Program Element (PE) funds Applied Research, which is the systematic study to understand the means to meet a recognized and specific need. Most of the work in this PE can be classified between Technology Readiness Level (TRL) 2 (technology concept and\/or application formulation) and TRL 4 (component and\/or breadboard validation in laboratory environments). \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "180.549"
                },
                "CurrentYear": {
                    "val": "119.517"
                },
                "BudgetYearOne": {
                    "val": "119.535"
                },
                "BudgetYearOneBase": {
                    "val": "119.535"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "175.857"
                },
                "CurrentYear": {
                    "val": "215.517"
                },
                "BudgetYearOne": {
                    "val": "122.281"
                },
                "BudgetYearOneBase": {
                    "val": "122.281"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.692"
                },
                "CurrentYear": {
                    "val": "96.000"
                },
                "BudgetYearOne": {
                    "val": "2.746"
                },
                "BudgetYearOneBase": {
                    "val": "2.746"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "96.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-4.692"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "2.746"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.746"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: The program increase is due to increased programmed investment in 3D airborne imaging and unmanned undersea technologies.\n\nTechnical: no significant change\n\nSchedule: no significant change"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Force Protection Applied Res"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "121.314"
                        },
                        "CurrentYear": {
                            "val": "119.517"
                        },
                        "BudgetYearOne": {
                            "val": "122.281"
                        },
                        "BudgetYearOneBase": {
                            "val": "122.281"
                        },
                        "BudgetYearTwo": {
                            "val": "124.750"
                        },
                        "BudgetYearThree": {
                            "val": "127.298"
                        },
                        "BudgetYearFour": {
                            "val": "129.854"
                        },
                        "BudgetYearFive": {
                            "val": "132.450"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "America is a maritime nation with global responsibilities that require U.S. naval forces be respected around the world and decisive when it matters. The Office of Naval Research (ONR) was established to guide ongoing research to ensure the technical superiority of the U.S. Navy and Marine Corps. This project addresses applied research associated with providing the capability of Platform and Force Protection for the U.S. Navy. It supports the development of technologies associated with all naval platforms (surface, subsurface, terrestrial, and air) and the protection of those platforms. The goal is to provide the ability to deter, or avoid engagements, and if necessary, fight and win against adversary naval platforms or weapons. In the event of conflict, naval platforms must be able to resist and control damage while preserving operational capability. Research is focused on providing technologically superior defense of naval assets and delivering warfighting capabilities at reduced total ownership costs for surface and subsurface platforms through investments in applied research in: a) Power, Energy & Propulsion and b) Platform Design and Engineering, This program develops technologies for reduced observables technology and enhanced capability of naval aviation aircraft platforms in terms of mission effectiveness, platform range, responsiveness, survivability, observability, readiness, safety and life cycle cost. The program addresses technology development to provide substantial improvements in energetic material systems and subsystems, primarily in terms of performance, but also addressing safety, reliability, and affordability concerns."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aircraft Technology"
                                    },
                                    "Description": {
                                        "val": "The Aircraft Technology activity develops technologies for reduced observables technology and enhanced capability of naval aviation aircraft platforms in terms of mission effectiveness, platform range, responsiveness, survivability, observability, readiness, safety and life cycle cost. It also develops new Naval air vehicle concepts and high impact, saleable naval air vehicle technologies, such as - autonomous air vehicle command and control, helicopter and tilt rotor systems, aerodynamics, propulsion systems, materials, structures and flight controls for future and legacy air vehicles.\n\nVariable Cycle Advanced Technology (VCAT) Program will identify and mature critical, relevant propulsion system technologies that enable the Next Generation Air Dominance (NGAD) carrier-based aircraft. The Sea-Based Aviation National Naval Responsibility (SBA NNR) Structures and Materials program will develop the next generation structural capability and material response science for aircraft technology in fixed and rotary wing, manned and unmanned airframe technology to achieve reduced weight, increased durability, strength, streamlined manufacturability, reduced life-cycle cost and maintenance\/readiness gaps improvements. Program payoffs include increased availability\/readiness, reduced sustainment requirements, fatigue\/loads life enhancement, reduced weight and improved range, and advanced prognostics design tools.\n\nThese efforts address unique attributes to propulsion and power technologies for Naval Aviation, as well as those having higher importance to Naval Aviation and some that are more pervasive to all of military aviation. Related basic research efforts are addressed under 0601153N Defense Research Sciences."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "35.419"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "35.882"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct ongoing research related to Sea Based Aviation National Naval Responsibility (SBA NNR) priorities in Aviation, Propulsion, and Structures and Materials.  Ongoing research in Aircraft Technology, examples of research\/efforts include Virtual Ship\/Aircraft Dynamic Interface, Manned\/Unmanned Handling Qualities and Control, Automated Deck Operations, High Lift Aerodynamics and Vertical\/Short Take-off and Landing (V\/STOL) Operations, the development of rotorcraft\/Vertical Take-Off and Landing (VTOL) systems automated launch and recovery technology and mechanical\/ environmental failure prediction research.  Examples of ongoing research in Propulsion include the Variable Cycle Advanced Technology (VCAT) Program. Major engine manufacturers and system contractors will develop\/mature the highest priority, long-lead propulsion system technologies, including variable\/adaptive cycle engine components, for next generation carrier-based Tactical Aircraft (TACAIR) systems. \n\nOngoing research in Structures and Materials include: advanced composite durability technology; new materials development; process-property relationship analysis; improved material selection tools; structural life prediction; multi-functional surfaces; and structural optimization for reducing structural weight.  Methods to expanding material degradation risk prediction and operational environment-driven materials selection methods will be created. \n\nExamples of ongoing research related to Autonomy include: high confidence\/Safe Autonomous Control in naval environments and on supervisory control of decentralized heterogeneous Unmanned Aircraft Systems (UAS).  Expand efforts on safe-perception based autonomous control in complex naval environments and on autonomy to support combined unmanned and manned air systems\/units.\n\nSpecific efforts in FY 2020 include:\n\nEfforts to mature Integrated Propulsion, Power and Thermal Management System technologies to an appropriate level to meet the next generation TACAIR Technology Maturation Readiness Review notional plan and schedule.  Investigate technologies that could increase engine efficiency, power and aircraft range including engine inlet distortion control, turbomachinery and drive systems optimization, high temperature engine materials and coatings, engine compressor casing treatments and advanced thermal management and transport systems.\n\nFlight Dynamics & Control analysis and scaled experiments to demonstrate knowledge fundamental aspects of phenomena associated with multibody control systems with a focus on the ability to demonstrate guaranteed performance relative to a desired end state.  Demonstrate algorithms and technology to enable precise ship-relative navigation in GPS-denied environments.\n\nAerodynamics research to demonstrate a new method for in situ measurement if ship airwake dynamics.  Demonstrate a leap forward in the capability to run real-time simulations of the coupled aerodynamics involved in ship-based recovery of rotary wing aircraft in order to advance the capability of piloted simulations and increase their effectiveness as training tools.\n\nHigh Fidelity Composite Characterization for Rapid Certification of Advanced Structures - application of previously developed advanced characterization methods for current and emerging next generation Composites.  This data will feed rapid certification through advanced damage modeling and failure predictions.  Advanced Galvanic Compatibly Theory for Operationally Optimized Material Selection - validation and transition of novel compatibility theory to improve material selection and design in vehicle sustainment and life extension."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.889"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.889"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research related to Sea Based Aviation National Naval Responsibility (SBA NNR) priorities in Aviation, Propulsion, and Structures and Materials.  \n\nResearch in Aircraft Science & Technology include:\n \n- Advanced analytical methods for achieving guaranteed performance in multibody control systems.\n\n- Control law synthesis methods to expand the recovery envelope and reduce touchdown loads.\n\n- Advanced modeling and analysis methods for ship\/aircraft aerodynamic interface.\n \n- Air vehicle flying qualities and control.\n\n- High lift aerodynamics and control.\n\n- Vertical\/Short Take-off and Landing (V\/STOL) science & technology.\n \n- Automated launch and recovery technology.\n\n- Mechanical\/environmental failure prediction research. \n  \nBasic and applied research in Flight Dynamics & Control will develop theory, analysis and experimental data to better understand and exploit the natural dynamics of air vehicles operating the in the marine environment.  \n\nFocus areas in Flight Dynamics & Control include:\n\n- Multibody control systems and the ability to demonstrate guaranteed performance relative to a desired end state.\n\n- Robust and precise control in the presence of highly turbulent flow fields to increase operational capability and reduce structural requirements for ship-based operations; \n\n- Algorithms and sensors to enable precise ship-relative navigation in GPS-denied environments;\n \n- Control effectors and vehicle configurations to enable platforms with VTOL utility and fixed-wing efficiency.\n  \n- Additionally, collaborative research will improve our knowledge of control system interactions between piloted aircraft and human performance.\n\nBasic and applied Aerodynamics research will include:\n\n-New methods for in situ measurement of ship airwake dynamics; \n\n-Advanced computational methods addressing the Navy-unique challenge of a fully coupled aerodynamic interface between ships and aircraft; \n\n-Advanced methods for reduced-order modeling of complex flow fields to enable real-time, high-fidelity simulations of ship-based aircraft operations; \n\n-Advanced methods for manipulating and more precisely controlling the flow fields around air vehicles operating in the maritime environment.\n\nApplied research in aircraft Propulsion and Power concepts for high speed, long endurance and responsiveness include: \n\n-High stage-loading and efficient Turbomachinery;\n\n-Cooling and thermal management for engines and auxiliary systems; \n\n-Advanced materials and coatings; \n\n-Diagnostics and control for Integrated Power, Propulsion and Thermal Management; \n\n-Highly integrated Propulsion inlets, exhausts, and Dust Ingestion research: including modeling, separating, deposition, coatings and sensing. \n\n-Next Generation Air Dominance Enabler applied research in aircraft engine advanced casing treatments, advanced compression system technologies and engine robustness in austere sand and salt environments.\n\nResearch related to Autonomy include: \n\n-High confidence\/Safe Autonomous Control in naval environments and on supervisory control of decentralized heterogeneous Unmanned Aircraft Systems (UAS).  \n\n-Expand efforts on new theory-based methods and processes for rapid and safe adoption of new autonomy capabilities including Verification and Validation, safety, and robustness within complex naval, adversarial environments. \n  \n-Expand efforts on safe-perception based autonomous control in complex naval environments and on autonomy to support combined unmanned and manned air systems\/units.\n\nStructures and Materials Research:\n\n-High Fidelity Composite Characterization for Rapid Certification of Advanced Structures: application of previously developed advanced characterization methods for current and emerging next generation Composites. This data will feed rapid certification through advanced damage modeling and failure predictions. \n \n-Advanced Galvanic Compatibly Theory for Operationally Optimized Material Selection: validation and transition of novel compatibility theory to improve material selection and design in vehicle sustainment and life extension.\n\n-Structural Remediation: materials and processes for extending and restoring structural material operational life via advanced repair and remanufacturing process research and development."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant funding change from FY 2020 to FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fleet Force Potection and Defense Against Undersea Threats"
                                    },
                                    "Description": {
                                        "val": "Fleet Force Protection and Defense against Undersea Threats efforts include applied research for complementary sensor and processing technologies for platform protection.  Current small platforms (both surface and airborne) have little to no situational awareness (SA) or self-protection against air, surface, and asymmetric threats.  A goal of this activity is to provide these platforms with effective self-protection.  The technology areas specific to platform protection will develop individual, multispectral electro-optical (EO), infrared (IR), radio frequency (RF), electro-magnetic (EM), visual and acoustic or chemical sensors\/biosensors and associated processing.  To defend platforms from current and advanced threats in at-sea littoral environments and in port, these technologies must improve multispectral detection and distribution of specific threat information."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.775"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.834"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sensors and Associated Processing: Develop a new 3D ISAR capability for moving targets in air,\nspace, ground, and sea to allow better target recognition.\n\nMaterials and Chemistry: Design and develop, utilizing room temperature ionic liquids, to demonstrate and fabricate\ninexpensive, miniaturized, low power electrochemical sensors for use in autonomous as well as distributed sensor networks. Develop real time, standoff, moving target, laser based detection for explosives and hazardous chemicals with the intent of shifting the paradigm of trace chemical detection through surface contact swabbing to a faster, more flexible wide area, standoff method for significant enhancement of force protection. Develop and design a new class of safe high performance rechargeable zinc air batteries to supplant state of lithium-ion batteries. Development of chemical vapor sensing strategy for application in marine environment, significantly different than terrestrial environment. Significant accomplishments include performance demonstration of highly sensitive electrochemical detection elements incorporated into electronic integrated circuits. Demonstration of high efficiency of zinc sponge anode in an electrochemical cell. \n\nUndersea Warfare: Conceptualize and perform laboratory and field studies to: develop acoustics technology and associated signal processing for the detection of small Unmanned Aerial Vehicles (UAVs); and the development of a pressure tolerant, inexpensive hydrogen storage based on hydrogenated graphene to increase undersea storage capacity."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.010"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.010"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic Warfare (formerly Sensors and Associated Processing): \n\n- Research conducted by one project in this area provides an increase in the performance of airborne imaging radars by developing a 3D imaging capability for maritime applications. The objective is to develop a new 3D ISAR capability for moving targets to allow better target recognition with reduced time-on-target for reduced platform vulnerability and improved speed and accuracy to discriminate threat from non-threat targets.\n\nMaterials and Chemistry:  \n\n- Design and develop inexpensive, miniaturized, low power electrochemical sensors for use in autonomous and distributed sensor networks.  Develop real time, standoff, moving target, laser based detection for explosives and hazardous chemicals.  Development of chemical vapor sensing strategy for application in marine environment. Development of ultra-high strength sintered ceramics for significant improvements in personnel protection and platform survivability.\n\n- Current plans focus efforts on use of metal oxide nanoparticle functionalization of graphene conductometric devices to detect sulfur compounds in vapor and liquid phase aviation; establishing a new paradigm for tunable substrates for efficient sample preconcentration (sensitivity enhancement) and partial separations (selectivity enhancement); and fabrication and optimization of chemical vapor sensor devices made from large-area chemical vapor deposition grown transition metal dichalcogenide films and demonstrate that they can be used to create a chemical sensor array that can identify particular chemical analytes of importance to nerve gas\/explosive detection by creating particular opto-electronic fingerprint for each analyte.  \n\nUndersea Warfare:  \n\n- Developing acoustics technology and associated signal processing to detect and track small-unmanned aerial vehicles for force and infrastructure protection. Development of a pressure tolerant, inexpensive hydrogen storage based on hydrogenated graphene to increase undersea storage capacity. Development of technologies for active control of acoustic scattering to increase stealth and survivability of unmanned undersea vehicles."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2020 to FY 2021 is due to increased investment in 3D airborne imaging and unmanned undersea technologies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Energetics"
                                    },
                                    "Description": {
                                        "val": "Advanced Energetics efforts address technology development to provide substantial improvements in energetic material systems and subsystems, primarily in terms of performance, but also addressing safety, reliability, and affordability concerns.  Goals include: advanced energetic materials for warheads, propellants, and reactive material based subsystems for both defensive and offensive applications. Efforts include: development of new fuels, oxidizers, explosive ingredients and formulations; and reliable simulation tools and diagnostics to develop and design superior-performance, and\/or reduced-vulnerability systems tailored to specific warfighter missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.497"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.380"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct research related to Advanced Energetics including development and evaluation of advanced explosive\/propellant\/\nreactive ingredients and formulations for the next generation higher performing systems.\n\nConduct research in proof of concept efforts to develop insensitive explosives, propellants, and munitions without\ncompromising performance. This work involves development of high quality, small particle energetic ingredients, novel\nprocessing techniques, and advanced energy conversion concepts; and involves both theoretical and experimental efforts.\n\nConduct research focused on chemical processing technologies. Incorporate molecular design and crystal morphology\ntechnology into scale-up and process development. New compliant commodity energetic ingredients will be transitioned to\nthe industrial base as appropriate.\n\nConduct research in development and diagnostics of novel energy conversion concepts to enhance performance, more\nefficiently exploit available energy, and more effectively couple energy to target for air, surface, and underwater warhead\napplication."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.382"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.382"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct applied research related to Advanced Energetic materials with a focus on higher tactical weapon performance including speed, range, and overall lethality in addition to proof of concept efforts to develop insensitive explosives, propellants, and munitions without compromising performance.  \n\n- Research areas include development and evaluation of advanced explosive\/propellant\/reactive composite ingredients and formulations for the next generation higher performing systems in addition to novel manufacturing\/chemical processing\/scale-up technologies and process development efforts.  This work involves development of high quality, small particle energetic and other formulation-enabling ingredients, novel processing techniques, and advanced energy conversion concepts, and involves both multi-scale theoretical and various dynamic diagnostic experimental efforts.\n\n- Conduct research focused on ingredient chemistry and chemical processing technologies, and incorporate molecular design and crystal morphology technology into scale-up and process development. New compliant commodity energetic ingredients will be transitioned to the industrial base as appropriate.\n\n- Conduct research in development and application of experimental diagnostics of novel energy conversion concepts to enhance performance, more efficiently exploit available energy, and more effectively couple energy to target for air, surface, and underwater warhead and propulsion applications.\n\n- Conduct research in development and application of modeling and simulation to predict dynamic response and effects of energetic processes such as ignition, combustion\/deflagration, shock, fragmentation, and detonation in order to predict weapon performance, lethality, and lifecycle for air, surface, and underwater weapon applications."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant funding change from FY 2020 to FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Surface Ship and Submarine Hull Mechanical and Electrical (HM&E)"
                                    },
                                    "Description": {
                                        "val": "Technology programs focused on providing technologically superior warfighting capabilities at reduced total ownership costs for surface and subsurface platforms through investments in applied research and advanced technology development of programs in: a) Power, Energy & Propulsion and b) Platform Design and Engineering. This element also includes the National Naval Responsibility in Naval Engineering (NNR-NE). Specific research themes are: \n\nPower, Energy and Propulsion Technology: \nEfforts address electrical and auxiliary system and component technology to dramatically improve energy and power density, operating efficiency, and recoverability from casualties. A major investment focus is providing the power and energy required for directed energy weapons on current and future surface combatants. \n\nPlatform Design and Engineering Technology: \nThis project includes the following efforts:\n- Hydrodynamics: Critical platform design for surface ships hydrodynamics that is focused on the theory, computation, and lab and at-sea experimentation to develop understanding and prediction capabilities for all hydrodynamic phenomena associated with surface ships and small craft, their effects on vessel performance, and concepts for modification. \n- Platform Structures: Focused on time-varying, structural reliability analysis and prediction for a ship structural system with uncertainty quantification and propagation. \n- Unmanned Surface Vehicles (USV): Autonomy for USVs and related mission functions aligned with Naval S&T strategic focus on autonomy and unmanned vehicles. \n- Sea Platform Survivability Technology: Aligned with survivability S&T strategic focus area, research investigates electromagnetic (EM) sources (including major ferro and non-ferromagnetic sources, eddy currents, and Corrosion Related Magnetic Fields (CRM)) that are associated with naval platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "70.037"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "67.859"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Advanced Naval Power and Energy Systems Research and Technology:\n\nAdvanced energy systems research includes a significant research program with the Hawaii Natural Energy Institute (HNEI) at the University of Hawaii that is focused on the analysis and optimization of resilient electrical grids and microgrids in the Pacific region.  Prior and on-going research has demonstrated the ability of advanced batteries and other power management technologies to greatly enhance the stability and reliability of electrical grids possessing high penetrations of variable renewable energy resources.  Results from these demonstrations will be used to evaluate and increase the energy resiliency of critically infrastructures on DOD installations in the Pacific.  The HNEI program has also initiated a new collaboration with the Alaska Center for Energy and Power (ACEP) at the University of Alaska Fairbanks to explore the use of energy storage technologies and distributed energy resources to enhance the energy resiliency of microgrids at remote locations and at DOD facilities in cold weather environments.\n\nTo support both new and existing surface ship and submarine programs, specific new and ongoing efforts are aimed at supporting electrical system reliability, as well as advanced power distribution and control and will utilize the Electric Ship Research and Development Consortium (ESRDC) to develop modeling and simulation tools, system analysis tools and models to provide critical design and operational capabilities for the all-electric ship program, accelerate development and demonstration of technologies, and to reduce risk of technology insertion. These efforts also address the national shortage of naval electrical power engineers. \n\nOngoing research related to the Next Generation Integrated Power System (NGIPS) and Distribution\/Control of Power Advanced Power Systems with a focus on power and energy requirements for directed energy weapons and advance sensor systems on current and future surface combatants, as well as for unmanned naval platforms.\n\nAdvanced Sea Platform Technology: \n\nNew and ongoing applied research related to critical S&T that supports platform design and advanced capability efforts related to propulsor, surface, and subsurface hydrodynamics; platform performance, and platform structural reliability. Specifically, efforts to utilize advanced analytics (machine learning and artificial intelligence), incorporate environmental effects on platform performance, research related to advancing unmanned sea surface vessel technologies and capabilities. Specific naval engineering and platform design efforts to support set-based design for the Next Generation Attack Submarine SSN(X), and efforts to mitigate technology and susceptibility risk for the COLUMBIA class submarine program and the Future Surface Combatant Force. \n\nSea Platform Survivability Technology: \n\nNew and ongoing applied research related to critical S&T to investigate efforts related to signature reduction; structural and machinery acoustics; machinery autonomy; and platform survivability (detectability and susceptibility); and acoustic and non-acoustic signatures. Specifically, efforts utilizing advanced analytics (machine learning and artificial intelligence) and the integration of environmental effects on platform performance and detectability, Specific naval engineering and platform design efforts to support the Next Generation Attack Submarine SSN(X), and efforts to mitigate technology and susceptibility risk for the COLUMBIA class submarine program and the Future Surface Combatant Force. Ongoing base program efforts, initiated in FY 2018 and FY 2019, include ocean surface scatter in RF propagation, wake measurement technologies, thermal management systems, high power control modules for ship application, decision support\/uncertainty analysis in operational environments, and reactive composite materials.\n\nSubmarine Security S&T\nNew and ongoing research efforts focused on the science and physics based signal detection technologies that, individually or as a system, can impact the security of the SSBN and submarines in general. Efforts looking at both passive and active detection technologies with near term (0-5 years), mid-term (5-10 years) and far term (10-20 years) implications, as well as improving the understanding of the generation, radiation, propagation, scatter, and detection of a variety of signal types (acoustic, chemical, optical, electromagnetic, hydrodynamic and radiological) associated with a submarine's operation.\n\nAutonomy Technology: \n\nOngoing research related to critical multidisciplinary autonomy challenges that cut across areas\/domains, including air, sea, undersea and ground. This includes multi-disciplinary research into the science of autonomy focuses on four interrelated areas: scalable and robust distributed collaboration among autonomous systems; human\/unmanned system collaboration; autonomous perception and intelligent decision-making; and intelligent architectures for autonomous systems. Continue research to develop and test autonomy for Medium Displacement Unmanned Surface Vehicle (MDUSV) missions including perception and classification. Ongoing efforts, initiated in FY 2018 and FY 2019, include network information sciences, long-range high-resolution imaging, and decision support\/uncertainty analysis for operational environments. In particular, continue research to develop and test autonomy for Unmanned Undersea Vehicle (UUV) missions including understanding of counter-UUV autonomy options; implementations and testing. Autonomy development involving a shared world model and sensor feedback will continue. Extensive in-water testing will continue."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "67.438"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "67.438"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Power, Energy and Propulsion Technology (covers efforts previously called Advanced Naval Power and Energy Systems Research and Technology): \n\n- Advanced energy systems research focused on the analysis and optimization of resilient electrical grids and microgrids in the Pacific and across DON critical mission areas. Prior and on-going research has demonstrated the ability of advanced batteries and other power management technologies to greatly enhance the stability and reliability of electrical grids. Results from these demonstrations will be used to evaluate and increase the energy resiliency of critically infrastructures on DON installations. Efforts include enhancing collaborations across academia, industry and DON beneficiaries.\n\n- To support both new and existing surface ship and submarine programs, specific new and ongoing efforts are aimed at supporting electrical system reliability, as well as advanced power distribution and control and will utilize the Electric Ship Research and Development Consortium (ESRDC) to develop modeling and simulation tools, system analysis tools and models to provide critical design and operational capabilities for the all-electric ship program, accelerate development and demonstration of technologies, and to reduce risk of technology insertion. These efforts also address the national shortage of naval electrical power engineers. \n\n- Next Generation Integrated Power System (NGIPS) and Distribution\/Control of Power Advanced Power Systems: focus on power and energy requirements for directed energy weapons and advance sensor systems on current and future surface combatants, as well as for unmanned naval platforms. \n\nPlatform Design and Engineering Technology (covers efforts previously called Advanced Sea Platform Technology, Sea Platform Survivability Technology, Submarine Security S&T and Autonomy Technology):\n\n- Conduct applied research related to critical S&T that supports platform design and advanced capability efforts related to propulsor, surface, and subsurface hydrodynamics; platform performance, and platform structural reliability. Specifically, efforts to utilize advanced analytics (machine learning and artificial intelligence), incorporate environmental effects on platform performance, research related to advancing unmanned sea surface vessel technologies and capabilities. Specific naval engineering and platform design efforts to support set-based design for the Next Generation Attack Submarine SSN(X), and efforts to mitigate technology and susceptibility risk for the COLUMBIA class submarine program and the Future Surface Combatant Force. \n\n- Conduct applied research related to critical S&T to investigate efforts related to signature reduction; structural and machinery acoustics; machinery autonomy; and platform survivability (detectability and susceptibility); and acoustic and non-acoustic signatures. Specifically, efforts utilizing advanced analytics (machine learning and artificial intelligence) and the integration of environmental effects on platform performance and detectability, Specific naval engineering and platform design efforts to support the Next Generation Attack Submarine SSN(X), and efforts to mitigate technology and susceptibility risk for the COLUMBIA class submarine program and the Future Surface Combatant Force. Ongoing base program efforts, initiated in FY 2018 and FY 2019, include ocean surface scatter in RF propagation, wake measurement technologies, thermal management systems, high power control modules for ship application, decision support\/uncertainty analysis in operational environments, and reactive composite materials.\n\n- Conduct research efforts focused on the science and physics based signal detection technologies that, individually or as a system, can impact the security of the SSBN and submarines in general. Efforts looking at both passive and active detection technologies with near term (0-5 years), mid-term (5-10 years) and far term (10-20 years) implications, as well as improving the understanding of the generation, radiation, propagation, scatter, and detection of a variety of signal types (acoustic, chemical, optical, electromagnetic, hydrodynamic and radiological) associated with a submarine's operation. \n\n- Ongoing research related to critical multidisciplinary autonomy challenges that cut across areas\/domains, including air, sea, undersea and ground. This includes multi-disciplinary research into the science of autonomy focuses on four interrelated areas: scalable and robust distributed collaboration among autonomous systems; human\/unmanned system collaboration; autonomous perception and intelligent decision-making; and intelligent architectures for autonomous systems. Ongoing efforts, initiated in FY 2018 and FY 2019, include network information sciences, long-range high-resolution imaging, and decision support\/uncertainty analysis for operational environments. In particular, continue research to develop and test autonomy for Unmanned Undersea Vehicle (UUV) missions including understanding of counter-UUV autonomy options; implementations and testing. Autonomy development involving a shared world model and sensor feedback will continue. Extensive in-water testing will continue. \n\nSpectrum Superiority:\n\n- Continuing research efforts for passive and active long-range high-resolution detection and imaging for increased survivability and situational awareness even in degraded\/contested environments.\n\n- Demonstrate portable distributed multi-domain sensor and surveillance technologies in portable expeditionary warfare form factor to protect forces in denied and contested EM environments. Reduce size of electronic warfare devices into handheld form factor to counter advanced threats.\n\nElectronics:  \n\n- Develop and explore new high voltage, high efficiency wide bandgap and ultra-wide bandgap power switches for electric propulsion and electric weapons. Current plans are to focus efforts on: Pioneering Vertical GaN High Power Switches; and Ultra-Wide Bandgap Gallium Oxide Power Device Transformative Integrated GaN Power Technology Platform.  \n\nMaterials and Chemistry:  \n\n- Design and demonstrate a rechargeable Zn-air battery with pulse-power capability that incorporates a Zn sponge anode and trifunctional air cathodes. The resulting rechargeable Zn-air battery prototype will validate a new class of safe, high-performance, rechargeable Zn-air batteries that will provide attractive options for future military and civilian applications.\n\nUndersea Warfare: \n\n- Conduct research to reduce the time and cost for Submarine hull inspections by creating technologies for non-destructive evaluation (NDE) of submerged elastic surfaces coated with highly absorptive layers."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant funding change from FY 2020 to FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Naval Research Enterprise"
                                    },
                                    "Description": {
                                        "val": "The Naval Research Enterprise (NRE) supports mission-driven problem solving within the Naval Research and Development Establishment (NR&DE) through agile, rapid prototyping processes, while also promoting implementation of a common, effective innovation process and language. Adopting a common innovation process stimulates effective NR&DE-wide collaborations and facilitates NR&DE-wide sharing and implementation of best practices to accelerate the delivery of innovative capabilities to the warfighter.  Activities are based on three foundational principles: (1) utilize innovative technical and business pathways that accelerate technology acquisition and deployment to the warfighter; (2) leverage the commercial market and attract private investments to accelerate and reduce the cost for defense acquisition and deployment of technologies that provide capabilities to the warfighter; and (3) employ innovative best-practices in contracting that accelerate awards and provide flexibility and speed in technology maturation and acquisition.   \n\nEfforts also include some continuing projects originally supported under the Independent Applied Research (IAR) Program established in 2013 to focus on solving a wide range of Naval Science and Technology (S&T) fleet issues utilizing unique Naval Warfare Center (WC) laboratory capabilities.  Starting in FY20, the NRE funds are shifting to support the agile, rapid prototyping processes that will continue to take advantage of the WC unique capabilities, while promoting mission-driven problem solving and collaborations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.586"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.562"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Independent Applied Research (IAR) shall align with Naval Research framework priorities (IAR projects which were three years in duration); Augmented Warfighter, Integrated & Distributed Forces; Operational Endurance, Sensing and Sense-Making, and Scalable Lethality. FY20 IAR projects will expand efforts in the areas of physics, chemistry, biotechnology, earth sciences, mathematics, and other hard and soft sciences. Representative projects include; Life Preserver Performance in Waves, Electronic Warfare Activity Recognition, Boron-Based Solid Fuel Development for Ramjet Application, Modularization Algorithm for Additive Manufactured Parts, Data Visualization Support for Creation of a Numerical Table: Effects on Training and Performance, Development of a Fully Integrated Ignition System for Multiple Pulse Hybrid Rocket Motor Firings, Active Sonar-based Cooperative Unmanned Underwater Vehicle Interception, and Ultra Short Pulse Laser Induced Plasma Filaments for Extended Covert Communications.\n\nFund the development of innovative prototypes at Warfare Centers and Naval Laboratories solving key warfighter problems that are identified through the Hacking for Defense innovation process pipeline."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.562"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.562"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Fund the development of innovative prototypes at Warfare Centers, Naval Laboratories and related DON organizations solving key warfighter problems that are identified through the Hacking for Defense (H4D) innovation process pipeline. \n \n- Efforts will be carried out under a pilot designated Naval Innovations Process Adoption (NIPA) to emphasize the implementation of a common process and language to promote collaborations and facilitate the use of best practices to accelerate the delivery of capabilities to the warfighter.  \n\n- The NIPA pilot is based on the proven Lean Innovation startup process adapted for defense innovation as Hacking for Defense (H4D). The H4D process employs an innovation pipeline composed of four primary steps, with each step lasting approximately 3 months, so that a prototype is delivered and evaluated within one year."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant funding change from FY 2020 to FY 2021."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "54.543"
                        },
                        "CurrentYear": {
                            "val": "96.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "150.543"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Alternative Energy Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "27.030"
                                        },
                                        "Text": {
                                            "val": "Funding used to carryout alternative energy research in several areas including modeling and simulation tools for energy efficient ship design, unmanned vehicle power systems, cyber-secure and resilient micro-grids, marine-derived renewable energy, and a variety of shore-based energy efforts addressing energy challenges in the Asia-Pacific regions, including Hawaii, Alaska, Guam, California, and Australia."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power Generation and Storage Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.827"
                                        },
                                        "Text": {
                                            "val": "Conduct and expand on-going competitively awarded efforts that improve Li-ion battery safety and increase micro-grid resiliency and efficiency"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conducted and expanded on-going competitively awarded efforts that improved Li-ion battery safety and increased micro-grid resiliency and efficiency"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hybrid Composite Structures Research for Enhanced Mobility"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.827"
                                        },
                                        "Text": {
                                            "val": "This effort will develop advanced fiber reinforced plastics for maritime craft and vessel structural components having the strength and weight benefits of traditional composite materials but without the corresponding cost and producibility limitations.  In addition, this effort will develop hybrid inflatable structures for high load applications culminating in building and testing a full-scale lightweight ramp structure capable of supporting a 75 ton M1A1 tank.  This ramp concept combines a metallic or composite compression member, drop stitch panels, and tension cables to form a lightweight, foldable ramp compatible with smaller vessels such as the Expeditionary Fast Transport and amphibious craft concepts such as the Ultra-Heavy Amphibious Connector."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Develop advanced fiber reinforced plastics for maritime craft and vessel structural components having the strength and weight benefits of traditional composite materials but without the corresponding cost and producibility limitations.  In addition, this effort will develop hybrid inflatable structures for high load applications culminating in building and testing a full-scale lightweight ramp structure capable of supporting a 75 ton M1A1 tank.  This ramp concept combines a metallic or composite compression member, drop stitch panels, and tension cables to form a lightweight, foldable ramp compatible with smaller vessels such as the Expeditionary Fast Transport and amphibious craft concepts such as the Ultra-Heavy Amphibious Connector."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Standoff Detection of Buried Hazards"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "2.896"
                                        },
                                        "Text": {
                                            "val": "Detection of Buried Hazards : Develop the basic signal processing requirements for the Laser Multi-Beam Differential Interferometric Sensor system have been analyzed and transformed into system specifications.  Draft the necessary test plan to investigate the effectiveness based both acoustic and seismic excitation for buried object detection in outdoor environment"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Energetics Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "7.240"
                                        },
                                        "Text": {
                                            "val": "These funds will be used towards the advanced demonstration of energetic materials in a variety of weapon system applications to include:  high performance solid rocket and air breathing propulsion, reactive materials demonstrations and effects in advanced lethality and effectiveness models, advanced warhead concepts to include novel reactive shaped charge configurations, hybrid reactive material warhead demonstrations, and the development and demonstration of any necessary modeling and simulation capabilities for quantification of damage effects on adversary weapon systems, and other potential energetic technologies."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Funds will be used for continued research towards the advanced demonstration of energetic materials in a variety of weapon system applications to include:  high performance solid rocket and air breathing propulsion, reactive materials demonstrations and effects in advanced lethality and effectiveness models, advanced warhead concepts to include novel reactive shaped charge configurations, hybrid reactive material warhead demonstrations, and the development and demonstration of any necessary modeling and simulation capabilities for quantification of damage effects on adversary weapon systems, and other potential energetic technologies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Hull Form Development and Demonstration"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "7.723"
                                        },
                                        "Text": {
                                            "val": "Using computation fluid dynamic modeling, design innovative sea-keeping small-craft with improved performance characteristics utilizing advanced building techniques and materials."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electric propulsion for military craft and advanced planing hulls"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research in Electric propulsion for military craft and advanced planning hulls."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test bed for autonomous ship systems"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research in Test bed for autonomous ship systems."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Talent and technology for Navy power and energy systems"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "9.500"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research in Talent and technology for Navy power and energy systems."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Compact high flow fan"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research in Compact high flow fan."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network cyber security and resiliency"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research in Network cyber security and resiliency."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Navy alternative energy research, development, testing and deployment"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "20.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research in Navy alternative energy research, development, testing and deployment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data-model fusion for naval platforms and systems"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research in Data-model fusion for naval platforms and systems."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blue carbon capture\/direct air capture"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research in Blue carbon capture\/direct air capture."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energy resilience efforts"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research in Energy resilience efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Coastal environmental research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research in Coastal environmental research."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Platform reliability and advanced technical research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "3.500"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research in Platform reliability and advanced technical research."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        }
                    }
                }
            ]
        }
    }
}