{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-9035d21372bc28631c31031b85da2fbd962d290bf8d6ca6eecbc49021508de49-9",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603000D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Munitions Advanced Technology"
        },
        "R1LineNumber": {
            "val": "24"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "25.550"
            },
            "PriorYear": {
                "val": "25.462"
            },
            "CurrentYear": {
                "val": "25.779"
            },
            "BudgetYearOne": {
                "val": "22.920"
            },
            "BudgetYearOneBase": {
                "val": "22.920"
            },
            "BudgetYearTwo": {
                "val": "23.483"
            },
            "BudgetYearThree": {
                "val": "23.944"
            },
            "BudgetYearFour": {
                "val": "24.639"
            },
            "BudgetYearFive": {
                "val": "25.200"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "This Program Element (PE) aligns with PE 0602000D8Z, Joint Munitions Technology. The two project codes within each PE form the 6.2 applied research and 6.3 technology demonstration components of the Joint Enhanced Munitions Technology Program (JEMTP) and the Joint Fuze Technology Program (JFTP). The JEMTP funds its applied research efforts using PE 0602000D8Z Project code (P) 076 Enhanced Munitions and its technology demonstration efforts using PE 0603000D8Z P077 Enhanced Munitions Applied Technology. The JFTP funds its applied research efforts using PE 0602000D8Z P204 Enabling Fuze Technology and its technology demonstration efforts using PE 0603000D8Z P301 Enabling Fuze Advanced Technology."
        },
        "ProgramElementMissionDescription": {
            "val": "This program advances and demonstrates munitions components (warheads, propulsion systems, advanced lethality mechanisms, fuzes and fuze components, etc.) in relevant environments with joint applicability. The goal is to demonstrate joint enabling technologies that increase or improve the lethality, range, reliability, safety, and survivability for existing and future weapons systems. The program invests in research of technologies from a Joint Service perspective, thus maximizing efficiencies, ensuring the development of technologies with the broadest applicability while avoiding duplication of efforts. Increasing the lethality, range and performance of munitions, while striving to increase the safety for our warfighters for munitions in procurement and under development guide program investments. This munitions based Science and Technology (S&T) program focuses on enhancements in weapon speed, range, and lethality while largely utilizing existing advanced insensitive munitions (IM) technology to maximize weapon safety. US power projection capabilities related to near peer competition are lagging and there is an urgent need to provide our warfighters with increased or new capabilities. The program will strive to develop the most lethal weapons possible and communicating associated risks intelligently, so U.S. warfighters can make informed decisions about their weapon systems capabilities and safe handling requirements. IM compliance requirements remain an important aspect of munitions reliability and readiness and thus will remain a critical characteristic of the program. The 2018 National Defense Strategy denotes that “Challenges to the U.S. military advantage represent another shift in the global security environment. For decades the United States has enjoyed uncontested or dominant superiority in every operating domain. Today, every domain is contested—air, land, sea, space, and cyberspace.” Therefore, the program will invest in technologies that will enable U.S. warfighters to regain the operational and battlefield advantages that technologies can provide through increased performance, range, and lethality to improve the Joint Force military advantages and build a more lethal force.  This program is has aligned its investment portfolio to complement and utilize priority technology areas (hypersonics, autonomy, artificial intelligence\/machine learning, and microelectronics) defined by the Under Secretary of Defense for Research and Engineering.\nMunition Area Technology Groups (MATGs) and Fuze Area Technology Groups (FATGs) are established for each technology area and are tasked with: 1) coordinating, establishing, and maintaining 2025, 2030, and 2035 year technology development plans and roadmaps, 2) coordinating biannual meetings to review technical and programmatic details of each funded and proposed effort, 3) developing and submitting Technology Transition Agreements in coordination with appropriate PEOs for insertion in their weapons system strategic plans \/ Fuze Technology Development Plans, and 4) interfacing with other MATGs \/ FATGs and IM \/ fuze science and technology projects as appropriate. The Joint Enhanced Munitions Technology Program (JEMTP) and Joint Fuze Technology Program (JFTP) utilize a Technical Advisory Board (TAB) and Technical Advisory Committee (TAC) (consisting of senior Department of Defense (DoD) and Department of Energy (DOE) technology experts and laboratory representatives, plus senior Munitions PEO representatives) to provide program oversight, policy, direction, and priorities during its annual meeting."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "25.540"
                },
                "CurrentYear": {
                    "val": "25.779"
                },
                "BudgetYearOne": {
                    "val": "26.156"
                },
                "BudgetYearOneBase": {
                    "val": "26.156"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "25.462"
                },
                "CurrentYear": {
                    "val": "25.779"
                },
                "BudgetYearOne": {
                    "val": "22.920"
                },
                "BudgetYearOneBase": {
                    "val": "22.920"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.078"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-3.236"
                },
                "BudgetYearOneBase": {
                    "val": "-3.236"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.074"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.004"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.214"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.214"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Re-alignment to PE 0603662D8Z"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.022"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.022"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2021 Re-alignment for Higher Priorities:\n$3.000 million adjustment to fund concept development of follow-on project within the Networked Communications Capabilities PE 0603662D8Z."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "002"
                    },
                    "ProjectTitle": {
                        "val": "Insensitive Munitions Advanced Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "18.977"
                        },
                        "PriorYear": {
                            "val": "18.931"
                        },
                        "CurrentYear": {
                            "val": "19.205"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Enhanced Munitions Advanced Technology effort will demonstrate enabling technologies and perform associated applied research that will improve the performance, range, and lethality of existing and future weapons systems. This effort will take promising technologies demonstrated at the laboratory scale and transition them into demonstration programs utilizing generic hardware based munitions in the concept and development stages. Mature demonstrated Enhanced Munitions technology can be transitioned, thereby decreasing the PEO’s program costs and schedule risk, facilitating spin-offs to other non-compliant munitions within their portfolios. Technologies demonstrated seek to improve the performance, lethality, and range of weapons to ensure the U.S. is not outgunned and outranged on the battlefield of the future.\nThe Joint Enhanced Munitions Technology Program (JEMTP) investments focus on five Munition Areas: 1) High Performance Rocket Propulsion, 2) Minimum Signature Rocket Propulsion, 3) Blast and Fragmentation Warheads (Area Effects Warheads), 4) Anti-Armor Warheads (Hard Target Effects Warheads), and 5) Gun Propulsion. Munition Area Technology Groups (MATG), under tri-service leadership, have developed technology roadmaps for each Munition Area which is used to guide investments based on goals consistent with the DoD IM Strategic Plan. These IM technologies, alone or in combination, will be incorporated in hardware, simulating real-world munitions, to demonstrate their utility and feasibility as part of Technology Transition Agreements with PEOs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enhanced Munitions Advanced Technology (previously Insensitive Munitions Advanced Technology)"
                                    },
                                    "Description": {
                                        "val": "Enhanced Munitions Advanced Technology focuses on the following key areas:\n- High Performance Rocket Propulsion HPP - focuses on the development of technologies to improve the range and speed of HPP systems, rocket motors with Ammonium Perchlorate and with or without a metal fuel, for rockets and missiles launched from air, ground, and sea platforms.\n- Minimum Signature Rocket Propulsion (MSP) - focuses on the development and demonstration of technologies to improve MS rocket propellant formulations and ingredients, including synthesis, characterization and scale-up; case and packaging design; active and passive venting techniques; rocket motor case design; ignition systems; and thrust mitigation techniques.\n- Blast and Fragmentation Warheads (BFW) - focuses on the development and demonstration of technologies that when applied enhance the lethality of Blast\/Fragmentation munitions.\n- Anti-Armor Warheads (AAW) - focuses on the development of explosive ingredients, explosives, and warhead technologies for improving performance of AAW munitions.\n- Gun Propulsion (GP) - focuses on the development and demonstration of technologies in the area of GP systems. The development and demonstration of gun propulsion technologies, when applied to munition systems, will improve the range and\/or time to target of all gun launched munitions to include small\/medium caliber, tank\/mortar and large caliber propulsion systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.931"
                                            },
                                            "Text": {
                                                "val": "Design and ballistic testing of a HD 1.3 propellant in a new DACS for Missile Defense Agency.  \nDemonstrate venting solution for large rocket motor casing applicable to sidewinder and AMRAAM. \nDemonstrate SCO\/FCO improvement and firing of MK-135 Tomahawk boost motor."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.205"
                                            },
                                            "Text": {
                                                "val": "- Complete the ballistic testing of a HD 1.3 propellant in a new nozzle system for the Missile Defense Agency. Demonstrate venting solution for large rocket motor casing applicable to sidewinder and AMRAAM. Manufacture motors and conduct baseline testing for MK-135 Tomahawk boost motor demonstration. Complete case design and motor geometry using a composite rocket motor case.\n- Manufacture components and propellant, for assembly and prep for testing an extruded propellant to improve flight motor for air to ground small missile system. Complete hardware design and manufacture for small diameter rocket motor. Conduct testing of extruded propellant to improve performance of ground to ground flight motor. Conduct analysis and optimize the energy management of a small diameter rocket motor system.\n- Conduct modelling and simulation on down-selected formulations and conduct functionality testing on large diameter indirect fire munitions to demonstrate improved performance. Conduct water pit testing and conduct lethality assessment on novel warhead design for direct fire ammunition warhead. Complete design and analysis for an optimized warhead the fragmentation features with rapid prototyping using additive manufacturing (AM). Scale up and conduct reliability testing of novel warhead initiation booster material.\n- Conduct modeling and simulation of medium caliber ammunition warhead designs, optimize the design, and build warheads.  Scale up and manufacture improved performance explosive for AAWs, load into warheads and conduct basic testing. Procure novel high explosive material, manufacture samples, and prepare to conduct penetration tests on representative hardware.\n- Fabricate novel material gun cartridge case material, conduct mechanical and specialized testing, and down-select coating material. Design the breech and propelling charge subsystems for a longer range artillery system using a novel ignition mechanism."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort transitions to a new Project Code, Enhanced Munitions Advanced Technology in FY 2021."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0602000D8Z P000"
                                    },
                                    "Title": {
                                        "val": "BA2 Insensitive Munitions"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "13.037"
                                        },
                                        "CurrentYear": {
                                            "val": "13.178"
                                        },
                                        "BudgetYearOne": {
                                            "val": "13.362"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "13.362"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.618"
                                        },
                                        "BudgetYearThree": {
                                            "val": "13.889"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "301"
                    },
                    "ProjectTitle": {
                        "val": "Enabling Fuze Advanced Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "6.573"
                        },
                        "PriorYear": {
                            "val": "6.531"
                        },
                        "CurrentYear": {
                            "val": "6.574"
                        },
                        "BudgetYearOne": {
                            "val": "6.621"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.621"
                        },
                        "BudgetYearTwo": {
                            "val": "6.782"
                        },
                        "BudgetYearThree": {
                            "val": "6.865"
                        },
                        "BudgetYearFour": {
                            "val": "7.042"
                        },
                        "BudgetYearFive": {
                            "val": "7.185"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program will demonstrate advanced fuze technologies needed to develop weapons that address Joint priority capability areas including ones highlighted by OUSD(R&E) Technology-Focused Modernization and Service Science and Technology (S&T) priorities including Hypersonics, Long Range Precision Fires, Counter UAS Air Defense and Scalable Lethality. This effort will take promising integrated technologies to maturity and demonstrate the maturity utilizing weapon hardware derived from priority capabilities and technology needs identified and validated by the Program Executive Officers (PEOs) and the Heads of the Service S&T communities. Demonstrate mature fuze technology will be transitioned, thereby decreasing their program costs and schedule risk and facilitating spin-offs to other munitions within their portfolios.\nUnder the Joint Fuze Technology Program (JFTP), investments are focused on specific capability areas that have been identified by Department strategic guidance and are focused on capability areas that are driven by next generation hypersonic and advanced weapons. The four capability areas are: 1) Extreme Environment Survivable Fuzing, 2) Tailorable Effects Fuzing and Warhead Initiation, 3) High Reliability Safe and Arm Technology, and 4) Target Detection and Burst Point Control."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enabling Fuze Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "Enabling Fuze Advanced Technology focuses on the following key areas:\n- Extreme Environment Survivable Fuzing - develops fuze components to increase the effectiveness of hypersonic munitions by improving the prediction tools and testing methodologies to evaluate the survivability and functionality of future fuzes.\n- Tailorable Effects Fuzing and Warhead Initiation - develops fuzing for tailorable effects weapons that encompasses the ability to selectively vary the output of the weapon (Dial-a-Yield) and\/or the ability to generate selectable effects (e.g., directed blast, fragmentation).\n- High Reliability Safe and Arm Technology - develops high reliability fuzing architectures, fuzing components, and Unexploded Ordnance (UXO) reduction features enabling the next generation of cluster munitions to achieve the required <1% UXO goal while Increasing the reliability across the board for future weapon systems.\n- Target Detection and Burst Point Control develops technologies enabling smaller, more survivable solutions while meeting or exceeding the performance of existing technologies in order to operate in extreme and challenging weapon environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.531"
                                            },
                                            "Text": {
                                                "val": "Develop fully programmable miniature data recorders for embedded fuzing that can survive extreme hard target fuzing environments.\nDevelop and demonstrate methods to accurately replicate high G loading on fuzing components and transition to the DoD and Industry fuze community."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.574"
                                            },
                                            "Text": {
                                                "val": "- Develop fully programmable miniature data recorders for embedded fuzing that can survive extreme hard target fuzing environments. Develop methods to accurately replicate weapon extreme shock and temperature effects on fuzing components and transition to the DoD and Industry fuze community.\nDevelop technologies for efficient\/novel generation of firing energy for multi-point fuze systems. Develop fuzing components precision timing between initiation of multi-points and of energetic reactions.\n- Develop integrated miniature fuze sensor technology for applications in miniature UAV weapons as well as for counter UAV applications. Demonstrate area-effects weapon fuzing subsystem and system-level prototypes and systems in both laboratory and field environments.\n- Develop miniaturized, low power, target detection device technologies in area-effect weapon simulated target environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.621"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.621"
                                            },
                                            "Text": {
                                                "val": "Validate tools and modeling that accurately replicate and record extreme high G loading and high temperature on fuzing components and transition capability to the DoD and Industry weapon fuze community.\n- Develop and demonstrate technologies for efficient\/novel generation of firing energy for multi-point fuze systems for advanced hypersonic warheads.\n- Develop integrated miniature fuze sensor technology for applications in miniature UAV weapons.\n- Demonstrate MEMS fuze sensor technology for application in miniature UAV weapons and transition Services’ Counter UAS and weaponized UAS programs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The level of effort is consistent between FY 2020 and FY 2021. Small changes reflect minor budget fluctuation."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0602000D8Z P204"
                                    },
                                    "Title": {
                                        "val": "BA2 Enabling Fuze Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.263"
                                        },
                                        "CurrentYear": {
                                            "val": "6.327"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.431"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.431"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.532"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.655"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "077"
                    },
                    "ProjectTitle": {
                        "val": "Enhanced Munitions Advanced Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "16.299"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.299"
                        },
                        "BudgetYearTwo": {
                            "val": "16.701"
                        },
                        "BudgetYearThree": {
                            "val": "17.079"
                        },
                        "BudgetYearFour": {
                            "val": "17.597"
                        },
                        "BudgetYearFive": {
                            "val": "18.015"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Funds in this new Project Code will be used to develop and demonstrate early applied weapons system science and technology (i.e., energetic ingredients, formulations, consolidation techniques, warheads, and propulsion technologies) focused on enhancing weapons lethality, range, and performance in the Joint Enhanced Munitions Technology Program (JEMTP)."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Enhanced Munitions Advanced Technology effort will demonstrate enabling technologies and perform associated applied research that will improve the performance, range, and lethality of existing and future weapons systems. This effort will take promising technologies demonstrated at the laboratory scale and transition them into demonstration programs utilizing generic hardware based munitions in the concept and development stages. Mature demonstrated Enhanced Munitions technology can be transitioned, thereby decreasing the PEO’s program costs and schedule risk, facilitating spin-offs to other non-compliant munitions within their portfolios. Technologies demonstrated seek to improve the performance, lethality, and range of weapons to ensure the U.S. is not outgunned and outranged on the battlefield of the future.\nThe Joint Enhanced Munitions Technology Program (JEMTP) investments focus on five Munition Areas: 1) High Performance Propulsion - Alternative propulsion designs and systems for increased range, e.g. rotating detonation engines, solid fuel ramjets, highly loaded grain technology, etc.; 2) Minimum Signature Propulsion – new propellant compositions and hybrid propulsion for reduced time to target\/increased range; 3) Area Effects Warheads – high performance explosives, reactive materials, multiphase blast, etc.; 4) Hard Target Effects Warheads – improved penetration for shaped charge jets, lethality enhancements for area effects munitions; and 5) Gun Propulsion – novel ignition schemes, advanced propellant design, etc. Munition Area Technology Groups (MATG), under tri- service leadership, have developed technology roadmaps for each Munition Area which are used to guide investments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enhanced Munitions Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "Enhanced Munitions Advanced Technology focuses on the following key areas:\n- High Performance Rocket Propulsion (HPP) - focuses on the development of technologies to improve the range and speed of HPP systems, rocket motors with Ammonium Perchlorate and with or without a metal fuel, for rockets and missiles launched from air, ground, and sea platforms.\n- Minimum Signature Rocket Propulsion (MSP) - focuses on the development and demonstration of technologies to improve MS rocket propellant formulations and ingredients, including synthesis, characterization and scale-up; case and packaging design; active and passive venting techniques; rocket motor case design; ignition systems; and thrust mitigation techniques.\n- Area Effects Warheads (AEW) focuses on the development and demonstration of technologies that when applied enhance the lethality of Area Effects munitions.\n- Hard Target Effects Warheads (HTEW) - focuses on the development of explosive ingredients, explosives, and warhead technologies for improving performance of HTEW munitions.\n- Gun Propulsion (GP) - focuses on the development and demonstration of technologies in the area of GP systems. The development and demonstration of gun propulsion technologies, when applied to munition systems, will improve the range and\/or time to target of all gun launched munitions to include small\/medium caliber, tank\/mortar and large caliber propulsion systems."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.299"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.299"
                                            },
                                            "Text": {
                                                "val": "- Demonstrate BI\/FI improvement and firing of MK-135 Tomahawk boost motor. Conduct motor preparations and static motor firing for air defense system.\n- Manufacture motor case assemblies to support air to ground small motor testing. Conduct testing of extruded propellant to improve Fragment Impact response of ground to ground flight motor. Complete designs and fabricate hardware for testing of a small diameter rocket motor system.\n- Conduct testing on large diameter indirect fire munitions to demonstrate improved performance while maintaining Fragment Impact, Slow Cookoff, and Sympathetic Reaction response. Finalize the design of AM warhead and conduct water pit testing to compare to the existing baseline warhead. Conduct mini-arena testing of novel warhead booster material and produce full size boosters to conduct testing in all up rounds.\n- Conduct testing of medium caliber ammunition warheads on full cartridges, in multiple scenarios. Conduct characterization and performance testing on improved performance explosive for HTEWs. Conduct penetration tests on novel high explosive material loaded hardware.\n- Fabricate prototype novel material gun cartridge cases, and prepare for engineering demonstration testing. Complete the design, assembly and initial testing of the longer range artillery system novel ignition mechanism."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This new Project Code re-aligns efforts from Project Code 002, Insensitive Munitions Advanced Technology, in FY 2021."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}