{
    "id": "2021-Army-PB-2040-JBOOK-714ad55e40c208dd6daa0faf0cf32aa88e3bc8f15c4df77071b9706a36db953e-6",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA5A-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604622A"
        },
        "ProgramElementTitle": {
            "val": "Family of Heavy Tactical Vehicles"
        },
        "R1LineNumber": {
            "val": "124"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "11.182"
            },
            "CurrentYear": {
                "val": "13.125"
            },
            "BudgetYearOne": {
                "val": "24.792"
            },
            "BudgetYearOneBase": {
                "val": "24.792"
            },
            "BudgetYearTwo": {
                "val": "12.494"
            },
            "BudgetYearThree": {
                "val": "8.849"
            },
            "BudgetYearFour": {
                "val": "8.803"
            },
            "BudgetYearFive": {
                "val": "16.331"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "95.576"
            }
        },
        "ProgramElementNote": {
            "val": "The Medium Equipment Trailer (MET) with planned execution from project E50 is a new start program in FY 2021. PdM ALUGS Leader\/Follower efforts transitioned from the 0604017A Robotics Development FD9 Robotic Systems line in FY 2018 and FY 2019 to a Program of Record under 0604622A Family of Heavy Tactical Vehicles EZ8 Leader\/Follower in FY 2020."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) aligns system development and demonstration of Heavy Tactical Vehicles (HTV) with Multi-Domain Operations (MDO) requirements to support combat and combat support missions, to include line haul, local haul, and unit resupply. HTV trucks transport water, ammunition, and general cargo over all terrains and throughout the battle-space. Systems include the Heavy Expanded Mobility Tactical Truck (HEMTT), Palletized Load System (PLS), Heavy Equipment Transporter System (HETS), Line Haul, Heavy Dump Truck (HDT) as well as recovery systems such as the Modular Catastrophic Recovery System (MCRS) that rescue large wheeled vehicle platforms in severe off-road conditions. Funding will also be used for developing the Army's next generation of tactical trucks as part of the Army's Tactical Wheeled Vehicle (TWV) Modernization Strategy. \n\nThis Program Element also supports the development and demonstration of enablers, active safety technologies and heavy and medium tactical trailers including the Medium Equipment Trailers (MET). Periodic evolutionary upgrade of survivability and crew protection as described in the Long Term Protection Strategy (LTPS) is supported by this PE for both the HTV family of vehicles and the Family of Medium Tactical Vehicles (FMTV). \n\nThe Tactical Wheeled Vehicle - Leader Follower (TWV-LF) program provides transportation units with the capability for Tactical Wheeled Vehicles (TWVs) to operate in an unmanned mode, initially the Palletized Loading System (PLS) vehicles, while operating in a convoy. This is accomplished by integrating technology to the unmanned vehicles which enables them to follow a manned Lead vehicle. This is done in a March Unit of up to (8) TWVs initially PLS vehicles, with (1) manned Lead vehicle and (3) to (7) unmanned Follower vehicles. This capability provides increased Soldier Force Protection and increased convoy logistics throughput by giving Commanders more options on Soldier utilization, removing Soldiers from threat zones and\/or utilizing vehicle operators for convoy security, and allowing supply convoys to run more often. The PLSA1 is the initial tactical vehicle used to support By-Wire Active Safety which provides the foundation for automated capabilities such as Leader\/Follower and Automated Convoy Operations effectively taking Soldiers out of harm's way. \n\nFunding also supports modernization of the current Tactical Wheeled Vehicle fleets by investigating technology insertions including, but not limited to: predictive based maintenance, vetronics, Victory Architecture, vehicle electrification, autonomous operations and other emerging technologies.  Funding also supports developing initial prototypes to enable refinement of Operational Requirements and early user feedback to support future sustainment and operational movement operating concepts. \n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "11.935"
                },
                "CurrentYear": {
                    "val": "16.745"
                },
                "BudgetYearOne": {
                    "val": "26.889"
                },
                "BudgetYearOneBase": {
                    "val": "26.889"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "11.182"
                },
                "CurrentYear": {
                    "val": "13.125"
                },
                "BudgetYearOne": {
                    "val": "24.792"
                },
                "BudgetYearOneBase": {
                    "val": "24.792"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.753"
                },
                "CurrentYear": {
                    "val": "-3.62"
                },
                "BudgetYearOne": {
                    "val": "-2.097"
                },
                "BudgetYearOneBase": {
                    "val": "-2.097"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-3.62"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.753"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.097"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.097"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "659"
                    },
                    "ProjectTitle": {
                        "val": "Family Of Hvy Tac Veh"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.339"
                        },
                        "CurrentYear": {
                            "val": "5.639"
                        },
                        "BudgetYearOne": {
                            "val": "5.635"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.635"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "12.613"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Enhanced Heavy Equipment Transporter System (EHETS) is the replacement system for the Heavy Equipment Transporter System (HETS). It is intended to transport, deploy, and evacuate the latest and future combat configured M1A2 MBT vehicles and provide a maximum payload transport capacity of 90 tons.  It will provide increased payload, highway transportability, and force protection over its predecessor and support flexible theatre postures to enhance the ability to compete and provide the transport for freedom of maneuver during combat.\n\nFY 2021 Project 659 Base funds in the amount of $5.635 million supports the Enhanced Heavy Equipment Transporter System (EHETS) new production prototype trailers under a competitive down-select. The EHETS supports the National Defense Strategy for modernization with an increased payload that provides the ability for transport, recovery and evacuation of heavy, oversized combat equipment such as the M1A2 Abrams main battle tank (MBT) and M88 recovery vehicle to support flexible theater postures and enhance the ability to compete and provide the transport for freedom of maneuver of the largest track combat weapon systems.\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "EHETS Acquisition Planning and Documentation Development"
                                    },
                                    "Description": {
                                        "val": "Acquisition planning and documentation development includes matrix personnel program support for the development of contracting\/acquisition milestone documentation and systems engineering plans for the Enhanced Heavy Equipment Transporter System (EHETS) program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.292"
                                            },
                                            "Text": {
                                                "val": "Accomplished providing the functional matrix engineering and logistics support for early input into the development of the EHETS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced heavy Equipment Transporter System (EHETS) Trailer Prototypes"
                                    },
                                    "Description": {
                                        "val": "Replacement system for the legacy Heavy Equipment Transporter System (HETS) to transport, deploy, and evacuate payloads up to 90 tons."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.635"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.635"
                                            },
                                            "Text": {
                                                "val": "Build EHETS new production trailer prototypes in preparation for follow-on testing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increase due to the procurement of EHETS new production prototype trailers."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HETS M1070A1 Tractor Modifications & System-level Testing"
                                    },
                                    "Description": {
                                        "val": "HETS M1070A1 tractor modifications and system-level testing are required to develop a near term interim solution in response to the USAREUR ONS for a transportation system capable of carrying 78.5 Tons of payload while achieving host country road permits at a reduced weight of 75 tons with an ultimate carrying capacity of 85 tons."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.047"
                                            },
                                            "Text": {
                                                "val": "Research and develop a solution to modify the current M1070A1 HETS tractor to ultimately carry an 85 tons payload when paired with the commercial trailer."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.449"
                                            },
                                            "Text": {
                                                "val": "HET System-level testing and evaluation of modified M1070A1 tractors and new commercial trailers required for the USAREUR ONS to meet up to 85 ton capability."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No FY 2021 funding for the HETS  M1070A1 Tractor Modifications and System level testing required."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "25T STLB Test"
                                    },
                                    "Description": {
                                        "val": "Feasibility testing required to evaluate prototype semitrailers from two vendors produced under the OT project agreement award."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.934"
                                            },
                                            "Text": {
                                                "val": "Feasibility testing required to evaluate prototype semitrailers from two vendors produced under Other Transaction (OT) project agreement award. Test results will be evaluated to determine single vendor for project agreement production award."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Feasibility test complete and no FY 2021 funds for 25T STLB required."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.256"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "DA0924"
                                    },
                                    "Title": {
                                        "val": "Modification Of In Svc Equip"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "256.642"
                                        },
                                        "CurrentYear": {
                                            "val": "83.627"
                                        },
                                        "BudgetYearOne": {
                                            "val": "114.977"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "114.977"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "29.661"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.456"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "485.363"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DA0500"
                                    },
                                    "Title": {
                                        "val": "Family Of Heavy Tactical Vehicles (FHTV)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "160.897"
                                        },
                                        "CurrentYear": {
                                            "val": "36.886"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.5"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "6.5"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.5"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "215.783"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "D16506"
                                    },
                                    "Title": {
                                        "val": "PLS ESP"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "23.221"
                                        },
                                        "BudgetYearOne": {
                                            "val": "37.132"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.969"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "15.163"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "60.353"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DV0021"
                                    },
                                    "Title": {
                                        "val": "Hvy Expanded Mobile Tactical Truck Ext Serv"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "109.764"
                                        },
                                        "CurrentYear": {
                                            "val": "194.575"
                                        },
                                        "BudgetYearOne": {
                                            "val": "65.635"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "65.635"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "11.225"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "381.199"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "D01650"
                                    },
                                    "Title": {
                                        "val": "SEMITRAILER LOW BED 25 TON"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.942"
                                        },
                                        "CurrentYear": {
                                            "val": "4.619"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.586"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.586"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.765"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.842"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.422"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.284"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "54.460"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "DA0924 - Modification Of In Svc Equip is a shared funding line with other product offices in FY 2019 and FY 2020."
                        },
                        "AcquisitionStrategy": {
                            "val": "The Enhanced Heavy Equipment Transporter System (EHETS) is the replacement system for the Heavy Equipment Transporter System (HETS). The EHETS will acquire new production prototype trailers under a competitive down-select. Currently developing the course of action for the acquisition strategy to present an efficient and effective streamlined acquisition approach to the Milestone Decision Authority (MDA) and in accordance with Army Requirements Oversight Council (AROC) approval to support force modernization."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.256"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.256"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "HETS M1070A1 Tractor Modification"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Oshkosh Defense"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Oshkosh, WI"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.047"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.047"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "EHETS Trailer Prototypes"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.635"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.635"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.635"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "EHETS Acquisition Planning and Documentation Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TACOM LCMC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.292"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.292"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "USAREUR HETS ONS System Level Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aberdeen Test Center (ATC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.449"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.449"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "25T STLB Prototype Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aberdeen Test Center (ATC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.934"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.934"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "5_659_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Enhanced Heavy Equipment Transporter System (EHETS)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EHETS Contract Documentation and Test Plans Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EHETS Request for Proposal (RFP) release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EHETS Prototype Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EHETS Prototype Trailers"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EHETS Run Off Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EHETS Milestone C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "USAREUR HETS ONS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "USAREUR HETS ONS Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "25-Ton Semitrailer Lowbed (25T STLB)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "25T STLB Prototype Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "E50"
                    },
                    "ProjectTitle": {
                        "val": "TRAILER DEVELOPMENT"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.3"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "6.921"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.921"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "9.221"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This is a new start in FY2021.\n\nThe Medium Equipment Trailer (MET) with planned execution from project E50 is a new start program in FY 2021."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Medium Equipment Trailer (MET) supports Large Scale Combat Operations and is capable of transporting track combat platforms weighing 60 tons or less in an Armored Brigade Combat Team (ABCT) and Infantry Brigade Combat Team (IBCT). MET directly supports Multi-Domain Operations and provides the capability to transport the tallest combat platforms (i.e. Paladin and Bradley) under 4 meter underpasses which are common in OCONUS. The MET shall also provide transportation of construction equipment used by units for horizontal construction projects in support of military or other national goals and objectives. It will also be capable of transporting 20 foot International Organization for Standardization (ISO) containers and general cargo when the situation requires.\n\nFY 2021 Project E50 Base funds in the amount of $6.921 million supports the MET new production prototype trailers under a competitive down-select.  The MET will provide flexible capability that reduces duplicative systems. The MET supports the National Defense Strategy for modernization with a 60 ton payload that provides the capability for transport of two thirds of the track combat platforms to include the tallest combat platforms to support flexible theater postures and enhance the ability to compete and provide freedom of maneuver.\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "25-Ton STLB Prototypes"
                                    },
                                    "Description": {
                                        "val": "Award of 25-Ton STLB prototypes, test services support and data item deliverables for test."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.782"
                                            },
                                            "Text": {
                                                "val": "Preparation of solicitation, scope of work, and other acquisition documentation leading to a competitive down select prototype project agreement awards to two vendors. Prototype builds of ten semitrailers (five trailers per vendor) expected to begin 4QFY2019."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "25-Ton Functional Matrix Support"
                                    },
                                    "Description": {
                                        "val": "Build six (6) armored Heavy Dump Trucks (HDTs) and one (1) armored cab. The armor solution will be developed concurrently with the armor capable truck."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.518"
                                            },
                                            "Text": {
                                                "val": "HDT prototypes awarded to procure assets for Developmental Test (DT), Operational Test (OT) and Life Fire Test (LFT)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medium Equipment Trailer (MET) Prototype Manufacturing"
                                    },
                                    "Description": {
                                        "val": "MET is a trailer capable of transporting  track combat platforms weighing 60 tons or less in an Armored Brigade Combat Team (ABCT). METS will provide flexible capability that reduces duplicative systems."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.921"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.921"
                                            },
                                            "Text": {
                                                "val": "Competitive acquisition of Medium Equipment Trailer prototypes in preparation for test and down-select."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 increase to procure MET prototypes."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "D01650"
                                    },
                                    "Title": {
                                        "val": "SEMITRAILER LOW BED 25 TON"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.942"
                                        },
                                        "CurrentYear": {
                                            "val": "4.619"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.586"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.586"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.765"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.842"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.422"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.284"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "54.460"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DA0926"
                                    },
                                    "Title": {
                                        "val": "MODIFICATION APPLICATION"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "41.904"
                                        },
                                        "CurrentYear": {
                                            "val": "21.582"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.227"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.227"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "84.713"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "MET will be executed as a competitive Other Transaction Agreement (OTA) awarded to two Original Equipment Manufacturers (OEMs). The plan is to procure three prototypes per vendor in preparation to test and down-select to one vendor for follow-on production."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "25T Prototype Award"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.782"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.782"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "MET Prototype Manufacturing"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.921"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.921"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.921"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "25-Ton Matrix Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TACOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.518"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.518"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "5_E50_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Medium Equipment Trailer (MET)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MET Materiel Development Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MET Requrest Prototype Proposal (RPP)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MET Prototype Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MET Prorotype Manufacturing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MET Run-off Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MET Milestone C Decision Point"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SEMI-TRAILER LOW-BED 25-Ton Trailer"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "25T Materiel Development Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "25T Prototype Project Agreement Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "25T Prototype Build"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "25T Run-off Testing for Prototypes"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "25T Milestone C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EZ8"
                    },
                    "ProjectTitle": {
                        "val": "Leader\/Follower"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "5"
                        },
                        "BudgetYearOne": {
                            "val": "10.637"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.637"
                        },
                        "BudgetYearTwo": {
                            "val": "9.412"
                        },
                        "BudgetYearThree": {
                            "val": "5.881"
                        },
                        "BudgetYearFour": {
                            "val": "5.324"
                        },
                        "BudgetYearFive": {
                            "val": "12.852"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "49.106"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Tactical Wheeled Vehicle Leader Follower program provides transportation units with the capability for Tactical Wheeled Vehicles (TWVs) to operate in an unmanned mode, beginning with the Palletized Loading System (PLS) vehicles, while operating in a convoy.  This is accomplished by integrating technology to the unmanned vehicles which enables them to follow a manned lead vehicle. This is done in a March Unit of up to (8) TWVs initially PLS vehicles, with (1) manned Lead vehicle and (3) to (7) unmanned follower vehicles.  This capability provides increased Soldier Force Protection and increased convoy logistics throughput by giving commanders more options on Soldier utilization, removing Soldiers from threat zones and\/or utilizing vehicle operators for convoy security, and allowing supply convoys to run more often.\n\nFY 2021 Project EZ8 Base funds will execute testing for the Tactical Wheeled Leader Follower program for safety and performance evaluations by the Army Test & Evaluation Command (ATEC) to support a production decision by the Milestone Decision Authority, fund Program Management office lifecycle planning, and engagements with industry to plan and solicit proposals for the program of record contracts. In addition, Project EZ8 Base funds exploration and development of the Expedient Leader Follower (ExLF) Applique on additional systems (Heavy Expanded Mobility Tactical Truck (HEMTT), Family of Medium Tactical Vehicles (FMTV), and 915 truck fleets) beyond the Palletized Load System (PLS)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Wheeled Vehicle Leader Follower"
                                    },
                                    "Description": {
                                        "val": "Funding line in FY 2021 for Project Manager Force Projection, Product Manager Applique and Large Unmanned Systems, to be used to execute the Program of Record (POR) for the Leader Follower capability of removing Soldier Operators from the PLS.  This provides increased Soldier protection and logistics throughput."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.773"
                                            },
                                            "Text": {
                                                "val": "FY 2020 funding will be used for the execution and management of the Leader Follower Transition Agreement (TA) and support LF Capability requirements development. It will also fund the chartering and support of the Test and Evaluation Working Integrated Product Team (T&E WIPT), Risk Management support, Logistics planning and IPT initiation.Technical Manual Validation and Logistics Demo will be funded in FY20. Funding will complete testing of the Expedient Leader Follower system design as it completes the engineering and operational demonstration phase under a directed requirement. Pre-Production Qualification Testing which includes RAM testing, Obstacle Detection and Avoidance Testing and Degraded System Testing will occur in FY 2020.   Funding will support formal validation of the demonstrated capability, and manpower support for production planning and Milestone C execution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.637"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.637"
                                            },
                                            "Text": {
                                                "val": "FY 2021 funding for Leader Follower will support follow-on testing of the Leader Follower configuration fielded assets.  It will fund a competitive run-off of multiple vendors during FY 2021 for a down-select of (1) Leader Follower autonomy solution.  Funding includes delivery of vendor prototypes, field service representatives, early logistics and product support analysis, independent testing, data analysis, source selection activities, contracting support, and program documentation to support the follow-on production decision. In addition, Project EZ8 Base funds exploration and development of the Expedient Leader Follower (ExLF) Applique on additional systems (Heavy Expanded Mobility Tactical Truck (HEMTT), Family of Medium Tactical Vehicles (FMTV), and 915 truck fleets) beyond the Palletized Load System (PLS)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 funding provides minimal funding for program initiation.  FY 2021 funding supports ramp-up of testing multiple vendors with multiple prototypes to support full and open competitive down-select."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.227"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "FD9"
                                    },
                                    "Title": {
                                        "val": "Robotics Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "67.868"
                                        },
                                        "CurrentYear": {
                                            "val": "3.051"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.06"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.06"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.009"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.961"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.006"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.014"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "85.969"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "R06806"
                                    },
                                    "Title": {
                                        "val": "Leader\/Follower Applique (L\/F)"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "7.624"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.624"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "33.128"
                                        },
                                        "BudgetYearThree": {
                                            "val": "106.998"
                                        },
                                        "BudgetYearFour": {
                                            "val": "125.788"
                                        },
                                        "BudgetYearFive": {
                                            "val": "139.838"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "413.376"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Prior to FY 2020, PM LF efforts were funded under the Robotics Development 6.4 line along with  United States Army Combat Capabilities Development Command Ground Vehicle Systems Center, formerly TARDEC, who had most of the funding."
                        },
                        "AcquisitionStrategy": {
                            "val": "The TWV LF Acquisition Strategy, where appropriate,  leverages prior developed and demonstrated technology, developed under a HQDA G-8 Directed Requirement effort by Ground Vehicle Systems Center (GVSC), and transitions to the Program Manager Force Projection, PdM ALUGS in FY 2021.   PdM ALUGS will use a competitive prototyping effort in FY 2021 leading to a single source Engineering & Manufacturing Development phase in FY 2022.  The funding allows for the Army to mature the technology demonstrated under the directed requirement, fully validate the production solution and ensure safe and suitable operation, develop the appropriate logistics products, operations manuals, and supportability strategy, and field an enduring unmanned, robotic, autonomous PLS convoy capability to Soldiers."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "LF Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM FP"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI; Harrison Twp, MI"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.874"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.874"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.227"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.227"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "LF Competitive Prototyping"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.337"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.337"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.337"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "LF Tech Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TARDEC, TACOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.334"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.3"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.3"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.634"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "LF Test Support ATEC"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.565"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.565"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "5_EZ8_0.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "5_EZ8_1.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "LEADER FOLLOWER (LF) ALUGS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2027"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF Safety Release Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF Operational Technology Demonstration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF Sustain Operational Technology Demonstration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF RPP Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF OTA Flyoff 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF OTA Flyoff 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF EMD RPP"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF EMD Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF Pre-Production Qualification Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF Milestone C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF Production Qualification Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF Follow-on Operational Test & Evaluation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF Full Materiel Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF Full Rate Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2029"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VR5"
                    },
                    "ProjectTitle": {
                        "val": "TWV Protection Kits"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.543"
                        },
                        "CurrentYear": {
                            "val": "2.486"
                        },
                        "BudgetYearOne": {
                            "val": "1.599"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.599"
                        },
                        "BudgetYearTwo": {
                            "val": "3.082"
                        },
                        "BudgetYearThree": {
                            "val": "2.968"
                        },
                        "BudgetYearFour": {
                            "val": "3.479"
                        },
                        "BudgetYearFive": {
                            "val": "3.479"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "24.636"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Heavy Dump Truck (HDT) supports construction projects by loading, transporting and dumping payloads of sand and gravel aggregates, crushed rock, hot asphalt mixes, earth, clay, rubble, large boulders and other materials up to gross vehicle weight rating to job sites under world-wide climatic conditions.  The HDT also serves as a quarry truck for the quick transport of bulk raw earth materials to and from the crushing, screening and washing plant and the asphalt mixing plant.  The HDT also serves as a transportation asset for organization equipment.  The HDT is Long Term Armor Strategy (LTAS) compliant with MRAP 1.1 underbody protection.  The armor solution is developed concurrently with the production of armor capable HDTs.\n\nFY 2021 Project VR5 Base funds in the amount of $1.599 million supports Developmental Test (DT), Operational Test (OT) and Live Fire Test (LFT) of the armored Heavy Dump Truck prototypes. The armor solution is in compliance with the Long Term Armor Strategy (LTAS) perimeter ballistic specification and Mine Resistant Ambush Protected (MRAP) underbody ballistic specification in support of the Tactical Wheeled Vehicle (TWV) strategy for Soldier protection.\n                  \nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Heavy Dump Truck (HDT) Testing"
                                    },
                                    "Description": {
                                        "val": "Reliability, Availability, and Maintainability (RAM) testing and system performance testing \/ evaluation of the armored HDTs. Developmental Test, Operational Test and Live Fire Test of armored vehicle."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.687"
                                            },
                                            "Text": {
                                                "val": "Awarded 5 prototype trucks, funded the start of DT\/OT for Armor Capable Heavy Dump Trucks, and ballistic and live fire exploitation testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.373"
                                            },
                                            "Text": {
                                                "val": "Armored HDT testing costs include system testing, evaluation and report production for the HDT program. The Government will conduct Production Verification Testing (PVT), First Production Vehicle Inspection (FPVI), Reliability, Availability, and Maintainability (RAM) testing and Live Fire Testing (LFT), as well as OEM test services support, familiarization training and refurbishment of test assets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.599"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.599"
                                            },
                                            "Text": {
                                                "val": "Continuation of Live Fire Testing of HDT armored prototypes. Developmental and Operational Testing for HDT armored vehicles."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2021 funding is decreased as RAM and performance testing for the HDT is finalized and all testing for armored prototypes is completed in FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HDT Prototypes"
                                    },
                                    "Description": {
                                        "val": "Build six (6) armored Heavy Dump Trucks (HDTs) and one (1) armored cab.  The armor solution will be developed concurrently with the armor capable truck."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.856"
                                            },
                                            "Text": {
                                                "val": "The armor solution will be developed concurrently with the production of armor capable HDTs. The Government has awarded six (6) armored HDTs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.113"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "D16001"
                                    },
                                    "Title": {
                                        "val": "TRUCK, DUMP, 20T (CCE)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.061"
                                        },
                                        "CurrentYear": {
                                            "val": "10.838"
                                        },
                                        "BudgetYearOne": {
                                            "val": "29.368"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "29.368"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "45.267"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Heavy Dump Truck (HDT) entered the acquisition cycle pre-Milestone C, based on a competitive source selection process that resulted in the award of a five year plus two option years firm-fixed price (FFP) indefinite delivery indefinite quantity (IDIQ) contract.   The contract award was for one Original Equipment Manufacturer (OEM) to develop an armor solution for a commercially-based dump truck.  The commercially-based dump truck will be armor-capable and will be produced concurrently with the development of the armor solution, which will ensure that the armor solution correctly interfaces with the commercially-based dump truck."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "FY 2020 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.113"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.113"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Heavy Dump Truck (HDT) Prototype Design of Armored Cab"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Mack Defense"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Allentown, PA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.856"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.856"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "HDT - Production Verification Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aberdeen Test Center (ATC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.444"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.444"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HDT - Live Fire Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aberdeen Test Center (ATC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.26"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.255"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.515"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HDT -  Familiarization Training"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Mack Defense"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Allentown, PA"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.016"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.016"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HDT - Test Services Representative"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Mack Defense"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Allentown, PA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.224"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.224"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HDT - Refurb of Test Assets"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Mack Defense"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Allentown, PA"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.037"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.037"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HDT - DT\/OT"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aberdeen Test Center (ATC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.203"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.621"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.599"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.599"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2021-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.423"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "5_VR5_0.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "HEAVY DUMP TRUCK (HDT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HDT Armor Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HDT Armored Prototypes"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HDT Armored Cab Live Fire Exploitation Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HDT Armored PVT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HDT Armored Live Fire Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HDT Armored Developmental\/Operational Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HDT Type Classification\/Materiel Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HDT Initial Operating Capability"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}