{
    "id": "2021-Army-PB-2040-JBOOK-2ce7b76ca8f41dbc06183380f90728d4a8e40b9122c9effab5b4a02fdffb364e-4",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605301A"
        },
        "ProgramElementTitle": {
            "val": "Army Kwajalein Atoll"
        },
        "R1LineNumber": {
            "val": "189"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "237.414"
            },
            "CurrentYear": {
                "val": "238.691"
            },
            "BudgetYearOne": {
                "val": "231.824"
            },
            "BudgetYearOneBase": {
                "val": "231.824"
            },
            "BudgetYearTwo": {
                "val": "231.405"
            },
            "BudgetYearThree": {
                "val": "236.592"
            },
            "BudgetYearFour": {
                "val": "244.958"
            },
            "BudgetYearFive": {
                "val": "247.487"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "1668.371"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) is unique in the Research, Development, Test & Evaluation (RDTE) portfolio due to the comprehensive scope of RDTE funding at United States (U.S.) Army Garrison Kwajalein Atoll, directly supporting eleven leased islands with radars, telemetry, and optics in support of continuous New Foreign Launch surveillance, space surveillance, space object identification, offensive and defensive strategic ballistic and interceptor missile testing. In addition, responsibilities include provision of the totality of the logistics and municipal services required to maintain a strategically vital mission support infrastructure in a remote Pacific island chain 2,300 miles southwest of Hawaii. Kwajalein's flexible electromagnetic frequency spectrum, equatorial locale, deep water, and unmatched instrumentation make the nation's space and missile operations possible. In addition, the Ronald Reagan Ballistic Missile Defense Test Site (RTS) on Kwajalein is the Department of Defense's (DoD) only land-impact missile testing site, providing an increasingly vital Test & Evaluation (T&E) capability. \n\nThe U.S. Army Kwajalein Atoll \/ Ronald Reagan Ballistic Missile Defense Test Site (USAKA\/RTS), located in the Republic of the Marshall Islands, is a remote, secure activity of the Major Range and Test Facility Base (MRTFB). USAKA\/RTS supports test and evaluation of major Army and DoD missile and space acquisition programs and provides New Foreign Launch surveillance and space operations (surveillance and object identification) in support of U.S. Strategic Command (USSTRATCOM), the U.S. Air Force, and National Aeronautics and Space Administration (NASA) scientific and space programs. USAG-KA provides Base Operations (BOS), Infrastructure and Services (Projects DW7, DW8, and DW9) support to the USAKA\/RTS mission and other resident Programs (i.e. Army missile defense, Air Force & Navy Intercontinental Ballistic Missile (ICBM) developmental and operational tests; Army, Air Force, Navy and Defense Advanced Research Projects Agency (DARPA) hypersonic developmental tests; Air Force Space Fence, Missile Defense Agency (MDA) operational \/demonstration\/ validation tests; USSTRATCOM space situational awareness requirements (including contributions to the U.S. Space Surveillance Network); and space experiments). Base Operations Services at Kwajalein Atoll are conducted predominantly through a contracted workforce with governmental oversight. These PE-funded contracts provide: installation\/base operations and maintenance for all facilities, logistics, and security; power generation fuel supporting the installation and radars; transportation; and mission essential bandwidth via a fiber optic cable system. \n\nThe Network Enterprise Technology Command (NETCOM) utilizes Project DX2 to provide civilian pay, manpower service contracts, supporting Information Technology (IT), equipment, and associated costs specifically identified and measurable to plan, manage, coordinate, and execute Information Technology Services Management at Army Kwajalein Test Ranges. This Project provides C4IM services in accordance with the Department of Army Pamphlet (DA PAM) PAM 25-1-1 and the Army C4IM Services List."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "246.275"
                },
                "CurrentYear": {
                    "val": "238.691"
                },
                "BudgetYearOne": {
                    "val": "234.76"
                },
                "BudgetYearOneBase": {
                    "val": "234.76"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "237.414"
                },
                "CurrentYear": {
                    "val": "238.691"
                },
                "BudgetYearOne": {
                    "val": "231.824"
                },
                "BudgetYearOneBase": {
                    "val": "231.824"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-8.861"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-2.936"
                },
                "BudgetYearOneBase": {
                    "val": "-2.936"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-8.861"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.936"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.936"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DW7"
                    },
                    "ProjectTitle": {
                        "val": "Army Kwajalein Atoll Facilities Sustainment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.2"
                        },
                        "CurrentYear": {
                            "val": "45.255"
                        },
                        "BudgetYearOne": {
                            "val": "47.07"
                        },
                        "BudgetYearOneBase": {
                            "val": "47.07"
                        },
                        "BudgetYearTwo": {
                            "val": "48.385"
                        },
                        "BudgetYearThree": {
                            "val": "50.447"
                        },
                        "BudgetYearFour": {
                            "val": "53.906"
                        },
                        "BudgetYearFive": {
                            "val": "54.464"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "319.727"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project provides resources for preventive maintenance and repair necessary to sustain 1,477 facilities on Kwajalein, Roi-Namur, and nine other leased islands, totaling 2.6 million square feet. Funds are focused toward keeping facilities in good working order in accordance with industry standards. This includes emergency response and service calls, minor repair and major repair or replacement resulting from Kwajalein's particularly harsh climate, including strong winds, saltwater corrosion, and sustained torrential rainfall. Funds also provide manpower necessary to achieve, evaluate, and sustain compliance with appropriate Federal, State, and local environmental laws, Executive Orders, Department of Defense (DoD) Directives, regulations, and overseas country-specific Final Governing Standards."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army Family Housing (AFH) Maintenance"
                                    },
                                    "Description": {
                                        "val": "Provided the operations to support a Family Housing (FH) inventory consisting of 372 units, Billeting consisting of 147 transient rooms, and Unaccompanied Personnel Housing dormitory inventory consisting of 692 units."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.003"
                                            },
                                            "Text": {
                                                "val": "Performed change of occupancy maintenance which includes deep cleaning, small interior repairs and interior painting to make the housing habitable and ready for occupancy. Performed spalling repairs on aged housing masonry. Repaired interior ceilings of the ?stick construction? homes to prevent further deterioration and prevent mold."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Real Property Maintenance"
                                    },
                                    "Description": {
                                        "val": "This effort provides the preventive maintenance and repair necessary to sustain Kwajalein facilities and utilities in order to prevent further deterioration. Funds facilities and utilities at minimum acceptable levels to mitigate risk of catastrophic failures. Includes regularly scheduled adjustments and inspections, preventive maintenance tasks, and emergency response and service calls for minor repairs. Also includes costs of major repairs or replacement of facility components that are expected to occur periodically throughout the expected service life. This work includes: regular roof replacement; refinishing wall surfaces; repairing and replacing electrical, plumbing, and cooling systems; replacing tile and carpeting; and similar types of work. Sustainment, however, is not intended to keep facilities adequately functioning beyond their expected service lives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.197"
                                            },
                                            "Text": {
                                                "val": "Continuing to service 1,477 facilities on Kwajalein, Roi-Namur, and the nine other leased islands, totaling 2.6 Million square feet. Continuing an aggressive maintenance plan based on the significant corrosive environment; prepare maintenance plans and schedules for recurring or preventive maintenance; perform periodic pre-maintenance inspections; perform preventive and corrective maintenance; report the need for major repair, replacement, or rehabilitation; prepare records of maintenance actions performed and deficiencies discovered; and perform post-maintenance inspections."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "45.139"
                                            },
                                            "Text": {
                                                "val": "Will continue to service 1,477 facilities on Kwajalein, Roi-Namur, and the nine other leased islands, totaling 2.6 Million square feet. Will continue an aggressive maintenance plan based on the significant corrosive environment; prepare maintenance plans and schedules for recurring or preventive maintenance; perform periodic pre-maintenance inspections; perform preventive and corrective maintenance; report the need for major repair, replacement, or rehabilitation; prepare records of maintenance actions performed and deficiencies discovered; and perform post-maintenance inspections."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "46.949"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "46.949"
                                            },
                                            "Text": {
                                                "val": "Will continue to service 1,477 facilities on Kwajalein, Roi-Namur, and the nine other leased islands, totaling 2.6 Million square feet. Will continue an aggressive maintenance plan based on the significant corrosive environment; prepare maintenance plans and schedules for recurring or preventive maintenance; perform periodic pre-maintenance inspections; perform preventive and corrective maintenance; report the need for major repair, replacement, or rehabilitation; prepare records of maintenance actions performed and deficiencies discovered; and perform post-maintenance inspections."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Realignment of funding to meet Facility Sustainment Goals"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Quality"
                                    },
                                    "Description": {
                                        "val": "This effort provides manpower necessary to achieve, evaluate, and sustain compliance with appropriate Federal, State, and local environmental laws, Executive Orders, DoD Directives, regulations, and overseas country-specific Final Governing Standards, in order to protect human health and safety and reduce total cost to the Army through environmental compliance, conservation, and pollution prevention. Enables installations to comply with legal environmental mandates and critical stewardship responsibilities that impact management and modernization of installations, while sustaining natural and cultural resources in a manner that provides continued access and long-term use of training lands to support the Army's installation missions.."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.116"
                                            },
                                            "Text": {
                                                "val": "Will continue oversight and management of environmental workload."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.121"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.121"
                                            },
                                            "Text": {
                                                "val": "Will continue oversight and management of environmental workload"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Programmatic  Economic Adjustments"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DW8"
                    },
                    "ProjectTitle": {
                        "val": "Army Kwajalein Atoll Installation Services"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "138.419"
                        },
                        "CurrentYear": {
                            "val": "124.738"
                        },
                        "BudgetYearOne": {
                            "val": "123.923"
                        },
                        "BudgetYearOneBase": {
                            "val": "123.923"
                        },
                        "BudgetYearTwo": {
                            "val": "124.351"
                        },
                        "BudgetYearThree": {
                            "val": "126.52"
                        },
                        "BudgetYearFour": {
                            "val": "130.824"
                        },
                        "BudgetYearFive": {
                            "val": "132.668"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "901.443"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project resources Base Operations \/ Installation Services Support for United States (U.S.) Army Kwajalein (USAKA) Garrison located in the Republic of the Marshall Islands, a remote, secure activity designated as a Major Range and Test Facility Base (MRTFB). Base Operations \/ Installation Services Support resourcing is a critical enabler to ensure continuity of operations supporting Test and Evaluation and Space Operations of the Ronald Reagan Ballistic Missile Test Site in its role as an MRTFB Activity. Kwajalein is a government-managed \/ contractor-operated (GOCO) site and is primarily dependent upon its associated support contracts for the daily operations and maintenance of Base Operations \/ Installation Services Support. Installation Services Support consists of: Utility Services; logistical (fuel\/transportation) operations support requirements; Medical\/Dental Services; Education (K-12) Services; Food\/Grocery Services; Contracted Security Guards; and Aviation\/Marine support."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army Family Housing (AFH) Operations"
                                    },
                                    "Description": {
                                        "val": "Description: Funds all costs associated with the operations of a residence to include management, services, furnishing and utilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.485"
                                            },
                                            "Text": {
                                                "val": "Continue to fund costs associated with the operations of FH inventory, consisting of 372 units, and is comprised of three different types: Housing units constructed of concrete masonry and poured concrete circa 1955 and 1994; units constructed of wood, metal studs and aluminum siding circa 1988, and modular housing- prefabricated, commonly referred to as domes. The Billeting Section consists of 147 transient rooms. Transient housing facilities are located on Kwajalein and Roi-Namur and consist of permanent buildings constructed of concrete masonry. The UPH inventory consists of 692 units comprised of permanent buildings constructed of concrete masonry and poured concrete. UPH units are located on both Kwajalein and Rooi-Namur."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Airfields (AAF) and Heliports (AHP)"
                                    },
                                    "Description": {
                                        "val": "Provides Resources Operations and Maintenance for Army Airfield and Aviation Fleet. Provides manpower, equipment acquisition, sustainment and maintenance in support of airfield operations, airfield management, aircraft services, air traffic services (ATS), air transport, airspace management and control, and air traffic control equipment maintenance. Includes airfield specific equipment, safety requirements, Hazardous Materials (HAZMAT) support, and airfield obstruction surveys. AAF\/AHP functions support Department of Defense (DoD) priorities for Army and joint force capabilities and inter-agency, intra-agency and multinational operations to meet current and future full spectrum requirements. Funds AAF\/AHP functions at the necessary state of readiness to support missions across eleven islands (two fixed wing\/six rotator wing) in addition to international aircraft traffic and reduces risk of major accidents\/incidents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.4"
                                            },
                                            "Text": {
                                                "val": "Provide services for all mission essential DoD, commercial, and transient aircraft. Operate two Airfields and eight outer islands helipads. Operate and maintain one Air Traffic Control (ATC) tower with class D airspace, two separate airfield operations and integrated STARS radar for aircraft separation and de-confliction. Support all intra-atoll cargo and personnel movements with two fixed wing and four rotary wing aircraft. Support transient international flights."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.641"
                                            },
                                            "Text": {
                                                "val": "Provide services for all mission essential DoD, commercial, and transient aircraft. Operate two Airfields and eight outer islands helipads. Operate and maintain one Air Traffic Control (ATC) tower with class D airspace, two separate airfield operations and integrated STARS radar for aircraft separation and de-confliction. Support all intra-atoll cargo and personnel movements  with two fixed wing and four rotary wing aircraft. Support transient international flights."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.812"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.812"
                                            },
                                            "Text": {
                                                "val": "Provide services for all mission essential DoD, commercial, and transient aircraft. Operate two Airfields and eight outer islands helipads. Operate and maintain one Air Traffic Control (ATC) tower with class D airspace, two separate airfield operations and integrated STARS radar for aircraft separation and de-confliction. Support all intra-atoll cargo and personnel movements  with two fixed wing and four rotary wing aircraft. Support transient international flights."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Programmatic Economic Increase"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Community Services (ACS)"
                                    },
                                    "Description": {
                                        "val": "Provides programs that prevent family violence\/fatalities through family advocacy programs and counseling; provide specialized assistance to provide prevention, education and family sustainment for military and civilian personnel and their families; and also provide critical financial, employment and relocation education and training to Soldiers, civilians, and their Families."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.065"
                                            },
                                            "Text": {
                                                "val": "Continue to provide necessary\/routine Army Community Services to the Installation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.273"
                                            },
                                            "Text": {
                                                "val": "Continue to provide necessary\/routine Army Community Services to the Installation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.283"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.283"
                                            },
                                            "Text": {
                                                "val": "Continue to provide necessary\/routine Army Community Services to the Installation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Programmatic Economic INcrease"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Child and Youth Services (CYS)"
                                    },
                                    "Description": {
                                        "val": "Provides child care, youth, and school services (CYSS) programs for children and youth. Provides child and youth spaces required to meet Army's child care and youth participation demand goals. Resources the following programs: 1) Child Development Centers; 2) Family Child Care; 3) School Age Care; 4) Youth Programs; 5) Youth Sports & Fitness; 6) School Support Services. Resources staffing levels necessary to minimize risk of child abuse, and the oversight to achieve and maintain DoD Certification (State licensing equivalent) and National Accreditation per statutory requirement and DoD policy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.28"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources to operate CYS programs on Kwajalein to include a Child Development Center, School Age Services programs, Supplemental Programs and Services, and Youth programs and services. Establish and maintain developmentally and age-appropriate staff-child\/youth interactions, activities, activity schedules and plans, supplies and equipment, furnishings, and environment (both indoors and outdoors) that lead to the social, physical, cognitive, and emotional growth of children up to 18 years. Ensure that youth programs include, at a minimum, seasonal sports programs, 4-H Club programs, Boys and Girls Club of America programs, instructional programs, recreational programs, programs that promote leadership and citizenship, intervention services, and teen programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.417"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources to operate CYS programs on Kwajalein to include a Child Development Center, School Age Services programs, Supplemental Programs and Services, and Youth programs and services. Establish and maintain developmentally and age-appropriate staff-child\/youth interactions, activities, activity schedules and plans, supplies and equipment, furnishings, and environment (both indoors and outdoors) that lead to the social, physical, cognitive, and emotional growth of children up to 18 years. Ensure that youth programs include, at a minimum, seasonal sports programs, 4-H Club programs, Boys and Girls Club of America programs, instructional programs, recreational programs, programs that promote leadership and citizenship, intervention services, and teen programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.427"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.427"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources to operate CYS programs on Kwajalein to include a Child Development Center, School Age Services programs, Supplemental Programs and Services, and Youth programs and services. Establish and maintain developmentally and age-appropriate staff-child\/youth interactions, activities, activity schedules and plans, supplies and equipment, furnishings, and environment (both indoors and outdoors) that lead to the social, physical, cognitive, and emotional growth of children up to 18 years. Ensure that youth programs include, at a minimum, seasonal sports programs, 4-H Club programs, Boys and Girls Club of America programs, instructional programs, recreational programs, programs that promote leadership and citizenship, intervention services, and teen programs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Programmatic Economic Increase"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering Services"
                                    },
                                    "Description": {
                                        "val": "Provides (1) Facility Management and Administration and (2) Installation Engineering Services. Facility Management includes public works management costs, contract management, material procurement, facility data management; to include, Geographic Information System (GIS) and Sustainment Management Systems (SMS) suite implementation\/inspections, furnishings management costs, and real property and real estate management. Installation Engineering Services includes facility engineer service contracts, annual inspection of facilities, master planning, overhead of planning and design, and overhead of construction management and non-Sustainment and Restoration Modernization (SRM) service calls. Excludes: vehicle maintenance, in-house shop and contracted personnel who routinely perform facility sustainment activities; and design engineers or project managers or construction inspectors who manage and oversee facility sustainment and construction projects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.952"
                                            },
                                            "Text": {
                                                "val": "Continue to provide necessary\/routine engineering services to the Installation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.286"
                                            },
                                            "Text": {
                                                "val": "Continue to provide necessary\/routine engineering services to the Installation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.386"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.386"
                                            },
                                            "Text": {
                                                "val": "Continue to provide necessary\/routine engineering services to the Installation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Programmatic Economic Increase"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Recreation and Community Support"
                                    },
                                    "Description": {
                                        "val": "Provides the development and delivery of Soldier Programs, Community Recreation, and Direct Common Family and Morale, Welfare and Recreation (FMWR) Support Services that sustain the Total Army, in accordance with (IAW) the Army Campaign Plan and the Chief of Staff of the Army (CSA)'s Strategic Priorities. Programs funded include sports, fitness and aquatics, recreation centers, libraries, outdoor recreation, skill development, bowling (16 lanes or less); Direct Common FMWR Support Services (essential command and control and risk management programs for property, funds and personnel); and as designated by Congress, Category C FMWR activities at remote and isolated sites. These programs resource readiness and resiliency and build upon physical, emotional, social and psychological coping skills; funds opportunities for Soldiers, civilians and Families to foster self-reliance, morale and a sense of belonging by offering positive discretionary time choices, mitigating aberrant behaviors through individual skill development and team participation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.885"
                                            },
                                            "Text": {
                                                "val": "Continue to provided resources necessary to sustain Soldier Recreation and Community Support for a community population of 1400 and meet the needs of USAKA\/RTS residents, tenants, satellite activities, range users, and other authorized organizations\/personnel on Kwajalein Island, Roi-Namur Island, Meck Island, and on other USAKA\/RTS outer islands."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.24"
                                            },
                                            "Text": {
                                                "val": "Continue to provided resources necessary to sustain Soldier Recreation and Community Support for a community population of 1400 and meet the needs of USAKA\/RTS residents, tenants, satellite activities, range users, and other authorized organizations\/personnel on Kwajalein Island, Roi-Namur Island, Meck Island, and on other USAKA\/RTS outer islands."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.25"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.25"
                                            },
                                            "Text": {
                                                "val": "Continue to provided resources necessary to sustain Soldier Recreation and Community Support for a community population of 1400 and meet the needs of USAKA\/RTS residents, tenants, satellite activities, range users, and other authorized organizations\/personnel on Kwajalein Island, Roi-Namur Island, Meck Island, and on other USAKA\/RTS outer islands."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Programmatic Economic Increase"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fire and Emergency Services (FES)"
                                    },
                                    "Description": {
                                        "val": "Provides for fire and emergency services for the installation, including preparation for and response and mitigation of aircraft and structural firefighting and rescue, technical rescue, Hazardous Materials and Weapons of mass destruction\/Chemical, Biological, Radiological, Nuclear, and Explosives (CBRNE) responses, and out of control wildfire mitigation in an all-hazard response environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.692"
                                            },
                                            "Text": {
                                                "val": "Continue to provide fire and Emergency Services which are performed in association with the Base Support\/Logistics contractor. Provide fire protection services for all USAG-KA and RTS assets, to include facilities, structural, aircraft, shipboard and small watercraft, and wild land fires. Services provide protection for the fire hazards associated with operations and community at USAG-KA and RTS. Provide Fire Protection on Kwajalein and Roi-Namur 24 hours Provided Fire Protection and Emergency Services on Meck during duty hours, mission periods, and hazardous operations. Provide ambulance service on Kwajalein, Meck, and Roi-Namur Islands. Provide fire safety education and activities for the schools and child development center and for adult residents of USAG-KA. Train personnel normally assigned to work on the remote islands of Illeginni, Ennylabegan, Gagan, and Legan in first aid, Cardiopulmonary Resuscitation (CPR), and operation of fire extinguishers and fire alarm and suppression equipment peculiar to the island. Provide rescue and emergency medical personnel available for immediate dispatch to aircraft or vessel crash site, entry into the ocean or lagoon, and be provisioned for immediate rescue and emergency medical assistance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.832"
                                            },
                                            "Text": {
                                                "val": "Continue to provide fire and Emergency Services which are performed in association with the Base Support\/Logistics contractor. Provide fire protection services for all USAG-KA and RTS assets, to include facilities, structural, aircraft, shipboard and small watercraft, and wild land fires. Services provide protection for the fire hazards associated with operations and community at USAG-KA and RTS. Provide Fire Protection on Kwajalein and Roi-Namur 24 hours Provided Fire Protection and Emergency Services on Meck during duty hours, mission periods, and hazardous operations. Provide ambulance service on Kwajalein, Meck, and Roi-Namur Islands. Provide fire safety education and activities for the schools and child development center and for adult residents of USAG-KA. Train personnel normally assigned to work on the remote islands of Illeginni, Ennylabegan, Gagan, and Legan in first aid, Cardiopulmonary Resuscitation (CPR), and operation of fire extinguishers and fire alarm and suppression equipment peculiar to the island. Provide rescue and emergency medical personnel available for immediate dispatch to aircraft or vessel crash site, entry into the ocean or lagoon, and be provisioned for immediate rescue and emergency medical assistance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.003"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.003"
                                            },
                                            "Text": {
                                                "val": "Continue to provide fire and Emergency Services which are performed in association with the Base Support\/Logistics contractor. Provide fire protection services for all USAG-KA and RTS assets, to include facilities, structural, aircraft, shipboard and small watercraft, and wild land fires. Services provide protection for the fire hazards associated with operations and community at USAG-KA and RTS. Provide Fire Protection on Kwajalein and Roi-Namur 24 hours Provided Fire Protection and Emergency Services on Meck during duty hours, mission periods, and hazardous operations. Provide ambulance service on Kwajalein, Meck, and Roi-Namur Islands. Provide fire safety education and activities for the schools and child development center and for adult residents of USAG-KA. Train personnel normally assigned to work on the remote islands of Illeginni, Ennylabegan, Gagan, and Legan in first aid, Cardiopulmonary Resuscitation (CPR), and operation of fire extinguishers and fire alarm and suppression equipment peculiar to the island. Provide rescue and emergency medical personnel available for immediate dispatch to aircraft or vessel crash site, entry into the ocean or lagoon, and be provisioned for immediate rescue and emergency medical assistance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Programmatic Economic Increase"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Financial Management (FM) Activities"
                                    },
                                    "Description": {
                                        "val": "Provides Directorate of Resource Management (DRM) and DRM base support for Army tenants resident on or receiving support from the Army installation. Functions of the DRM include program, budget, manpower, documentation, Memorandum of Understanding (MOU)\/Memorandum of Agreement (MOA)\/Support Agreement management, finance and accounting."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.516"
                                            },
                                            "Text": {
                                                "val": "Continue to provide program\/budget support and budget execution, financial advisory service and accounting liaison services. Support Audit Readiness through Statement of Budgetary Resource samples. Continue to establish Inter-service Support Agreements (ISSA). Provide management analysis on manpower requirements and organizational structure analysis. Provide Contracting Officer Representative oversight for the Program Management functions for the base-support contract."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.594"
                                            },
                                            "Text": {
                                                "val": "Continue to provide program\/budget support and budget execution, financial advisory service and accounting liaison services. Support Audit Readiness through Statement of Budgetary Resource samples. Continue to establish Inter-service Support Agreements (ISSA). Provide management analysis on manpower requirements and organizational structure analysis. Provide Contracting Officer Representative oversight for the Program Management functions for the base-support contract."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.608"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.608"
                                            },
                                            "Text": {
                                                "val": "Continue to provide program\/budget support and budget execution, financial advisory service and accounting liaison services. Support Audit Readiness through Statement of Budgetary Resource samples. Continue to establish Inter-service Support Agreements (ISSA). Provide management analysis on manpower requirements and organizational structure analysis. Provide Contracting Officer Representative oversight for the Program Management functions for the base-support contract."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Programmatic Economic Increase"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Food Services"
                                    },
                                    "Description": {
                                        "val": "Provides for the operation of dining facilities including contract employees, food service supplies, and equipment life-cycle replacement."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.209"
                                            },
                                            "Text": {
                                                "val": "Continue to provide services for DoD, contractor, host nation, interagency and intra-agency organizations with multiple facilities on three different islands to include 3 cafeterias, bakery, grocery store, dry\/cold warehousing, AAFES retail stores, AAFES food court, and catering services and private organizations. Monitor and approve food purchases and preparation. Conduct food service inspections."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.865"
                                            },
                                            "Text": {
                                                "val": "Continue to provide services for DoD, contractor, host nation, interagency and intra-agency organizations with multiple facilities on three different islands to include 3 cafeterias, bakery, grocery store, dry\/cold warehousing, AAFES retail stores, AAFES food court, and catering services and private organizations. Monitor and approve food purchases and preparation. Conduct food service inspections."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.178"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.178"
                                            },
                                            "Text": {
                                                "val": "Continue to provide services for DoD, contractor, host nation, interagency and intra-agency organizations with multiple facilities on three different islands to include 3 cafeterias, bakery, grocery store, dry\/cold warehousing, AAFES retail stores, AAFES food court, and catering services and private organizations. Monitor and approve food purchases and preparation. Conduct food service inspections."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Programmatic Economic Increase"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unaccompanied Housing"
                                    },
                                    "Description": {
                                        "val": "Provides for Government-owned Unaccompanied Housing including appropriated funded Army lodging, lifecycle replacement furnishings, and other associated costs. Includes Manpower purchase, control, moving, management and handling of lifecycle replacement and repair for all unaccompanied housing furnishings. Includes all costs of authorized replacement furnishings in existing inventory."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.601"
                                            },
                                            "Text": {
                                                "val": "Continue to provide contractor management, oversight, M&R, and control of all USAG-KA Housing\/ Billeting Facilities Utilize best commercial residential business practices to ensure basic quality of life standards are achieved and are in compliance with life and safety standards. Provide Master Key control services. Provide and implement a sound furnishings and appliances program that addresses acquisition, replacement, M&R, and refurbishing. Provide Hospitality Kits consisting of the minimum essential items to operate a household until permanent party personnel's HHG arrive and from HHG shipment until departure. Provide COOM on all facilities prior to reassignment to in-coming resident."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.658"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.658"
                                            },
                                            "Text": {
                                                "val": "Continue to provide contractor management, oversight, M&R, and control of all USAG-KA Housing\/ Billeting Facilities Utilize best commercial residential business practices to ensure basic quality of life standards are achieved and are in compliance with life and safety standards. Provide Master Key control services. Provide and implement a sound furnishings and appliances program that addresses acquisition, replacement, M&R, and refurbishing. Provide Hospitality Kits consisting of the minimum essential items to operate a household until permanent party personnel's HHG arrive and from HHG shipment until departure. Provide COOM on all facilities prior to reassignment to in-coming resident."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Programmatic Economic Increase"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Law Enforcement"
                                    },
                                    "Description": {
                                        "val": "Provides Law Enforcement (LE) activities\/services for the protection of people and property, enforcement of laws, and maintenance of order. This effort covers, but is not limited to: all personnel and operating costs associated with LE operations, salaries, overtime, benefits, material and supplies, equipment, vehicles, training and management for LE response forces (Department of the Army Civilian Police (DACP) and military police (MP)). Funds the conduct of motor vehicle traffic supervision, and liaison with civilian LE agencies. Funds LE work load derived from historical responses to calls for service (i.e. Crimes against Persons, Drug Crimes, Traffic Crimes, Absent Without Leave (AWOL), Sex Crimes, and Crimes against Property, Environmental Violations, Fraud Crimes, Alarm Response and Public Service Calls), investigation of non-felony level offenses, preparation and distribution of MP reports and related documents, and collection and analyses of crime statistics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.929"
                                            },
                                            "Text": {
                                                "val": "Continue to provide LE activities\/services for the protection of people and property, enforcement of laws, and maintenance of order. Will cover, but not limited to, all personnel and operating costs associated with LE operations, salaries, overtime, benefits, material and supplies, equipment, vehicles, training and management for LE response forces."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.537"
                                            },
                                            "Text": {
                                                "val": "Continue to provide LE activities\/services for the protection of people and property, enforcement of laws, and maintenance of order. Will cover, but not limited to, all personnel and operating costs associated with LE operations, salaries, overtime, benefits, material and supplies, equipment, vehicles, training and management for LE response forces."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.631"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.631"
                                            },
                                            "Text": {
                                                "val": "Continue to provide LE activities\/services for the protection of people and property, enforcement of laws, and maintenance of order. Will cover, but not limited to, all personnel and operating costs associated with LE operations, salaries, overtime, benefits, material and supplies, equipment, vehicles, training and management for LE response forces."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Programmatic Economic Increase"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Materiel Maintenance"
                                    },
                                    "Description": {
                                        "val": "Provide for automotive, Marine vessel, Construction, General Equipment, and Armament Maintenance. Also provides Field and Sustainment level maintenance services to Army activities in accordance with AR 750-1; provides maintenance technical assistance to supported units and activities, and provides material maintenance on base operations support equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.161"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources for the maintenance of all 6 aircraft, 17 marine vessels, heavy equipment, non-tactical and tactical equipment, construction equipment; base operations equipment and marine navigational aides. Provide government estimates for repair\/ replacement of damaged, lost or lifecycle replacement equipment. Provide resources for OCCM for marine vessels."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.761"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources for the maintenance of all 6 aircraft, 17 marine vessels, heavy equipment, non-tactical and tactical equipment, construction equipment; base operations equipment and marine navigational aides. Provide government estimates for repair\/ replacement of damaged, lost or lifecycle replacement equipment. Provide resources for On-Condition Cyclic Maintenance (OCCM) for marine vessels."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.92"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.92"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources for the maintenance of all 6 aircraft, 17 marine vessels, heavy equipment, non-tactical and tactical equipment, construction equipment; base operations equipment and marine navigational aides. Provide government estimates for repair\/ replacement of damaged, lost or lifecycle replacement equipment. Provide resources for On-Condition Cyclic Maintenance (OCCM) for marine vessels."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Realigned resources to align with expected contract execution (see Municipal Services, Installation Command and Management, Supply Logistics and Transportation Services) as well as revert to routine vs scheduled maintenance\/overhaul"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Municipal Services"
                                    },
                                    "Description": {
                                        "val": "Provides for municipal services including grounds maintenance, custodial, pest management, solid waste or refuse handling operations, pavement clearance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.959"
                                            },
                                            "Text": {
                                                "val": "Provide necessary\/routine municipal services to the Installation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.865"
                                            },
                                            "Text": {
                                                "val": "Will provide necessary\/routine municipal services to the Installation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.932"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.932"
                                            },
                                            "Text": {
                                                "val": "Will provide necessary\/routine municipal services to the Installation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Programmatic Economic Increase"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Installation Command and Management"
                                    },
                                    "Description": {
                                        "val": "Provides for a K-12 school system, medical\/dental services, and Base Support Contract overhead fees. Additionally, supports offices of the Commander, Staff Judge Advocate (SJA), Chaplain, Public Affairs (PA), and Safety Office. Supports civilian pay and benefits, training, duty travel, Permanent Change of Station (PCS) costs, equipment, and contractual services for installation command and management activities. Kwajalein Medical\/Dental services provide family practice and emergency services at Kwajalein (2-5 days for MEDEVAC support to Honolulu), a secondary clinic on Roi-Namur, and a dental clinic. Support includes but is not limited to medical lab and imaging services, pharmacy services, basic dental services, and all medical functions including inspections of medical facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "31.284"
                                            },
                                            "Text": {
                                                "val": "Provide Installation Command and Management across 11 islands\/defense sites to a population of over 100 Active Duty Military and Department of the Army civilians & 1100 contractors and their family members. Plan, organize, staff, direct, and control all aspects of installation and command management."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.842"
                                            },
                                            "Text": {
                                                "val": "Provide Installation Command and Management across 11 islands\/defense sites to a population of over 100 Active Duty Military and Department of the Army civilians & 1100 contractors and their family members. Plan, organize, staff, direct, and control all aspects of installation and command management."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "33.813"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "33.813"
                                            },
                                            "Text": {
                                                "val": "Provide Installation Command and Management across 11 islands\/defense sites to a population of over 100 Active Duty Military and Department of the Army civilians & 1100 contractors and their family members. Plan, organize, staff, direct, and control all aspects of installation and command management."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Realigned resources to align with expected contract execution (see Municipal Services, Installation Command and Management, Supply Logistics and Transportation Services)"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Personnel Services Delivery"
                                    },
                                    "Description": {
                                        "val": "Provides a human resource specialist responsible for providing all aspects of human resource management, administrative, and counsel to the Garrison Staff."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.117"
                                            },
                                            "Text": {
                                                "val": "Continue to provide human resource support to the Garrison Staff."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.121"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.121"
                                            },
                                            "Text": {
                                                "val": "Continue to provide human resource support to the Garrison Staff."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Programmatic Economic Increase"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physical Security Matters"
                                    },
                                    "Description": {
                                        "val": "Provides resources for physical security programs and equipment to support Army installations and facilities requirements. Procures, installs, maintains and\/or leases physical security equipment to include, but not limited to barriers; blast mitigation devices; communication systems; explosive detection devices; intrusion detection systems and devices; sensors; site improvements; management\/planning; and security forces and technicians. Funds contract security guards including military working dog management and equipping the installation with explosive and drug detection dog capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.902"
                                            },
                                            "Text": {
                                                "val": "Continue to provide the necessary physical security procedures and materials to ensure USAG-KA maintains all proper security measures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.5"
                                            },
                                            "Text": {
                                                "val": "Continue to provide the necessary physical security procedures and materials to ensure USAG-KA maintains all proper security measures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.669"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.669"
                                            },
                                            "Text": {
                                                "val": "Continue to provide the necessary physical security procedures and materials to ensure USAG-KA maintains all proper security measures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Programmatic Economic Increases"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Security Programs"
                                    },
                                    "Description": {
                                        "val": "Funds Army Command security activities supporting: Information Security, Personnel Security, Industrial Security, Communications Security (COMSEC) Policy, Security Education, Training and Awareness (SETA), Special Access Program (SAP) Security, Sensitive Compartmented Information (SCI) Security, Foreign Disclosure, and Technology Protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.15"
                                            },
                                            "Text": {
                                                "val": "Continue to provide the necessary security procedures and materials to ensure USAGKA maintains all proper security measures to ensure successful missions continue on USAGKA."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.119"
                                            },
                                            "Text": {
                                                "val": "Continue to provide the necessary security procedures and materials to ensure USAGKA maintains all proper security measures to ensure successful missions continue on USAGKA."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.122"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.122"
                                            },
                                            "Text": {
                                                "val": "Continue to provide the necessary security procedures and materials to ensure USAGKA maintains all proper security measures to ensure successful missions continue on USAGKA."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Programmatic Economic Increases"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Supply Logistics"
                                    },
                                    "Description": {
                                        "val": "Provides supply operations which support: ammunition supply point services, bulk petroleum operations, marine and aviation assets, Army tenants, operation of a central receiving point and\/or Installation Supply Support Activity (SSA) for goods delivered to the installation, management of non-deployable installation property, and receipt, storage, issue, reutilization and tracking of hazardous materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.73"
                                            },
                                            "Text": {
                                                "val": "Continue to provided resources for property accountability of all GFE\/CAP, reutilization items, Military Standard Requisitioning and Use Procedures ordering and delivery to multiple outer islands. Dispose of obsolete items in accordance with Army equipment disposition procedures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.134"
                                            },
                                            "Text": {
                                                "val": "Continue to provided resources for property accountability of all GFE\/CAP, reutilization items, Military Standard Requisitioning and Use Procedures ordering and delivery to multiple outer islands. Dispose of obsolete items in accordance with Army equipment disposition procedures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.195"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.195"
                                            },
                                            "Text": {
                                                "val": "Continue to provided resources for property accountability of all GFE\/CAP, reutilization items, Military Standard Requisitioning and Use Procedures ordering and delivery to multiple outer islands. Dispose of obsolete items in accordance with Army equipment disposition procedures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Realigned resources to align with expected contract execution (see Municipal Services, Installation Command and Management, Supply Logistics and Transportation Services)"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Transportation Services"
                                    },
                                    "Description": {
                                        "val": "Provides the operation of installation transportation offices, transportation motor pools, and cost of rolling stock; also includes movement of privately-owned household goods of military personnel (and civilian personnel in overseas areas) in connection with assignment, reassignment, or termination of government-furnished family housing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.492"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources for the operation of all transportation services to include 6 aircraft, 17 marine vessels, and over 200 pieces of rolling stock. Operate a centralized motor pool. Fund operations for movement of all international and intra atoll air and surface cargo to include mission critical equipment and supplies, household goods, HAZMAT, United States Postal Service (USPS) mail, medical, and food items. Safely ferry over 48,000 mission critical employees per month within the atoll on various USAGKA marine assets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.925"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources for the operation of all transportation services to include 6 aircraft, 17 marine vessels, and over 200 pieces of rolling stock. Operate a centralized motor pool. Fund operations for movement of all international and intra atoll air and surface cargo to include mission critical equipment and supplies, household goods, HAZMAT, United States Postal Service (USPS) mail, medical, and food items. Safely ferry over 48,000 mission critical employees per month within the atoll on various USAGKA marine assets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.015"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.015"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources for the operation of all transportation services to include 6 aircraft, 17 marine vessels, and over 200 pieces of rolling stock. Operate a centralized motor pool. Fund operations for movement of all international and intra atoll air and surface cargo to include mission critical equipment and supplies, household goods, HAZMAT, United States Postal Service (USPS) mail, medical, and food items. Safely ferry over 48,000 mission critical employees per month within the atoll on various USAGKA marine assets."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Realigned resources to align with expected contract execution (see Municipal Services, Installation Command and Management, Supply Logistics and Transportation Services)"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Utilities"
                                    },
                                    "Description": {
                                        "val": "Provides utility services - production and distribution of utilities including expenses for electricity, steam, hot water, fuels and other utilities, and operation of electrical, air conditioning, refrigeration, water distribution, and wastewater collection and treatment plants and systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.94"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources including fuel to operate and maintain seven Power generation and distribution systems on Kwajalein; nine on Roi, five on Meck, and eleven total on the outer islands of Carlos, Gagan, Illeginni, and Legan, distributing over 7.5 Million kilowatt hours \/ month. Operate, maintain, and repair all prime power plants, distribution systems, and ancillary equipment and related systems, including fixed and portable auxiliary generators. Provide reliable power during mission windows. Develop and implement a maintenance plan which includes operator maintenance, predictive maintenance, Program Management (PM), cyclical, and recurring maintenance, as well as periodic equipment and systems overhauls for all power production systems. Provide appropriate staff to operate power plants 24 hours a day. Operate and maintain potable and non-potable water production & distribution systems. Operate and maintain wastewater treatment plant water systems and storage including equipment. Distribute water to a population of approximately 1400 people consuming over 5.3 million gallons of water per month. Operate all wastewater treatment plants and equipment, collection and distribution systems, and all ancillary equipment and other related systems, including septic tanks. Develop, implement, and manage a waste management program including collection, incineration, landfill, compost, and recycling facilities. Provide preventative, cyclical and recurring, and unscheduled maintenance and repair of the Incinerator and all ancillary equipment and systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.902"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources including fuel to operate and maintain seven Power generation and distribution systems on Kwajalein; nine on Roi, five on Meck, and eleven total on the outer islands of Carlos, Gagan, Illeginni, and Legan, distributing over 7.5 Million kilowatt hours \/ month. Operate, maintain, and repair all prime power plants, distribution systems, and ancillary equipment and related systems, including fixed and portable auxiliary generators. Provide reliable power during mission windows. Develop and implement a maintenance plan which includes operator maintenance, predictive maintenance, Program Management (PM), cyclical, and recurring maintenance, as well as periodic equipment and systems overhauls for all power production systems. Provide appropriate staff to operate power plants 24 hours a day. Operate and maintain potable and non-potable water production & distribution systems. Operate and maintain wastewater treatment plant water systems and storage including equipment. Distribute water to a population of approximately 1400 people consuming over 5.3 million gallons of water per month. Operate all wastewater treatment plants and equipment, collection and distribution systems, and all ancillary equipment and other related systems, including septic tanks. Develop, implement, and manage a waste management program including collection, incineration, landfill, compost, and recycling facilities. Provide preventative, cyclical and recurring, and unscheduled maintenance and repair of the Incinerator and all ancillary equipment and systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.534"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.534"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources including fuel to operate and maintain seven Power generation and distribution systems on Kwajalein; nine on Roi, five on Meck, and eleven total on the outer islands of Carlos, Gagan, Illeginni, and Legan, distributing over 7.5 Million kilowatt hours \/ month. Operate, maintain, and repair all prime power plants, distribution systems, and ancillary equipment and related systems, including fixed and portable auxiliary generators. Provide reliable power during mission windows. Develop and implement a maintenance plan which includes operator maintenance, predictive maintenance, Program Management (PM), cyclical, and recurring maintenance, as well as periodic equipment and systems overhauls for all power production systems. Provide appropriate staff to operate power plants 24 hours a day. Operate and maintain potable and non-potable water production & distribution systems. Operate and maintain wastewater treatment plant water systems and storage including equipment. Distribute water to a population of approximately 1400 people consuming over 5.3 million gallons of water per month. Operate all wastewater treatment plants and equipment, collection and distribution systems, and all ancillary equipment and other related systems, including septic tanks. Develop, implement, and manage a waste management program including collection, incineration, landfill, compost, and recycling facilities. Provide preventative, cyclical and recurring, and unscheduled maintenance and repair of the Incinerator and all ancillary equipment and systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Programmatic Economic Increases"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Quality"
                                    },
                                    "Description": {
                                        "val": "Provides manpower and funding necessary to achieve, evaluate, and sustain compliance with appropriate Compact of Free Association, national, and USAKA Environmental Standards, Executive Orders, DoD Directives, regulations, and overseas country-specific. Final Governing Standards, in order to protect human health and safety and reduce total cost to the Army through environmental compliance, conservation, and pollution prevention. Enables installations to comply with legal environmental mandates and critical stewardship responsibilities that impact management and modernization of installations, while sustaining natural and cultural resources in a manner that provides continued access and long-term use of training lands to support the Army's installation missions. Also includes costs associated with Range Military Construction (MILCON) to address one-time mitigation actions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.388"
                                            },
                                            "Text": {
                                                "val": "Provide necessary\/routine environmental quality services to the Installation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.077"
                                            },
                                            "Text": {
                                                "val": "Will provide necessary\/routine environmental quality services to the Installation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.149"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.149"
                                            },
                                            "Text": {
                                                "val": "Will provide necessary\/routine environmental quality services to the Installation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Programmatic Economic Increases"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Terrorism (AT)"
                                    },
                                    "Description": {
                                        "val": "Funds the Army Antiterrorism program, a defensive program to protect against Terrorism. Supports the following: Antiterrorism installation and mission requirements: Combatant Commands (COCOM) Antiterrorism requirements (Army as Executive Agent (EA)), Antiterrorism Program Management, Antiterrorism Training and Awareness efforts (Area of Responsibility (AOR) specific, Level I Antiterrorism Awareness Training, Level II Antiterrorism Officers Training, Level III Pre-command training, and Level IV Antiterrorism Executive Seminar), protection of High Risk Personnel (HRP) to include support requirements (equipment), execution of Antiterrorism Assessments (Terrorism Vulnerability Assessments, Special Event Assessments, Pre-deployment Vulnerability Assessments, and Comprehensive Antiterrorism Reviews) designed to identify and fix protection vulnerabilities that will protect personnel and facilities from terrorist acts, intelligence support to Army Antiterrorism, conduct annual Antiterrorism Exercises designed to execute Antiterrorism plans, and the implementation of the Random Antiterrorism Measures Program (RAMP) and the Force Protection Condition (FPCON) system."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.21"
                                            },
                                            "Text": {
                                                "val": "Will provide antiterrorism programs. Will provide personnel with the necessary training and identify high risk individuals when appropriate. Will continue to identify and update vulnerabilities to our facilities and put protective measures in place to reduce risks to mission."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.217"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.217"
                                            },
                                            "Text": {
                                                "val": "Will provide antiterrorism programs. Will provide personnel with the necessary training and identify high risk individuals when appropriate. Will continue to identify and update vulnerabilities to our facilities and put protective measures in place to reduce risks to mission."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Programmatic Economic Increases"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DW9"
                    },
                    "ProjectTitle": {
                        "val": "Army Kwajalein Atoll Restoration And Modernization"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "68.513"
                        },
                        "CurrentYear": {
                            "val": "57.887"
                        },
                        "BudgetYearOne": {
                            "val": "49.312"
                        },
                        "BudgetYearOneBase": {
                            "val": "49.312"
                        },
                        "BudgetYearTwo": {
                            "val": "46.995"
                        },
                        "BudgetYearThree": {
                            "val": "47.923"
                        },
                        "BudgetYearFour": {
                            "val": "48.402"
                        },
                        "BudgetYearFive": {
                            "val": "48.407"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "367.439"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds the restoration and modernization of United States (U.S.) Army Kwajalein Atoll (USAKA) degraded infrastructure (Real Property\/facilities) to working condition and upgrades facilities to meet current standards. Restoration consists of repair and replacement work to fix facilities degraded due to the effects of aging and previously deferred sustainment. Modernization supports upgrade of facilities to meet current codes, accommodate new functions, and\/or replace building components that exceed the overall service life of the facilities.\n\nFiscal Year (FY) 2020 funds will continue to provide resources in support of a Headquarters, Department of the Army (HQDA)-approved 15-year investment plan. Funds focus on Phase II of the Bucholz Army Airfield runway repair. Efforts will include repairing 1000 feet on both ends of the runway down to subgrade, resurfacing the center section of runway, and repairing aged and deteriorating airfield pavements to include airfield lighting and back up generator."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Recapitalization Deficit R&M"
                                    },
                                    "Description": {
                                        "val": "Provides facility restoration for facilities not specifically aligned to specified Facility Investment Strategy focus areas. Funds facilities quality improvement required to achieve elimination of Q4\/Q3 Installation Status Report (ISR) rated facilities. In addition to major renovation costs, facility costs include project tails in accordance with AR 420-1 for: National Environmental Policy Act (NEPA) compliance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "68.513"
                                            },
                                            "Text": {
                                                "val": "Continuing to provide (2nd year) resources against the HQDA-approved 15-year investment plan, focusing on Phase II of the Bucholz Army Airfield runway. Efforts include repairing 1000 feet on both ends of the runway down to subgrade, resurfacing center section of runway, and repairing aged and deteriorating airfield pavements to include airfield lighting and back up generator."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "57.887"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide (3rd year) resources against the HQDA-approved 15-year investment plan, focusing on completion of Phase II of the Bucholz Army Airfield runway, including repair of 1000 feet on both ends of the runway down to subgrade, resurfacing center section of runway, and repairing aged and deteriorating airfield pavements to include airfield lighting and back up generator."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "49.312"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "49.312"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide resources against the HQDA-approved 15-year investment plan, focusing on completion of Phase II of the Bucholz Army Airfield runway, including repair of 1000 feet on both ends of the runway down to subgrade, resurfacing center section of runway, and repairing aged and deteriorating airfield pavements to include airfield lighting and back up generator."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease represents programmed decrease in 15 year airfield investment plan begun in FY18.  First 3 years (FY18-20) required a higher initial investment than 21+ steady state for remainder of plan."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DX2"
                    },
                    "ProjectTitle": {
                        "val": "Army Kwajalein Test Ranges and Mission Support"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.282"
                        },
                        "CurrentYear": {
                            "val": "10.811"
                        },
                        "BudgetYearOne": {
                            "val": "11.519"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.519"
                        },
                        "BudgetYearTwo": {
                            "val": "11.674"
                        },
                        "BudgetYearThree": {
                            "val": "11.702"
                        },
                        "BudgetYearFour": {
                            "val": "11.826"
                        },
                        "BudgetYearFive": {
                            "val": "11.948"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "79.762"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds Network Enterprise Technology Command (NETCOM) installation management-related Command, Control, Communications, Computers, and Information Management (C4IM) services at Army Kwajalein Test Ranges. NETCOM utilizes this Project to provide civilian pay, manpower service contracts, supporting Information technology (IT) equipment, and associated costs specifically identified and measurable to plan, manage, coordinate, and execute Information Technology Services Management at Army Kwajalein Test Ranges. Project provides C4IM services in accordance with the Department of Army Pamphlet (DA PAM) PAM 25-1-1 and the Army C4IM Services List. Provides Base Communications Support (Service 701), Visual Information (Service 702), Information Assurance (Service 703), and Automation (Service 700). Includes the delivery of services consisting of secure and non-secure fixed voice communications, wireless voice, data and video connectivity services, and studio video conferencing services. Provides infrastructure support, including the design, installation, and maintenance of special circuits\/systems in support of life safety\/security systems and monitoring\/control systems. Provides Collaboration and Messaging Services including services and tools for workforce to communicate and share information. Provides Application and Web-hosting including operation and management services required to support web and application hosting. Provides Desktop Management Support including management and support for end-user hardware and software services and tools. Includes Service Desk Support, Continuity of Operations, and Disaster Recovery support."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Contractor Support (C4IM Services)"
                                    },
                                    "Description": {
                                        "val": "The Contractor shall provide non-personnel IT support to the 30th Signal Battalion NEC on Kwajalein Atoll. The NEC?s IT environment includes any hardware, software, application, tool, system, or network used by the Government, whether developed, leased, or commercially purchased.  Although this is a level of effort service contract, there are currently 74 contractors supporting this capability at Kwajalein.  The contract covers supply and small equipment replacement that are needed to perform C4IM services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.609"
                                            },
                                            "Text": {
                                                "val": "Provide Department of Army civilian pay, manpower service contracts, supporting IT equipment, and associated costs specifically identified and measurable to plan, manage, coordinate, and execute Information Technology Services Management. Provide Command, C4IM services in accordance with the DA PAM 25-1-1 and the Army C4IM Services List. Provide Base Communications Support (Service 701), Visual Information (Service 702), Information Assurance (Service 703), and Automation (Service 700). Delivery services consisting of secure and non-secure fixed voice communications, wireless voice, data and video connectivity services, and studio video conferencing services. Provide infrastructure support, including the design, installation, and maintenance of special circuits\/systems in support of life safety\/security systems and monitoring\/control systems. Provide Collaboration and Messaging Services including services and tools for workforce to communicate and share information. Provide Application and Web-hosting including operation and management services required to support web and application hosting. Provide Desktop Management Support including management and support for end-user hardware and software services and tools, to include Service Desk Support, Continuity of Operations, and Disaster Recovery support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.092"
                                            },
                                            "Text": {
                                                "val": "Work will include current and new systems at various lifecycle stages, and any future applications and systems not currently identified in this PWS. The 30th Signal Battalion NEC requires support for unclassified and classified networked systems located throughout Kwajalein Atoll, including the islands of Kwajalein, Roi-Namur, Gagan, Omleck, Meck, Carlos, Legan, and Illeginni. Currently, the 30th Signal Battalion NEC supports approximately 2,000 users, computers, and notebooks with about 20 servers, both physical and virtual.   \n\nProvide Command, C4IM services in accordance with the DA PAM 25-1-1 and the Army C4IM Services List. Provide Base Communications Support (Service 701), Visual Information (Service 702), Information Assurance (Service 703), and Automation (Service 700). Delivery services consisting of secure and non-secure fixed voice communications, wireless voice, data and video connectivity services, and studio video conferencing services. Provide infrastructure support, including the design, installation, and maintenance of special circuits\/systems in support of life safety\/security systems and monitoring\/control systems. Provide Collaboration and Messaging Services including services and tools for workforce to communicate and share information. Provide Application and Web-hosting including operation and management services required to support web and application hosting. Provide Desktop Management Support including management and support for end-user hardware and software services and tools, to include Service Desk Support, Continuity of Operations, and Disaster Recovery support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.791"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.791"
                                            },
                                            "Text": {
                                                "val": "Work shall include current and new systems at various lifecycle stages, and any future applications and systems not currently identified in this PWS. The 30th Signal Battalion NEC requires support for unclassified and classified networked systems located throughout Kwajalein Atoll, including the islands of Kwajalein, Roi-Namur, Gagan, Omleck, Meck, Carlos, Legan, and Illeginni. Currently, the 30th Signal Battalion NEC supports approximately 2,000 users, computers, and notebooks with about 20 servers, both physical and virtual.  \n\nProvide Command, C4IM services in accordance with the DA PAM 25-1-1 and the Army C4IM Services List. Provide Base Communications Support (Service 701), Visual Information (Service 702), Information Assurance (Service 703), and Automation (Service 700). Delivery services consisting of secure and non-secure fixed voice communications, wireless voice, data and video connectivity services, and studio video conferencing services. Provide infrastructure support, including the design, installation, and maintenance of special circuits\/systems in support of life safety\/security systems and monitoring\/control systems. Provide Collaboration and Messaging Services including services and tools for workforce to communicate and share information. Provide Application and Web-hosting including operation and management services required to support web and application hosting. Provide Desktop Management Support including management and support for end-user hardware and software services and tools, to include Service Desk Support, Continuity of Operations, and Disaster Recovery support."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Economic adjustments for expected inflation rate. Civilian pay rate adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Civilian Pay"
                                    },
                                    "Description": {
                                        "val": "Civilian Pay"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.233"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.279"
                                            },
                                            "Text": {
                                                "val": "The 2 civilians do a multitude of things from Site manager, COR, manages and performs Enterprise Information Technology (IT) Customer Services. Coordinates all aspects of effective Service Desk, Break Fix, Network Management, Systems Administration and Engineering, Project Management, Software Engineering, Video Teleconferencing, Information Management Officer (IMO) Support, Information Assurance, Telecommunications, and IT Logistics.  Also responsible for incident management, problem management, availability management, configuration management, and change management.  The positions are responsible for all inherently government functions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.288"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.288"
                                            },
                                            "Text": {
                                                "val": "The two civilians will continue to perform duties such as Site manager, COR, manages and performs Enterprise Information Technology (IT) Customer Services. Coordinates all aspects of effective Service Desk, Break Fix, Network Management, Systems Administration and Engineering, Project Management, Software Engineering, Video Teleconferencing, Information Management Officer (IMO) Support, Information Assurance, Telecommunications, and IT Logistics.  Also responsible for incident management, problem management, availability management, configuration management, and change management.  The positions are responsible for all inherently government functions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Breaking out the original total to show the details of the $11.5M.  The only increase would be due to the CEAC rate."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ISSA (Installation Service Support Agreement)"
                                    },
                                    "Description": {
                                        "val": "ISSA with Garrison to provide all services that would normally be provided by the home station and other services specific to Kwajalein."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.44"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.44"
                                            },
                                            "Text": {
                                                "val": "Pay Garrison to provide housing, food support, etc."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.44"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.44"
                                            },
                                            "Text": {
                                                "val": "Pay Garrison to provide housing, food support, etc."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}