{
    "id": "2021-DefenseLogisticsAgency-PB-0400-JBOOK-916c2fa4c10502bc2b01f3613011e18e870b4d56a51ab8963df214c7d7bbf945-0",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-DLA-U_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603680S"
        },
        "ProgramElementTitle": {
            "val": "Manufacturing Technology Program (ManTech)"
        },
        "R1LineNumber": {
            "val": "50"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "58.826"
            },
            "PriorYear": {
                "val": "62.396"
            },
            "CurrentYear": {
                "val": "51.002"
            },
            "BudgetYearOne": {
                "val": "40.025"
            },
            "BudgetYearOneBase": {
                "val": "40.025"
            },
            "BudgetYearTwo": {
                "val": "40.029"
            },
            "BudgetYearThree": {
                "val": "41.465"
            },
            "BudgetYearFour": {
                "val": "42.480"
            },
            "BudgetYearFive": {
                "val": "43.457"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Logistics Agency (DLA) Manufacturing Technology (ManTech) Program funds the advanced technology development needed to achieve a responsive, efficient domestic industrial base that meets the warfighters' needs in an affordable and timely manner.  The ManTech program works with DLA’s diverse supply chains to improve manufacturing capability throughout a product's life cycle.  It provides the crucial link between invention and application by maturing, scaling up, and validating advanced manufacturing technology in “real world” environments.  ManTech developments provide a path to low-risk technology implementation for many small businesses and defense unique suppliers as well as depots and shipyards that are critical to DLA.  By anticipating and addressing production and sustainment problems before they occur, readiness levels increase and sustainment costs are lower.  \n\nDLA ManTech is aligned into three Strategic Focus Areas (SFA): 1) Improving Industrial Base Manufacturing Processes (IIBM); 2) Maintaining Viable Sources of Supply (MVSS); and 3) Improving Technical and Logistics Information (ITLI).  \n\n• The IIBM SFA includes efforts to reduce industrial base material costs and production lead-times, while improving the quality of DLA managed products.  This SFA has supply chain focused execution portfolios for food (Subsistence Network), Castings (Procurement Readiness Optimization—Advanced Casting Technology), Forgings (Procurement Readiness Optimization—Forging Advance System Technology), Batteries (Battery Network) and Additive Manufacturing.\n\n• MVSS includes efforts to assure the commercial industrial base can satisfy DLA materiel requirements without relying on foreign sources for microcircuits.  This strategic focus area mitigates supply issues caused by the lack of a reliable domestic manufacturing capability to produce products or raw materials needed to build and maintain weapon systems.  The major focus of the program is maintaining a reliable, trusted, domestic source for “non-procurable” linear and digital microcircuits.  Microcircuit emulation allows the Services to save significant costs by using form, fit and functionally equivalent spare parts rather than redesigning the next-higher-assembly.\n\n• The ITLI SFA includes efforts to improve and facilitate the exchange of engineering and logistics information among DLA, the Military Services, DLA industry partners and DLA customers.  It includes the Military Unique Sustainment Technology (MUST) and the Defense Logistics Information Research (DLIR) programs.  A primary focus of this SFA is to capitalize on the emerging “Model Based Enterprise” paradigm and the semantic web as an enabler to a logistics system that is smart and connected up and down the supply chain and across all DLA Customers and suppliers.  A major focus is to transform DoD engineering data from two-dimensional paper-based products to three-dimensional computer based models, and to develop processes to move from “electronic paper” (i.e. PDF files) to technical data files that can interface directly with industries’ engineering systems. The benefits include shorter product introduction cycles, lower set up-costs for parts production and more economical small batch production.\n\nDLA’s focus for this budget cycle highlights advanced capabilities in digital and technical data modernization, management and analytics to fulfill the DLA role in the DOD Digital Engineering Strategy and improve sharing of data with the industrial base and supported organizations. Investment explores technologies to lower the Agency’s material acquisition and operations costs and improve weapons systems support.  This effort spans across both DLA R&D Program Elements and multiple Strategic Focus Areas, impacting across the DOD Joint Defense Manufacturing Technology Panel and DLA Enterprise logistics processes."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "62.396"
                },
                "CurrentYear": {
                    "val": "42.834"
                },
                "BudgetYearOne": {
                    "val": "43.045"
                },
                "BudgetYearOneBase": {
                    "val": "43.045"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "62.396"
                },
                "CurrentYear": {
                    "val": "51.002"
                },
                "BudgetYearOne": {
                    "val": "40.025"
                },
                "BudgetYearOneBase": {
                    "val": "40.025"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "8.168"
                },
                "BudgetYearOne": {
                    "val": "-3.020"
                },
                "BudgetYearOneBase": {
                    "val": "-3.020"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "10.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "CurrentYear": {
                        "val": "-1.832"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Inflation for Civilian Pay"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.027"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.027"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Inflation for Non-Pay\/Non-Fuel Purchases"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.037"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.037"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Defense Wide Review Reduction"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.280"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.280"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Internal Realignment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.730"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.730"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY2020, increased baseline by $10.000 million for program increase steel performance initiative in Castings.\nFY2020, Small Business Innovation Research and Small Technology Transfer Research tax amounted to $1.832 million.\nFY2021, internal realignment decreased program baseline by $0.730 million for critical Defense Property Accountability System redesign and upgrade requirements.\nThe FY 2021 funding request was reduced by $2.280 million during the Defense-Wide Review to free up resources for higher priority Department needs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "IBMP"
                    },
                    "ProjectTitle": {
                        "val": "Improving Industrial Base Manufacturing Processes (formerly Material Availability)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "26.544"
                        },
                        "PriorYear": {
                            "val": "30.637"
                        },
                        "CurrentYear": {
                            "val": "28.572"
                        },
                        "BudgetYearOne": {
                            "val": "17.205"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.205"
                        },
                        "BudgetYearTwo": {
                            "val": "16.796"
                        },
                        "BudgetYearThree": {
                            "val": "17.194"
                        },
                        "BudgetYearFour": {
                            "val": "17.306"
                        },
                        "BudgetYearFive": {
                            "val": "17.724"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Improving Industrial Base Manufacturing Processes Strategic Focus Area (SFA) is an R&D effort undertaken with DLA’s suppliers to reduce material costs, reduce the length and variability of production lead-times, assure DLA managed products meet performance requirements, and continuously improve quality and reliability.  Benefits of this SFA include lower material costs, lower inventory levels and more predictable customer wait times, fewer quality deficiencies, and lower customer support costs.  This SFA includes within its scope the Subsistence Network, the Battery Network, the Castings\/Forging programs and Additive Manufacturing programs. \n\nThe Subsistence Network (SUBNET) program is the successor to the Combat Rations Network R&D program. SUBNET focuses on solutions to develop and promote manufacturing improvements in the subsistence supply chain.  The program's expanded areas of interest include: combat rations, food equipment, field feeding solutions, food footprint, food innovations, food safety and defense developments, garrison feeding, nutrition and health, storage and packing solutions, surge and sustainment support, and water security.  SUBNET forms a community of practice with Military Services, U.S. Department of Agriculture, Natick Soldier Research Development, and Engineering Center; Academia, and Industry to research and promote manufacturing improvements in the Subsistence Supply Chain with the goals of maximizing capability and capacity to produce, and to encourage innovation and modernization needed to leverage the latest technologies.  Desired outcomes include: reduced cost, increased efficiencies, improved processes, enhanced quality, and improved surge demand capabilities.\n\nThe Casting program works to ensure a stable, reliable, and competitive domestic casting industrial base supporting the weapon system needs of the Department of Defense (DoD) and the Defense Logistics Agency (DLA).  The casting program works with industry, universities, and the Casting Industry Associations to identify projects that improve the materials, processes and business practices of the nation’s foundry industry.  The program aligns projects with strategic issues and identified focus areas within the DLA and DoD. Guidance for these projects comes from the DLA Strategic Plan and input from the casting industry.  Weapon system spare parts managed by DLA that contain castings are responsible for a disproportionate share of DLA’s backorders or unfilled orders (UFOs).  Cast parts are ~2% of National Stock Numbered Class IX parts but represent ~5% of all backorders, and when only the oldest backorders are considered, up to 10% are castings.  This program includes tasks that focus on developing new capabilities in the areas of inspection, materials, processes, modeling, and design. Once developed, these capabilities will support the foundry industry, where the technologies will be tested and implemented, most often in conjunction with the casting industry associations.  These advancements improve the metal casting supply chains for the DoD and the DLA to better support the warfighter.  We will invest in projects aimed at reducing lead-time, reducing cost, and improving quality of castings critical to DoD weapon systems.\n\nThe Forging program works to ensure a stable, reliable, and competitive domestic forging industrial base for the weapon system needs of the Department of Defense (DoD) and the Defense Logistics Agency (DLA).  Working with industry, universities, and the Forging Industry Associations to identify projects that improve the materials, processes and business practices of the nation’s forging industry.  The program aligns its projects with strategic issues and focus areas identified within the DLA and DoD.  Guidance for these projects comes from the DLA Strategic Plan and input from the forging industry.  Weapon system spare parts managed by DLA that contain Forgings are responsible for a disproportionate share of DLA’s backorders or unfilled orders (UFOs).  Forged parts are ~2% of National Stock Number (NSN) Class IX parts but represent ~5% of all backorders, and when only the oldest backorders are considered, up to 10% are forgings.  This program includes tasks to develop new capabilities in the areas of inspection, materials, processes, modeling, and design. Once developed these capabilities will support the forging industry, where these technologies will be tested and implemented in conjunction with the forging industry associations.  These advancements improve the forging supply chains for the DoD and the DLA to better support the warfighter.  We will invest in projects aimed at reducing lead-time, reducing cost, and improving quality of forgings critical to DoD weapon systems.\n\nThe Battery Network (BATTNET) program objective is to develop the next generation of battery manufacturing technologies for cost and price efficiency, longer shelf life, and lighter batteries with higher energy.  BATTNET conducts R&D initiatives to address sustainment gaps and bridge technical solutions into higher a Manufacturing Readiness Level (MRL) for specific groups of batteries.  BATTNET also focuses on projects to develop the production capability for advanced lithium-based non-rechargeable and rechargeable batteries to ensure the prompt and sustained availability, quality, and affordability of Service approved batteries.  Desired outcomes include: streamlined inventory and associated cost reductions through standardization and improved distribution practices; resolved obsolescence issues; addressed surge and sustainment issues; enhanced security of supply chain; increased competition and manufacturing base; reduced per unit battery cost; and leveraged Service-level (Army, Navy, Air Force) and other governmental (DOE, DOT, NASA) R&D efforts to insert new technology and practices into the existing DLA battery inventory.\n\nThe Additive Manufacturing (AM) program objective is to establish AM as an effective alternative to conventional manufacturing and document the process for AM benefits.  DLA is pursing all AM technology as a lead-time and inventory reduction enabler.  The AM effort pursues alternate means of supply for products that are otherwise non-procurable or susceptible to procurement issues due to an unresponsive manufacturing vendor base.  The AM effort includes the identification of AM candidates among the population of products that are needed but hard to obtain, costly or have long manufacturing lead times.  The AM effort requires management of 3D digital technical and manufacturing data. In addition, the AM effort includes the development of the processes that will tie the designers, engineers, maintainers, logisticians, procurement managers and the vendor base into a seamless AM procurement stream. Potential benefits include products that can address an unfulfilled Warfighter readiness need by reducing production lead times, production costs, storage costs, transportation costs and in some cases fuel consumption due to lighter design and material options. DLA R&D will leverage these efforts with Industry, Academia and ongoing Military Service-level agreements (Army, Navy, Marine Corps, Air Force), Oak Ridge National Laboratory (ORNL) and the Department of Energy."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Digital Innovation Design for Reliable Castings Performance"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "This project developed a set of design tools to allow modern engineers to improve casting design.  These design tools are based on modern property measurements and validated by testing, allowing engineers to create cast parts that are reliable, high performance and cost efficient for critical DOD applications."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battery Network for All Solid-State Battery Development"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Focused on the production development and transition of solid-state electrolyte technology for military lithium-ion batteries that demonstrates a significant increase in available energy density and safety, eliminates the need for toxic flammable electrolyte, and reduces the complexity of battery management systems.  Projects enabled improvements to the dismounted warfighter’s capability by reducing battery weight for combat operations, as well as significantly increasing operating time of equipment and weapons systems."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Congressional add to improve steel performance initiative in Castings."
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Conduct projects in Casting to improve steel performance."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Improving Industrial Base Manufacturing Processes (formerly Material Availability)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.637"
                                            },
                                            "Text": {
                                                "val": "The Subsistence Network (SUBNET) program plans to research and execute short-term innovative projects to improve the subsistence supply chain in FY2019, and continue efforts from FY2018. SUBNET will attend subsistence trade and industry events to leverage technology innovations and promote manufacturing improvements. The program will also pursue Small Business Innovation Research (SBIR) topics in Subsistence.  The SUBNET program will work with community partners (military services, industry, and academia) to leverage the latest technologies, encourage innovation and modernization, and promote manufacturing improvements in the subsistence supply chain. The program also plans to collaborate with the Defense Advanced Research Projects Agency on their future projects for synergy and also incorporating them as a potential transition partner.\n\nThe Casting program plans to research, develop and deploy innovative and technical solutions to ensure a viable and competitive domestic industrial base for the DoD and DLA in support of the needs of the warfighter. The program uses competitively awarded contracts to fulfill these requirements; projects are required to include a business case with specific metrics and a transition plan for success. The Casting program works with industry, academia, and the leading Industry Associations to identify improvements to materials, processes, and business practices of the nation’s metal casting industry. The Casting program will continue the execution and monitoring of projects approved and awarded in prior years while maintaining focus on future development and needs. \n\nThe Forging program will investigate, develop and deploy innovative enterprise and technical solutions to strengthen the forging supply chain and the forging industry. The program will explore alternative forging manufacturing methods, materials and modeling to reduce production lead-time and costs. Enhancements to modeling and simulation software coupled with forging process and post-processing improvements are some projects that align the forging program with fulfilling the needs of the warfighter. The Forging program will, with a Broad Agency Announcement (BAA), solicit industry, academia, and industry associations for new projects in alignment with the strategic focus and future needs of the DoD and DLA. \n\nThe Battery Network (BATTNET) program will initiate new projects for improving the production readiness, transition, and standardization of soldier and system batteries within the DLA supply chain. The BATTNET program will also leverage new battery manufacturing technologies for the supply chain that have been developed by industry – advanced electrode production, low cost materials production or recycling, advanced performance cells, and deep-discharge lithium-ion capabilities. The program will continue addressing additional requirements for manufacturing and material improvements in the vacuum electron tube supply base.\n\nThe Additive Manufacturing (AM) program plans to fund technically proficient efforts that accelerate the rapid qualification and certification methodologies for AM items, identify the best AM applications for castings and forging preforms, achieve precise repeatability of part fabrication using an AM technical data package at simultaneous geographic points of need and prove the delivery of AM parts to warfighters deployed at expeditionary sea, land or air bases. Using market research, requests for information\/proposals, BAA, DLA R&D will identify the best courses of action to negotiate technical, testing and intellectual property data for AM fabrication to keep these items competitive. The DLA R&D efforts include the proof of concept of using digital thread methodologies to effectively manage manufacturing data and maintain a consistent AM product from design through qualification and acceptance. Collaboration will continue with the Military Service Engineering Support Activities (via Service-level agreements with the Army, Navy, Marine Corps, Air Force) and the Department of Energy by providing funding for AM work identified under the respective agreements. The partnership with Oak Ridge National Laboratory (ORNL) will allow further options with the Big Area AM (BAAM) family of parts. DLA will leverage Military Services and Industry collaboration to develop digital verification and validation (including measures of effectiveness and key performance parameters) of AM technical data and first article testing for polymers and metals, and critical and non-critical items. These efforts seek to increase the number of AM parts qualified for procurement and achieve savings from the associated lead-time, storage costs, transportation costs, in some cases reduction of fuel consumption due to lighter design and material options."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.572"
                                            },
                                            "Text": {
                                                "val": "The Subsistence Network (SUBNET) program plans to research and execute short-term innovative projects to improve the subsistence supply chain in FY2020 and beyond.  SUBNET will attend subsistence trade and industry events to leverage technology innovations and promote manufacturing improvements, continuing to expand and revise its internal Strategic Program Roadmap based upon the latest food supply chain emerging and technological advancements.  DLA R&D SUBNET is currently researching and testing areas utilizing drones technology, food irradiation and plasma technology for fresh fruits and vegetables shelf-life extension, and block chain use cases in the subsistence supply chain.  SUBNET plans to research and execute projects in FY2020 regarding RFID sensors, cybersecurity, quality assurance processes, phytosanitary requirements, and food waste.  The program will also continue to pursue Small Business Innovation Research (SBIR) topics in Subsistence.  The SUBNET program will work with community partners to leverage the latest technologies, encourage innovation and modernization, and promote manufacturing improvements in the subsistence supply chain.\n\nThe Casting program will complete work for the On-Demand Melting for Small Quantity Castings for die castings and the Digital Radiographic Reference Standards for Copper Alloys projects. We will continue to monitor the existing projects.  These projects focus on improving manufacturing processes and technology that includes robotic and additive manufacturing methods and implementation, new test processes and procedures to evaluate cast materials, computer simulation and modeling to decrease lead-time and increase quality.  The Casting program works with Academia, industry, and industry associations to continually identify future development and technical needs in alignment with the DoD and DLA.\n\nThe Forging program will award contract(s) based on responses to the Broad Agency Announcement (BAA) that is planned for release in late FY19 or early FY20.  The BAA will solicit projects from industry to improve the materials and processes used within the forging industry.  Contract awards are anticipated during the fiscal year.\n\nThe Battery Network (BATTNET) program will initiate new projects for improving the production readiness, transition, and standardization of soldier and system batteries within the DLA supply chain.  Areas of focus will be for critical non-rechargeable soldier batteries, bipolar lead-acid battery capabilities, and lithium-ion formats for aviation batteries.  The program will also continue addressing requirements for manufacturing and material improvements in the low power, vacuum electron tube supply base.\n\nThe Additive Manufacturing (AM) program plans to finance collaborative technical efforts from the military departments, industry, and academic institutions that have the potential to accelerate the qualification, certification and fabrication methodologies for AM applications and create sources of AM supplies or services for DLA.  DLA R&D will support DOD-wide efforts to baseline risk categorization of AM parts and acceptability criteria that will accelerate AM integration into the DOD Supply Chain.  DLA R&D will fund efforts to identify the best methods for converting models and technical drawings that predate Computer-Aided Design and Drafting software into digital format in order to expedite creation of digital models and related design and testing information to help establish and expand the DoD digital library of AM parts to solve issues with obsolescence, low volume, long-lead, costly parts.  These efforts seek to increase the number of AM parts qualified for procurement and achieve savings from the associated lead-time, storage costs, transportation costs, in some cases reduction of fuel consumption due to lighter design and material options.  Desired outcomes include: exploration of improved reverse engineering processes for AM purposes, and optimization of polymer and metal AM production to obtain land, air and sea and expeditionary platform spare parts. Overall DLA Enterprise AM efforts will provide alternatives in product realization in order to address unfulfilled Warfighter readiness needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.205"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.205"
                                            },
                                            "Text": {
                                                "val": "The Subsistence Network (SUBNET) program will continue to research and execute short-term innovative projects to improve the subsistence supply chain. SUBNET will work with community partners (military services, industry, and academia) to leverage the latest innovations. SUBNET plans to research and execute projects in FY2021 regarding mobile distribution facilities around the battlefield, modernization of government subsistence warehouses, assessment of materiel handling capabilities, and integrating robotics into current processes.  The program will also continue to pursue Small Business Innovation Research (SBIR) topics in Subsistence, and collaborate with the Defense Advanced Research Projects Agency on their future projects for synergy and as a potential transition partner.\n\nThe Casting program will on continue to monitor awarded contracts for projects that research, develop and deploy innovative and technical solutions to ensure a viable and competitive domestic industrial base.  These projects focus on improving manufacturing processes and technology that includes robotic and additive manufacturing methods and implementation, new test processes and procedures to evaluate cast materials, computer simulation and modeling to decrease lead-time and increase quality.  The Casting program works with Academia, industry, and industry associations to continually identify future development and technical needs in alignment with the DoD and DLA. \n\nThe Forging program will monitor contracts awarded under the Broad Agency Announcement (BAA) offered in FY20 and award any remaining proposed projects that could be funded.  The projects included in the contracts will focus on exploring alternative forging manufacturing methods, materials to reduce production lead-time and costs, modeling and simulation software improvements and enhancements and improvements to post processing methods.  These projects will be in alignment with the needs of the DoD and DLA aimed and supporting and fulfilling the needs of the warfighter. Forgings baseline was reduced by approximately $0.500 million resulting from overall MANTECH $3.020 million in directed reductions. Impact of the baseline reduction will cause project cancellation or delays in the Forgings program.\n\nThe Battery Network (BATTNET) program will continue new projects for improving the production readiness, transition, and standardization of soldier and system batteries within the DLA supply chain.  The BATTNET program will also leverage new battery manufacturing technologies for the supply chain that have been developed by industry – advanced electrode production, low cost materials production or recycling, advanced performance cells, and deep-discharge lithium-ion capabilities. BATTNET baseline was reduced by approximately $0.500 million resulting from overall MANTECH $3.020 million in directed reductions. Impact of the baseline reduction will cause project cancellation or delays for improvements to warfighter weapon system battery performance and cost.\n\nThe Additive Manufacturing (AM) program, using market research, requests for information\/proposals, Broad Agency Announcements (BAA), DLA R&D will fund analysis of alternatives for the best cognitive computing solutions to integrate information from several logistics, engineering, legal, and supplier data sources into an efficient AM decisional framework.  These augmented analytics efforts will help identify unseen patterns in the utilization of AM resources such as machines, materials, manufacturing expertise, and manufacturing data to shape an efficient AM distributive manufacturing ecosystem.  Desired outcomes include: optimization of polymer and metal AM production to obtain land, air and sea and expeditionary platform spare parts. The Additive Manufacturing (AM) program plans to finance collaborative technical efforts from the military departments, industry, and academic institutions that enhance the customer engagement with the AM product management workflows.  Overall DLA Enterprise AM efforts will identify the best AM applications to achieve precise robustness-repeatability-reproducibility of part fabrication using an AM technical data package in a distributed manufacturing setting and prove the delivery of AM parts to warfighters deployed at the expeditionary sea, land or air bases. AM baseline was reduced by approximately $0.943 million resulting from overall MANTECH $3.020 million in directed reductions. Impact of the baseline reduction will cause project cancellation or delays to support one of the DLA Strategic Imperatives."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Adjustments of $2.130 million in reductions due to DLA Fiscal Guidance reduction, civilian pay inflation, inflation for non-pay\/non-fuel purchases and internal realignment. Reduction impacts: $0.500 million to Forgings; $0.500 million to Battery Network; $0.943 million to Additive Manufacturing Programs."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The DLA R&D program is executed through Delivery Orders placed on Indefinite Delivery\/Indefinite Quantity Contracts that resulted from competitive Broad Agency Announcements and through interagency agreements with the Military Services when it is cost effective and\/or provides some technical advantage, e.g. improves the probability of successful transition. DLA also has a continuously open Broad Agency Announcement for Emerging Technologies."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AAA"
                    },
                    "ProjectTitle": {
                        "val": "Maintaining Viable Supply Sources (formerly High Quality Sources)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "22.076"
                        },
                        "PriorYear": {
                            "val": "26.296"
                        },
                        "CurrentYear": {
                            "val": "17.229"
                        },
                        "BudgetYearOne": {
                            "val": "17.854"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.854"
                        },
                        "BudgetYearTwo": {
                            "val": "18.192"
                        },
                        "BudgetYearThree": {
                            "val": "19.151"
                        },
                        "BudgetYearFour": {
                            "val": "19.232"
                        },
                        "BudgetYearFive": {
                            "val": "19.677"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Maintaining Viable Supply Sources (MVSS) Strategic Focus Area (SFA) consists of projects undertaken to assure that the industrial base can respond to DLA requirements and DLA can fill military customers’ material requirements reliably and consistently.  Benefits include eliminating cancelled requisitions returned to customers as “non-procurable.”  This strategic focus area includes within its scope the Material Acquisition Electronics (MAE) program. \n\nThe Program Roadmap has two major thrusts areas: Digital Microcircuits and Linear\/Analog Microcircuits.  The program has several projects addressing specific classes of obsolescent microcircuit technologies.  Over the past several years, obsolescence in this class of microcircuits has greatly increased and has become a significant concern.  These are classes of microcircuits that are expected to become non-procurable in FY2020 and beyond.  Without the technologies planned on the MAE Roadmap, DLA will not be able to support DoD’s requirements for high quality spare parts for critical electronic systems and subsystems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Maintaining Viable Supply Sources (formerly High Quality Sources)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.296"
                                            },
                                            "Text": {
                                                "val": "MAE will continue planning for the specific emulation technology implementations to support specific device family groups in consonance with Customer and Agency requirements. It will begin digital microcircuit process development at the 250 nanometer technology node including development of electron-beam lithography techniques. MAE will continue a major new thrust in emulation to address Linear Microcircuits in addition to its traditional focus on Digital. Several efforts will address basic design, manufacturing, electrical test and quality\/reliability requirements for establishing a basis for product-oriented developments across the FYDP. MAE will complete and transition 20-Volt operational amplifier emulation capability into full-scale production increasing DLA's ability to re-establish sourcing of non-procurable microcircuit NSNs. MAE will begin 40-Volt operational amplifier and analog switch projects started in FY2018.  It will continue applying 350 nanometer emulation technology to specific part families for additional NSNs including Dual-Port Static Random Access Memory (SRAM).  MAE will continue to explore using Additive Manufacturing techniques for non-semiconductor aspects of microcircuit manufacturing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.229"
                                            },
                                            "Text": {
                                                "val": "MAE will continue planning for the specific emulation technology implementations to support specific device family groups in consonance with Customer and Agency requirements.  It will complete and transition TTL-compatible CMOS digital logic emulation into full scale production.  It will expand process development at the 350 nanometer technology node into % Volt devices and continue process development for Linear\/Analog Microcircuits.  It will begin additional Linear\/Analog emulation projects for types\/groups of parts, prioritized based on customer requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.854"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.854"
                                            },
                                            "Text": {
                                                "val": "MAE will continue planning for the specific emulation technology implementations to support specific device family groups in consonance with Customer and Agency requirements. It will complete and transition its first Linear\/Analog technology, 20 Volt Operational Amplifier, into full scale production.  It will continue development of Additive Manufacturing techniques to address Microcircuit Cases.  It will begin additional Linear\/Analog emulation projects for types\/groups of parts, prioritized based on customer requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No significant change."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The DLA R&D program is executed through Delivery Orders placed on Indefinite Delivery\/Indefinite Quantity Contracts that resulted from competitive Broad Agency Announcements and through interagency agreements with the Military Services when it is cost effective and\/or provides some technical advantage, e.g. improves the probability of successful transition.  DLA also has a continuously open Broad Agency Announcement for Emerging Technologies."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "OOO"
                    },
                    "ProjectTitle": {
                        "val": "Improving Technical and Logistics Information (formerly Industry and Customer Collaboration)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "10.206"
                        },
                        "PriorYear": {
                            "val": "5.463"
                        },
                        "CurrentYear": {
                            "val": "5.201"
                        },
                        "BudgetYearOne": {
                            "val": "4.966"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.966"
                        },
                        "BudgetYearTwo": {
                            "val": "5.041"
                        },
                        "BudgetYearThree": {
                            "val": "5.120"
                        },
                        "BudgetYearFour": {
                            "val": "5.942"
                        },
                        "BudgetYearFive": {
                            "val": "6.056"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Improving Technical and Logistics Information (ITLI) SFA projects improve and facilitate the communication of technical and logistics information among industry, DLA’s military customers and DLA. This SFA includes the Military Unique Sustainment Technology (MUST), the Defense Logistics Information Research (DLIR), and the Emergent Manufacturing Technology (EMT) portfolios within its scope. \n\nThe Military Unique Sustainment Technology (MUST) program’s focus addresses GAO Report 12-707 recommendations for DoD to establish a “knowledge-based approach” to define, communicate, and collaborate on military unique combat uniforms and individual equipment (CUIE) requirements.  DLA has the responsibility to manage the technical requirements among the Services and the Defense Industrial Base. Currently there is no common environment for collaborating on new requirements among the stakeholders.  The strategic objective of the DLA MUST program is to identify, develop and adopt technologies that can significantly shorten the time needed to transition Combat Uniforms and Individual Equipment from development to operational use from years to months.  The Program focuses on technologies that will transform the military CUIE supply chain from an “electronic paper” (i.e. PDF\/MS Word) based manual environment, into a knowledge-based automated environment.  The resulting approach will be a neutral platform that will seamlessly communicate military unique technical requirements throughout the end-to-end supply chain.\n\nThe Defense Logistics Information Research (DLIR) program researches core technology to improve the quality, security, and interoperability of logistics data acquisition and management to enable and streamline DLA operations.  DLA enables transformation of business practices and methodologies as the data for weapons systems evolve from traditional formats and delivery methods (such as two-dimensional images and PDF formats) to newer, more innovative methods (such as three-dimensional solid models, object-oriented databases, service-oriented architecture (SOA) and Web 3C standards).  This transformational shift for DLA is driven by the Model-Based Enterprise (MBE) approach, the way industry is delivering design and development data for weapon systems to the Military Services and the way the Military Services in turn manage and provide the data to DLA. DLA Logistics Operations, DLA Acquisition, DLA Tech\/Quality, and DLA’s Major Subordinate Commands (MSCs) are key stakeholders in the DLIR initiatives to modernize the representation and delivery of weapons systems data.  \n\nThe EMT program addresses emerging and out of cycle requirements that always occur as DLA strives to maintain readiness of the aging weapon systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Improving Technical and Logistics Information (formerly Industry and Customer Collaboration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.463"
                                            },
                                            "Text": {
                                                "val": "The MUST program plans to transition the MUST Developed Tools to DLA Troop Support Clothing and Textiles (C&T) and applicable Service stakeholders. The tools to be implemented are: 1. Supply Request Package (SRP) Tool for Joint Service and DLA Processes; 2. TexSpec Tool for C&T Product Description and Interim Change management; 3. Product Test Center (PTC) Management Tool for source testing and color shade management; 4. MUSTSize Tool for joint tariff optimization.   \n\nThe DLIR program plans to continue assisting DLA to improve the quality, speed, and interoperability of logistics data across the Enterprise and for the defense industrial base. DLIR will continue promoting and demonstrating the use of methodologies that are computer-aided design(CAD) software-neutral across the military service Engineering Support Activities (ESAs) and Program Management Offices (PMOs) that provide DLA with technical data for Class IX parts.  DLIR will also initiate the Connecting the Model-Based Enterprise project working closely with a selected PMO or ESA as it stands up its Product Lifecycle Management (PLM) system to operationally test different methods and processes to obtain technical data packages for selected Class IX weapon system parts resident in the PLM system.\n\nThe EMT program enables DLA to investigate new disruptive technology advances that may be implemented in the nearer term, without degrading  well established program efforts. This program enables the Agency to advance those technologies sooner in order to provide to the warfighter earlier. Small business Innovation Research (SBIR) phase III efforts (which cannot be funded with SBIR funds) are a prime example of activities that will be funded with these funds, examples include emerging magnetic braking technologies, and addressing strategic materials shortage\/risk. Efforts will begin in FY2019 to advance Digital Manufacturing by developing a comprehensive approach to take advantage of integrated, computer-based systems of simulation, three-dimensional (3D) visualization, analytics and various collaboration tools to create and manufacture products to support the warfighter.  Additionally, any emergent Strategic Materials requirements will be addressed through the EMT program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.201"
                                            },
                                            "Text": {
                                                "val": "The Military Unique Sustainment Technology (MUST) program will finalize development for MUST I and begin transition of contract deliverables: Supply Request Package for introduction of new items into DLA sustainment; Product Test Center fabric and color inspection tools for improved quality reporting; and digital models of requirement documents (TexSpecs)for the MUST knowledge base.  These tools are in validation testing with key DLA Troop Support Clothing and Textile(C&T)and Service Stakeholders.  Validation will be completed in 2021 and test results will be documented in the Functional Requirements Document(FRD).  The next phase of the program, MUST II, will build on MUST I results and continue technical data modernization with extended focus on integration of manufacturing and testing processes.  It will enable combat uniform and individual equipment technical data to be seamlessly communicated and applied throughout the DLA C&T Supply Chain. For example, settings would be directly fed into the test equipment and results would be accurately communicated to quality assurance.  A new broad agency announcement (BAA) will be released for an anticipated FY 2021 award.\n\nThe Defense Logistics Information Research (DLIR) program will continue with the Connecting the Model-Based Enterprise (MBE) project which will operationally test different methods and processes to obtain technical data packages for selected Class IX weapon system parts directly from ESA\/PMO’s PLM system in lieu of the 339 process.  The DLIR program will also initiate the 3D Technical Data Solutions and Digital Rights Management (DRM) projects.  The 3D Technical Data Solutions project will identify one or more commercial viewers that provide the ability to view multiple data formats that may simplify DLA employees work processes, or give DLA additional capabilities to view data provided by the Military Services; and develop standard guidance or advice to Military Service organizations, ESAs and PMOs, to guide and influence their generation of 3D model based TDPs in order to ensure that they support the needs of DLA and its vendor base.  The DRM project will benchmark the DRM technologies currently practiced in the private and public sectors, conduct analyses to determine the right solution for DLA, develop a prototype to validate the requirement, and develop a transition plan.  Additionally, the DLIR program will continue to support DLA’s Technical Data Management Transformation (TDMT) efforts.\n\nThe EMT program continues to enable DLA's investigation of new disruptive technology advances that may be implemented in the nearer term, without degrading well established program efforts. This program enables the Agency to advance those technologies sooner in order to provide to the warfighter earlier.  Small Business Innovation Research (SBIR) phase III efforts (which cannot be funded with SBIR funds) are a prime example of activities that will be funded with these funds, examples include emerging magnetic braking technologies, and addressing strategic materials shortage\/risk.  Efforts will continue in FY2020 to advance Digital Manufacturing by developing a comprehensive approach to take advantage of integrated, computer-based systems of simulation, three-dimensional (3D) visualization, analytics and various collaboration tools to create and manufacture products to support the warfighter.  Additionally, any emergent Strategic Materials requirements will be addressed through the EMT program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.966"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.966"
                                            },
                                            "Text": {
                                                "val": "The Military Unique Sustainment Technology (MUST) program will award multiple MUST II contracts.  The technical roadmap will be developed.  Building on MUST I results, the MUST II objective is to complete tech data modernization for the MUST Knowledge base and to extend its impact across the C&T industrial base.  \n\nThe Defense Logistics Information Research (DLIR) program will continue the Connecting the Model-Based Enterprise (MBE) project and begin efforts to improve the Federal Catalog in combination with 3D Scanning capabilities.  This project would define the requirements and develop the prototype of the next generation of the federal catalog, including advanced search functions, geometric data representation, and autonomous data validation.  An enhanced catalog would promote the digital twin, i.e., the digital representation of systems and their components, and the use of digital artifacts to design, test and sustain national defense systems.  These capabilities could significantly improve DLA and DOD operations in acquisition, quality control, customer support, and other areas.  Additionally, the DLIR program will continue efforts to collaborate and develop a cyber-physical model that will evaluate the resiliency of OT systems after a cyber-attack and continue to support DLA’s Technical Data Management Transformation (TDMT) efforts.\n\nThe EMT program continues to enable DLA's investigation of new disruptive technology advances that may be implemented in the nearer term, without degrading well established program efforts.  This program enables the Agency to advance those technologies sooner in order to provide to the warfighter earlier.  Small Business Innovation Research (SBIR) phase III efforts (which cannot be funded with SBIR funds) are a prime example of activities that will be funded with these funds, examples include emerging magnetic braking technologies, and addressing strategic materials shortage\/risk.  Efforts will continue in FY2020 to advance Digital Manufacturing by developing a comprehensive approach to take advantage of integrated, computer-based systems of simulation, three-dimensional (3D) visualization, analytics and various collaboration tools to create and manufacture products to support the warfighter.  Additionally, any emergent Strategic Materials requirements will be addressed through the EMT program. EMT baseline was reduced by approximately $0.353 million resulting from overall MANTECH $3.020 million in directed reductions. Impact of the baseline reduction will result in limited availability of funds for emergent technology requirements in execution years."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Adjustments of $0.459 million in reductions due to DLA Fiscal Guidance reduction, civilian pay inflation, inflation for non-pay\/non-fuel purchases and internal realignment. Most significant impact of reduction is $0.353 million decrease in EMT baseline."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The DLA R&D program is executed through Delivery Orders placed on Indefinite Delivery\/Indefinite Quantity Contracts that resulted from competitive Broad Agency Announcements and through interagency agreements with the Military Services when it is cost effective and\/or provides some technical advantage, e.g. improves the probability of successful transition. DLA also has a continuously open Broad Agency Announcement for Emerging Technologies."
                        }
                    }
                }
            ]
        }
    }
}