{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-9035d21372bc28631c31031b85da2fbd962d290bf8d6ca6eecbc49021508de49-21",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603618D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Electronic Advanced Technology"
        },
        "R1LineNumber": {
            "val": "46"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "14.020"
            },
            "PriorYear": {
                "val": "12.680"
            },
            "CurrentYear": {
                "val": "12.063"
            },
            "BudgetYearOne": {
                "val": "15.164"
            },
            "BudgetYearOneBase": {
                "val": "15.164"
            },
            "BudgetYearTwo": {
                "val": "15.425"
            },
            "BudgetYearThree": {
                "val": "15.642"
            },
            "BudgetYearFour": {
                "val": "15.966"
            },
            "BudgetYearFive": {
                "val": "16.230"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The electromagnetic spectrum (EMS) environment (EME) is the largest and most complex warfighting environment because it is universally pervasive, largely unseen and can only be perceived through the use of advanced electronics technologies.  Understanding and managing EME warfighting challenges is essential to all military operations because it is through the use of EMS technologies that we perceive operational realities – the state and disposition of all military and nonmilitary groups\/forces − and coordinate all actions of our military forces.  \n\nHistorically, the United States has had technological advantages in EME warfighting technologies (i.e., sensors, communications and countermeasures), however, this is no longer the case in many technology areas due to the broad proliferation of advanced technologies, the rapid commercialization of advanced electronic systems and components and the concurrent rise of cyber-related technologies.  Leveraging these advanced technologies, adversaries are developing and fielding competing and asymmetric capabilities to offset past U.S. advantages.  Their efforts are making U.S. operations in the EMS and cyberspace significantly more difficult, and they are doing these things at accelerating rates.  Their developments include new generations of challenging threats ranging from small unmanned air systems and easily transportable Man-Portable Air Defense Systems (MANPADS) to dedicated military systems incorporating the most advanced sensing, communication and electronic warfare (EW) technologies such as integrated air defense systems and increasingly capable cruise and ballistic missiles. \n\nThe accelerating rate at which new EMS and cyber threats are appearing demands much faster responses than traditional Department of Defense (DoD) research, development and acquisition (RD&A) processes can provide.  Concurrently, the effective operational lifetime of many advanced technology solutions is decreasing due to the accelerating pace of technological innovation.  For these reasons, we must begin developing technological solutions much quicker and at much lower costs.\n\nThe Joint Electronic Advanced Technology (JEAT) Program was established to address these challenges through efforts designed to substantially accelerate the development and transition of innovative technology solutions to EMS warfighting challenges.  To do this, the JEAT program rapidly identifies, explores, develops, matures and demonstrates technologies and approaches that fall outside the Services’ purviews.  By using both off-the-shelf and new military and commercial technologies in innovative ways, JEAT’s approach has enabled needed capabilities to be delivered to the warfighter much sooner than possible by traditional DoD approaches and have also resulted in substantial savings for the Department in both research and development (R&D) and in Programs of Record.\n\nBeginning in FY 2020, all JEAT work has been moved into Project 245, EW Enterprise Exploration and Innovation.  Project 619, EW and Non-Kinetic Effects Experimentation and Oversight, was terminated and the efforts previously conducted within in Project 619 were moved into Project 245. \n\nPROJECT 619, EW AND NON-KINETIC EFFECTS EXPERIMENTATION AND OVERSIGHT\n\nProject 619 previously included three efforts: Experimentation\/Demonstration, Advanced Technology Development\/Verification and EW Enterprise Collaboration and Planning.  All Project 619 efforts were moved into Project 245 in FY 2020.\n\nPROJECT 245, EW ENTERPRISE EXPLORATION AND INNOVATION (EW E&I)\n\nEW E&I identifies, explores, develops and rapidly matures and demonstrates EMS and hybrid electronic warfare (EW)-Cyber warfighting technology solutions at rates that are significantly faster than traditional Department developmental efforts and at much lower costs.  To do this, a thorough understanding of all the EMS and EW-Cyber challenges confronting warfighters and technology developers is foundational.  Knowledge of all of the efforts to mitigate these challenges is also essential.  Utilizing this knowledge, innovative potential technology solutions that fall outside the Services’ purviews are identified and developed in state-of-the-art laboratory environments.  Promising potential solutions are then validated by fully exploring them side-by-side with existing capabilities and other potential technology solutions in real-world experimentation environments under real-world conditions.  To provide the greatest possible insights, these experimentation environments are designed so that they are operationally realistic − utilizing the most realistic threats available − and environmentally realistic – utilizing near-real-world EMS environments.  The knowledge gained through EW E&I efforts accelerates the transition of capabilities to the warfighter and informs senior leaders so they can more effectively oversee and direct all Department EW and EW-Cyber developmental efforts."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "12.889"
                },
                "CurrentYear": {
                    "val": "12.063"
                },
                "BudgetYearOne": {
                    "val": "12.280"
                },
                "BudgetYearOneBase": {
                    "val": "12.280"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "12.680"
                },
                "CurrentYear": {
                    "val": "12.063"
                },
                "BudgetYearOne": {
                    "val": "15.164"
                },
                "BudgetYearOneBase": {
                    "val": "15.164"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.209"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "2.884"
                },
                "BudgetYearOneBase": {
                    "val": "2.884"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.207"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Re-alignment of funds for EMS"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "2.899"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.899"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.015"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.015"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.002"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Re-alignment of funds from 0604055D8Z to accelerate work on invisible Electronic Manufacturing Services (EMS) and cyber environment; next generation fully adaptive radar."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "619"
                    },
                    "ProjectTitle": {
                        "val": "EW and Non-Kinetic Effects Experimentation and Oversight"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "11.770"
                        },
                        "PriorYear": {
                            "val": "11.999"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project 619, EW and Non-Kinetic Effects Experimentation and Oversight explored and assessed innovative technologies and approaches to rapidly mitigate advanced threats and demonstrate new overmatch technologies.  The three efforts previously conducted within Project 619, Experimentation\/Demonstration, Advanced Technology Development\/Verification and EW Enterprise Collaboration and Planning were moved into Project 245 in FY 2020."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Experimentation\/Demonstration (Expt\/Demo)"
                                    },
                                    "Description": {
                                        "val": "Leveraging JEAT’s history of conducting highly successful experimentation venues, SILENT HAMMER (SH), our new multi-year, multi-agency, series of field experimentation venues, will explore, assess, mature, and accelerate technologies and approaches for multi-platform, multi-aperture, multi-domain (M3) passive\/active sensing in complex and congested EMS environments.  As with earlier Project 619 experimentation venues, SH and subsequent venues will be scoped to address the most pressing EMS threats and issues.  The EW and Cyber Communities of Interest and Executive Committees and warfighters are involved in the selection of follow-on venue topics and scoping of these efforts to ensure their maximum relevance and value."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.172"
                                            },
                                            "Text": {
                                                "val": "This venue will begin exploring, assessing, and maturing technologies and approaches to engage M3 passive\/active threat architectures. It will provide understanding of the effectiveness of current and new technologies in this role and any unintended consequences of simultaneous passive\/active engagement."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Technology Development\/Verification (ATD\/V)"
                                    },
                                    "Description": {
                                        "val": "ATD\/V research efforts mature and assess emerging technologies to address compelling EW and converged EW-Cyber warfighting needs.  They focus on identifying and integrating advanced technologies to synergistically create effects that are far greater than the sum of the constituent systems and identifying nearer term, lower cost, and more effective solutions.  Many of these efforts utilize JEAT’s DEED Laboratory, which integrates promising technologies into unmanned aerial vehicles for further exploration and assessment in venues like SILENT HAMMER."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.714"
                                            },
                                            "Text": {
                                                "val": "Demonstrate and assess multi-platform\/multi-aperture EW and integrated Cyber\/Electronic Warfare (ICEW) techniques in the laboratory.  Integrate matured technologies\/approaches into unmanned air systems to be flown in Silent Hammer and other experimentation venues."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EW Enterprise Collaboration and Planning (EW C&P)"
                                    },
                                    "Description": {
                                        "val": "Coordinates, oversees, and manages all EMS warfare-related R&D activities within OUSD(R&E).  Maintains cognizance of all EW capabilities and capability development efforts worldwide; oversees all EW-related R&D activities across DoD; explores new and innovative EMS technologies and approaches; coordinates Departmental EW-related R&D, protocols, and policy; analyzes requisite development and operational interfaces across DoD and with international partners; and reports relevant information to senior leaders and across the Department, as well as to Congress and other external groups."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.113"
                                            },
                                            "Text": {
                                                "val": "Participate in joint, collaborative EW guidance and oversight activities, including the EW EXCOM.  Guide, direct, and oversee the JEAT Advance initiatives to establish EW vulnerability portfolios.  Track the progress of Joint Urgent Operational Need SO-0010 (Project 619-led identification of technology solutions).  Interface with the Intelligence Community (IC) to address critical intelligence gaps related to foreign EMS capabilities and advanced technology development efforts.  Additional efforts include exploring a variety of new EW capabilities including battle management and visualization technologies; asymmetric targeting technologies; countermeasures to passive sensor threats; and greater leveraging of national technical means to support the development of EW and EW-Cyber capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "245"
                    },
                    "ProjectTitle": {
                        "val": "EW Enterprise Exploration and Innovation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "2.250"
                        },
                        "PriorYear": {
                            "val": "0.681"
                        },
                        "CurrentYear": {
                            "val": "12.063"
                        },
                        "BudgetYearOne": {
                            "val": "15.164"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.164"
                        },
                        "BudgetYearTwo": {
                            "val": "15.425"
                        },
                        "BudgetYearThree": {
                            "val": "15.642"
                        },
                        "BudgetYearFour": {
                            "val": "15.966"
                        },
                        "BudgetYearFive": {
                            "val": "16.230"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project 245, EW Enterprise Exploration and Innovation (EW E&I), identifies, explores, develops and rapidly matures and demonstrates EMS and hybrid electronic warfare (EW)-Cyber warfighting technology solutions at rates that are significantly faster than traditional Department developmental efforts and at much lower costs.  Maintaining awareness of all EW and EW-Cyber research and development (R&D) efforts globally enables the selection of internal JEAT development efforts and provides analyses and insights for senior decision-makers to ensure effective direction of all Department EW and EW-Cyber technology programs and processes.  Internal JEAT developmental efforts investigate and mature technologies and approaches to counter advanced EMS threats in innovative ways and enable the development of compelling new warfighting technologies.  JEAT’s large-scale open-air, dynamic field experimentation venues explore and validate promising potential technology solutions side-by-side with existing and other developmental technologies to provide the greatest possible insights to senior leaders directing the Department’s EW and EW-Cyber capabilities development efforts.  Current and future experimentation venues will be selected, designed and directed within EW E&I but funding for the execution of them will be provided by Program Element 0603699D8Z, Emerging Capabilities Technology Development.\n\nUnderstanding.  EW E&I “understanding” efforts maintain awareness of all EW and EW-Cyber R&D efforts globally.  In addition to guiding internal JEAT development efforts, they also provide analyses and technology deep dives to give key insights to senior decision-makers so they can effectively direct all Department EW and EW-Cyber technology development programs and processes.\n\nIdentifying and Developing Innovative Solutions.  These efforts investigate and mature technologies and approaches to counter advanced EMS threats in innovative ways and develop new overmatch technologies.  They develop, mature and demonstrate new EW and EW-Cyber technologies in state-of-the-art laboratory environments and include, e.g., the development and validation of new EW countermeasures and nonkinetic battle management technologies to vastly simplify operational planning and decision-making for EMS operations.\n\nExploring Potential Solutions.  The JEAT Program developed and continues to pioneer the use of large-scale open-air, dynamic field experimentation venues as powerful tools for technology discovery and maturation.  These overwhelmingly successful venues firmly established this type of experimentation as an invaluable tool for both technology acceleration and cost savings.  Current and future experimentation venues will be selected, designed and directed within this effort but funding for the execution of them will be provided by Program Element 0603699D8Z, Emerging Capabilities Technology Development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "EW Enterprise Exploration and Innovation"
                                    },
                                    "Description": {
                                        "val": "EW E&I efforts identify, explore, mature and assess emerging technologies to address compelling EW and converged EW-Cyber warfighting needs.  EW E&I involves three classes of efforts.\n\nUnderstanding.  To maintain awareness of the global state of EW and EW-Cyber technology development, this effort coordinates and oversees all EMS warfare-related R&D activities within the Department and manages R&D activities within OUSD(R&E).  Work within this effort includes:\n• Maintaining cognizance of all EW capabilities and capability development efforts worldwide.\n• Overseeing all EW and EW-Cyber related R&D activities across DoD.\n• Exploring new and innovative EMS technologies and approaches and advocating their development and adoption.\n• Coordinating Department EW and EW-Cyber-related R&D, protocols, and policy efforts.\n• Analyzing requisite development and operational interfaces across DoD and with international partners.\n• Reporting relevant information to senior leaders, across the Department and to Congress and other external groups.\n• Providing recommendations for development and acquisition programs that address EW- and EW-Cyber-related threats impacting sensors, seekers, communications, platform survivability, countermeasures, and EMS battle management.  \n• Providing technical and analytic support to the Office of the Under Secretary of Defense for Acquisition and Sustainment (OUSD(A&S)) on Programs of Record, Joint Urgent Operational Needs and efforts involving technology maturity and availability, critical program information standards, foreign disclosure, and technical signals requirements.\n• Conducting deep dives and analyses of technological opportunities and advanced threats to support Departmental EW and EW-Cyber R&D efforts.\n\nIdentifying and Developing Innovative Solutions.  Efforts include:\n• Identifying, developing and integrating advanced technologies to synergistically create EW and EW-Cyber effects that are far greater than the sum of the constituent systems.\n• Identifying and developing nearer term, lower cost, and more effective EW and EW-Cyber technology solutions.\n• Conducting R&D within JEAT’s Distributed Electronic Effects Delivery (DEED) Laboratory.\n• Developing and validating prototypes of promising technology solutions within JEAT’s DEED Laboratory. \n• Integrating prototypes into unmanned vehicles for further exploration and assessment in experimentation venues.\n• Conducting collaborative R&D efforts with the Services, Combatant Commands and the Intelligence Community (IC) to explore, integrate and demonstrate enhanced real-time EMS\/Cyberspace situational awareness and battle management technologies within the Digital Attack Surface Execution Environment (DASEE) effort.  DASEE leverages state-of-the-art computational and perception technologies including artificial intelligence, machine learning, big data, graph analytics, advanced heuristics and cognition\/visualization also provide predictive analytics and course of action development.  \n\nExploring Potential Solutions.  The JEAT team is DoD’s acknowledged expert in designing and conducting large-scale open air field experimentation venues.  JEAT’s experimentation venues are selected and scoped to explore technology solutions to some of the most difficult operational challenges facing U.S. warfighters.  JEAT’s experimentation venues are designed to simultaneously examine numerous developmental and existing technologies side-by-side under the same conditions and they utilize realistic threats and real-world EMS environments to provide the greatest insights to operators, developers and decision-makers.  Leveraging JEAT’s history of conducting highly successful experimentation venues, SILENT HAMMER (SH) is our current multi-year, multi-agency series of field experimentation venues and the first SH venue, SH 1, was conducted in late FY 2019.  Beginning in FY 2020, funding to conduct JEAT’s experimentation venues will be provided by PE 0603699D8Z, Emerging Capabilities Technology Development.\n• Exploring, maturing and assessing technologies and approaches for multi-platform, multi-aperture, multi-domain (M3) engagement of passive\/active sensing architectures in very complex and highly congested EMS environments.    \n• Selecting, scoping, designing and conducting subsequent experimentation venues.  As with earlier JEAT experimentation venues, warfighters and the EW and Cyber Communities of Interest and Executive Committees are involved in this process to ensure their maximum relevance and value to both warfighters and technology developers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.681"
                                            },
                                            "Text": {
                                                "val": "The DASEE research effort will continue with two additional demonstrations involving progressively challenging objectives culminating with field demonstrations with operational and IC users to enable the transition of capabilities to these communities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.063"
                                            },
                                            "Text": {
                                                "val": "Understanding.  \n• Support Service, Joint and international EW and EW-Cyber management and direction efforts including the EW Executive Committee and the EMS Operations Cross-Functional Team.  \n• Lead OUSD(R&E) oversight of EW and EW-Cyber development and oversight activities to include the SECDEF-chartered EW Executive Committee.  \n• Identify and oversee JEAT technology development and experimentation initiatives.\n• Provide detailed analyses of U.S. EW vulnerabilities and recommendations for addressing them.  \n• Identify potential EW and EW-Cyber overmatch opportunities.  \n• Provide EW technical support to the Intelligence Community (IC) to enable the IC to better address critical intelligence gaps related to foreign EW and EW-Cyber capabilities and technology development efforts.  \n• Identify new EW and EW-Cyber opportunities, such as asymmetric targeting technologies, countermeasures to passive sensor threats and ways to better leverage national technical means to support the development of new EW and EW-Cyber capabilities.  \n• Lead efforts to identify subsequent JEAT experimentation venues.\n\nIdentifying and Developing Innovative Solutions.  \n• Continue exploring multi-platform\/multi-aperture EW and EW-Cyber technologies.  \n• Continue developing a new EMS technology, the Next Generation Fully Adaptive Radar (NG-FAR).\n• Continue exploring additional classified EW and EW-Cyber technologies.  \n• Develop, demonstrate and assess new EW and EW-Cyber technologies in the DEED Laboratory. \n• Develop and assess EW and EW-Cyber technologies prototypes within the DEED Laboratory.\n• Integrate promising prototypes onto unmanned air systems so they can be assessed in field experimentation venues such as SILENT HAMMER (see below).\n• Continue developing, assessing and validating DASEE.  Key FY 2020 DASEE efforts include conducting critical technology readiness demonstrations in operational contexts to enable subsequent demonstrations with operational users and analysts.\n\nExploring Potential Solutions.  \n• Design and plan SH 2 after SH 1 assessment is completed."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.164"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.164"
                                            },
                                            "Text": {
                                                "val": "Understanding.  \n• Continue all FY 2020 EW and EW-Cyber coordination, oversight and management efforts.\n\nIdentifying and Developing Innovative Solutions.  \n• Continue maturing, demonstrating and assessing EW and EW-Cyber technologies in the laboratory to include multi-platform\/multi-aperture approaches.  \n• Continue development of the Next Generation Fully Adaptive Radar (NG-FAR).\n• Continue developing viable technology products into prototypes and integrate these prototypes into unmanned systems for demonstration and assessment in experimentation venues such as SILENT HAMMER.  \n• Continue DASEE development efforts focusing on more advanced and realistic capability demonstrations to enable earlier transition to operational users.\n\nExploring Potential Solutions.  \n• Continue planning for SH 2.  SH 2 will tentatively be conducted in mid-FY 2021. \n• Scope, design and begin planning for SH 3 after assessment of SH 2 is completed."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2021 increase includes a re-alignment of funds from PE 0604055D8Z, Operational Energy Capability Improvement, to accelerate work on a new EMS technology, the Next Generation Fully Adaptive Radar (NG-FAR)."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}