{
    "id": "2021-Army-PB-2040-JBOOK-2ce7b76ca8f41dbc06183380f90728d4a8e40b9122c9effab5b4a02fdffb364e-7",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605602A"
        },
        "ProgramElementTitle": {
            "val": "Army Technical Test Instrumentation and Targets"
        },
        "R1LineNumber": {
            "val": "193"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "82.617"
            },
            "CurrentYear": {
                "val": "61.974"
            },
            "BudgetYearOne": {
                "val": "48.475"
            },
            "BudgetYearOneBase": {
                "val": "48.475"
            },
            "BudgetYearTwo": {
                "val": "49.774"
            },
            "BudgetYearThree": {
                "val": "74.230"
            },
            "BudgetYearFour": {
                "val": "56.520"
            },
            "BudgetYearFive": {
                "val": "60.338"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "433.928"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) provides critical front-end investments for development of:  new test methodologies; test standards; advanced test technology concepts for long range requirements; future test capabilities; advanced development of Modeling and Simulation and Instrumentation (MS&I) prototypes; and the full development of test instrumentation for the United States (U.S) Army Test and Evaluation Command (ATEC), which includes the Operational Test Command (OTC) at Ft Hood, Texas; Aberdeen Test Center (ATC), Aberdeen Proving Ground, Maryland; White Sands Test Center (WSTC) at White Sands Missile Range (WSMR), New Mexico; Electronic Proving Ground (EPG), Fort Huachuca, Arizona; Yuma Test Center (YTC) at Yuma Proving Grounds (YPG), Arizona (including the Cold Regions Test Center (CRTC), Fort Greely, Alaska and the Tropics Regions Test Center (TRTC), at various locations); and Redstone Test Center (RTC), Redstone Arsenal, Alabama. OTC consists of three forward Test Directorates (Airborne and Special Operations Test Directorate, Fort Bragg, North Carolina; Air Defense Artillery Test Directorate, Fort Bliss, Texas; and the Fires Test Directorate, Fort Sill, Oklahoma) together with four other Test Directorates (Aviation; Maneuver; Mission Command; Maneuver Support and Sustainment) at Ft Hood, Texas.  These activities enable Army Futures Command (AFC) modernization effort and readiness and support the development and fielding cycle of all Army acquisition programs including rapid fielding initiatives. Sustainment funding maintains existing testing capabilities at all locations by replacing unreliable, uneconomical, and irreparable instrumentation, as well as incremental upgrades of hardware and software for MS&I systems to assure adequate test data collection capabilities.  This data supports acquisition milestone decisions for all commodity areas throughout the Army including programs such as the 105-mm Mobile Howitzer, 30mm\/40mm ammunition, Active Protection System (APS), AH-64 Block III, AN\/MPQ-64A3 Sentinel 3-D Radar, APR-39C(V)1 Radar, Armored Multi-Purpose Vehicle (AMPV), Army Integrated Air-Missile Defense (AIAMD), Army Tactical Missile System (ATACMS), CH-47F Chinook, Common Infrared Counter Measures (CIRCM), Common Robotic System-Individual (CRS-I), Counter Unmanned Aircraft System (c-UAS), Counter Rocket Artillery Mortar (C-RAM), Counter Unmanned Aircraft System (C-UAS), Enhanced Heavy Equipment Transporter System (EHETS\/Medium Equipment Trailer (MET), Enhanced Night Vision Goggle - Binocular (ENVG-B), Expedient Leader Follower, Extended Range Cannon Artillery (ERCA), Family of Medium Tactical Vehicles (FMTV), Guided Multiple Launch Rocket System (GMLRS), Hypervelocity Gun Weapon System, Integrated Tactical Network (ITN),Javelin, Joint Air-to- Ground Missile (JAGM) for US Navy, Joint Light Tactical Vehicle (JLTV), Leader Radio, M109A7 Paladin\/M992A3 Field Artillery Ammunition Supply Vehicle (FAASV), M1147 Advanced Multi-Purpose X (AMP), M1A2 Abrams SEPv2 Next Evolution Armor (NEA), M-2\/3 Bradley Expedited Active Protection System (ExAPS), M-2\/3 Bradley Fist, M776 Chrome Tube, M777 Long Range Cannon, Maneuver Short Range Air Defense (M-SHORAD), Mobile Protected Firepower (MPF), Modular Handgun System (MHS), Optionally Manned Fighting Vehicle, Patriot 3 (PAC-3), Precision Guidance Kit (PGK), Precision Strike Missile (PrSM), Robotic Combat Vehicle (RCV), Shadow Tactical Unmanned Aircraft System (TUAS), Squat Multipurpose Equipment Transport (SMET), Stinger Shelf life Extension Program (SLEP), Stryker, Systems for Assured Position, Navigation and Timing (PNT), Terminal High-Altitude Area Defense (THAAD), and UH-60M Black Hawk."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "84.805"
                },
                "CurrentYear": {
                    "val": "46.974"
                },
                "BudgetYearOne": {
                    "val": "48.132"
                },
                "BudgetYearOneBase": {
                    "val": "48.132"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "82.617"
                },
                "CurrentYear": {
                    "val": "61.974"
                },
                "BudgetYearOne": {
                    "val": "48.475"
                },
                "BudgetYearOneBase": {
                    "val": "48.475"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.188"
                },
                "CurrentYear": {
                    "val": "15"
                },
                "BudgetYearOne": {
                    "val": "0.343"
                },
                "BudgetYearOneBase": {
                    "val": "0.343"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "15"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.188"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.343"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.343"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "628"
                    },
                    "ProjectTitle": {
                        "val": "Developmental Test Technology & Sustainment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "66.498"
                        },
                        "CurrentYear": {
                            "val": "48.215"
                        },
                        "BudgetYearOne": {
                            "val": "34.251"
                        },
                        "BudgetYearOneBase": {
                            "val": "34.251"
                        },
                        "BudgetYearTwo": {
                            "val": "35.081"
                        },
                        "BudgetYearThree": {
                            "val": "59.168"
                        },
                        "BudgetYearFour": {
                            "val": "41.051"
                        },
                        "BudgetYearFive": {
                            "val": "44.868"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "329.132"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project provides critical front-end investments for development of new test methodologies, test standards, advanced test technology concepts for long range requirements, future test capabilities, and advanced instrumentation prototypes for subordinate commands of the Army Test and Evaluation Command (ATEC). These capabilities are required to support developmental testing requirements of high priority Army systems supporting Army modernization efforts. Where practical, efficiencies will be gained through the common use of developmental instrumentation in operational testing. A key element is sustaining aging instrumentation which maintains existing capabilities at test facilities by replacing unreliable, uneconomical and irreparable instrumentation, as well as lifecycle replacement and incremental upgrades of instrumentation and software, reducing their average age to assure adequate testing capabilities. This Project develops and sustains developmental test instrumentation and capabilities that provide the data necessary to support acquisition milestone decisions for all commodity areas throughout the Army. Significant examples include new instrumentation for the testing of Command, Control, Communication and Computer (C4) systems, upgrades to existing radars to extend their economic life, common data collection and analysis tools, non-intrusive instrumentation to test Unmanned Ground Vehicles and sensors, high speed - high definition digital imaging systems to capture missile flight events, and automation software to improve data collection of reliability, availability, and maintainability (RAM) testing."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Developmental Test Technology & Sustainment"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "22.5"
                                        },
                                        "Text": {
                                            "val": "Developmental Test Technology & Sustainment"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "15"
                                        },
                                        "Text": {
                                            "val": "Developmental Test Technology & Sustainment"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Developmental Test Technology Investment"
                                    },
                                    "Description": {
                                        "val": "Develops, acquires, and sustains critical test technology and instrumentation. Provides the necessary test instrumentation, computer and communications systems, data collection, analysis and reporting equipment, and other special test capabilities to successfully develop and test Army weapons and equipment. Provides the necessary live, virtual and constructive environment, hardware-in-the-loop capabilities, and modeling and simulation (M&S) needed for testing Army materiel solutions. Acquires instrumentation to measure performance of C4 systems; RAM data collection on tracked and wheeled vehicles; ballistic transducers for measuring chamber pressures during ammunition and barrel tests; supports development of common data collection instrumentation and data management systems used in testing across all test commodity areas and lifecycles; continues replacement and upgrade of range control instrumentation, radar, optics and telemetry used in missile testing; acquires data recorders, signal conditioning equipment, data processing equipment and other instrumentation for various aircraft tests; upgrades natural environments test instrumentation used for testing weapon systems, vehicles, munitions and support equipment in extreme hot desert environments as well as extreme cold conditions; continues upgrade of survivability\/vulnerability test capabilities in support of live fire testing; upgrades and replaces mobile range communications equipment and digital end devices; and improves test efficiency through the use of smart devices as data collectors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "43.984"
                                            },
                                            "Text": {
                                                "val": "Test centers continued to provide, acquire and upgrade instrumentation for C4; RAM; ballistics, missile, aviation and environmental testing across all test commodity areas and enhance\/expand the use of common data collectors, smart devices, and enterprise data management tools. This included the continuation and completion of previous fiscal year initiatives in addition to the execution of new initiatives to modernize test infrastructure. The Redstone Test Center (RTC) completed a critical storage backup system modernization program that will permit RTC to store the substantial developmental test data. The Aberdeen Test Center (ATC) continued its vehicle Crew Survivability Instrumentation and small arms instrumentation developments. The Electronic Proving Ground (EPG) continued the development of Phoenix Architecture for data collection systems to store, analyze, and fully characterize the increased volume of data from high throughput network systems. The White Sands Test Center (WSTC) and the Yuma Test Center (YTC) developed Counter-Unmanned Aerial System (cUAS) testing capabilities. WSTC modernized test support equipment for Long Range Precision Fires and Air and Missile Defense and continued its Flight Termination Systems Modernization program. YTC continued service life extension programs for close-in and fly-out radars."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "31.848"
                                            },
                                            "Text": {
                                                "val": "Test centers will continue to provide, acquire, and upgrade instrumentation for C4, RAM, ballistics, missile, aviation and environmental testing across all test commodity areas and enhance\/expand the use of common data collectors, smart devices, and enterprise data management tools. Examples include Aberdeen Test Center Crew Survivability Instrumentation during Live Fire Test and Evaluation (LFT&E); Electronic Proving Ground Phoenix Architecture project for future data demand; Redstone Test Center Aircraft Survivability Equipment (ASE) Data Processing and Analysis; White Sands Missile Range Aerial Cable Lifecycle Replacement project to replace critical components reaching the end of their useful lives; and Yuma Test Center Counter Unmanned Aircraft System (cUAS) test capability for anticipated cUAS technology systems which can detect, track, identify and collect data on hostile Unmanned Aircraft System systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "34.251"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "34.251"
                                            },
                                            "Text": {
                                                "val": "Test centers will continue to provide, acquire, and upgrade instrumentation for Command, Control, Communications, and Computers Intelligence, Surveillance and Reconnaissance (C4ISR), RAM, automotive, ballistics, missile, aviation and environmental testing across all test commodity areas and enhance\/expand the use of common data collectors, smart devices, and enterprise data management tools.  Examples include ATC Crew Survivability Instrumentation during LFT&E; EPG Phoenix Architecture project for future data demand; RTC ASE Data Processing and Analysis; WSMR Long Range Precision Fires (LRPF) and Air Missile Defense (AMD) test support equipment; and YTC test capability for cUAS which can detect, track, identify and collect data on hostile UAS."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding adjustments align program requirements with Army modernization priorities in support of the National Defense Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 National Defense Authorization Act (NDAA) Section 825 Major Defense Acquisition Program (MDAP) Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA Section 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.367"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "62C"
                    },
                    "ProjectTitle": {
                        "val": "Modeling and Simulation Instrumentation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.119"
                        },
                        "CurrentYear": {
                            "val": "13.759"
                        },
                        "BudgetYearOne": {
                            "val": "14.224"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.224"
                        },
                        "BudgetYearTwo": {
                            "val": "14.693"
                        },
                        "BudgetYearThree": {
                            "val": "15.062"
                        },
                        "BudgetYearFour": {
                            "val": "15.469"
                        },
                        "BudgetYearFive": {
                            "val": "15.47"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "104.796"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The U.S. ATEC plans, executes, and reports on operational tests, assessments and experiments in order to provide essential information for the acquisition and fielding of Army systems. A subordinate unit of ATEC, the OTC employs MS&I to provide a realistic operational test (OT) environment, conduct test monitoring and control, and perform data analysis. OTC develops and adapts Army training simulations (such as Multiple Integrated Laser Engagement System (MILES) and One Semi-Automated Forces (OneSAF)) for use in OT, reducing the demand for Army test units and test cost by simulating tactical engagements, adjacent & higher headquarters units, mission command message traffic, and battlefield effects. OTC provides test monitoring and control through video monitoring, Global Positioning System (GPS)-enabled networks, and integration with Army mission command systems to collect real-time position location and status tracking to ensure test safety and provide status of data collection devices. OTC uses video equipment, data collection devices, and software to collect and analyze system performance during test. MS&I funding is used to adapt\/integrate current Army training simulation capabilities to function with new Army systems, purchase commercial off-the-shelf systems, and develop and sustain OT-unique simulation and instrumentation systems. The MS&I program also funds the technical expertise and hardware to sustain cyber security of OTC's technology capabilities, and provides for minor data collection device development and sustainment to support systems undergoing OT."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MS&I"
                                    },
                                    "Description": {
                                        "val": "Develops and enhances ATEC's simulation\/stimulation of Mission Command; Fire Support; Air Defense; Command, Control, Communications, and Computers Intelligence, Surveillance and Reconnaissance (C4ISR); and Network systems.  Improves and sustains Real-Time Casualty Assessment (RTCA). Also develops, enhances, and sustains Performance Instrumentation Systems, Time Space Positioning Information (TSPI), Telemetry Systems, and Imaging Systems together with their associated data management enabling capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.114"
                                            },
                                            "Text": {
                                                "val": "Continued to sustain ATEC's Fire Support, Air and Missile Defense, C4ISR, and Network OT tools.  Improved OTC's RTCA secure network and tactical engagement simulation system capabilities to support future Army Integrated Air and Missile Defense (AIAMD), Joint Tactical Radio System (JTRS), Leaders Radio, Mid-Tier Networking Vehicular Radio (MNVR), Joint Enterprise Network Manager (JENM), and Shadow (RQ-7BVN) Tactical Unmanned Aerial System (TUAS) Operational Tests (OTs). Supported the Abrams and Bradley PIP, AN\/TPQ-53, Distributed Common Ground System - Army (DCGS-A), and Joint Warning and Reporting Network (JWARN) OTs. Sustained Performance Instrumentation Systems, TSPI, and Telemetry and Imaging Systems and associated data management (e.g. collection, reduction, analysis, and visualization) enabling capabilities. Executed life cycle replacement of legacy MS&I systems which have reached end of useful life. Sustained and upgraded MS&I systems used for operational tests."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.134"
                                            },
                                            "Text": {
                                                "val": "Will continue to sustain ATEC's Fire Support, Air and Missile Defense, C4ISR, and Network OT tools. Will improve OTC's RTCA secure network and tactical engagement simulation system capabilities to support future Bradley, Global Position System III, Indirect Fire Protection Capability (IFPC), Patriot PDB-8, and Integrated Air and Missile Defense (IAMD) OTs. Will support the AIAMD, DCGS-A, Manpack, Joint Enterprise Network Manager (JENM), Leaders Radio, and Shadow (RQ-7BVN) TUAS OTs. Will sustain Performance Instrumentation Systems, TSPI, and Telemetry and Imaging Systems and associated data management (e.g. collection, reduction, analysis, and visualization) enabling capabilities. Will execute life cycle replacement of legacy MS&I systems which have reached end of useful life. Will sustain and upgrade MS&I systems used for operational tests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.224"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.224"
                                            },
                                            "Text": {
                                                "val": "Will continue to sustain ATEC's Fire Support, Air and Missile Defense, C4ISR, and Network OT tools.  Will improve OTC's RTCA secure network and tactical engagement simulation system capabilities to support future Armored Multi-Purpose Vehicle (AMPV), Bradley, IFPC, Joint Warning and Reporting Network (JWARN) and Mobile Protected Firepower (MPF) OTs.  Will also support the Army Integrated Air Missile Defense (AIAMD), Distributed Common Ground System-Army (DCGS-A), Global Combat Support System ? Army (GCSS-A) and Shadow (RQ-7BVN) TUAS OTs.  Will sustain Performance Instrumentation Systems, TSPI, and Telemetry and Imaging Systems and associated data management (e.g. collection, reduction, analysis, and visualization) enabling capabilities. Will execute life cycle replacement of legacy MS&I systems which have reached end of useful life. Will sustain and upgrade MS&I systems used for operational tests."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding was adjusted to align program requirements with Army modernization priorities in support of the National Defense Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA Section 825 MDAP Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA Section 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.005"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2020 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Funding transferred in accordance with Title 15 USC ?638"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.625"
                                            },
                                            "Text": {
                                                "val": "Funding transferred in accordance with Title 15 USC ?638"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred in accordance with Title 15 USC ?638"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}