{
    "id": "2021-Navy-PB-1319-JBOOK-29075b3c2af92ab5fcca1096cf65ecac9cc771240d227e79d45bc59626cdea42-3",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602114N"
        },
        "ProgramElementTitle": {
            "val": "Power Proj Applied Research"
        },
        "R1LineNumber": {
            "val": "4"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "26.903"
            },
            "CurrentYear": {
                "val": "28.546"
            },
            "BudgetYearOne": {
                "val": "17.792"
            },
            "BudgetYearOneBase": {
                "val": "17.792"
            },
            "BudgetYearTwo": {
                "val": "21.918"
            },
            "BudgetYearThree": {
                "val": "23.184"
            },
            "BudgetYearFour": {
                "val": "27.440"
            },
            "BudgetYearFive": {
                "val": "27.989"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "In an Artificial Intelligence (AI)enabled maritime battlespace, the ability to fight at the speed of light will determine the outcome. The effective defense against threats increasingly beyond human speed, will enable U.S. naval forces to outthink, outmaneuver and outfight adversaries. This Program Element (PE) supports both advanced technology research and near to mid-term transition opportunities.  The advanced research focus is primarily on directed energy, high speed weapon propulsion, Electro-Optic\/Infrared (EO\/IR) sensor technologies, and Naval Precision Strike Operations. The goal of this research is to develop technologies and capabilities that enable Directed Energy (DE) weapons as well as defense against adversary DE systems; the development of vehicle and propulsion technology for high-speed weapons operating from Mach 3 to Mach 8 and beyond; investment in the areas of Electro Optic\/Infrared devises and advanced sensors; and technologies that provide the navy of the future the ability to quickly locate, target, and strike critical targets ashore.  \n\nToday's Sailors and Marines are enabled by naval Science and Technology (S&T). Since 1946, the Office of Naval Research (ONR) has fostered scientific research related to the maintenance of maritime superiority and national defense. ONR manages the Department of the Navy's (DON) portfolio of naval Basic and Applied research, and Advanced Technology Development investments to ensure naval forces can effectively deter conflict, but when called upon, fight, win and come home safe. Current investments hedge against uncertainty, providing solutions to commanders today, and options for the future. The Naval S&T budget supports higher guidance defined by the National Defense Strategy, and responds to requirements identified by the Secretary of the Navy through research priorities set by the Chief of Naval Research, coordinated across the Naval Research Enterprise (NRE), and outlined in the Naval R&D Framework.\n\nThis Program Element (PE) funds Applied Research, which is the systematic study to understand the means to meet a recognized and specific need. Most of the work in this PE can be classified between Technology Readiness Level (TRL) 2 (technology concept and\/or application formulation) and TRL 4 (component and\/or breadboard validation in laboratory environments).\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "27.643"
                },
                "CurrentYear": {
                    "val": "18.546"
                },
                "BudgetYearOne": {
                    "val": "19.583"
                },
                "BudgetYearOneBase": {
                    "val": "19.583"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "26.903"
                },
                "CurrentYear": {
                    "val": "28.546"
                },
                "BudgetYearOne": {
                    "val": "17.792"
                },
                "BudgetYearOneBase": {
                    "val": "17.792"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.740"
                },
                "CurrentYear": {
                    "val": "10.000"
                },
                "BudgetYearOne": {
                    "val": "-1.791"
                },
                "BudgetYearOneBase": {
                    "val": "-1.791"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "10.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.740"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.791"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.791"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: The Program decrease in FY 21 reflects reduced investment in Information Security and Mathematics, Electronics, and Quantum Fundamental research as part of the annual Science and Technology portfolio assessment and realignment. \n\nTechnical: no significant change\n\nSchedule: no significant change"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Power Proj Applied Research"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "14.354"
                        },
                        "CurrentYear": {
                            "val": "18.546"
                        },
                        "BudgetYearOne": {
                            "val": "17.792"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.792"
                        },
                        "BudgetYearTwo": {
                            "val": "21.918"
                        },
                        "BudgetYearThree": {
                            "val": "23.184"
                        },
                        "BudgetYearFour": {
                            "val": "27.440"
                        },
                        "BudgetYearFive": {
                            "val": "27.989"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "In an Artificial Intelligence (AI)enabled maritime battlespace, the ability to fight at the speed of light will determine the outcome. The effective defense against threats increasingly beyond human speed, will enable U.S. naval forces to outthink, outmaneuver and outfight adversaries. This Project supports both advanced technology research and near to mid-term transition opportunities. The advanced research focus is primarily on directed energy, high speed weapon propulsion, electro-optic\/infrared (EO\/IR) sensor technologies, and Naval Precision Strike Operations. The goal of this research is to develop technologies and capabilities that enable Directed Energy (DE) weapons as well as defense against adversary DE systems; the development of vehicle and propulsion technology for high-speed weapons operating from Mach 3 to Mach 8 and beyond; investment in the areas of Electro Optic\/Infrared devises and advanced sensors; and technologies that provide the navy of the future the ability to quickly locate, target, and strike critical targets ashore."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Directed Energy"
                                    },
                                    "Description": {
                                        "val": "The goal of this activity is to develop technologies and capabilities that enable Directed Energy (DE) weapons for naval applications as well as defense against adversary Directed Energy systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.284"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.427"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Component Technologies\n- Conduct research efforts and thrusts in component technologies and basic understanding of laser\/material interactions to enable higher power, more lethal High Energy Laser (HEL), high power Microwave\/Radio Frequency, and Ultra Short Pulse Laser (USPL) weapons capabilities. Some examples of research include the development of novel laser and beam directory architectures, improved sensor and illuminator technologies including materials and coating, improved HEL electrical to optical efficiency, improved laser sources with enhanced spectrum control, reduced system jitter and improved precision aim point maintenance. Other research areas that will be explored are the syntheses of target recognition, pose\/trajectory estimation, autonomous aim point selection and maintenance including tracking through intermittent viewing conditions such as waves and clouds, understanding atmospheric characterization and modeling tools, blooming, laser\/material\/target interactions, novel laser sources in Medium Wavelength Infrared (MWIR) and the Long Wavelength Infrared, USPL propagations and effects. Research will continue in Counter Directed Energy Weapons (CDEW), in response to the development of HEL and high-power microwave (HPM) and high-power radio frequency threats. Complete effort to develop a fiber based high power laser operating in the eye safe regime beyond 2 microns.\n\nElectronics\n- Conduct applied research efforts to apply innovative Science and Technology (S&T) in plasmas, pulsed power, electromagnetic acceleration, particle beams, high-energy & Ultra Short Pulse Lasers, and non-linear optics to support current and future Navy and DoD needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.044"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.044"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Component Technologies\nConduct exploratory research and develop component technologies that enables higher power, more lethal High Energy Laser (HEL), High Power Microwave (HPM) and Ultra Short Pulse Laser (USPL) weapons. Research efforts include:\n\n- Development of novel laser and beam-director architectures\n- Improved sensor and illuminator technologies\n- Improved HEL electrical-to-optical efficiency\n- Improved laser sources with enhanced spectrum control\n- Reduced system jitter and improved precision aim-point maintenance\n- Improved characterization of atmosphere and associated modeling tools\n- Improved understanding of blooming and laser\/material\/target interactions\n- Development of novel laser sources in MWIR and LWIR\n- Improved understanding of USPL propagation mechanisms and effects\n\nCounter Directed Energy Weapons (CDEW)\nConduct exploratory research in response to development of HEL and HPM threats. Research efforts include:\n\n- Development of understanding of HPM use in EM Maneuver Warfare and Integrated Defense of US naval forces\n- Improved understanding of HPM effects and lethality\n- Improved predictive tools and testing instrumentation\n\nElectronics:  To develop and apply innovative S&T in plasmas, pulsed power, electromagnetic acceleration, particle beams, high-energy & ultra-short-pulse lasers (USPL), and non-linear optics to support current and future Navy and DoD needs. \n- Research efforts include: Adaptive Optics for Nonlinear Atmospheric Propagation of High-Power Laser Pulses and on Multiband Tunable High Power Fiber Laser."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Speed Propulsion and Advanced Weapon Technologies"
                                    },
                                    "Description": {
                                        "val": "This activity is focused on applied research to support the development of vehicle and propulsion technology for high-speed weapons operating from Mach 3 to Mach 8 and beyond. The goal is to develop computational, experimental and flight testing capabilities along with the workforce needed to support the development of hypersonic weapons. Research includes: \n\nObjectives:\n- Prediction and control of hypersonic boundary-layers and shock-wave boundary-layer interactions\n- Development of hypersonic ground test facilities, instrumentation and nonintrusive diagnostics \n- Prediction of interactions between materials and the high-speed flight environment such as flight through weather and oxidation of thermal protection systems\n- Development of improved modeling tools to predict the aerothermal and aerodynamic performance of hypersonic weapons over a wide range of velocities and altitudes\n- Development of ultra-high temperature materials, cooling strategies and thermal protection systems that can survive the launch and flight environment \n- Development high-speed propulsion technologies such as solid fuel ramjets"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.823"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.774"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investments to include topics relevant for development of high speed propulsion for solid rocket motors and hybrid type propulsion technologies such as solid-fuel ramjets for greatly enhanced projectile range and missiles. High-speed and hypersonic external aerodynamic technologies will be investigated to support future development efforts to enable hypersonic boost-glide missiles and hypersonic ship-launched projectiles. \n\nSpecific research and development plans include continued development of very long range hypersonic boost-glide missiles and hypersonic ship-launched projectiles; advanced computational and experimental techniques for hypersonic boundary layer transition; high temperature thermal management research; ultra-high temperature materials research for hypersonic leading edges and nose tips; technology maturation of advanced airframes and controls; high G-force components and miniaturization of electronics; advanced guidance and control technologies for high speed weapons; insulator and ablative technology investigations; high speed propulsion and integrated airframe technology development to enhance system range, responsiveness, and reliability; and advanced material solutions to high speed airframes and air systems operating in maritime environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.767"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.767"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "High Speed Propulsion Technologies\nCurrent investments relevant to the development of high-speed propulsion technologies such as solid-fuel ramjets to extend the range of projectiles and missiles will continue. High-speed and hypersonic external aerodynamic technologies such as laminar flow control will be investigated to support future developments to enable hypersonic missiles and hypersonic ship-launched projectiles.\n\nNew research plans include:\n- Ground experiments and sounding-rocket flight experiments to demonstrate: under relevant conditions, new aeroshell material technology to extend laminar flow\n- High-fidelity computations, ground test techniques and flow diagnostics to characterize neutral and ionized gas species over the nose-tip region, frustum and wake of ablating hypersonic vehicles\n- Experimental and computational studies to extend the flight envelope of solid fuel ramjets to higher speeds and altitudes and to improve throttle-ability."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2020 to FY 2021 is associated with an increased concentration on the applied research in the areas of rocket and combined propulsion, warheads and energetic materials and advanced aerodynamics and control concepts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Navigation, Electro Optic\/Infrared (EO\/IR), and Sensor Technologies"
                                    },
                                    "Description": {
                                        "val": "This activity describes Navy Science and Technology investments in the areas of Electro Optic\/Infrared (EO\/IR) devices and advanced sensors and includes investment\/performance in the technology areas of EO\/IR, Electronic Warfare (EW), Electromagnetic Warfare, and Communications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.515"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.596"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electronics: Create and explore new concepts, components, techniques, and subsystems for the detection of Ultra-violet (UV), visible, and infrared radiation to support current and future Navy and DoD needs with attention given to quantum enabled precise time, and magnetic and gravimetric sensing.\n\nElectromagnetic Warfare: Multiple efforts will be executed to address the necessary technologies to engage Electro Optic\/Infrared threats through both active and passive countermeasures technologies and assuring deployment capabilities are available to achieve the proper disposition of materials for extended durations. Recent results in the application of new material concepts applied to IR concepts have received interest for potential follow on consideration pending successful demonstrations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.587"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.587"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electronics\nTo develop and explore new concepts, components, techniques, and subsystems for the detection of UV, visible, and infrared radiation to support current and future Navy and DoD needs with attention given to quantum-enabled precise time, and magnetic and gravimetric sensing.  \n\nCurrent plans are to focus efforts on:\n- Solution-Processed Ultra-Sensitive, Room-Temperature Short Wave Infrared\/ Mid-Wave Infrared (SWIR\/MWIR) Photodetectors.\n\nElectromagnetic Warfare \n\nEfforts completing in FY 2021:  \n- Micro-Gas Chromatography with Stationary-Phase Infrared Spectroscopy; Optimize in column planar IR sensor and GC column configuration; Test with range of representative analytes including complex mixture challenges; Include existing IMS or mass spectrometer technology for direct comparison testing; and Demonstrate in column planar IR sensor GC sensor to Government program managers and industry for transitions and commercialization."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease in funding from FY 2020 to FY 2021 is due to completion of Micro-Gas Chromatography research and reduced  investment in Electromagnetic Warfare related EO\/IR technologies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Strike and Littoral Combat Technologies"
                                    },
                                    "Description": {
                                        "val": "The focus of this activity is on those technologies that will support Naval Precision Strike Operations and provide the Navy of the future the ability to quickly locate, target, and strike critical targets ashore."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.732"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.749"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic Warfare: Technology development is ongoing to address capabilities to understand the defeat mechanism for operations of Intelligence Surveillance and Reconnaissance (ISR) platforms using non-traditional frequencies as well as protecting current capabilities against electronic attack through enhanced concepts. The non-traditional integration of ISR capabilities is being implemented into a major Commercialization Pilot Programs (CPP) funded effort at NRL to validate expectations at minimal cost to this program and expand the capability of a significant testing resource."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.394"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.394"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic Warfare\nThe projects in this area are developing technology and techniques to provide the Navy of the future the ability to quickly locate, target, and strike critical targets ashore.\n\nCurrent research efforts include:\n- New high-resolution sensing techniques for emerging USN needs in Maritime ISR to allow 3D imaging through cloud cover\n- Machine-learning-based resource management for distributed radar system operation to support search and track requirements while minimizing emissions to degrade, defeat, and delay counter targeting. \n\nEnded in FY20: \n- Developed electronic protection (EP) techniques and algorithms to enable surveillance, imaging, and targeting in EW denied areas."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease in funding from FY 2020 to FY 2021 is due to the Electronic Protection technologies effort completing in FY20."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "12.549"
                        },
                        "CurrentYear": {
                            "val": "10.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "22.549"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "High Performance Microwave for Counter-IED Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8.688"
                                        },
                                        "Text": {
                                            "val": "Funds will be used towards the isolating\/determining High Power Microwave (HPM) waveform spaces that enable control over desired levels-of-lethality on small Unmanned Aerial Vehicle (sUAV) and similar targets, with the least power density, to drive development of transitionable HPM sources and electronically steerable radiators."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Directed Energy"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "3.861"
                                        },
                                        "Text": {
                                            "val": "Develop advanced components for use in Directed Energy applications."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Microwave systems for counter-UAS defense"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Conduct applied research for Microwave systems for counter-UAS defense"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}