{
    "id": "2021-Navy-PB-1319-JBOOK-29075b3c2af92ab5fcca1096cf65ecac9cc771240d227e79d45bc59626cdea42-18",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603640M"
        },
        "ProgramElementTitle": {
            "val": "MC Advanced Technology Demo"
        },
        "R1LineNumber": {
            "val": "19"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "170.659"
            },
            "CurrentYear": {
                "val": "212.347"
            },
            "BudgetYearOne": {
                "val": "219.045"
            },
            "BudgetYearOneBase": {
                "val": "219.045"
            },
            "BudgetYearTwo": {
                "val": "221.406"
            },
            "BudgetYearThree": {
                "val": "215.419"
            },
            "BudgetYearFour": {
                "val": "194.026"
            },
            "BudgetYearFive": {
                "val": "186.702"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The U.S. Navy\/Marine Corps team is the most potent naval fighting force in the world. Fundamental to their success are the technologies necessary for effective distributed maritime operations. The Office of Naval Research (ONR) combines knowledge of the naval mission with researchers to select and explore solutions critical to expeditionary warfighting needs.  This Program Element (PE) addresses requirements outlined. Additionally, an emergent operation stressor is the contested urban environment which exemplifies the characterizations listed above. The urban environment is one of the most complex terrains with physical compartmentalization and canalization, additional physical dimensions (subterranean and multi-story structures), crowded conditions and associated threat obscuration, communications challenges, informational and human aspects, and proliferation of observation and fires technologies. This environment requires capabilities addressing all the activities within this PE and while it provides many challenges, unique opportunities are also presented and can further shape technology approaches. \n\nThese future challenges and portents demand robust technologies for the Marine Corps, but the technology options are constrained. They must have a lightweight deployable character, and the ability to operate in austere conditions with little fixed infrastructure or support while retaining the agility and lethality of an integrated maneuver force. Technology must provide full spectrum capability against robust and complex peer and near-peer adversaries while meeting Size, Weight, Power, Cost limitations, and information availability within Distributed, Intermittent and Limited environments. \n\nThe approach within this PE encompasses ideas that support both revolutionary and evolutionary capabilities, and in this way considers and balances both \"push\" and \"pull\" aspects of technology projects. This PE matures technologies emerging from PE 0602131M-Marine Corps Landing Force Technology to develop concept prototypes and initial experimentation to confirm feasibility in an environment relevant to operations. \n\nThis Program Element (PE) funds Advanced Technology Development (ATD) that includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment. Efforts in this PE generally have Technology Readiness Levels TRL) of 4 (component and\/or breadboard validation in laboratory environment.), 5 (component and\/or breadboard validation in relevant environment.), or 6 (system\/subsystem model or prototype demonstration in a relevant environment).\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "174.809"
                },
                "CurrentYear": {
                    "val": "172.847"
                },
                "BudgetYearOne": {
                    "val": "168.520"
                },
                "BudgetYearOneBase": {
                    "val": "168.520"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "170.659"
                },
                "CurrentYear": {
                    "val": "212.347"
                },
                "BudgetYearOne": {
                    "val": "219.045"
                },
                "BudgetYearOneBase": {
                    "val": "219.045"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.150"
                },
                "CurrentYear": {
                    "val": "39.500"
                },
                "BudgetYearOne": {
                    "val": "50.525"
                },
                "BudgetYearOneBase": {
                    "val": "50.525"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "39.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-4.150"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "50.525"
                                },
                                "BudgetYearOneBase": {
                                    "val": "50.525"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The program increase in FY 2021 reflects an alignment to Naval priorities and a targeted investment in signature management and multi-domain sensors necessary to support warfighter requirements as well as increased investment in logistic material transport surface and aerial platforms.\n\nMarine Corps Warfighting Laboratory \/ Futures Directorate (MCWL\/FD: Major program adjustments, beginning in FY20 and sustained across the FYDP, support Marine Corps specific Science and Technology initiatives, and are in accordance with Office of the Secretary of Defense (OSD) steady-state guidance. Efforts are justified in Project 2297."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2223"
                    },
                    "ProjectTitle": {
                        "val": "Marine Corps ATD"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "98.695"
                        },
                        "CurrentYear": {
                            "val": "95.327"
                        },
                        "BudgetYearOne": {
                            "val": "114.439"
                        },
                        "BudgetYearOneBase": {
                            "val": "114.439"
                        },
                        "BudgetYearTwo": {
                            "val": "116.490"
                        },
                        "BudgetYearThree": {
                            "val": "116.592"
                        },
                        "BudgetYearFour": {
                            "val": "114.030"
                        },
                        "BudgetYearFive": {
                            "val": "107.111"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds technology demonstration, experimentation, and prototyping; and more technologically mature projects within the Future Naval Capability (FNC) process as means to inform, enhance, enable, and invent future concepts and capabilities with new Science and Technology (S&T). This project is organized into ten activities, the core of which is represented by the eight Expeditionary Warfighting Capability Areas.\n\nEmphasized within this project are increased efforts to actively demonstrate advanced technologies and system concepts. These demonstrations and experiments focus on the specific technologies, not necessarily their operational application, and vary based on the technical maturity of the project. This early technology exposure gives Marines a view into the future and enables them to use their imagination and innovation to envision novel employment of the technology and inform the acquisition process."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Command, Control, Communications, Computers (C4)"
                                    },
                                    "Description": {
                                        "val": "This activity investigates robust, resilient, and secure networked communications pathways and capability that support an expeditionary force's distributed and disaggregated operations. Research supports both networked and local computation for communications that exploits the expeditionary forces close physical proximity to threats while mitigating shortfalls commensurate within Distributed, Intermittent, and Limited environments. Expeditionary forces must operate in the cyber domain and in addition to defending communications networks, vehicles, and weapons systems, are reliant on electronic controllers for basic operations and as such are susceptible to cyberattacks.\n\nTechnologies addressed within this activity include secure, robust, self-forming, mobile communications networks; distributed computing to support information dissemination to all echelons; improved capabilities in over-the-horizon, beyond line-of-sight, and restricted environment communications and sensors; and software and data processing to support formation of an appropriate common picture. Other efforts include power management, low detectability, conforming to Size, Weight, Power, Cost constraints, and interoperability within the joint environment.\n\nFurther, this activity integrates and demonstrates enhanced communications and situational awareness capabilities in experimental and warfighting environments reflecting USMC operations. Advanced technology resources will be developed and applied to complement commercial, other service, and defense agency investments to produce a technology base addressing identified Marine Corps technology gaps.  Focus will be on developing component level prototypes and experimentation in relevant environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.480"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The C4 and Electronic Warfare research effort focuses heavily on the continued development and integration of multiple underlying technologies into subsystems and system with the purpose of demonstrating the tactical exploitation of information and the electromagnetic spectrum. To address resiliency requirements of C4 this effort is closely coordinated with the Intelligence, Surveillance, and Reconnaissance and Expeditionary Cyber research portfolio also described herein so as to most efficiently exploit multifunction capabilities in portable reduced Size, Weight, Power, Cost systems. This integrated rapid co-design, prototyping, and experimentation approach will reduce time needed to provide new capabilities to the US Marine Corps. Developed and demonstrated technologies will include advanced signature management, interoperability, machine learning, spectrum maneuver, damage assessment monitoring, and information dominance for tactical edge systems. Additional emphasis of operating in the challenging warfighter electromagnetic spectrum environment is addressed in the multifunction electronic warfare domains."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.598"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.598"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to emphasize operating in contested and denied electromagnetic spectrum (EMS) environments. The goal of operating ubiquitously in multifunction electronic warfare domains will be achieved by reducing size to handheld form factor focused heavily on the continued development and integration of multiple underlying technologies into systems and subsystems with the purpose of demonstrating the tactical exploitation of information and the EMS. To address resiliency requirements of Command, Control, Communications, Computers (C4) this effort is closely coordinated with the Intelligence, Surveillance, and Reconnaissance and Expeditionary Cyber research portfolio also described herein so as to most efficiently exploit multifunction capabilities in portable reduced Size, Weight, Power, and Cost systems. This integrated rapid co-design, prototyping, and experimentation approach will reduce time needed to provide new capabilities to the US Marine Corps.  \n\nThe following efforts are in collaboration with the CRIT and MuDRaCE FNC activities in this PE\/project and leverage experimental discoveries under the MAGTF C4 project to accelerate development of high priority capabilities.\n- Initiate the development to demonstrate technologies that include advanced signature management, machine learning, interoperability, spectrum maneuver, damage assessment monitoring, and information dominance for tactical edge systems.\n- Initiate the development to demonstrate portable distributed multi-domain sensor and surveillance technologies in portable expeditionary warfare form factor to protect forces in denied and contested EM environments."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY2020 to FY2021 reflects an alignment to Naval priorities and a targeted investment in signature management and multi-domain sensors necessary to accelerate their development, help close high priority capability gaps, and meet the demands of the National Defense Strategy \"forward force maneuver and posture resilience.\""
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Firepower"
                                    },
                                    "Description": {
                                        "val": "The activity investigates a large variety of weapons to provide the warfighter with a decisive, yet surgical, tactical advantage to collectively address 21st-century combined-arms warfare against peer and near-peer states. Research efforts increase the reach, lethality, and capacity while retaining mobility and tempo beneficial to expeditionary maneuver warfare. Maintaining focus on Size, Weight, Power, Cost and Distributed, Intermittent and Limited environments stresses the technical solutions available. This activity furthers the maturity of researched technology solutions by also developing the integration required to effectively demonstrate and test emergent capabilities. Achieving a true combined arms state involves a full systems approach for both kinetic and non-kinetic capabilities all driven by a holistic targeting capability. This activity develops technology for application on current and future expeditionary weapons. It includes, but is not limited to, the following technologies: fuze, fire control, targeting, launch\/propulsion, lethality, and accuracy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.985"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Finalize development of caseless small caliber ammunition: development of fuzing and sensor technologies for cannon-delivered area effects munitions, and development of supervised-autonomous weapon system control technologies for weaponized unmanned ground vehicles. Munitions developments will focus on low cost, extended range, precision munitions with improved lethality warhead payloads for use against stationary and moving targets on land and water, in satellite and network denied environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.160"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.160"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Progress development of automated fire control technologies enabling automated target classification and prioritization for weaponized unmanned ground vehicles \n- Munition development will continue to focus on low-cost, extended range, precision guided munitions, having improved lethality warheads for use against various types of stationary and moving targets on land and water, and in satellite and network denied environments"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY20 to FY21 reflects a completion of caseless ammunition work in FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Force Protection"
                                    },
                                    "Description": {
                                        "val": "This activity investigates new ways and means to protect forces and materiel across all operational settings from contested sea-land surface interfaces to complex urban environments. The portfolio protects against adversaries' challenges such as guided-rockets and missiles, mobile coastal artillery, threat Electronic Warfare and Counter Intelligence, and Surveillance and Reconnaissance. Mines and obstacles both in the water and ashore also complicate amphibious landings. The activity invests in vehicle survivability aspects that are exacerbated due to Size, Weight, and Power Cost constraints inherent to Marine Corps operation and the harsh nature of the amphibious environment.\n\nTechnologies addressed include lightweight armor for ballistic and underbody blast protection, advanced sensors for counter tactical surveillance, active protection, and signature management. This activity also considers technology for payloads, packages and sensors that are needed by amphibious vehicles (both manned and unmanned) including mine counter measures; explosive hazard defeat systems; and obstacle and threat detection systems as well as technologies for improved protection for individuals against blast, ballistic and blunt impact threats.\n\nTechnologies in this activity enable Marine Corps forces to maintain operational tempo through a range of environments by avoiding or detecting surveillance and targeting capabilities before engagement; counter detection and targeting (e.g. long range sniper, urban shooter, rocket propelled grenades) and delay vehicle detection and identification through signature management\/control."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.794"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.415"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 2020 Plans emphasize development of miniaturized hardware systems for the detection of threats across a variety of sensing modalities to take advantage of unique susceptibilities of threat systems at significant ranges. Leveraging these sensor systems, there will be development of computer vision and machine learning approaches for automated target recognition within these innovative sensing modalities. There will be development of feature extraction of threats leveraging Radio Frequency based 3-Dimensional buried object detection. Signature reduction materials and sensor hardware for pre-shot detection of ambush threats and surveillance will be demonstrated on platforms to evaluate enhanced survivability. Efforts will also include tactical decision aids that provide vehicle susceptibility assessment and route planning recommendations. Additionally, technologies and systems supporting the neutralization of threat systems via kinetic and non-kinetic means, to include unmanned aerial vehicles, will be developed."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.167"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.167"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Efforts that emphasize the further development of sensors and systems to enable autonomous amphibious assault under mined and obstacle environments will continue. This continues the work on buried object detection, and combines it with other sensor modalities such as magnetometers and electro-optical and integrate on a range of unmanned platforms. These platforms are capable of operating in and from the very shallow water\/surf-zone under contested conditions as well as in-land cluttered environments. \n- Technologies and systems supporting the neutralization of threat systems via kinetic and non-kinetic\/directed energy means will continue. These threats include unmanned aerial vehicles as well as defenses against direct-fire precision weapon systems.\n- Miniaturized hardware sensing systems will be developed for the detection of threats across a variety of sensing modalities to take advantage of unique susceptibilities of threat systems at significant ranges.\n- Develop advanced technologies that enable detection of hazards and surveillance\/targeting systems in complex operational environments such as jungles and littorals. Demonstrate use of autonomous vehicles in the detection, neutralization, marking, and reporting of hazards."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2020 to FY 2021 is due to an increase in applied technology developments to counter small Unmanned Aerial Vehicle Swarms."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Performance, Training and Education"
                                    },
                                    "Description": {
                                        "val": "This activity investigates several technology investment areas; warrior resilience, and decision-making and expertise development. Warrior resilience is focused on advanced training technologies and methodologies that enhance neural, cognitive, and physical readiness. Decision making and expertise development accelerates development\nand improves the retention of skills in decision making, situation awareness, and individual and team adaptability and coordination on decentralized, dynamic and dispersed battlefields.  Focus will be on developing component level prototypes for Marine for evaluation and experimentation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.863"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct research in wearable physiological monitoring, predictive algorithms, health tracking capability, and related technologies will provide the opportunity to integrate with Marine Corps' 'Force Fitness Division' programs in support of close combat formations and populations, in order to increase physical readiness and reduce potential injuries. The use of these 'Warrior Resilience' programs may be demonstrated as integral elements of larger, multipurpose exercises focused on all aspects of military tasks, or as stand-alone events where the primary purpose is to illustrate the capability to achieve improved awareness of the physical and physiological readiness of the individual. \nThe advance of augmented reality devices and the content available for collection and display, and each of their contribution to simulation-based training (and the increased decision-making ability that this training can afford) will provide the opportunity to demonstrate 3-Dimensional (3D) terrain visualization, battlefield control measures and effects, and target identification and classification. This robust and ever increasing capability will be incorporated into demonstration opportunities at ever-increasing levels of complexity and scale to demonstrate the increased decision making efficiency - in both speed and accuracy of information processing across the plan, execute, and debrief spectrum of operations.  Demonstrations will include advances in hardware, software, collection and display capabilities that will support increased decision making and expertise development and warrior resilience."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.650"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.650"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate capability to increase physical readiness and reduce potential injuries by using wearable physiological monitoring devices, predictive algorithms, health tracking capability, and related technologies that support Marine Corps' 'Force Fitness Division' programs. The use of these Warrior Resilience programs may be demonstrated as integral elements of larger, multipurpose exercises focused on all aspects of military tasks, or as stand-alone events where the primary purpose is to illustrate the capability to achieve improved awareness of the physical and physiological readiness of the individual.\nContinue efforts demonstrating 3D terrain visualization, battlefield control measures and effects, and target identification and classification will continue. This robust and ever increasing capability will increase decision making efficiency - in both speed and accuracy of information processing.\nDevelop assessment tools and experiential training solutions to place, retain, and educate the right Marine for the right military occupation."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Intelligence, Surveillance, and Reconnaissance (ISR)"
                                    },
                                    "Description": {
                                        "val": "This activity investigates enhanced situational awareness, persistent surveillance, and tactical decision making through automated analysis of data and rapid integration of information and acquired knowledge.  Specific technologies in this activity effectively present actionable information to decision-makers, especially those at the lower command levels.  This includes biometric monitoring for expeditionary operations, operational Course of Action development, and autonomous surveillance in support of distributed operations. Conduct advanced development research on the impact of machine learning on mission outcomes. Will investigate the operational relevance of enhanced situational understanding and machine-aided tactical decision-making.  This includes presenting actionable information (e.g. support to planning, mission monitoring, and re-planning to decision makers).\n\nFurther, this activity supports the demonstration of technologies to enhance situational awareness and tactical decision making through automated analysis, fusion of data, rapid integration of information, and acquired knowledge resulting in actionable intelligence at the lower command levels. The activity includes the demonstration of ISR efforts involving enhanced reconnaissance and persistent surveillance, and sensors for unmanned ground and aerial vehicles. Advanced technology demonstrations also include the collection of information [monitoring, sensing, and locating] in the 3-Dimensional urban battlespace as well as exploiting information [identifying and classifying data] as part of the intelligence preparation of the battlespace in order to facilitate operational maneuver and distributed operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.460"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct assessment of the operational utility of natural language processing and computer vision.  Show operational relevance of computer vision as an autonomy enabler. Increase emphasis on the production of synthetic data useful to train decision aids.  Accelerate deep learning enabled data fusion. Mature algorithms capable of analyzing signatures and signature changes from graph data. Initiate development of deep learning architecture enablers including dynamic graph stores and workflow managers for models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.136"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.136"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct advanced development research on the operational utility of artificial intelligence\/machine learning algorithms and develop applications to specifically apply these techniques to Marine Corps intelligence and operations activities.\nIncrease emphasis on the use of model-based simulators to generate data useful for machine learning while learning how to combine real data with operational data. Conduct experimentation with operational forces to understand the utility and impact of these tools on improving and accelerating understanding and information-based decision-making as well as reductions in operator workload"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from FY20 to FY21 is to enable tactical AI\/ML development, work has accelerated to utilize reinforcement to teach agents to complete Marine  to FY21sential Task under diverse conditions within standards.  These agents then act within physics based simulations to provide training data needed to produce exercise decision aids. Work has also accelerated to give these agents known human decision preferences\/biases in order to pass a \"Turing\" test for agent enabled simulations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "USMC Future Naval Capabilities"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity addresses the advanced technology development associated with the Marine Corps' participation in the Department of the Navy's (DoN) Future Naval Capabilities (FNC) Program.  The objective of the work in this Program Element (PE) is to develop promising technologies emerging from the FNC technology candidates funded in PE 0602131M that have been matured to higher Technology Readiness Levels (TRLs). Investments in this activity are coordinated with similar and non-duplicative efforts in PE 0603673N.  The FNC Program is structured to accelerate the transition of new technologies to the Fleet and Force.  Each effort is assessed for its technology maturity and transition commitment. Funding for FNCs, which have Technology Readiness Levels (TRLs) of 4\/5 to 6 and also have transition funding commitments from acquisition Programs of Record, are resourced in this PE 0603640M MC Advanced Technology Demo.  Funding for FNC technology candidates at lower TRLs (3 to 4) is resourced in PE 0602131M Marine Corps Landing Force Tech.  ONR is working closely with the Resource Sponsors and acquisition stakeholders to develop high priority technological capabilities needed by the operational forces.\n\nFNC budget activity (BA) 2 investments develop candidate FNC technologies in an agile fashion by exploiting technology advances that respond rapidly to naval needs. This approach facilitates an optimum response when developing and maturing the technology options that can be developed further in this PE 0603640M MC Advanced Technology Demo. \n\nThe FNC Program favors a high level of collaboration. Collaboration with the acquisition stakeholders and their resource sponsors is required. A complete accounting of the technology candidates being developed and a full disposition of each technology development effort funded in this PE is provided annually to the Congressional oversight committees."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.585"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.849"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity focus on developing promising technologies emerging from the FNC Applied Research program that have been matured to a Technology Readiness Level of 4 to 5.  Technologies being developed include, but are not limited to, those that increase target prosecution speed and accuracy against enemy firing positions by compressing the kill chain timeline through sensor fusion, Command and Control integration, and automated collaboration of warfighting functions, those that will enhance mobility, propulsion, autonomy, weapons, materials, logistics, vehicle architectures, and Electronic Warfare protection for a light armored vehicle fleet, technologies associated with the development of an affordable, longer range mortar projectile, with precision delivery against stationary and moving targets during periods of full Global Positioning Satellite denial, technologies that optimize the balance between hardening and flexible software development for future dynamic engagements in contested environments with adversaries, and new repair techniques to include the use of solid-state technologies such as cold-spray and additive friction stir welding for structural repairs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.783"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.783"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This activity will continue to focus on developing promising technologies emerging from the FNC Applied Research program that have been matured to a Technology Readiness Level of 4 to 5. Technologies being developed include, but are not limited to:\n\nCRIT\n- In collaboration with Command, Control, Communications, Computers (C4) activity in this PE\/project, initiate the accelerated development of capabilities to demonstrate small form factor technologies that provide improved signature management of the Marine Air-Ground Task Force (MAGTF) in electromagnetic and information environments.  This effort addresses a high priority Marine Corps capability gap and directly supports the National Defense Strategy by providing an 'advanced autonomous system' for 'forward force maneuver and posture resilience'.\n\nEnabling Dynamic Operational RF (ENDOR)\n- Continue work on ENDOR by initiating development of a more secure tactical computing infrastructure, reducing its attack surface for modern C-UAS and C-IED applications that use standardized interfaces for rapid hardware and software integration.\n\nArmored Reconnaissance Vehicle (ARV)\n- Complete the integration of technologies into transformational advanced reconnaissance vehicle technology demonstrators and test and evaluate the land and water propulsion system, sensors, weapons, survivability, and unmanned systems in a relevant environment to assess enhanced capabilities.\n\nEnhanced Lethality for Maritime Operations (ELMO)\n- In collaboration with a complementary effort funded in PE 0603673N - FNC Advanced Technology Demonstration, initiate development of new Multi-Function Sensor (MFAS) modes for the MQ-4C Triton Unmanned Aircraft System (UAS), enhancing Distributed Maritime Operations (DMO) with the Next Generation Network (NGN).\n\nStreamlined Marine After-Action Review Tool- Visualization (SMART-Viz)\n- In collaboration with a complementary effort funded in PE 0603673N - FNC Advanced Technology Demonstration, initiate technologies that provide timely and improved feedback to warfighters to enhance learning in live and simulated environments.\n\nMulti Domain Radar for the Contested Environment (MuDRaCE)\n- In collaboration with the C4 activity in this PE\/project, initiate the accelerated development of capabilities for a highly mobile multi-domain radar system with improved effectiveness and survivability to support MAGTF units in contested environments.  This effort leverages MAGTF C4 networking and sensor development for system of systems capability to ensure key National Defense Strategy requirement for expeditionary 'forward force maneuver and posture resilience' and addresses a high priority Marine Corps capability gap.\n\nAll Signal Tactical Real-Time Analyzer (ASTRAL)\n- Initiate the development of sensors able to detect, identify, and characterize complex signals in contested and congested electromagnetic environments.  This program will explore novel topologies that help to address these applications using photonics. Particular emphasis will be given to the use of integrated photonics as a path to reduce overall system cost, size, weight and power (C-SWAP)."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2020 and FY 2021."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Logistics"
                                    },
                                    "Description": {
                                        "val": "This activity investigates the practical discipline and real world application of the deployment, sustainment, reconstitution, and re-deployment of forces engaged in expeditionary operations.  Logistics replaces mass with assured knowledge and speed, is equally capable ashore or afloat in austere environments, and is fully scalable to meet uncertain requirements.  This includes efficient and responsive force sustainment, planning and directing logistics operations, logistics demand reduction, fleet maintenance, and expeditionary energy.  Expeditionary Energy enhances combat capability of expeditionary warfighters by increasing the efficiency and effectiveness of energy production, storage, distribution and use. Beyond traditional energy efforts, this portfolio also looks at other issues, including energy-efficient behaviors and hybridization of energy sources. These pillars are thoroughly integrated and perpetually related in execution."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.053"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.837"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Logistics development will focus on the broad range of technologies to demonstrate the military utility of enhancing combat capability by increasing energy production, storage, distribution, and curbing energy consumption of the individual Marine and other tactical assets. This includes advanced system research into the scaled use of high specific power solar cell for Marine Corps applications ranging from the individual warfighter to augmenting the power and combat endurance unmanned robotic vehicles. Additionally investigate, system level research and demonstration of enhanced power and energy technologies to support the Marine warfighter as a system, to include enhanced power and energy storage technology, more energy efficient equipment, and enhanced power networks that enhance mission duration, decrease combat load, and enhance combat performance.  Research into friction stir welding and additive friction stir welding, and cold spray for structural repair of Marine Corps equipment will be completed."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.495"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.495"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Advance the broad range of technologies to demonstrate the military utility of enhancing combat capability by increasing energy production, storage, distribution, and curbing energy consumption of the individual Marine and other tactical assets. Conduct advanced system research into the scaled use of high specific power solar cell for Marine Corps applications ranging from the individual warfighter to augmenting the power and combat endurance unmanned robotic vehicles. Progress efforts to investigate energy-efficient planning for unmanned aircraft, enabling modular and reconfigurable tactical microgrids and wave energy technologies."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2020 to FY 2021 reflects an alignment to Naval priorities and increased investment in logistic material transport surface and aerial platforms."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maneuver"
                                    },
                                    "Description": {
                                        "val": "This activity investigates new ways and means to land forces and material through contested sea-land surface interfaces and then conduct maneuver warfare. In order to enable future Amphibious Operations, research efforts will support autonomous operations across the sea-surf-ground environment, improved fuel efficiency and speed of amphibious vehicles, amphibious vehicle technologies, water performance, and amphibious payloads to change the dynamics of a surface amphibious assault. This includes the emergence manned-unmanned teaming and autonomous vehicle collaboration.\n\nThe technologies included in this work address areas of mobility, materials, propulsion, signature reduction, modularity, and unmanned systems. This also encompasses navigating the surf zone by a small autonomous vehicle, navigating negative obstacles on land at speed, overcoming adversarial intent, and developing low-cost robotic autonomy kits to support expeditionary amphibious operations (e.g., ISR, mine-counter-measures, breaching, fire support, and logistics)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.070"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.526"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 2020 Plans include research and evaluation of advanced technologies for full combat systems.  Demonstrator platforms will be developed that integrate novel propulsion, mobility, and autonomous technologies to enable enhanced land operations and seamless transition between land and water environments.  The automation and autonomy systems developed will concentrate on the surf-zone and beach operations and include work to include development of unmanned swarming amphibious assault craft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.450"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.450"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Progress the development and evaluation of mobility technologies and future concepts for the ground and amphibious fleet to improve maneuverability across a range of challenging terrain environments. Demonstration platforms will continue to be used for further development of technologies to enable enhanced land operations and seamless transition between land and water environments. Expand efforts on the automation and autonomy systems to include development of low-cost, unmanned swarming amphibious assault capable platforms with a focus on performance in the surf zone and beach environments. Conduct experimentation in increasingly challenging environments to evaluate system performance.  Transition enabling technologies for the Armored Reconnaissance Vehicle from this activity to the Future Naval Capabilities activity"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY20 to FY21 reflects a transition of enabling technologies for the Armored Reconnaissance Vehicle from this activity to the Future Naval Capabilities activity."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Expeditionary Cyber"
                                    },
                                    "Description": {
                                        "val": "This activity provides freedom of maneuver and influence in the cyber-electronic warfare domain while simultaneously denying the same to the adversary and protecting critical command systems. Technologies are being developed using a multi-disciplinary approach that combines Radio Frequency electronics, digital signal processing, computer engineering, software engineering, machine learning and data science to support Naval Expeditionary warfighters operating with size, weight and power constrained equipment in Disrupted, Intermittent, Limited environments. Areas of applied research include distributed precision time, predictive software defined radio architectures, coordinated Cyber and Spectrum maneuver to mitigate detection and exploitation, tactical Cyber visualization, discovering and mapping networks in dense urban environments, contextual awareness and blind channel characterization."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.405"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2297"
                    },
                    "ProjectTitle": {
                        "val": "Futures Directorate"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "45.900"
                        },
                        "CurrentYear": {
                            "val": "73.046"
                        },
                        "BudgetYearOne": {
                            "val": "99.806"
                        },
                        "BudgetYearOneBase": {
                            "val": "99.806"
                        },
                        "BudgetYearTwo": {
                            "val": "100.116"
                        },
                        "BudgetYearThree": {
                            "val": "94.027"
                        },
                        "BudgetYearFour": {
                            "val": "74.996"
                        },
                        "BudgetYearFive": {
                            "val": "74.492"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The mission of the Marine Corps Warfighting Laboratory \/ Futures Directorate (MCWL\/FD) is to identify future challenges and opportunities, develop warfighting concepts, and comprehensively explore options in order to inform the combat development process to meet the challenges of the future operating environment.  The Deputy Commandant, Combat Development and Integration (DC, CD&I) is the United States Marine Corps (USMC) advocate for Science and Technology (S&T). MCWL's Commanding General (CG) is the proponent of USMC S&T and serves as the USMC Executive Agent for Marine Corps S&T. The MCWL\/FD also serves as the Marine Corps' liaison to the Joint Staff for Joint Concept Development and Experimentation; thereby facilitating service-specific experiments as well as participation in joint service experimentation.  \n\nAs reflected in strategic guidance, expeditionary forces will provide an ever-ready quick strike force to protect United States (US) interests. MCWL\/FD pursues concepts, capabilities, and solutions to ensure that Marine of the future force will be effectively organized, trained, and equipped to win across the range of military operations in an uncertain and complex environment. Prioritized investments in S&T are necessary to enable the future Marine Corps and maintain a technological advantage over our adversaries.\n\nThis project is organized into 6 activities, the core of which are represented by the Warfighting Capability Areas of the Marine Air-Ground Task Force (MAGTF).  The project emphasizes development and demonstration of advanced technology capability concepts, and the examination of their operational application and military utility in the context of formal wargames and live-force field experimentation with Marines. This operational experimentation directly supports Marine Corps combat development to inform future capability requirements and optimize the acquisition process."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Combat Service Support (CSS) and Force Protection"
                                    },
                                    "Description": {
                                        "val": "This activity includes Marine Corps Warfighting Laboratory \/ Futures Directorate (MCWL\/FD) Combat Service Support and Force Protection experimentation efforts including assessment of equipment, new Tactics, Techniques, and Procedures (TTPs), training opportunities, and proposed organizational changes associated with enhanced capabilities.  This activity develops technology in support of a more distributed technologically advanced force, increasing range, effectiveness, and survivability of the Marine Corps Air-Ground Task Force (MAGTF). Most programs listed below are considered major (valued at $500K or more) or have near real-time operational impact. Investments in this activity are conducted under the Thrust Areas of Expeditionary Logistics, Expeditionary Medicine, Force Protection, or Autonomy and Robotics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.002"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.447"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop prototypes and experiment with logistics enablers and air defense enhancements in support of (EABO) and Littoral Operations in a Contested Environment (LOCE) as prescribed by the Commandant's Planning Guidance (CPG). This includes development and experimentation with autonomous sea-based surface connectors for over-the-horizon missions during ship-to-shore maneuvers. Experiment with efficient and redundant hybrid energy platforms providing reliable electrical power using multiple fuel input sources. Develop a highly mobile and efficient hybrid power generation and storage capability that provides the flexibility to operate with a variety of energy sources in support of EABO. Effort includes developing a modular design combining JP-8 fuel cell, solar, battery and energy scavenging technologies. Integrate hybrid\/electric capabilities within the MAGTF to experiment with alternative vehicle power, extended mobility, and logistics demand reduction functions; building Concepts of Operations (CONOPS) and TTPs for tactical mobility utilizing electric\/hybrid power as a fuel source. Improve ground maneuver force and critical installation defense against small unmanned aerial systems (UASs). Effort includes development of new counter UAS architectures, integration of new sensors for detection and tracking, and development of new counter-UAS defeat mechanisms. Develop, test, and evaluate autonomous\/automated aerial platforms for logistics resupply. Develop and experiment with highly autonomous and synchronous logistics capabilities in support of expeditionary MAGTF operations, offering increased flexibility and speed to Marines by means of seamless, end to-end logistics chain management and execution. Effort includes air, sea, and ground based systems, providing tactical commanders with an organic, responsive, and flexible option(s) to support disbursed and semi-independent maneuver operations. Develop an autonomous explosive detection and defeat capability. Continue to develop and experiment with medical technologies that enhance survivability; includes power management and energy scavenging capabilities which will enable more effective casualty warming and blood storage\/distribution. Integrate and experiment with systems to provide battlefield medical command and control and information management."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.555"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.555"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Unmanned Logistics and Defense - Continue prototype development and experimentation of logistics enablers and air defense enhancements in support of a more distributed technologically advanced force, in support of (EABO). This effort develops platforms that assess and analyze execution of high-tempo unmanned support to dispersed and disaggregated forces during joint air-ground operations.  Continue development and experimentation with autonomous sea-based surface connectors for over-the-horizon missions during ship-to-shore maneuvers.  This effort addresses maneuvering from seabases and littorals and includes autonomous breaching, well deck operations, payload integration, and bulk transport of personnel and equipment. \n\n- Sustainment - Sustain multiple technologies either developed or leveraged from existing capabilities that can be integrated within the MAGTF to experiment with alternate vehicle power, extended mobility, hybrid energy, expeditionary fuel distribution, and small unit water purification to enable logistics demand reduction and provide alternate sustainment to the MAGTF at all levels. This includes continuing experimentation with efficient and redundant hybrid energy platforms providing reliable electrical power using multiple fuel input sources. \n\n- Counter UAS - Continue development of counter UAS architectures, integration of sensors for detection, tracking, and defeat of unmanned aerial threats.  Evaluate a host of technologies for frangible rounds and added equipment attachments to counter small UAS rounds.\n\n- Explosive Detection\/Defeat - Continue to develop an autonomous explosive detection and defeat capability; integrating specialized sensors for enhanced neutralization.\n\n- Medical - Complete development of power management and energy scavenging capability to enable a more effective casualty warming and blood storage\/distribution.  Continue to experiment with systems to provide battlefield medical command and control and information management.  Initiate the design and integration of an Automated Artificial Intelligence Medical Information System (AAIMIS), facilitating a medical logistics push from the Capabilities Based Medical Treatment Facility (CBMTF) by providing the situational awareness via Medical Common Operating Picture (MedCOP) for medical supply utilization at forward deployed medical units.\n\n- Warfighter Performance - Provide increased lethality and mobility to the warfighter through the integration of technology directly attributable to individual combat equipment.  Emphasis placed on voice reaction \/ voice enhanced technologies, as well as multi-mode unmanned systems command and control with augmented reality technologies.\n\nLittoral Connectors - Pursue development and enhancement of capabilities for end-to-end distribution, storage, and supply of fuel to air, ground, and sea platforms."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY20 to FY21 is directly attributable to the following areas:  \n\n- Unmanned Logistics and Defense - Expand and accelerate autonomous air, ground, and surface platform development\/integration to support dispersed and segregated forces during joint operations.\n\n- Warfighter Performance - Initiate prototype development and integration of critical warfighter capabilities.  Integrated into individual combat equipment, systems are designed to increase warfighter lethality and mobility.\n\n- Littoral Connectors - Initiate experimentation of a modernized landing craft to sustain movement ashore, provide intra-theatre lift, and increase Expeditionary Advanced Based (EAB) survivability."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fires, Targeting, and Maneuver"
                                    },
                                    "Description": {
                                        "val": "This activity includes Marine Corps Warfighting Laboratory \/ Futures Directorate (MCWL\/FD) experimentation efforts in the areas of fires, targeting, and maneuver including assessment of equipment, new  Tactics, Techniques, and Procedures (TTPs), training programs, and proposed organizational changes associated with enhanced capabilities.  This area increases fires, targeting, and maneuver related troop environmental awareness, lethality, and mobility using fused sensors as well as unmanned weaponized and reconnaissance air and ground vehicle platforms to support experimentation.  Most programs listed below are considered major (valued at $500K or more) or have near real-time operational impact.  Investments in this activity are conducted under the Thrust Areas of Marine Air-Ground Task Force (MAGTF) Fires, Maneuver, and Autonomy and Robotics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.029"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.174"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to provide a multi-purposed Unmanned Ground Vehicle (UGV) which hosts a government-owned modular payload architecture and provides the ability to rapidly modify payloads for a variety of missions across the MAGTF. In concert, evaluate various payloads that enhance dismounted unit abilities across the warfighting functions. Continue to pursue company level precision guided munitions to increase responsiveness, survivability, and lethality to the ground combat element. Specifics include development of: a multi-tubed launcher integrated with a UGV and the ability to remotely launch Unmanned Aerial Systems (UASs) from distributed positions. Experiment with a multi-purpose, electro-optical missile system with a real-time wireless data link for ranges up to 25km; operated in either direct attack or mid-course navigation based on target coordinates. The system has the ability to carry a heat, fragmentation, or anti-armor payload and can be integrated with a variety of sea, air, and land platforms. Initiate pursuit into a recoverable, long-range reconnaissance and precision strike asset with lethal capability against armored targets. Facilitate the integration of a small UAS with the identification, engagement, assessment, and adjustment of indirect fires for an individual Marine operating with an indirect fire weapon. Increase lethality of ground forces through rapid design iteration and testing of small UASs (sUASs), including advanced sensors and warheads. Experimentation efforts will include integration of critical payloads for immediate use and will enable earlier force training. Assess potential solutions to identified marksmanship capability gaps. Ensure the availability of Utility Task Vehicles (UTVs) for integration, testing, assessment throughout the experimentation cycle. Pursue technologies to dramatically increase the range and lethality of the MAGTF using a Low-Cost Unmanned Aerial Vehicle (UAV) with integrated swarming technology to create a Lethal Miniature Aerial Munition (LMAM). Experiment with loitering munitions launched from a variety of platforms (air, ground, and sea). Conduct swarming follow-on efforts to develop distributed, cognitive, collaborative, and cooperative swarming behaviors for maximum effect and complexity on target. Investigate Naval Surface Missile (NSM) simulators for experimentation of weapons system and integration with naval system queuing. NSM simulator systems will be used to exercise the NSM coastal defense system in coordination with Naval target sensing and tasking, allowing Naval vessels to queue and task NSM launch."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.824"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.824"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Unmanned Ground Vehicle (UGV) - Continue to provide a multi-purposed UGV, with modular payload architecture, with specific focus on counter battery. Continue to integrate payloads for the UGV platform that enhance dismounted units across the warfighting functions.  \n\n- Aerial Munitions - Continue to pursue company level precision guided munitions to increase responsiveness, survivability, and lethality to the ground combat element.  Continue experimentation with loitering munitions launched from a variety of platforms (air, ground, and sea) to develop distributed, cognitive, collaborative, and cooperative swarming behaviors for maximum effect and complexity on target.  Continue experimentation of long range Low-Cost UAV swarming technology.  Objectives include integration of command and control, multi-tubed launchers, and autonomous ground platforms to test capability of remotely launching UASs from distributed positions.\n\n- Multi-Domain Fires - Continue the examination and testing of precision guided munitions, to include the development of an integrated communications architecture. Effort will inform anti-ship missile concept development.  Initiate experimentation of an end-to-end kill chain in multiple environments, neutralizing targets in an effective and cost efficient manner. \n\n- Marksmanship - Complete assessment of potential solutions to identified marksmanship capability gaps.\n\n- Naval Surface Missile - Complete assessment of Naval Surface Missile simulators for experimentation of weapons system and integration with naval system queuing."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY20 to FY21 is directly attributable to the completion of marksmanship technology demonstrations and the assessment of a Naval Surface Missile solution."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Marine Air-Ground Task Force (MAGTF) Command, Control, Communications, and Computers (C4)"
                                    },
                                    "Description": {
                                        "val": "This activity encompasses all Marine Corps Warfighting Laboratory\/Futures Directorate (MCWL\/FD) Command, Control, Communications, and Computers (C4) experimentation efforts including assessment of equipment, new Tactics, Techniques, and Procedures (TTPs), training programs, and proposed organizational changes associated with enhanced C4 capabilities. The area provides cutting edge\/enhanced Over-The-Horizon (OTH), Beyond Line of Sight (BLOS), satellite and non-satellite based C4 capabilities to support experimentation. Programs listed below are considered major (valued at $500K or more) or have near real-time operational impact. Investments in this activity are conducted under the Thrust Areas of Command, Control, Communications, and Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) and Cyber\/Electronic Warfare (Cyber\/EW)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.124"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.269"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct research to identify and assess a collaborative solution that provides tailorable Over-the-Horizon (OTH), On-the-Move (OTM),  and Beyond Line of Sight (BLOS) communications, situational awareness, and fires for units across a wide spectrum of air, ground, and sea operations. Experiment with an organic and persistent capability to wirelessly receive, process, and disseminate digital information from organic sensors (to dismounted users), with relevant and\/or immediately actionable information.  This is done while simultaneously enabling BLOS digital connectivity to both higher and adjacent units (supporting dismounted operations). Effort will enable BLOS digital connectivity to higher and adjacent units. Initiate efforts to automate the identification of targets and expedite the sharing of information between sensors, shooters, and approval authority. Integrate electronic warfare technologies (ground and airborne sensors) and cyber space warfare technologies into demonstrations and live-force experiments to inform requirements and develop Tactics, Techniques, and Procedures (TTPs) for use by operational forces. Experiment with a cyber mission execution framework enabling military commanders, planners, and operators to collaborate, understand, plan, and manage cyber operations in real-time against large-scale and dynamic network environments. Initiate cyber and communications infrastructure common operational picture tactics and procedures for situational awareness and coordination of battlefield effects. Experiment with worldwide social media mapping. This technology will enable real-time situational awareness of the information environment (IO), including content and location of social media users. Open IO technology will provide Marines at the tactical edge with alerts using civilian and adversary open source communications. Provide units at the tactical edge IO situational awareness, planning, and command and control tools to include measures of effectiveness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.900"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.900"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Asymmetric Command and Control (C2) - Continue research to identify and assess a collaborative solution, providing tailorable OTH, OTM, and BLOS communications, situational awareness, and fires for units across a wide spectrum of air, ground, and sea operations. Efforts include upgrading radios with service specific cryptology.\n\t\n- Integrated C2 - Continue experimentation with an organic and persistent capability to wirelessly receive, process, and disseminate digital information from organic sensors (to dismounted users), with relevant and\/or immediately actionable information. Efforts include maintenance of experimentation assets as well as development to enable receipt of ground entry point information from an aerial fused integrated network asset.  In addition, continue to pursue automatic target recognition, identification, and prosecution.\n\n- Electronic Warfare \/ Cyberspace - Continue experimentation with a cyber mission execution framework enabling military commanders, planners, and operators to collaborate, understand, plan, and manage cyber operations in real-time against large-scale and dynamic network environments. Pursuits include evaluating cyber anomaly detection hardware devices that possess artificial intelligence (AI), identifying abnormal behaviors and notifying the user of deviations. Continue experimentation of cyber and communication infrastructure common operational picture TTPs, increasing situational awareness and battlefield effects. Investigate defensive, offensive, and cyberspace warfare protection and monitoring capabilities through all echelons of the Marine Expeditionary Forces (MEF).\n\n- Information Operations - Complete experimentation with worldwide social media mapping.\n\n- Air Command - Develop, integrate, and experiment with a Tactical Air Control Element (TACE); improving mobility and\ndigital interoperability internal to the Marine Air Command and Control System.  Efforts will provide an ability to control and de-conflict airspace."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY20 to FY21 is directly attributable to the completion of experimentation and assessment of\nworldwide social media mapping."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Marine Air-Ground Task Force (MAGTF) Intelligence, Surveillence, and Reconnaissance (ISR)"
                                    },
                                    "Description": {
                                        "val": "This activity includes Marine Corps Warfighting Laboratory \/ Futures Directorate (MCWL\/FD) Intelligence, Surveillance and Reconnaissance (ISR) related experimentation efforts including assessment of equipment, new Tactics, Techniques, and Procedures (TTPs), training programs, and proposed organizational changes associated with enhanced ISR capabilities.  Using a variety of fused sensors to mesh data, video, and images and incorporating a common tactical controller to operate multiple air and ground ISR platforms, this area enhances small unit situational awareness as well as exploitation and forward engagement ability via experimentation. Programs listed below are considered major (valued at $500K or more) or have near real-time operational impact. Investments in this activity are conducted under the Thrust Areas of Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) and Autonomy and Robotics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.376"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.869"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Expand development of government-owned Unmanned Aerial Systems (UAS) architecture to allow for rapid design iterations in support of experimentation. Effort will continue to provide situational awareness of the battlespace, incorporating payloads that improve navigation and allow for multi-mode sensors. Experiment with enabling technologies to combine sensor and telemetry data from multiple unmanned platforms (ground, surface (water), and air); minimizing operator intervention over current systems, with the ability to react in a wide range of operational tasks, environmental conditions, and landscapes. Continue to develop a capability to display and control a myriad of unmanned platforms and sensor inputs in a fused network on a common controller for Intelligence, Surveillance and Reconnaissance (ISR) as well as target identification and prosecution. Initiate experimentation with an autonomous reconnaissance system, improving threat situational awareness and reducing tactical surprise to assault forces on long range missions. Initiate an effort to receive, transmit, and fuse joint asset specialized sensor information to communications nodes afloat and ashore via an aerial gateway. Expand investigations to add a Mission-Configurable Software Defined Radio with an Electronically Steerable Array (ESA) to the currently developed communication pod. Missions will include, but not be limited to, Early Warning radar, Cueing radar and\/or Electro-magnetic Spectrum Operations. Effort will utilize Artificial Intelligence (AI) software to fuse sensor information in order to generate track information on-board the pod and then push it to both terrestrial communications nodes and directly to aircraft. Seek to provide a multi-role, long reach, expeditionary, next generation network of ISR capabilities. This includes the enhancement of capabilities for multi-sensor collection, fusion and real-time transmission; multi-electro-magnetic spectrum operations; C4 network bridge and relay; escort and protection for assault forces; persistent and precision fires and targeting; integration of an early warning air defense network; and informing assault support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.875"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.875"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Small UASs - Continue to expand experimentation and development of government-owned UAS architectures to allow for rapid design iterations.  Continue experimentation with an autonomous reconnaissance system, improving threat situational awareness and reducing tactical surprise to assault forces on long range missions.  Objectives include rapid design, build, test, and experimentation of technologies to increase ground maneuver force capabilities.  \n\n- Robotic Autonomous Command and Control (C2) - Continue to investigate\/experiment with enabling technologies; combining sensor and telemetry data from multiple unmanned platforms (ground, surface (water), and air).  Efforts will include conducting multi-manned and unmanned system missions focusing on intuitive control and robust localization.  \n\n- Universal Controller - Complete development of a common controller for ISR as well as target identification and prosecution. Program aspects successfully transitioned into programs of record.\n\n- Mapping - Continuing investigations into providing a small, lightweight, semi-autonomous system that can self-navigate structure interiors and subterranean environments while simultaneously creating real-time three-dimensional (3D) maps. \n\n- Fused Integrated Networking - Continue experimentation and development to receive, transmit, and fuse joint asset specialized sensor information to communication nodes afloat and ashore via an aerial gateway.  Efforts include sharing of aerial obtained fused sensor data information and\/or organically produced sensor information with other air, ground, space, surface, and sub-surface platforms.\n\n- Air-Launched Reconnaissance - Continue to provide a multi-role, long reach, expeditionary, next generation network of ISR capabilities.  Efforts include providing a deployable UAS capable of dashing ahead of MV-22 aircraft to conduct final reconnaissance of the landing zone to update threat situation in route to the objective.\n\n- Information Operations - Develop and enhance capabilities to increase situational awareness and influence decision making.  Specifically, efforts support the operational utility of artificial intelligence\/machine learning.\n\n- Space - Initiate development of disruptive space-based capabilities to Marine Air-Ground Task Force (MAGTF) planners at the tactical edge, increasing cognitive awareness to the adversary space threat, and developing unique space-based tools for wargaming and concept development."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY20 to FY21 increase is directly attributable to the following areas:\n\n- Small Unmanned Aerial Systems (UASs) - Continue to explore and expand mission sets and exploit the tactical potential of small UASs across multiple Marine Corps domains; focusing on autonomy, innovative applications, and the most advanced small UAS technology.\n\n- Space - Initiate efforts to provide space-based capabilities to the Marine Air-Ground Task Force (MAGTF) planners at the tactical edge.  \n\nInformation Support - Develop and enhance capabilities to increase situational awareness and influence decision making.  Specifically, efforts support the operational utility of artificial intelligence\/machine learning."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Marine Corps Warfighting Laboratory \/ Futures Directorate (MCWL\/FD) Operations (SUPPORT)"
                                    },
                                    "Description": {
                                        "val": "Marine Corps Warfighting Laboratory \/ Futures Directorate (MCWL\/FD) Operations (Support) efforts include overarching experimentation doctrine, planning, management, technical\/engineering support, analysis, data collection and reporting, as well as technology transition tracking efforts.  Programs listed below are considered major (valued at $500K or more) or have near real-time operational impact."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.120"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.087"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "MCWL\/FD will elicit a broad range of unique analytical expertise to evaluate experiments in various warfighting areas. Design experimentation plans, collect data during experiments, perform reconstruction and analysis of experiments, and prepare experiment analysis reports. Identify global commercial technology trends\/innovations and disruptive technologies which may impact future Marine Corps capabilities. Expand upon generalized as well as specific program level engineering, technical, and management support. In addition, technical program area management capability increased. Initiate investigations into development of a narrow Artificial Intelligence (AI) capability which is capable of automating data collection to assist in tracking and decision making regarding technology based programs of interest."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.035"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.035"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Experimentation Analysis - Building upon lessons learned in previous experimentation, continue to design, collect data, and provide independent analytical evaluations of experiments. Analysts take active roles in supporting experimentation concept refinement, capability development, and identification of tactics, techniques and procedures; organizational changes; technologies; and training that the experiments are designed to test. \n\n- Commercial Forecasting - Explore new mechanisms to identify long-range commercially available technologies\/innovations that may influence future Marine Corps investments.\n\n- Management Support - Continue to provide program level engineering, technical, and managerial support.  Efforts include detailed program planning and tracking and encompass technology development and experimentation insertion; troop development and concepts of operation; and portfolio development and execution.\n\n- War Room - Continue to investigate Artificial Intelligence (AI) capabilities to streamline data collection and program presentation, facilitating informed rapid decision-making. Promote transparent communication, problem-solving, risk mitigation, and status reporting by visually communicating project activities, milestones, and transition opportunities.\n\n- Collaboration - Provide a laboratory facility to co-locate experimentation designers\/implementers with project teams and technologists to enhance effectiveness of experimentation design, development, implementation, reporting, prototyping, and outreach of results."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY20 to FY21 increase is directly attributable to the following areas:  \n\n- Management Support - Increase technical, engineering, and managerial staff support to provide necessary strategic planning and program management support across the enlarged spectrum of experiment-based initiatives.\n\n- Collaboration - Establish an environment to support continuous interactions of program technicians and experimentation designers. Structured with collaborative design and tool sets; this co-location will greatly aid in technology development, demonstration, as well as experiment implementation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warfighting Excellence"
                                    },
                                    "Description": {
                                        "val": "This activity includes Marine Corps Warfighting Laboratory \/ Futures Directorate (MCWL\/FD) efforts in the development and assessment of joint and service warfighting concepts, joint and service missions, analysis of emerging threats and opportunities, and joint capability experimentation.  It also includes MCWL\/FD service experimentation in areas that impact multiple warfighting functions.  Programs listed below are considered major (valued at $500K or more) or have near- real-time operational impact."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.249"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Aid the combat development process by conducting 11 core wargames. Focus areas include the CPG supported Expeditionary Advanced Base Operations (EABO) and Littoral Operations in a Contested Environment (LOCE). Create an effective collaborative wargaming environment that will increase the use of automated and analytical tools, and will provide the necessary quantitative and qualitative output for Marine Corps capability\/concept development. Coordinate with the Marine Corps Systems Command's (MCSC's) Wargaming Center of Excellence to provide an encompassing wargaming ability throughout the Marine Corps. Focusing 15 to 30 years in the future, continue to offer top level identification and analysis of emerging asymmetric threats and opportunities. This is accomplished by capitalizing on a myriad of foresight assessments of future operating environments. Maintain insight and continue making contributions to support approved Joint Concept Technology Demonstrations (JCTDs) and Emerging Capability Technology Demonstrations (ECTDs) efforts and warfighting concepts; intended to provide rapidly fieldable capabilities by using emergent mature technologies matched with innovative operational concepts. This includes furthering demonstrations with a high-altitude balloon-borne communications platform and continuing development efforts of distributed mobile amphibious (and ground) assault fuel logistics capabilities. The communications platform effort involves demonstrating and experimenting with the military utility of a resilient, low cost, effective, high-altitude balloon-borne communications platform that can be rapidly deployed to enhance warfighter communications capabilities. The fuel logistics efforts include demonstration and experimentation to build the concept of employment as well as tactics, techniques, and procedures (TTPs) for inflatable, scalable, double-walled fuel storage, transport, and transfer systems for bulk fuel logistics.  Continue in the conduct of a multi-year effort to enhance situational awareness; Command and Control (C2); and fires and maneuver in the dense urban environment. Conduct experimentation events to identify changes in training, organizing, and equipping future forces and provide venues for live-force evaluation and assessment. Bring concept developers, operational Subject Matter Experts (SMEs), and technologists together in order to discover, purchase, and assess new and advanced technologies that can aid in the implementation and refinement of the Expeditionary Advanced Base (EAB) concept. Additionally, by exposing technology and acquisition professionals to the concept, future development can be guided. Explore the use of modeling and simulation tools and techniques to gather, process, analysis, and utilize operational data in support of experiment development, execution, and assessment. Capitalizing on an OSD 2 year investment, provide organic, experimental opposition force capability (Red Team, Red Cell and Live Adversary Force). This will assist in providing a more realistic, adaptive, and cohesive enemy force\/civil infrastructure for wargames, command post exercises, simulations, and experimentation events in order to support free-play, friendly force adaptation and decision-making skills."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.617"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.617"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Wargaming - Continue to plan and execute executive agent responsibilities for the Marine Corps Title Ten Wargame, Expeditionary Warrior, as well as other wargames to examine Marine Corps capstone, operating, and functional concepts and explore assigned topics.  A minimum of 11 wargames will be conducted (4 large, 5 medium, and 2 small); all examining concept and combat development issues, experimentation, and other assigned topics.  Establish a stand-alone Wargame Network (develop, test, train, and operate) that provides visualization support (tools, methods, and procedures) as well as modeling and simulation (M&S) capabilities during wargames.  \n\n- Emerging Threats and Opportunities - Continue to assess and analyze the future security environment; identify and analyze emerging threats; develop and appraise promising concepts, opportunities and technologies; and serve as a catalyst to stimulate thought and debate on issues of importance to the Marine Corps.\n\n- JCTD - Continue to monitor and contribute to approved efforts that address joint and combatant command warfighting needs through the execution and demonstration of prototypes within two to four years.  The program delivers developmental and operational prototypes to affordably operationalize technologies that enable warfighters to explore novel concepts and to facilitate informed transition to formal acquisition programs.  Complete high-altitude balloon-borne communications and bulk-fuel logistics efforts.  Develop technology to enable barges\/vessels to serve as distributed resupply nodes in support of littoral operations.  \n\n- Exercise Support - Continue multi-year effort to enhance the ability of the Marine Air-Ground Task Force (MAGTF) to conduct operations in the dense urban environment. Develop and refine objectives and capability areas to address challenges in the future operating environment.  \n\n- Innovation - Conduct warfighter driven challenges to develop prototypes and foster innovation with the Marine Corps.  Reaching out to fleet organizations, engage entities and develop required capabilities for further testing and evaluation.  \n\n- Modeling, Simulation, and Analysis - Expand the use of M&S tools and techniques to provide analysis to support capability development activities.  Model and assess naval operations with a focus on current pacing threat and theater.  Provide analytical support to the Marine Corps Capability Based Assessment and Integration Process (MC CIP) and other complementary efforts.  \n\n- Experimentation Opposition Force - Continue to demonstrate the abilities of a live adversary force.  Force provides a realistic, adaptive, and cohesive adversary as well as civilian environmental characteristics.  This concept strongly enhances experimentation and strengthens experiment hypotheses and objectives.  \n\n- Autonomous First Wave - Initiate a multi-year campaign to assess an ecosystem of technologies to better understand and advance capabilities to ultimately increase the lethality and effectiveness of the warfighter on tomorrow's battlefield.  Efforts include, manned and unmanned teams capable of conducting military operations in complex urban terrains and multi-domain environments.  \n\n- Joint Assessment Strategies - Initiate investigations to pursue a lethal, resilient, and rapidly adaptive Joint Force capable of defeating and deterring potential adversaries.  Experimentation efforts will seek to inform future warfighting architectures, address\/solve identified challenges, and analyze the hardest military challenges facing the United States (US) and our allies.\n\n- Artificial Intelligence (AI) - Initiate operational integration of AI into concept based experimentation.  Deliver AI enabled capabilities that address key missions, including improvement of situational awareness and decision-making, implementation of predictive maintenance and supply, and streamlining business processes."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY20 to FY21 increase is directly attributable to the following areas:\n\n- Wargaming - Establishment of a technical staff for wargame planning, development, and execution.  These technical enablers are subject matter experts (SMEs) in modeling and simulation (M&S), visualization, and network development, programming, setup, and management.  The increase in personnel, specialized equipment, and software will improve player interface, allow for increased interactive visualization, provide for more rapid and systematic wargame adjudication, improve qualitative analytic outputs, and identify topics for subsequent deeper computational analysis.\n\n- Modeling, Simulation, and Analysis - Data driven assessment of Marine Corps programs through the lens of the CPG and force design. \n\n- Experimentation Opposition Force - Capitalize on ideas and strategies suggested by SMEs and provide opposing forces with combative equipment and gear to reinforce live-force experimentation.  Also provide equipment\/gear\/assets to aid with civilian interaction perceptions\/realism.\n\n- Autonomous First Wave - Initiate a multi-year effort to provide guidance, vision, and unity of effort.  Program objectives will feed and support live force experimentation as well as map directly to the National Defense Strategy (NDS) and CPG. Each Limited Objective Assessment (LOA) will portray a multi-disciplinary\/cross-functional approach towards larger foci; assessing technologies at different phases of ship-to-shore maneuver and combat operations in an urban environment.\n\n- Joint Assessment Strategies - Research and address an increasingly contested environment with rapidly evolving security challenges; highlighted by the emergence of major peer competitors.\n\n- Artificial Intelligence (AI) - Investigate concepts, methods, toolkits, software applications, and ideologies to provide\/promote AI support\/use for MCWL concept based experimentation."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2958"
                    },
                    "ProjectTitle": {
                        "val": "Cyberspace Activities"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "4.474"
                        },
                        "BudgetYearOne": {
                            "val": "4.800"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.800"
                        },
                        "BudgetYearTwo": {
                            "val": "4.800"
                        },
                        "BudgetYearThree": {
                            "val": "4.800"
                        },
                        "BudgetYearFour": {
                            "val": "5.000"
                        },
                        "BudgetYearFive": {
                            "val": "5.099"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project activity provides freedom of maneuver and influence in the cyber-electronic warfare domain while simultaneously denying the same to the adversary and protecting critical command systems. Technologies are being developed using a multi-disciplinary approach that combines Radio Frequency electronics, digital signal processing, computer engineering, software engineering, machine learning and data science to support Naval Expeditionary warfighters operating with size, weight and power constrained equipment in Disrupted, Intermittent, Limited environments. Areas of applied research include distributed precision time, predictive software defined radio architectures, coordinated Cyber and Spectrum maneuver to mitigate detection and exploitation, tactical Cyber visualization, discovering and mapping networks in dense urban environments, contextual awareness and blind channel characterization."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Expeditionary Cyber"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.474"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Cyber related demonstrations and experimentations will be conducted to verify the secure transfer of information across mobile tactical user platforms. Controlled demonstrations will be conducted to assess battle damage on a class of systems from the use of cyber effects. Demonstrations of cyber hardened operational systems will be conducted to showcase improved resiliency. Software redesign of modular Cyber\/Electronic Warfare systems will be demonstrated as a proof of concept prototype. Initiate research to develop a rapid testing tool of major C2 and weapon systems to provide acquisition sponsors and operational planners a method to identify and project vulnerabilities and impacts within computing systems and networks as well as an operational assessment measures to determine how to proactively address these issues and maximize projection power."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Cyber related research will initiate the advanced technology development of mitigation techniques related to USMC systems\n- Cyber related activities will continue to improve the overall cyber protection strategy for deployed systems at the battalion level and below that feed into the Marine Air-Ground Task Force (MAGTF) Information Group Integrated Command Center\n- Further research to better identify key cyber terrain at the physical, logical, and cyber persona layers that can be visualized at small unit level\n- Completion of integrating a framework to quickly reconfigure hardware accelerator devices to understand unknown signals of interest in the wild"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase reflects a transition of enabling technologies for dynamic radio frequency agility efforts from 0602131M to this activity integrated into the Future Naval Capabilities activity being executed."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "26.064"
                        },
                        "CurrentYear": {
                            "val": "39.500"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "65.564"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Common Unmanned Aerial Vehicle Simulation System"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "9.654"
                                        },
                                        "Text": {
                                            "val": "Develop technology for mission simulation to help reduce the development cycle time of UAVs."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Flight Motion Simulator and Testing of UAVs"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5.792"
                                        },
                                        "Text": {
                                            "val": "Conduct research using computer simulation sensor modeling and actuator modeling in real-time with UAV hardware and software."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modular Advanced Armed Robotic System 2.0"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "3.861"
                                        },
                                        "Text": {
                                            "val": "MCWL\/FD continued experiments to assess the military utility of small tactical autonomous unmanned ground vehicle systems.  Multiple systems were purchased, integrated with a common ground remote control system and applicable communications assets, and performance tested using a variety of control parameters.  Once demonstrated, results analysis is conducted and reported to aid in requirements identification."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "UAS Air-Delivered Extended Range Munitions Demo"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "6.757"
                                        },
                                        "Text": {
                                            "val": "Conduct research for technology maturation and testing of a full cartridge level solution prototype extended range guided projectile for an airborne platform. This proposed effort will develop and integrate enabling technologies with  81mm and 120mm extended mortar cartridges for launch from an airborne platform rather than ground launch from a mortar tube."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotic protection system"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Perform Marine Corp Advance Technology research in Robotic protection systems."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Expeditionary mission planning enabled by high fidelity simulation"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Perform research in Expeditionary mission planning enabling advance high fidelity simulations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended range 155mm projectile"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "2.500"
                                        },
                                        "Text": {
                                            "val": "Perform Advanced Technology research in Extended range 155mm projectiles."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive threat force"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "7.000"
                                        },
                                        "Text": {
                                            "val": "Perform Advance research in Adaptive threat force Technology."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air drop extended range munitions"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "15.000"
                                        },
                                        "Text": {
                                            "val": "Perform Advanced Technology research in Air drop extended range munitions."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}