{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-855515f7cbe1443b1cc76e32ff869263061a887974718017fcc8f688288c6578-7",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602668D8Z"
        },
        "ProgramElementTitle": {
            "val": "Cyber Security Research"
        },
        "R1LineNumber": {
            "val": "17"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "14.429"
            },
            "PriorYear": {
                "val": "14.594"
            },
            "CurrentYear": {
                "val": "25.118"
            },
            "BudgetYearOne": {
                "val": "15.255"
            },
            "BudgetYearOneBase": {
                "val": "15.255"
            },
            "BudgetYearTwo": {
                "val": "15.586"
            },
            "BudgetYearThree": {
                "val": "15.857"
            },
            "BudgetYearFour": {
                "val": "16.265"
            },
            "BudgetYearFive": {
                "val": "16.596"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Cybersecurity Applied Research program (PE: 0602668D8Z) promotes innovative higher risk cyber research to address joint force challenges in full spectrum cyber operations.  Through the dedicated funding line the program addresses joint service science and technology (S&T) gaps that influence DoD cyber research priorities and shapes the direction of the wider cyber community.  The program integrates both defensive and offensive cyber research to develop interchangeable, defense-wide technology options to meet Combatant Command (CCMD) needs and requirements. To better align itself to the NDS, DoD Cyber Strategy, and Office of Under Secretary of Defense for Research and Engineering (OUSD(R&E)) Road to Dominance cyber initiative, the program recalibrated research thrust areas to pivot towards emphasizing a need for power projection and taking the fight to the adversary.  Developing research thrusts areas in: Behavior Cyber Science, Self-Securing Systems, Precise Cyber Effects, and Applied Mathematics for Cyber."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "14.935"
                },
                "CurrentYear": {
                    "val": "15.118"
                },
                "BudgetYearOne": {
                    "val": "15.396"
                },
                "BudgetYearOneBase": {
                    "val": "15.396"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "14.594"
                },
                "CurrentYear": {
                    "val": "25.118"
                },
                "BudgetYearOne": {
                    "val": "15.255"
                },
                "BudgetYearOneBase": {
                    "val": "15.255"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.341"
                },
                "CurrentYear": {
                    "val": "10.000"
                },
                "BudgetYearOne": {
                    "val": "-0.141"
                },
                "BudgetYearOneBase": {
                    "val": "-0.141"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "10.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.338"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.003"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.126"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.126"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.015"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.015"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2021 increase in $10.000 million for Leveraging Next Generation Cyber Joint Service Capabilities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "003"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Applied Research"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "14.429"
                        },
                        "PriorYear": {
                            "val": "14.594"
                        },
                        "CurrentYear": {
                            "val": "25.118"
                        },
                        "BudgetYearOne": {
                            "val": "15.255"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.255"
                        },
                        "BudgetYearTwo": {
                            "val": "15.586"
                        },
                        "BudgetYearThree": {
                            "val": "15.857"
                        },
                        "BudgetYearFour": {
                            "val": "16.265"
                        },
                        "BudgetYearFive": {
                            "val": "16.596"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "As adversaries develop more sophisticated technology and tactics and become more skilled and better funded, the cyber S&T community must accelerate the pace of innovative research. Judiciously exploring research under these thrust areas should provide a distinct advantage in future cyber conflicts.  Following a review and assessment of emerging joint operational needs, OUSD(R&E) developed four (4) research areas to enhance the DoD’s tactical edge in a rapidly evolving cyber domain (described below):  \n\n• Behavioral Cyber Science:  Exploring the interaction between computers and human behavior by moving beyond binary electronic signals towards understanding human behavior.  New insights from behavioral science will increase the effectiveness of tools, increase the effectiveness of the cyber workforce, and improve the utility of cyber solutions.  Behavioral cyber science seeks to uncover details about how humans (represented by operators, users, adversaries, and\/or defenders) react to cyber actions and how those reactions can be understood, from a behavioral science standpoint, and leveraged to create more effective actions and outcomes.\n\n• Self-Securing Systems:  Prevailing in a contested cyber environment will require new sciences and mechanisms for autonomous cybersecurity to protect the increasingly complex weapon systems and platforms that help DoD operators react more quickly to cyber-attacks.  Exploring foundational research in self-securing systems will arm future DoD systems with the capability to proactively, autonomously, and seamlessly assess cyber threats.  Additionally, future systems will be able to deploy self-defense mechanisms to neutralize cyber-attacks and enable blue forces to maneuver at will.  Autonomous cyber defenses will need to apply the most current advances in artificial intelligence research.\n\n• Precise Cyber Effects:  Precision offensive campaigns for the cyber domain require accurate and timely predictions of cyber effects to enable DoD leadership to achieve the desired outcomes from cyber operations and help manage risks associated with collateral damage.  Exploring methods to derive quantifiable metrics will help improve the precision control of selecting cyber mission targets and raise the accuracy of effects; achieving an understanding of second and third order of effects will provide commanders with a higher confidence of success and limit collateral damage.\n\n• Applied Mathematics for Cyber:  Advancing mathematical foundations that are intrinsically linked to all branches of cyber science and technology, will cut across focus areas producing new methods to design, secure, and reason about complex cyber systems.  This area of research will characterize the cyber domain, maintain the integrity of data, harden systems, analyze potential solutions, and counter adversarial machine learning. \n\nAdvances in these cyber S&T areas will promote strong foundations, while disruptive innovations will create surprise, shape the fight, and ensure a decisive advantage.  The research areas are critical to the development of innovative and sustainable research that takes cybersecurity beyond the incremental escalation of attack and defense."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Leveraging Next Generation Cyber Joint Service Capabilities"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Initiate and harness research opportunities in academic cyber institutes.  The effort will leverage existing partnerships with academia to reduce vulnerabilities in our national information infrastructure by promoting higher education, workforce development, and research in cyber defense.  These investments will establish mechanisms \/ foundries for future learning and increase the professional workforce with cyber defense expertise.  These efforts will promote investments in key cyber areas at these institutions."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Leveraging Next Generation Cyber Joint Service Capabilities"
                                    },
                                    "Description": {
                                        "val": "Integrating both defensive and offensive innovative cyber research within the DoD cyber science and technology (S&T) enterprise to develop interoperable, defense-wide technology options that address joint force challenges in full spectrum cyber operations.  The 2018 National Defense Strategy (NDS) recognized cyber as an actively contested domain with significant security challenges and potential leap-ahead capabilities for military operations.  By focusing on higher risk research ideas with major potential impacts, the Cybersecurity program addresses one of the NDS’s mission focus areas of cybersecurity.  The program works to advance the state of cybersecurity by judiciously exploring research in the areas of Behavioral Cyber Science; Self-Securing Systems; Precise Cyber Effects; and Applied Mathematics for Cyber.  These thrusts provide an opportunity to identify and advance foundational technologies to support all Services and Agencies.  \n\nResearch in Behavioral Cyber Science advances understanding and the technical rigor of modeling and predicting human responses to cyber activities that enhance cyber operations through planning, and training.  Exploring the interaction between computers and human behavior, moving beyond electronic signals (ones and zeroes) enables development of new insights to human behavior.  Exploring Self-Securing Systems, platforms, and networks will help DoD operators react more quickly to cyber-attacks.  Equipping future DoD systems with the capability to proactively, autonomously, and seamlessly access cyber threats and deploy self-securing mechanisms to neutralize cyber-attacks, offers blue force an innovative new disruptive capability.  Precise Cyber Effects provide scalable cyber options for military cyber commanders to precisely identify and engage specific threats and targets with a high confidence of success.  This high-risk research provides a disproportionate advantage in modeling cyber with high variability architectures for blue, gray, and red space that would potentially afford real opportunities.  Finally advancements in mathematical foundations of cyber cut across all three thrust areas producing new provable methods to design, secure, and reason about complex cyber systems.  There is a need for an array of formal and informal modeling techniques, backed by various rigorous mathematical theories, to capture and support the richness of the cyber domain."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.594"
                                            },
                                            "Text": {
                                                "val": "\"Performance Assessment Suite for the Cyber Mission Force” project will develop an analytics platform to accommodate future sensors, interactive data-mining, and workflow monitoring plug-ins.  The initial framework for platforms will be developed for U.S. Cyber Command and tested in-house using observer tablets.  Research will build a better understanding of the cyber information environment by developing Cyber Mission Force (CMF) knowledge acquisition and observational assessments. \n\n\"Designing a Contextualized Operator Perspective (COP) to Enable Joint Cyber Operations” project identifies key cyber terrain, defined as the overlap between protected mission’s system needs and the supporting network, to uncover potential threats for Cyber Protection Team (CPT).  The discovery supports CPT analyses for developing technical and data requirements for preliminary work support systems.  The research measures and explores aspects of situational awareness (SA) theory to determine the applicable methodologies to evaluate work support system designs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.118"
                                            },
                                            "Text": {
                                                "val": "Performance Assessment Suite for Cyber Mission Force project will integrate research automated for predictive analytics into Joint Artificial Intelligence Center (JAIC) rapid prototyping events at Dreamport.  Research will develop a prototype for workflow monitoring, addressing human-in-the-loop protocols by refining simulation-based software. (Behavioral Cyber Science)   \n\nRobust Low-level Cyber Attack-Resilience for Warfighting Vehicles project will develop new attack scenarios\/patterns developed through Artificial Intelligence\/Machine Learning (AI\/ML) based intrusion detection simulators to harden vehicle security. (Self-Securing Systems)\n\nAutonomous Cyber Defense project will demonstrate a prototype of autonomous cyber defense using deception techniques based on human operator defender goals.  The demonstration will test and simulate different AI techniques, using both deception and cyber defense tactics. (Self-Securing Systems)\n\nFifth Generation (5G) Secure Co-existence of Advanced Networks (SCAN) project will examine 5G security issues and spectrum opportunities to augment Future Autonomous Battlespace Radio Frequency (RF) with Integrated Communications (FABRIC). (Precise Cyber Effects)  \n\nStealthy Communications and Situational Awareness project will develop Linear Statistical Network Analysis (LSNA) infused Naval Research Laboratory Extensible Stealthy Protocol (NExtSteP) test-bed and determine the “stealthiness” of throughput, to ensure consistency with the proof-of-concept overlay protocol.(Applied Mathematics) \n\nMitigating Adversarial Machine Learning project will investigate evasion, inversion, and extraction attack techniques to enhance the performers understanding of machine learning resilience and its effects on human operator decision support. (Applied Mathematics)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.255"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.255"
                                            },
                                            "Text": {
                                                "val": "Plan for new research efforts to identify and meet objectives under the thrust areas. A list of some of the research under consideration is: Artificial Intelligence\/Machine Learning (AI\/ML); Countering Adversarial Machine Learning; 5G Vulnerabilities; Exploring 6G Standards; and Exploring Precise Cyber Effects at the Tactical Edge."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent between FY 2020 and FY 2021.  Small changes reflect minor budget fluctuations."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}