{
    "id": "2021-UnitedStatesSpecialOperationsCommand-PB-0400-JBOOK-34af129b214279bb0d1492afd1cd339f28b0467b7feac660fd5af4ecebbe5dd1-1",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-SOCOM-U_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "United States Special Operations Command",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1160402BB"
        },
        "ProgramElementTitle": {
            "val": "SOF Advanced Technology Development"
        },
        "R1LineNumber": {
            "val": "70"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "United States Special Operations Command"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "1377.147"
            },
            "PriorYear": {
                "val": "77.010"
            },
            "CurrentYear": {
                "val": "99.404"
            },
            "BudgetYearOne": {
                "val": "89.072"
            },
            "BudgetYearOneBase": {
                "val": "89.072"
            },
            "BudgetYearTwo": {
                "val": "94.659"
            },
            "BudgetYearThree": {
                "val": "96.485"
            },
            "BudgetYearFour": {
                "val": "98.602"
            },
            "BudgetYearFive": {
                "val": "100.486"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Advanced Technology Development (project S200) conducts rapid prototyping and Advanced Technology Demonstrations (ATDs).  ATDs provide a means for demonstrating and evaluating the utility of emerging\/advanced technologies in as realistic an operational environment as possible by Special Operations Forces (SOF) users.  Evaluation results are included in a transition package, which assists in the initiation of or insertion into an acquisition program.  ATDs also address projects that are a result of unique joint special mission or area-specific needs for which a few-of-a-kind prototypes must be developed on a rapid response basis, or of sufficient time sensitivity to accelerate the prototyping effort of a normal acquisition program in any phase.  \n\nEngineering Analysis (project SF101) provides rapid response capability for the investigation, evaluation, and demonstration of technologies for SOF platform (ground, air, and maritime) and soldier system-unique requirements. Timely application of SOF-unique technology is critical and necessary to meet requirements in such areas as: sensor integration; enhanced situational awareness; near-real-time intelligence to include data fusion, threat detection and avoidance; electronic support measures for threat geo-location and specific emitter identification; navigation; target detection; weapon performance integration; and future SOF platform and soldier system requirements.  Provides additional engineering analysis and testing required to transition items from national forces to theater forces.\n\nInformation and Broadcast Systems Advanced Technology (project S225) conducts rapid prototyping, advanced technology demonstrations, and advanced concept technology demonstrations of information and broadcast systems technology.  Includes planning, analyzing, evaluating, and production information systems capabilities and distribution\/dissemination broadcast systems capabilities.  It provides a means for demonstrating and evaluating the utility of emerging\/advanced technologies in as realistic an operational environment as possible by SOF users.  This project also integrates efforts with each other and conducts technology demonstrations in conjunction with joint experiments and other assessment events.  Evaluation results are included in a transition package, which assists in the initiation of or insertion into an acquisition program.  The project also addresses unique, joint special mission or area-specific needs for which prototypes must be developed on a rapid response basis, or are of sufficient time sensitivity to accelerate the prototyping effort of a normal acquisition program in any phase."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "79.380"
                },
                "CurrentYear": {
                    "val": "89.154"
                },
                "BudgetYearOne": {
                    "val": "100.729"
                },
                "BudgetYearOneBase": {
                    "val": "100.729"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "77.010"
                },
                "CurrentYear": {
                    "val": "99.404"
                },
                "BudgetYearOne": {
                    "val": "89.072"
                },
                "BudgetYearOneBase": {
                    "val": "89.072"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.370"
                },
                "CurrentYear": {
                    "val": "10.250"
                },
                "BudgetYearOne": {
                    "val": "-11.657"
                },
                "BudgetYearOneBase": {
                    "val": "-11.657"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.030"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "10.250"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.840"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-11.657"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-11.657"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding:\n\nFY 2019:  Net decrease of $2.370 million is due to a transfer of funds to support emerging command priorities (-$0.030 million), Small Business Innovative Research (SBIR)\/Small Business Technology Transfer (STTR) programs (-$2.490 million for SBIR and -$0.350 million for STTR), and transfer from Program Element 110604BB, Aviation Systems ($0.500 million).\n\nFY 2020:  Net increase of $10.250 million is due to Congressional Adds for Ballistic and Laser Protective Eyewear ($4.250 million) and Identity Management ($6.000 million).\n\nFY 2021:  Net decrease of $11.657 million is due to the transition of funds to Program Element 1160431BB, Warrior Systems, (-$4.599 million); decrease for the transition of funds to Program Element 1160403BB, Aviation Systems or Aviation Engineering Analysis (-$3.947 million), increase to support the integration of technology within the Experimentation Force Project ($4.000 million), and minor adjustments (-$0.110 million).  For the Defense Wide Review, USSOCOM performed a comprehensive analysis of future capability and is reducing SOF Advanced Technology concept demonstrations, prototyping, and evaluation of advanced capabilities to better align with the Department's priorities as outlined in the National Defense Strategy (-$7.001 million).  \n.\n\n\nSchedule: None.\n\nTechnical: None."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S200"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Technology Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "1315.751"
                        },
                        "PriorYear": {
                            "val": "56.107"
                        },
                        "CurrentYear": {
                            "val": "72.960"
                        },
                        "BudgetYearOne": {
                            "val": "69.985"
                        },
                        "BudgetYearOneBase": {
                            "val": "69.985"
                        },
                        "BudgetYearTwo": {
                            "val": "75.263"
                        },
                        "BudgetYearThree": {
                            "val": "76.772"
                        },
                        "BudgetYearFour": {
                            "val": "78.523"
                        },
                        "BudgetYearFive": {
                            "val": "80.098"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for rapid prototyping, Advanced Technology Demonstrations (ATDs) and Joint Capability Technology Demonstrations.  It is a means for demonstrating and evaluating the utility of emerging\/advanced technologies in operationally relevant environments with Special Operations Forces (SOF) users.  This project integrates emerging technologies and presents them in technology demonstrations, in conjunction with joint experiments and other assessment events.  Evaluation results often facilitate the initiation of new programs and the insertion of appropriate technologies to acquisition programs.  The element also addresses unique, joint special mission or area-specific needs for which a few rapid prototypes must be developed on a responsive basis, or of sufficient time sensitivity to accelerate prototyping efforts of a normal acquisition program in any phase."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Classified Project"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "6.000"
                                        },
                                        "Text": {
                                            "val": "Details provided under separate cover."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SOF Special Technology Project"
                                    },
                                    "Description": {
                                        "val": "This project integrates emerging technologies and presents them in technology demonstrations, in conjunction with joint experiments and other assessment events.  Beginning in FY 2021 this project will continue to exploit and integrate emerging technologies for sensors and surveillance enabling systems. Increases focus on tactical sensors and enabling technologies in support of the Intelligence, Surveillance, and Reconnaissance (ISR) mission set focused leading edge technology, biometric and biotechnology, which is directed towards the development of revolutionary tags, taggants, sensors, communications, and data processing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "31.886"
                                            },
                                            "Text": {
                                                "val": "Continue the development and insertion of technology into existing programs.  Technologies include, but are not limited to: reduced signature profiles, improved weapons, communications, command, and control systems, machine learning\/artificial intelligence, sensors, and situational awareness tools; lightweight armor and materials, alternative power systems, eco-friendly sustainable energy devices, long duration, reduced size, high output power supplies, and technologies that reduce the load of the operator.  Continue development of technologies supporting undersea, air and ground mobility.  Evaluate and develop sensors across the electromagnetic spectrum to meet operational requirements.  Continue the integration of critical technologies focused on providing the dismounted special operator leap-ahead capabilities via innovative collaborative processes.  Continue developing unique robotic systems to reduce the load of the operator and augment human performance. Continue to develop Command, Control, Communications, Computers, and Intelligence (C4I) Technology to implement a robust, ultra-wideband communication capability.  Continue effort for field prototype system incorporating technologies likely to transition to fielded systems.  Based upon agreed technology maturity metrics, transfers successful projects into programs of record, and conduct field experimentations at various venues to facilitate technology insertion."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "41.118"
                                            },
                                            "Text": {
                                                "val": "Continue the development and insertion of technology into existing programs. Technologies include, but are not limited to: reduced signature profiles, improved tailorable lethality and precision strike weapons, assured communications, command and control systems, machine learning\/artificial intelligence, optics, sensors, information sources, and situational awareness tools; lightweight armor and materials, power and energy enablers, and technologies that reduce the load of the operator. Continue development of technologies supporting undersea, ground and air mobility. Evaluate and develop sensors across the electromagnetic spectrum to meet operational requirements. Continue the integration of critical technologies focused on providing the dismounted special operator leap-ahead capabilities via innovative collaborative processes. Continue to develop sensors, surveillance, network and data management technology to provide tactically relevant situational awareness and point of need. Continue effort for field prototype system incorporating technologies likely to transition to fielded systems. Based upon agreed technology maturity metrics, transfers successful projects into programs of record, and conducts field experimentations at various venues to facilitate technology insertion."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "63.940"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "63.940"
                                            },
                                            "Text": {
                                                "val": "Continues the development and insertion of technology into existing programs. Technologies include, but are not limited to: reduced signature profiles, improved tailorable lethality weapons and precision strike weapons, assured communications, command and control systems, machine learning\/artificial intelligence, optics, sensors, information sources, and situational awareness tools; lightweight armor and materials, power and energy enablers, and technologies that reduce the load of the operator.  Continues the development of technologies and materials which support power and energy enablers, and technologies that reduce the load of the operator.  Continues development of technologies supporting undersea, ground and air mobility.  Evaluates and develops sensors across the electromagnetic spectrum to meet operational requirements. Continues the integration of critical technologies focused on providing the dismounted special operator leap-ahead capabilities via innovative collaborative processes. Continues to develop sensors, surveillance, network and data management technology to provide tactically relevant situational awareness and point of need.  Continues effort for field prototype system incorporating technologies likely to transition to fielded systems.  Beginning in FY 2021, this project will continue to exploit and integrate emerging technologies for sensors and surveillance enabling systems. Increases focus on tactical sensors and enabling technologies in support of the ISR mission set focused leading edge technology, biometric and biotechnology, which is directed towards the development of revolutionary tags, taggants, sensors, communications, and data processing.  Based upon agreed technology maturity metrics, transfers successful projects into programs of record, and conducts field experimentations at various venues to facilitate technology insertion."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Net increase of $22.822 million due to an increase for the integration with SOF Tagging, Tracking, and Locating Technologies (TTL) Project ($21.926 million) and integration of Artificial Intelligence and Biotechnologies ($0.896 million)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tagging, Tracking, and Locating Technologies (TTL) Project"
                                    },
                                    "Description": {
                                        "val": "TTL funds SOF unique ATDs identified in the USSOCOM Quick Look Capabilities Based Assessments (QL-CBA).  TTL rapidly prototypes and expeditiously transitions projects from laboratory to acquisition Programs of Record\/operational use to address SOF capability deficiencies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.079"
                                            },
                                            "Text": {
                                                "val": "Continue to exploit and integrate recently-proven and emerging technologies for TTL and TTL-enabling systems.  Continue to mature technologies that are linked to the USSOCOM\/DOD TTL Roadmap, which is updated via the JCS\/J8-approved annual TTL QL-CBA.  Continue to increase focus on tactical sensors and enabling technologies in support of the special reconnaissance mission set."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.915"
                                            },
                                            "Text": {
                                                "val": "Continue to exploit and integrate recently-proven and emerging technologies for TTL and TTL-enabling systems.  Continue to mature technologies that are linked to the USSOCOM\/DoD TTL Roadmap, which is updated via the Joint Chiefs of Staff (JCS)\/J8-approved annual TTL QL-CBA.  Continue to increase focus on tactical sensors and enabling technologies in support of the special reconnaissance mission set."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $19.915 million is due to the integration of the SOF Tagging, Tracking, and Locating Technologies (TTL) Project into the SOF Special Technology Project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Classified Project"
                                    },
                                    "Description": {
                                        "val": "Classified Project (provided under separate cover)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.142"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.927"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.045"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.045"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $0.118 million will be provided under separate cover."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "SF101"
                    },
                    "ProjectTitle": {
                        "val": "Engineering Analysis"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "37.384"
                        },
                        "PriorYear": {
                            "val": "16.475"
                        },
                        "CurrentYear": {
                            "val": "21.845"
                        },
                        "BudgetYearOne": {
                            "val": "19.087"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.087"
                        },
                        "BudgetYearTwo": {
                            "val": "19.396"
                        },
                        "BudgetYearThree": {
                            "val": "19.713"
                        },
                        "BudgetYearFour": {
                            "val": "20.079"
                        },
                        "BudgetYearFive": {
                            "val": "20.388"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides a rapid response capability to support Special Operations Forces (SOF) platforms (ground, air and maritime), Unmanned Aerial Vehicle (UAV) payload sensors and soldier systems.  The purpose is to correct system deficiencies, improve asset life, and enhance mission capability through the means of feasibility studies, analysis of alternatives, pre-developmental risk reduction studies, and engineering analyses. This project provides the engineering required to improve the design and performance integrity of the SOF platforms, UAV payload sensors and soldier support systems, sub-systems, equipment, and embedded computer software as they relate to the maintenance, overhaul, repair, quality assurance, modifications, materiel improvements, and service life extensions.  This project also conducts risk reduction studies, analyses, and demonstrations to support emerging, time-critical weapons and sensor enhancements."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Soldier System Engineering Analysis"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4.250"
                                        },
                                        "Text": {
                                            "val": "Continue to assess materials, concepts and prototypes to reduce soldier load and provide increased protection against the latest emerging threats.  Evaluate soldier worn sensors and heads up displays for operability within soldier worn components and subsystems.  Assess technology feasibility and integration readiness of next generation load carriage systems such as exoskeletons and load-assist devices.  Assess proofs of concept and technologies for next generation communications systems that integrate situational awareness in all environments."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Platform Engineering Analysis"
                                    },
                                    "Description": {
                                        "val": "Funding supports the development of rapid response capabilities to support SOF platform and soldier systems.  Rapidly addresses technology needs for insertion into Programs of Record.  Supports technology development to correct system deficiencies, improve platform asset life, and enhance mission capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.452"
                                            },
                                            "Text": {
                                                "val": "Continue to assess concepts and prototypes that provide increased ballistic protection of air, ground and undersea mobility platforms to include manned and unmanned UAVs, and mobility platform improvements to meet emerging threats.  Assess and evaluate advanced precision guided munitions and scalable effects weapons.  Identify, assess and evaluate improved Command, Control, Communication, Computer (C4) systems that incorporate significant improvements to operate in contested environments, systems that improve situational awareness on the battlefield, and next generation manned and unmanned Intelligence, Surveillance, and Reconnaissance (ISR) systems and common sensors and sensor suites."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.912"
                                            },
                                            "Text": {
                                                "val": "Continue to assess concepts and prototypes that provide increased capability of air, ground and undersea mobility platforms to include improvements to meet emerging threats.  Assess and evaluate advanced methods to deliver tailorable lethality.  Identify, assess, and evaluate improved network and data management systems that incorporate significant improvements to operate in contested environments, systems that improve situational awareness on the battlefield, and disruptive technologies to enable Intelligence, Surveillance, and Reconnaissance (ISR) in future environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Future Platform Engineering Analysis efforts will continue under the Engineering Analysis Project."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $10.192 million is due to the consolidation and integration of technology insertion funding to the Engineering Analysis Project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier System Engineering Analysis"
                                    },
                                    "Description": {
                                        "val": "Funding supports engineering assessments and evaluation of technology readiness in the following areas: 1) next generation lightweight low-cost body armor and ballistic helmets 2) ballistic and laser variable light transmission protective eyewear 3) soldier worn sensors to assess ballistic and blast events as well as soldier health 4) next generation soldier worn load carriage systems and 5) soldier worn head borne communications that provide greater situational awareness and hearing protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.472"
                                            },
                                            "Text": {
                                                "val": "Continue to assess advanced body armor and ballistic helmet materials, concepts and prototypes to reduce soldier load and provide increased ballistic protection against the latest emerging threats.  Reduce the number of eyewear lenses needed and to have one lens that provides ballistic and laser protection as well as automatically darkens\/lightens based on combat conditions.  Evaluate soldier worn sensors and heads up displays for operability within soldier worn components and subsystems.  Assess technologies feasibility and integration readiness of next generation load carriage systems such as exoskeletons and load-assist devices.  Assess proof of concepts and technologies for next generation head borne communications systems that provide reliable and secure wireless transmission in all combat conditions, as well as provide 360 degree situational awareness and noise attenuation while increasing hearing protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Continue to assess materials, concepts and prototypes to reduce soldier load and provide increased protection against the latest emerging threats.  Evaluate soldier worn sensors and heads up displays for operability within soldier worn components and subsystems.  Assess technology feasibility and integration readiness of next generation load carriage systems such as exoskeletons and load-assist devices.  Assess proofs of concept and technologies for next generation communications systems that integrate situational awareness in all environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $0.500 million is due to the consolidation and integration of Future Soldier System Engineering Analysis efforts into the Engineering Analysis Project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "National to Theater Engineering Analysis"
                                    },
                                    "Description": {
                                        "val": "Provides additional engineering analysis and testing required to transition items from national forces to theater forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.726"
                                            },
                                            "Text": {
                                                "val": "Conduct additional testing and evaluation required on various equipment items such as communications, intelligence, weapons, and operator protection planned for transition to SOF Theater Forces."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.236"
                                            },
                                            "Text": {
                                                "val": "Conduct additional testing and evaluation required on various equipment items such as communications, intelligence, weapons, and operator protection planned for transition to SOF Theater Forces."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.281"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.281"
                                            },
                                            "Text": {
                                                "val": "Conducts additional testing and evaluation required on various equipment items such as communications, intelligence, weapons, and operator protection planned for transition to SOF Theater Forces."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $0.045 million is for minor adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aviation Mission Improved Survivability"
                                    },
                                    "Description": {
                                        "val": "Funding supports engineering analysis activities to address aviation survivability such as signature management, situational awareness, and versatile mission equipment (payloads, communications, and weapons) to achieve SOF mission objectives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.825"
                                            },
                                            "Text": {
                                                "val": "Continue engineering analysis activities to improve SOF aviation mission survivability.  Activities include, but are not limited to, signature management (acoustic, infrared, radio frequency), situational awareness with full spectrum threat warning and countermeasures, and versatile mission equipment (payloads, communications and weapons) to improve SOF survivability in less than permissive operating environments.  Proof of concepts with potential from prior year will be further matured."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.947"
                                            },
                                            "Text": {
                                                "val": "Continue engineering analysis activities to improve SOF aviation mission survivability.  Activities include, but are not limited to, signature management (acoustic, infrared, radio frequency), situational awareness with full spectrum threat warning and countermeasures, and versatile mission equipment (payloads, communications, and weapons) to improve SOF survivability in less than permissive operating environments.  Proof of concepts with potential from prior year will be further matured."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $3.947 million due to the integration of Future Aviation Mission Improved Survivability Project efforts into Aviation Systems (Program Element 1160403BB) under project SF100 Aviation Engineering Analysis (AEA)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering Analysis"
                                    },
                                    "Description": {
                                        "val": "Funding supports the development of rapid response capabilities to support SOF platform and soldier systems. Supports technology development to correct system deficiencies, improve platform asset life, and enhance mission capabilities. Supports engineering assessments and evaluation of technology feasibility, producibility, and integration into next generation soldier equipment. Supports engineering analysis activities to address platform survivability such as signature management, situational awareness, and versatile mission equipment (payloads, communications, and weapons) to achieve SOF mission objectives. Rapidly addresses technology needs for insertion into Programs of Record."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.806"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.806"
                                            },
                                            "Text": {
                                                "val": "Begins to assess concepts and prototypes that provide increased capability of SOF mobility platforms to include improvements to meet emerging threats. Assesses and evaluates advanced methods to deliver tailorable lethality. Identifies, assesses, and evaluates improved network and data management systems that incorporate significant improvements to operate in contested environments, systems that improve situational awareness on the battlefield, and disruptive technologies to enable ISR in future environments. Continues to assess materials, concepts, and prototypes to increase operator effectiveness and situational awareness in all environments. Continues engineering analysis activities to improve SOF platform mission survivability. Activities include, but are not limited to, signature management (acoustic, infrared, radio frequency), situational awareness with full spectrum threat warning and countermeasures, and versatile mission equipment (payloads, communications, and weapons) to improve SOF survivability in less than permissive operating environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $12.806 million due to the consolidation and integration of technology insertion funding from Platform Engineering Analysis and Soldier System Engineering Analysis Projects."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Experimentation Force"
                                    },
                                    "Description": {
                                        "val": "Funding supports the integration of technology with operational vignette-based experiments designed to stimulate innovative applications across all domains addressing SOF specific modernization needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Begins the development of innovative concepts and conducts experimentation to develop hyper-enabled teams capable of conducting globally integrated special operations across all domains."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $4.000 million due to funding the development of the Experimentation Force infrastructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S225"
                    },
                    "ProjectTitle": {
                        "val": "Information and Broadcast Systems Adv Tech"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "24.012"
                        },
                        "PriorYear": {
                            "val": "4.428"
                        },
                        "CurrentYear": {
                            "val": "4.599"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts development, rapid prototyping, and demonstration\/testing of information and broadcast system technology.  Includes cyber capabilities that predict the best media channels to reach potential target audiences, data mining and information collections tools, propaganda and social behavior analytical tools, cultural analysis tool sets and emerging technologies that support the planning and analytical needs for Military Information Support Operations (MISO) forces.  It provides a means for demonstrating and evaluating the utility of emerging\/advanced technologies in as realistic an operational environment as possible by SOF users.  This project integrates efforts and conducts technology demonstrations in conjunction with joint experiments and other assessment events and performs market research on emerging technologies that support all phases of MISO.  Evaluation results are included in a transition package, which assists in the initiation of or insertion into an acquisition program.  The project also addresses unique, joint special mission or area-specific needs.  Seeks technologies that will transform current MISO capabilities through two major objectives: 1) Exploit technologies capable of disseminating products to reach target audiences across a variety of media to include audiences in denied areas.  2) Automate and improve MISO planning and analytical capability through technologies that are integrated into SOF planning systems (Cultural Analysis, Targeting, Theme Development, Media & Product Selection, Distribution & Dissemination, and Measures of Effectiveness).  Develops software applications that increases the efficiency and shortens the timeline to get MISO dissemination packages approved.  Develops hardware\/software tools that facilitate the collaboration and sharing of information and other critical data."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Broadcast and Dissemination Modernization"
                                    },
                                    "Description": {
                                        "val": "Develops emerging technologies available in the marketplace to transform and modernize planning, analysis, development, broadcast, distribution, dissemination, and feedback capabilities for MISO forces. This initiative will also continue development of appropriate emerging technologies initially identified by Advance Technology Demonstrations and Joint Capability Technology Demonstrations to transition to acquisition programs. Technologies include: multi-frequency broadcast systems; digital broadcast capabilities; remote controlled electronic paper; near-real-time command and control of unattended systems, especially in denied areas; focused\/beam speaker sound technologies; visual projection technologies; advanced commercial broadcast technologies including amplitude modulation and frequency modulation radio transmitters and antenna; television transmitter and antenna systems; internet and telephony dissemination and broadcast systems; technologies capable of long-loiter broadcast and delivery in denied and permissive environment; and technologies that automate and improve planning and analytical capability through integrated capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.428"
                                            },
                                            "Text": {
                                                "val": "Continue performance of engineering studies, development, and demonstrations of planning, analysis, distribution, and broadcast capabilities in the digital domain."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.599"
                                            },
                                            "Text": {
                                                "val": "Continue performance of engineering studies, development, and demonstrations of planning, analysis, distribution, and broadcast capabilities in the digital domain."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $4.599 million is due to funding being transitioned to PE 1160431BB, Warrior Systems."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}