{
    "id": "2021-DefenseLogisticsAgency-PB-0400-MJBOOK-0-0-acf96c0beb9213fd7cee6eedeab49827fe0ca18e948d06da9ee842b40269601c-1",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-DLA-U_RDTE_MasterJustificationBook_Defense_Logistics_Agency_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Logistics_Agency_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603712S"
        },
        "ProgramElementTitle": {
            "val": "Logistics Research and Development Technology (Log R&D)"
        },
        "R1LineNumber": {
            "val": "52"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "45.739"
            },
            "PriorYear": {
                "val": "18.127"
            },
            "CurrentYear": {
                "val": "16.620"
            },
            "BudgetYearOne": {
                "val": "10.235"
            },
            "BudgetYearOneBase": {
                "val": "10.235"
            },
            "BudgetYearTwo": {
                "val": "10.355"
            },
            "BudgetYearThree": {
                "val": "10.679"
            },
            "BudgetYearFour": {
                "val": "10.920"
            },
            "BudgetYearFive": {
                "val": "11.171"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Logistics Agency (DLA) is responsible for providing to the Military Services, and other Federal Agencies, as well as combined and allied forces the full spectrum of logistics, acquisition and technical services. DLA sources and provides virtually 100 percent of the consumable items the military services need to operate – including food, uniforms, fuel and energy, medical supplies, construction and barrier materials and equipment, and more than 85 percent of the military’s spare parts.  DLA also provides logistics services including logistics information data, manages the reutilization of military equipment, and documents automation and production services. DLAs Logistics Research and Development (Log R&D) program helps ensure that advanced logistics concepts and business processes are used to accomplish the agency’s mission with the leanest possible infrastructure.  Log R&D identifies the best commercial business practices and tailors them, as necessary, into the most effective business processes for the agency.  Log R&D develops and demonstrates high risk, high payoff technology that provides a significantly higher level of support at the lowest possible costs. \n\nThe DLA Log R&D program is organized into three Strategic Focus Areas (SFAs):\n• Enhancing Analysis, Modeling, and Decision Support (EAMD): R&D efforts to develop decision support tools, such as modeling, simulation, and other analytics to improve operational strategy decision-making, forecasting, and procurement, which support more effective and efficient responses to emerging market and customer requirements.  \n• Improving Logistics Processes (ILP): R&D efforts to develop and implement advanced technology in logistics processes over and above current baseline systems.\n• Emergent Logistics R&D Requirements (ELR): R&D efforts to support emergent Logistics R&D requirements that arise out of the budget cycle. These out of cycle requirements always occur.  This SFA begins new projects in a timely manner without disrupting ongoing projects by funds reallocation.  This SFA scope includes all DLA supply chains and logistics processes.\n\nDLA’s focus for this budget cycle highlights advanced capabilities in digital and technical data modernization, management and analytics to fulfill the DLA role in the DOD Digital Engineering Strategy and improve sharing of data with the industrial base and supported organizations. Investment explores technologies to lower the Agency’s material acquisition and operations costs and improve weapons systems support. This effort spans across both DLA R&D Program Elements and multiple Strategic Focus Areas, impacting across the DOD Joint Defense Manufacturing Technology Panel and DLA Enterprise logistics processes."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "18.127"
                },
                "CurrentYear": {
                    "val": "10.817"
                },
                "BudgetYearOne": {
                    "val": "10.998"
                },
                "BudgetYearOneBase": {
                    "val": "10.998"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.127"
                },
                "CurrentYear": {
                    "val": "16.620"
                },
                "BudgetYearOne": {
                    "val": "10.235"
                },
                "BudgetYearOneBase": {
                    "val": "10.235"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "5.803"
                },
                "BudgetYearOne": {
                    "val": "-0.763"
                },
                "BudgetYearOneBase": {
                    "val": "-0.763"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-3.600"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "10.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "CurrentYear": {
                        "val": "-0.597"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Defense Wide Review Reduction"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.583"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.583"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Inflation for Civilian Pay"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.017"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.017"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Inflation for Non-Pay\/Non-Fuel Purchases"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.010"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.010"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Internal Realignment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.187"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.187"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY2020, $3.600 million reduction OSD Enacted FY2020 adjustments due to prior year carryover. \nFY2020, $10.000 million Congressional Addition for program increase steel performance initiative in Castings.\nFY2020, the Small Business Innovation Research and Small Technology Transfer Research tax amounted to $0.597 million.\nFY2021, internal realignment decreased program baseline by $0.186 million for critical Defense Property Accountability System redesign and upgrade requirements.\nThe FY 2021 funding request was reduced by $0.583 million during the Defense-Wide Review to free up resources for higher priority Department needs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EMM"
                    },
                    "ProjectTitle": {
                        "val": "Enhancing Analysis, Modeling, and Decision Support (formerly Analytic & Decision Support)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "8.754"
                        },
                        "PriorYear": {
                            "val": "3.758"
                        },
                        "CurrentYear": {
                            "val": "2.075"
                        },
                        "BudgetYearOne": {
                            "val": "2.729"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.729"
                        },
                        "BudgetYearTwo": {
                            "val": "2.775"
                        },
                        "BudgetYearThree": {
                            "val": "2.886"
                        },
                        "BudgetYearFour": {
                            "val": "2.900"
                        },
                        "BudgetYearFive": {
                            "val": "2.970"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Strategic Focus Area (SFA) funds developments in advanced analytical tools, modeling, and simulation of logistics and supply chain processes. These tools will improve DLA forecasting and procurement strategy decisions and lead to faster and more flexible responsiveness to emerging market and customer requirements.  This SFA consists of two programs:\n\nThe Medical Logistics Network (MLN) program supports the Medical Directorate’s mission to develop and implement the logistics and medical supply chain business practices that ensure the cost-effective and efficient distribution of medical materiel to the full range of Military Health System operations. \n\nThe Strategic Distribution & Disposition (SDD) Program collaborates with DLA Distribution and Disposition Services to identify legacy capabilities that are inadequate for emerging worldwide distribution and disposition requirements. A key objective of the SDD Program is to anticipate, assess, and meet the current and future Warfighter requirements by leveraging R&D to infuse innovation into solutions. Long-term objectives include mitigating the DoD Supply Chain Management high risk issues identified by the Government Accountability Office (GAO), 2018 (Inventory Management, Material Distribution and Asset Visibility)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enhancing Analysis, Modeling, and Decision Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.758"
                                            },
                                            "Text": {
                                                "val": "The Medical Logistics Network (MLN) program supports the Medical Directorate’s mission to develop and implement the logistics and medical supply chain business practices that ensure the cost-effective and efficient distribution of medical materiel to the full range of Military Health System operations.  A portion of the MLN budget was realigned to other R&D efforts due to no specific projects identified.  Assessments are currently being conducted for viable R&D projects for the budgeted amounts.\n\nThe Strategic Distribution and Disposition (SDD) program provides applied research, analytical and decision support to DLA Distribution and Disposition Services through advanced analytical tools such as Business Case Analyses (BCAs) that support DLA Distribution and Disposition Services strategic decision making. Additionally, SDD will continue to support the Distribution Modernization Program to identify, evaluate, and test emerging and disruptive technologies that have high potential application to distribution and disposition operations. Furthermore, SDD will engage with Department of Defense (DoD) sponsored Federally Funded Research and Development Centers (FFRDCs) and University-Affiliated Research Center Laboratories (UARCs) to perform applied research in technologies such as blockchain, artificial intelligence, machine learning, Internet of Things (IoT), augmented reality, and autonomous\/robotics systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.075"
                                            },
                                            "Text": {
                                                "val": "The Medical Logistics Network (MLN) program continues to support the Medical Directorate’s mission to develop and implement the logistics and medical supply chain business practices that ensure the cost-effective and efficient distribution of medical materiel to the full range of Military Health System operations. Assessments are currently being conducted for viable R&D projects for the budgeted amounts. MLN baseline was reduced by approximately $0.165 million resulting from overall LOG R&D  $3.600 million reduction OSD Enacted FY2020 adjustments due to prior year carryover. No planned projects are impacted.\n\nThe Strategic Distribution and Disposition (SDD) program continues to provide applied research, analytical and decision support to DLA Distribution and Disposition Services and provide support to the Distribution Modernization Program. Additionally, SDD will continue to engage with Industry, Department of Defense (DoD) sponsored Federally Funded Research and Development Centers (FFRDCs) and University-Affiliated Research Center Laboratories (UARCs) leveraging subject-matter expertise in key areas of research such as Blockchain, Artificial Intelligence, Machine Learning, Internet of Things (IoT), Augmented Reality, and Autonomous\/Robotics systems. SDD baseline was reduced by approximately $0.907 million resulting from overall LOG R&D  $3.600 million reduction OSD Enacted FY2020 adjustments due to prior year carryover. Impact of the baseline reduction will cause project delays or cancellations in support of the DLA Distribution Modernization Program initiatives, one of DLA Strategic Imperatives."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.729"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.729"
                                            },
                                            "Text": {
                                                "val": "Due to directed fiscal reductions, the Medical Logistics Network (MLN) program baseline was reduced to zero. Currently, there are no planned projects that will be impacted by the reduction.\n\nThe Strategic Distribution and Disposition (SDD) program will continue to provide applied research, analytical and decision support to DLA Distribution and Disposition Services and provide support to the Distribution Modernization Program (DMP). Additionally, SDD will continue to engage with Industry, Department of Defense (DoD) sponsored Federally Funded Research and Development Centers (FFRDCs) and University-Affiliated Research Center Laboratories (UARCs) leveraging subject-matter expertise in key areas of research such as Blockchain, Artificial Intelligence, Machine Learning, Internet of Things (IoT), Augmented Reality, and Autonomous\/Robotics systems. SDD will continue to incorporate Integrate Project Teams (IPT) for project collaboration and Integrated System Engineering concepts (test and evaluation) into Distribution projects."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Adjustments of $0.566 million due to DLA Fiscal Guidance reduction, civilian pay inflation, inflation for non-pay\/non-fuel purchases and internal realignment. Reduction zeroed-out the Medical Logistics Network Program baseline, no projects currently planned."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The DLA R&D program is executed through Delivery Orders placed on Indefinite Delivery\/Indefinite Quantity Contracts that resulted from competitive Broad Agency Announcements and through interagency agreements with the Military Services when it is cost effective and\/or provides some technical advantage, e.g. improves the probability of successful transition. DLA also has a continuously open Broad Agency Announcement for Emerging Technologies."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "GLTD"
                    },
                    "ProjectTitle": {
                        "val": "Improving Logistics Processes (formerly Logistics Process)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "19.502"
                        },
                        "PriorYear": {
                            "val": "3.568"
                        },
                        "CurrentYear": {
                            "val": "2.588"
                        },
                        "BudgetYearOne": {
                            "val": "4.044"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.044"
                        },
                        "BudgetYearTwo": {
                            "val": "4.114"
                        },
                        "BudgetYearThree": {
                            "val": "4.258"
                        },
                        "BudgetYearFour": {
                            "val": "4.277"
                        },
                        "BudgetYearFive": {
                            "val": "4.376"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Improving Logistics Processes (ILP) Strategic Focus Area (SFA) encompasses R&D efforts within the Weapon System Sustainment (WSS) Program to support DLA business functional units through applied research and development of advanced technologies to improve business processes and operational methods, leverage the application of leading edge logistics “out-of-the box” concepts using disruptive technology business tools, and support DLA’s technological transformation effort. To qualify for R&D funding, the R&D effort must develop and apply technology and processes over and above current baseline IT systems and continuous improvements efforts.\n\nAlthough all DLA processes are in scope, the strategic focus for this budget cycle is in Procurement, Planning, Technical Quality and the Major Subordinate Commands.\n\nInnovative process changes and new technologies will be researched in these areas to drive improvements to internal costs, reduce award delays, and improve material availability, supply chain security, demand forecasting and logistical planning. This will be accomplished through the use of artificial intelligence\/machine learning, blockchain technology, and research of emerging commercial best practices and technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Improving Logistics Processes (ILP)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.568"
                                            },
                                            "Text": {
                                                "val": "The Weapon Systems Sustainment (WSS) program will continue working with Procurement to implement long term process improvement plans to include projects in the areas of administrative and production lead time estimation and procurement of commercially available parts (e-commerce). Another main thrust for FY2019 will be the execution of projects to improve retail operations inventory strategy and to research new processes that leverage DLA’s capabilities in operational and tactical retail operations.  WSS will also leverage condition based maintenance data from the Services to enhance planning for retail operations and depot maintenance logistical support. Initial studies will focus on a single Service.  Artificial intelligence \/ machine learning capability projects will begin in FY2019 and continue for years to come as additional opportunities are identified.  Also, machine-learning techniques will be applied to processes for lead-time estimation, demand forecasting, low demand inventory strategies, and retail operation strategies.  In addition, the use of blockchain technology in Tech Quality (TQ)  processes that monitor vendor risk will be researched as an initial study of using this technology in DLA processes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.588"
                                            },
                                            "Text": {
                                                "val": "The Weapon Systems Sustainment (WSS) program will continue to explore new use case studies for disruptive technologies.  Additional areas of interest for the five year artificial intelligence roadmap  include the ability to effectively manage metadata in DLA systems to enable enterprise-wide adoption of new capabilities, development of a predictive analytics capability for backorders, and using machine learning techniques to improve operation plan logistic estimates. Projects are planned to research incorporating internet-based purchases and a contract quality control program into DLA’s acquisition processes as well as expansion of capabilities to gather and utilize market intelligence. WSS baseline was reduced by approximately $1.335 million resulting from overall LOG R&D  $3.600 million reduction OSD Enacted FY2020 adjustments due to prior year carryover. Impact of the baseline reduction will cause project delays or cancellations in support of the DLA Strategic Imperatives for exploring AI\/ML technologies for Predictive Analytics as well as Market Intelligence and Supply Chain security projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.044"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.044"
                                            },
                                            "Text": {
                                                "val": "The Weapon System Sustainment (WSS) program will continue research of artificial intelligence \/ machine learning capabilities to identify readiness drivers for retail parts support and predict vendor \/ distributor vulnerabilities that will impact the supply chain. Projects to leverage the Services’ advances in predictive maintenance and condition based maintenance programs will continue to identify opportunities to improve DLA planning processes and retail operations. In addition, the program will collaborate with academia to research capabilities to improve the ability to acquire items with diminishing manufacturing sources or material shortages."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No significant change."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The DLA R&D program is executed through Delivery Orders placed on Indefinite Delivery\/Indefinite Quantity Contracts that resulted from competitive Broad Agency Announcements and through interagency agreements with the Military Services when it is cost effective and\/or provides some technical advantage, e.g. improves the probability of successful transition. DLA also has a continuously open Broad Agency Announcement for Emerging Technologies."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "04"
                    },
                    "ProjectTitle": {
                        "val": "Emergent Logistics R&D Requirements (formerly Innovative Products & Services for DLA Customers)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "17.483"
                        },
                        "PriorYear": {
                            "val": "10.801"
                        },
                        "CurrentYear": {
                            "val": "11.957"
                        },
                        "BudgetYearOne": {
                            "val": "3.462"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.462"
                        },
                        "BudgetYearTwo": {
                            "val": "3.466"
                        },
                        "BudgetYearThree": {
                            "val": "3.535"
                        },
                        "BudgetYearFour": {
                            "val": "3.743"
                        },
                        "BudgetYearFive": {
                            "val": "3.825"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Emergent Logistics R&D Strategic Focus Area (SFA) includes R&D efforts to develop new products and services for DLA customers in two programs:\n\nThe Energy Readiness Program (ERP) roadmap helps to achieve the operational energy strategy goals of increasing sources of supply, developing and implementing alternative fuels under the ERP. \n\nThe Supply Chain Management (SCM) program addresses emergent and out of budget cycle requirements and opportunities within DLA’s supply chains. A key objective of the SCM Program is to collaborate with customers (DLA J-Codes and Major Subordinate Commands (MSCs)) to identify  capability shortfalls that can be addressed through major research efforts.  These R&D efforts strive to develop technology mitigation strategies that address current and anticipated problems within DLA’s supply chains."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Energy Readiness Program for Liquid Hydrocarbon Fuels"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "7.000"
                                        },
                                        "Text": {
                                            "val": "Developed innovative technologies to produce hydrocarbon biofuels from cellulosic (plant\/vegetable) matter. This effort further developed the upscaling of woody biomass-to-fuel processes."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "$5.000 million program increase for fuel conversion and $5.000 million for liquid hydro-carbon fuel."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Emergent Logistics R&D Requirements"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.801"
                                            },
                                            "Text": {
                                                "val": "The Energy Readiness Program (ERP) will focus on determining R&D solutions for ongoing issues affecting fuel and fuel additive quality and operational requirements (e.g. thermal stability, storage stability, ignition capability).  The program will assist the military services in the qualification and certification of alternative fuels to meet military specification requirements; this will be parallel to the availability of military resources necessary to complete these efforts. The ERP program will investigate and prototype, as appropriate, drone technologies applied to the energy operations.\n\nThe Supply Chain Management (SCM) program address the emerging capabilities shortfalls that occur in the supply chain through major research opportunities. Initiatives will align strategically and produce benefits such as reduced operating costs, enhanced organizational responsiveness and reliability, network resiliency, and streamlined customer service.  Additionally, SCM will complete the Advanced Thermoelectric Technology project to improve the current thermoelectric heater technology so it is more fuel-efficient, has an increased heating range, reduced maintenance requirements, and a longer service life. SCM will also work with DLA HQ Information Operations J6 on Robotic Process Automation (RPA) efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.957"
                                            },
                                            "Text": {
                                                "val": "The Energy Readiness Program (ERP) will continue to focus on providing additional alternatives for military unique fuels, working with the Service customers to improve specifications and standards for fuel quality, engage in modeling and simulation of the energy supply chain and identifying alternative energy sources for Military Customers.  ERP will focus on determining R&D solutions for ongoing issues affecting fuel and fuel additive quality and operational requirements (e.g. thermal stability, storage stability, ignition capability). The program will continue to assist the military services in the qualification and certification of alternative fuels to meet military specification requirements; this will be parallel to the availability of military resources necessary to complete these efforts.\n\nThe Supply Chain Management (SCM) program will continue to address the emerging capabilities shortfalls that occur in the supply chain through major research opportunities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.462"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.462"
                                            },
                                            "Text": {
                                                "val": "The Energy Readiness Program (ERP) will continue to focus on providing additional alternatives for military unique fuels, working with the Service customers to improve specifications and standards for fuel quality, engage in modeling and simulation of the energy supply chain and identifying alternative energy sources for Military Customers.  ERP will focus on determining R&D solutions for ongoing issues affecting fuel and fuel additive quality and operational requirements (e.g. thermal stability, storage stability, ignition capability). The program will continue to assist the military services in the qualification and certification of alternative fuels to meet military specification requirements; this will be parallel to the availability of military resources necessary to complete these efforts.\n\nThe Supply Chain Management (SCM) program will continue to address emergent and out of budget cycle requirements and opportunities within DLA’s supply chains. The SCM program will expand blockchain projects across the Joint Deployment and Distribution Enterprise (JDDE).  SCM baseline was reduced by approximately $0.477 million resulting from overall LOG R&D $3.600 million reduction OSD Enacted FY2020 adjustments due to prior year carryover. Impact of the baseline reduction will decrease the availability of funds for emergent technology solutions for the LOG R&D Program, to include blockchain technologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No significant change."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The DLA R&D program is executed through Delivery Orders placed on Indefinite Delivery\/Indefinite Quantity Contracts that resulted from competitive Broad Agency Announcements and through interagency agreements with the Military Services when it is cost effective and\/or provides some technical advantage, e.g. improves the probability of successful transition. DLA also has a continuously open Broad Agency Announcement for Emerging Technologies."
                        }
                    }
                }
            ]
        }
    }
}