{
    "id": "2021-Army-PB-2040-JBOOK-7f1ee284016a103cbd6a4d63ea727aa617711f15268cf669f26149e7ae172ad5-22",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602618A"
        },
        "ProgramElementTitle": {
            "val": "Ballistics Technology"
        },
        "R1LineNumber": {
            "val": "28"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "86.737"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "86.737"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020, this Program Element (PE) is realigned with continuity of effort to the following PEs:\n* PE 0602141A (Lethality Technology)\n* PE 0602143A (Soldier Lethality Technology)\n* PE 0602145A (Next Generation Combat Vehicle Technology)\n* PE 0602147A (Long Range Precision Fires Technology)"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE investigates and evaluates materials and technologies, and designs and develops methodologies and models required to enable enhanced lethality and survivability. Project H80 focuses on applied research of lightweight armors and protective structures for the Soldier and vehicles; kinetic energy active protection; crew and components protection from ballistic shock and mine-blast; insensitive propellants\/munitions formulations; novel multi-function warhead concepts; affordable precision munitions design; techniques, methodologies, and models to analyze combat effectiveness and identify potential technology vulnerabilities; and technologies, methods, and tools for injury prediction of vehicle occupants during under-body blast events.\n\nWork in this PE makes extensive use of high performance computing and experimental validation and builds on research transitioned from PE 0601102A (Defense Research Sciences) \/ Project H42 (Materials and Mechanics) and Project H43 (Research In Ballistics); and utilizes emerging materials from PE 0602105A (Materials Technology) and applies it to specific Army platforms and the individual Soldier applications.\n\nThe work in this PE complements and is fully coordinated with efforts in PE 0602120A (Sensors and Electronic Survivability), PE 0602303A (Missile Technology), PE 0602601A (Combat Vehicle and Automotive Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602716A (Human Factors Engineering Technology), PE 0602786A (Warfighter Technology), PE 0603125A (Combating Terrorism-Technology Development), PE 0603001A (Warfighter Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603313A (Missile and Rocket Advanced Technology), and PE 0708045A (Manufacturing Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nThis work is performed by the United States Army Futures Command."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "85.491"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "86.737"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "1.246"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.896"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.65"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H80"
                    },
                    "ProjectTitle": {
                        "val": "Survivability And Lethality Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "76.737"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "76.737"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned with continuity of effort to:\nProgram Element (PE) 0602141A Lethality Technology\n* Project AH5 Projectile and Multi-Function Warhead Technologies\n* Project AH6 Disruptive Energetics and Propulsion Technologies\n* Project AH7 Lethal and Scalable Effects Technologies\nPE 0602143A Soldier Lethality Technology\n* Project AZ5 Soldier Protection Technology - Vulnerability\nPE 0602145A Next Generation Combat Vehicle Technology\n* Project BG6 Advanced Concepts for Active Defense Technology\nPE 0602147A Long Range Precision Fires Technology\n* Project AH4 Precision and Coop Weapons in a Denied Env Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates, designs and develops materials, methods and models that provide Soldier protection by enhancing survivability and lethality. Specific technology and research thrusts include: lightweight armors and protective structures; crew and component protection from ballistic shock and\/or mine-blast; insensitive high energy propellants\/munitions to increase lethality and reduce propellant\/munitions vulnerability to attack; novel kinetic energy (KE) penetrator concepts to maintain\/ improve lethality; novel multi-function warhead concepts to enable defeat of a full-spectrum of targets (anti-armor, bunker, helicopter, troops); techniques, methodologies and models to analyze combat effectiveness and identify potential vulnerabilities in current and emerging technologies; and technologies, methods, and analysis tools for injury prediction of vehicle occupants during under-body blast events.\n\nThis Project supports efforts in the Army Science and Technology Ground, Lethality, Command, Control, Communications and Intelligence (C3I), and Soldier Portfolios.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nThe Ground Portfolio technology investments are creating a layered vehicle protection suite including Active Protection (Hard-Kill and Soft-Kill) capabilities supported by robust advanced armor."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Disruptive Energetics and Propulsion Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, evaluates, models, and informs the selection of propulsion and energetic materials and technologies to validate novel energetic materials concepts (such as nano-structural and insensitive) that exploit managed energy release required for improving the effectiveness and reducing the vulnerability of future gun\/missile systems and warheads.\nThis effort builds on disruptive energetic materials discovery efforts in PE 0601102A (Defense Research Sciences) \/ Project H43 (Research in Ballistics) to synthesize new materials with energy content up to ten times that of Research Department Explosive."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.902"
                                            },
                                            "Text": {
                                                "val": "Developed scale-up capability of multiple classes of disruptive energetic materials, testing and performance evaluation of disruptive energetic materials; developed computational methodology to model\/predict behavior for energetic materials in explosives and propellants composites at extreme conditions; developed mechanisms for modeling the gas-phase chemistry associated with the combustion of solid propellants; developed technologies to extend the range and velocity of small, medium and large caliber projectiles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lethal and Scalable Effects Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort identifies and models preferred options to reduce energy\/mass required to defeat emerging armor threats and to provide multi-purpose capabilities for revolutionary future lethality. In addition, this effort investigates technology options for scaling warhead lethality to enhance urban Warfighting capabilities including control of collateral damage."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.336"
                                            },
                                            "Text": {
                                                "val": "Explored new materials and architectures to reduce the weapon mass required to launch and deliver lethal mechanisms; experimentally demonstrated the ability to modify high energy muzzle blast fields; explore warhead concepts that can simultaneously defeat multiple targets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability\/Lethality Analyses"
                                    },
                                    "Description": {
                                        "val": "This effort devises state-of-the-art survivability\/lethality\/vulnerability methodologies to dynamically model the interaction of conventional ballistic threats against future weapon systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.424"
                                            },
                                            "Text": {
                                                "val": "Designed and developed new analytical methodologies and models to assess the highest priority new foreign and American technologies with the highest likelihood of affecting the ballistic survivability of Soldiers and fielded and developmental Army system; conducted experiments to characterize high resolution, time dependent penetration and failure mechanisms in ballistic events and exploited for applied mechanism that can be used in future Army systems; continued to investigate energy-efficient penetrator and warhead concepts for direct-fire, distributed, and cooperative lethality scenarios; develop deeper understanding of the science associated with non-lethal incapacitation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Threat Armor Formulations and Designs"
                                    },
                                    "Description": {
                                        "val": "This effort devises and matures multi-threat hybrid armor technologies incorporating both active and passive mechanisms for ground vehicle systems that are effective against future conventional weapons and evolving improvised threats. This research is coordinated with PE 0602601A (Combat Vehicle and Automotive Technology) and PE 0603005A (Combat Vehicle and Automotive Advanced Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.982"
                                            },
                                            "Text": {
                                                "val": "Matured promising multi-threat armor designs utilizing hybrid electromagnetic armor (EMA)\/energetic technologies; verified results both computationally and experimentally; transitioned a top attack defeat mechanism to Combat Capabilities Development Center Ground Vehicle Systems Center (CCDC GVSC) for further maturation and integration; initiated an effort to accelerate the maturation of a next generation kinetic energy (KE) defeat mechanism."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive and Cooperative Protection Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort pursues a holistic approach toward achieving significant weight reduction and defeat of future threats by utilizing real-time information, combined with threat knowledge, to provide ever-increasing protection. This approach includes integrating individual vehicle capabilities of armor, underbody blast protection, active protection systems, and advanced\nsoft kill methods into one solution to maximize survivability and minimize weight for combat and tactical vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.909"
                                            },
                                            "Text": {
                                                "val": "Conducted computational and experimental research to mature\/optimize promising adaptive armor designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ballistic and Blast Protection for Dismounted Soldiers"
                                    },
                                    "Description": {
                                        "val": "This effort develops unique physics-based models to understand the deflection and stress wave interactions with the human during the complex target interactions between threats and personal protective equipment. Use this knowledge framework to develop low technology readiness level Personal Protective Equipment concepts that are informed by the human effects during impact and blast events."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.134"
                                            },
                                            "Text": {
                                                "val": "Investigated the physics of failure for emerging threats utilizing high definition experiments to identify phenomena and calibrate the ballistic models; finalized injury models for soft and hard tissues for ballistic impact."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warrior Injury Assessment Manikin (WIAMan)"
                                    },
                                    "Description": {
                                        "val": "This work develops an improved demonstrator blast test manikin, data acquisition system, and injury prediction methods and tools that incorporate new medical research and which provides an improved capability to measure and predict skeletal injuries for vehicle occupants during under-body blast events."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.919"
                                            },
                                            "Text": {
                                                "val": "Completed injury bio-mechanics testing and injury assessment reference performance; validated finite element model for Generation-1 Automotive Test Dummy for risk assessment capabilities; completed injury analysis tool development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-scale Materials Modeling for Force Protection"
                                    },
                                    "Description": {
                                        "val": "This effort develops computational tools for the design of terminal ballistic concepts and material-specific properties to enable novel penetrator-target interactions. Multi-scale materials models developed in previous 6.1 (Basic Research) programs are transitioned to simulation framework suitable for impact and penetration modeling. This approach includes fusing materials and mechanisms to maximize survivability and minimize weight for combat and tactical vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.864"
                                            },
                                            "Text": {
                                                "val": "Performed limited V&V assessments of computational capability; transitioned models to Sandia and Livermore National Labs; developed second generation models."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Emerging Overmatch Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort supports the development and demonstration of lethality and protection concepts that re-establish overmatch for the next generation of manned and unmanned combat platforms.  It will tightly couple scientific research within a campaign of learning to form technology concepts for battlefield domination."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.194"
                                            },
                                            "Text": {
                                                "val": "Explored advanced protection and lethal mechanisms to enable the next generation combat vehicle and small autonomous systems; modeled operational effects based on laboratory\/range experiments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precision and Cooperative Weapons in Denied Environments"
                                    },
                                    "Description": {
                                        "val": "The goal of this research is to deliver weapon payloads in more extreme environments (e.g., speed, time, size, survivability, number of agents) against complex, evolving threats (e.g., evading, hiding, counter-measured).  Research focuses on understanding and enabling weapons technologies in the areas of vehicle design, control mechanisms, algorithms, embedded processing, and onboard sensing for multi-agent systems with limited, potentially-hostile guidance feedback information."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.058"
                                            },
                                            "Text": {
                                                "val": "Conducted free-flight computational and experimental investigation of enhanced open-loop control maneuver technologies in subsonic regime; studied structural response of control mechanism technologies for extremely high-G (>60kGs) launch survivability; investigated gun-launched morphing airframe technologies using computational and experimental methods; validated anchored and unanchored localization technologies for navigation in denied environments on low-speed vehicle in flight experiments and on high-speed vehicle in high-fidelity simulation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.015"
                                            },
                                            "Text": {
                                                "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "HB1"
                    },
                    "ProjectTitle": {
                        "val": "SURVIVABILITY AND LETHALITY TECHNOLOGIES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional increase."
                        },
                        "ProjectMissionDescription": {
                            "val": "These are Congressional Interest Items"
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase - Extended Range Cannon Artillery"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Program Increase - Extended Range Cannon Artillery"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Increase - Warfighter Protection Technology"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.998"
                                        },
                                        "Text": {
                                            "val": "Program Increase - Warfighter Protection Technology"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.002"
                                        },
                                        "Text": {
                                            "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}