{
    "id": "2021-UnitedStatesSpecialOperationsCommand-PB-0400-JBOOK-34af129b214279bb0d1492afd1cd339f28b0467b7feac660fd5af4ecebbe5dd1-0",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-SOCOM-U_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "United States Special Operations Command",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1160401BB"
        },
        "ProgramElementTitle": {
            "val": "SOF Technology Development"
        },
        "R1LineNumber": {
            "val": "23"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "United States Special Operations Command"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "552.604"
            },
            "PriorYear": {
                "val": "34.635"
            },
            "CurrentYear": {
                "val": "37.569"
            },
            "BudgetYearOne": {
                "val": "42.464"
            },
            "BudgetYearOneBase": {
                "val": "42.464"
            },
            "BudgetYearTwo": {
                "val": "45.304"
            },
            "BudgetYearThree": {
                "val": "46.274"
            },
            "BudgetYearFour": {
                "val": "47.388"
            },
            "BudgetYearFive": {
                "val": "48.336"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element enables United States Special Operations Command (USSOCOM) to conduct studies and develop laboratory prototypes for applied research and advanced technology development, as well as leverage other organizations' technology projects that may not otherwise be affordable within MFP-11.  Applying small incremental amounts of investments to Department of Defense (DoD), other government agencies, and commercial organizations allows USSOCOM to influence the direction of technology development or the schedule against which it is being pursued, and to acquire emerging technologies for Special Operations Forces (SOF).  This project provides an investment strategy for USSOCOM to link technology opportunities with capability deficiencies, capability objectives, technology thrust areas, human endurance and sensory performance, and technology development objectives."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "35.921"
                },
                "CurrentYear": {
                    "val": "40.569"
                },
                "BudgetYearOne": {
                    "val": "46.674"
                },
                "BudgetYearOneBase": {
                    "val": "46.674"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "34.635"
                },
                "CurrentYear": {
                    "val": "37.569"
                },
                "BudgetYearOne": {
                    "val": "42.464"
                },
                "BudgetYearOneBase": {
                    "val": "42.464"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.286"
                },
                "CurrentYear": {
                    "val": "-3.000"
                },
                "BudgetYearOne": {
                    "val": "-4.210"
                },
                "BudgetYearOneBase": {
                    "val": "-4.210"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-3.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.286"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-4.210"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.210"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding:  \n\nFY 2019:  Decrease of $1.286 million is due to transfer of funds to Small Business Innovative Research (SBIR)\/Small Business Technology Transfer (STTR) programs.   \n\nFY 2020:  Decrease of $3.000 million is due to a Congressional directed reduction due to underexecution.\n\nFY 2021:  Decrease of $4.210 million is due to a comprehensive analysis of future capability by USSOCOM resulting in a reduction of technology concept demonstrations, prototyping, and evaluation of advanced capabilities to better align with the Department's priorities as outlined in the National Defense Strategy (-$4.210 million).\n\nSchedule:  None.  \n\nTechnical:  None."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S100"
                    },
                    "ProjectTitle": {
                        "val": "SOF Technology Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "552.604"
                        },
                        "PriorYear": {
                            "val": "34.635"
                        },
                        "CurrentYear": {
                            "val": "37.569"
                        },
                        "BudgetYearOne": {
                            "val": "42.464"
                        },
                        "BudgetYearOneBase": {
                            "val": "42.464"
                        },
                        "BudgetYearTwo": {
                            "val": "45.304"
                        },
                        "BudgetYearThree": {
                            "val": "46.274"
                        },
                        "BudgetYearFour": {
                            "val": "47.388"
                        },
                        "BudgetYearFive": {
                            "val": "48.336"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts studies and develops laboratory prototypes for applied research and advanced technology developments, and leverages other organizations' technology projects that may not otherwise be affordable within MFP-11.  Small incremental co-investments with Department of Defense (DoD), other government agencies, and commercial organizations allow USSOCOM to influence the schedule and direction of technology developments, emerging technologies, and capabilities for Special Operations Forces (SOF), with significant economies of investment.  This USSOCOM investment strategy is used to link technology opportunities with capability deficiencies, capability objective, technology thrust areas, and technology objectives.  Technology development needs in these areas may be advertised to industry and government research and development agencies via agency announcements and calls for white papers."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SOF Technology Development"
                                    },
                                    "Description": {
                                        "val": "This project conducts studies and develops laboratory prototypes for applied research and advanced technology developments, and leverages other organizations' technology projects that may not otherwise be affordable within MFP-11.  Beginning in FY 2021, this project will continue to exploit and integrate emerging technologies for sensors and surveillance enabling systems. Increases focus on tactical sensors and enabling technologies in support of the Intelligence, Surveillance, and Reconnaissance (ISR) mission set focused leading edge technology, biometric and biotechnology, which is directed towards the development of revolutionary tags, taggants, sensors, communications, and data processing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.833"
                                            },
                                            "Text": {
                                                "val": "Continue ongoing technology development sub-projects in areas such as, but not limited to: long duration small form factor power supplies, alternative fuel power systems, reduced signature technologies, high data-rate throughput, and advance lightweight armor and materials.  Advance technologies for combat medical equipment, tactics, human performance, sensor and processing improvements, improve interfaces and displays, machine learning\/artificial intelligence, and secure communications.  Continue pursuit of methods to reduce operator load and provide advanced protection.  Develop technologies for improved and widened window of target engagement (escalation of force), pursue enhancements to technologies that can aid in detection of enemy intentions and movement, and continue development and exploration across the electromagnetic spectrum.  Based upon agreed technology maturity metrics, transfer successful projects into programs of record.  Continue the integration of critical technologies focused on providing the dismounted special operator leap-ahead capabilities via innovative collaborative processes.  Focus is on delivering prototype system for soldier protection and augmentation and continuing development of situational awareness and command\/control systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.967"
                                            },
                                            "Text": {
                                                "val": "Continue ongoing technology development projects in areas such as, but not limited to: enabling power technologies, signature reduction technologies, high data-rate throughput, and advances in lightweight armor and materials.  Advance technologies for combat medical equipment, biotechnologies, tactics, human performance, optics, sensor, information sources, and processing improvements, improve human-machine interfaces and display, identify SOF specific machine learning\/artificial intelligence, and secure communications.  Continue pursuit of methods to reduce operator load and provide advanced protection. Develop technologies for improved and widened window of target engagement (escalation of force), pursue enhancements to technologies that can aid in detection of enemy intentions and status, and continue development and exploration of novel technologies across the electromagnetic spectrum.  Based upon agreed technology maturity metrics, transfer successful projects into programs of record. Continue the integration of critical technologies focused on providing the dismounted special operator leap-ahead capabilities via innovative collaborative processes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "38.389"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "38.389"
                                            },
                                            "Text": {
                                                "val": "Continues ongoing technology development projects in areas such as, but not limited to: enabling power technologies, signature reduction technologies, high data-rate throughput, and advances in lightweight armor and materials.  Advances technologies for combat medical equipment, biotechnologies, tactics, human performance, optics, sensor, information sources, and processing improvements, improves human-machine interfaces and displays, identifies SOF specific machine learning\/artificial intelligence, and secure communications.  Continues pursuit of methods to reduce operator load and provides advanced protection. Develops technologies for improved and widened window of target engagement (escalation of force), pursues enhancements to technologies that can aid in detection of enemy intentions and status, and continues development and exploration of novel technologies across the electromagnetic spectrum.  Continues to exploit and integrate emerging technologies for sensors and surveillance enabling systems. Increases focus on tactical sensors and enabling technologies in support of the Intelligence, Surveillance, and Reconnaissance mission set.  Based upon agreed technology maturity metrics, transfers successful projects into programs of record. Continues the integration of critical technologies focused on providing the dismounted special operator leap-ahead capabilities via innovative collaborative processes."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Net Increase of $20.422 million is due to an increase for the integration of SOF Tagging, Tracking, and Locating Technologies (TTL) Project ($15.862 million) and increase for the integration of Artificial Intelligence (AI) and biotechnologies ($4.560 million)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tagging, Tracking, and Locating Technologies (TTL) Project"
                                    },
                                    "Description": {
                                        "val": "TTL funds Applied Research projects identified in the USSOCOM Quick Look Capabilities Based Assessments (QL-CBA).  TTL applies Intelligence, Surveillance, and Reconnaissance (ISR) focused leading edge technology, biometric and biotechnology, which is directed towards the development of revolutionary tags, taggants, sensors, communications, and data processing in support of the TTL mission."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.008"
                                            },
                                            "Text": {
                                                "val": "Continue projects to exploit technology, biotechnology and chemistry for application to TTL and TTL-enabling systems.  Initiate projects linked to the USSOCOM\/DOD TTL and ISR Roadmaps, which are updated via the JCS\/J8-approved annual TTL QL-CBA."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.956"
                                            },
                                            "Text": {
                                                "val": "Complete projects to exploit technology, biotechnology and chemistry for application to TTL and TTL-enabling systems.  Complete projects linked to the USSOCOM\/DoD TTL and ISR Roadmaps, which are updated via the Joint Chief of Staff (JCS)\/J8-approved annual TTL QL-CBA."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $15.956 million is due to the transition to the SOF Special Technology Project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Classified Sub-Project"
                                    },
                                    "Description": {
                                        "val": "Classified Sub-Project (provided under separate cover)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.794"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.646"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.075"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.075"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Details provided under separate cover."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}