{
    "id": "2021-Army-PB-2040-JBOOK-7f1ee284016a103cbd6a4d63ea727aa617711f15268cf669f26149e7ae172ad5-2",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602120A"
        },
        "ProgramElementTitle": {
            "val": "Sensors and Electronic Survivability"
        },
        "R1LineNumber": {
            "val": "8"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "90.023"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "90.023"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) is being realigned, with continuity of effort realigned to the following PEs:\n* PE 0602145A Next Generation Combat Vehicle Technology\n* PE 0602146A Network C3I Technology\n* PE 0602148A Future Vertical Lift\n* PE 0602150A Air and Missile Defense Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE investigates designs and evaluates sensors and electronic components and software that enhance situational awareness, survivability, lethality, and autonomous mobility for tactical ground forces. Project H16 investigates sensors, signal processing and information fusion technologies to increase target detection range and speed of engagement. Project SA1 (Congressional Interest Item) focuses on the design and development of Assured Positioning, Navigation, and Timing, and Robust Communications technologies for the Warfighter in disadvantaged\/degraded environments.  Project SA2 conducts applied research on biological sensors and biologically derived electronics that exploits breakthroughs in biotechnology basic research in collaboration with the Institute for Collaborative Biotechnology (ICB), a University Affiliated Research Center (UARC) led by the University of California, Santa Barbara in partnership with California Institute of Technology and Massachusetts Institute of Technology and their industry partners. Project TS1 researches and evaluates space-based remote sensing, signal, and information processing software in collaboration with other Department of Defense (DoD) and government agencies to support space force enhancement and space superiority advanced technology integration into Army battlefield operating systems. Project TS2 focuses on advancing perception for autonomous ground mobility, intelligent vehicle control and behaviors, human-robot interaction, robotic manipulation, and unique mobility for unmanned vehicles.  \n\nWork in this PE complements and is fully coordinated with efforts in PE 0602307A (Advanced Weapons Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602709A (Night Vision Technology), PE 0602782A (Command, Control, Communications Technology), PE 0603001A (Warfighter Advanced Technology), PE 0603006A (Command, Control, Communications Advanced Technology), PE 0603710A (Night Vision Advanced Technology), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology),\n \nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the Army Futures Command.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "80.849"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "90.023"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "9.174"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "9.735"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.561"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019 increase of $9.735M in support of Army modernization efforts (Project H16\/Networked Sensing and Data Fusion)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H16"
                    },
                    "ProjectTitle": {
                        "val": "S3I Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "28.972"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "28.972"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0602145A Next Generation Combat Vehicle Technology Project:\n* Project BI2 Sensor Protection Technology\nPE 0602146A Network C3I Technology Projects:\n* Project AP5 Electronic Warfare Technology\n* Project AR1 Robust, Resilient and Intelligent C3I Technology\nPE 0602148A Future Vertical Lift Project:\n* Project AL8 Holistic Situational Awareness and Dec Making Tech\nPE 0602150A Air and Missile Defense Technology Project:\n* Project AD5 Next Generation Fires Radar Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs, investigates, evaluates, and characterizes advanced sensor components, signal processing, and information fusion algorithms that will provide the future Soldier decisive new capabilities to locate, identify, and make decisions about and engage battlefield targets in tactical environments.  The ultimate impact and utility of this work will be to greatly increase the lethality, range, and speed of engagement of the Soldier.  Emphasis is on solving critical Army-specific battlefield sensing and information management problems, such as false targets, complex terrain (including urban applications), movement of sensors on military vehicles, and exploitation of multimodal sensors.  Significant areas of research include low-cost networked sensors for force protection, hostile fire defeat, homeland defense, counter terrorism operations, munitions, and fusion of disparate sensors (e.g., acoustic, seismic, electric-field (E-field), magnetic field) to passively detect, classify, and track battlefield targets such as personnel, heavy\/light vehicles, and helicopters.  Other areas of research include sensing technologies for tagging, tracking, and locating (TTL) non-traditional targets and the location of direct and indirect fires and other hostile threats.  Further areas of research include ultraviolet (UV) optoelectronics for battlefield sensors, networked compact radar for vehicle and dismount identification and tracking; ultra-wideband radar for buried and concealed threat detection, enhanced robotic mobility, stand-off characterization of infrastructure, and the detection, classification, and tracking of humans in urban terrain.  Additional areas of research are aided\/automatic target recognition (ATR), advanced battlefield sensor and information processing to conduct a dynamic and real time situational assessment to present a common picture of the battle space focused on low echelon commanders; protection of sensors, especially human eyes, from battlefield laser threats; and advanced computational methods to provide automatic information technologies from widely dispersed sensor and legacy information sources for improved situational awareness. \n\nThis Project supports Army Science and Technology efforts in the Command, Control, Communications and Intelligence, Ground, and Soldier portfolios. The sensor-related work in this Project complements efforts funded in PE 0601104A (University and Industry Research Centers), PE 0602709A (Night Vision Technology), PE 0603710A (Night Vision Advanced Technology), and PE 0603001A (Warfighter Advanced Technology). The networked sensing and data fusion efforts performed in this Project complement efforts funded in PE 0601104A (University and Industry Research Centers) \/ Project H50 (Network Sciences CTA) and PE 0601104A (University and Industry Research Centers) \/ Project J15 (Network Science ITA).\n\nThe cited work is consistent with the Under Secretary of Defense, Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Non-Imaging Intelligence, Surveillance, and Reconnaissance (ISR) Sensing"
                                    },
                                    "Description": {
                                        "val": "This effort designs and characterizes technologies for multi-modal (acoustic, seismic, infrasound, electric and magnetic (E\/H) field, and passive radio frequency (RF)), low-cost networked sensors to enhance persistent sensing capabilities for increased probability of target detection and reduced false alarms. These combined sensors have unique capabilities that enable detection of electrical equipment operation, underground facilities, vehicles, weapons launch, gunfire, and explosions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.169"
                                            },
                                            "Text": {
                                                "val": "Developed robust, low-cost acoustic sensors  with 1 to 10000 Hz frequency response to detect and locate Army-relevant target signals in environments of interest; focus on sensor miniaturization and small arrays; developed novel wind noise reduction techniques that are necessary for successful particle-velocity sensor operation in complex military scenarios and on mobile platforms; developed new tools to calibrate and characterize quasi-static E\/H field sensors for long-wavelength applications, such as power-line sensing, anomaly detection, and low-frequency positioning\/navigation\/timing; developed novel detection, classification, and identification algorithms for new classes of targets; characterized and assessed technologies and sensing modalities that can detect and identify improvised explosive threats, detect their components, and mitigate their delivery platforms; and developed and integrated automated multi-modal detection, tracking, classification and decision support tools for deployment on low resource tactical platforms, ground stations and sensors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networked Sensing and Data Fusion"
                                    },
                                    "Description": {
                                        "val": "This effort will develop and assess a concept to link physical sensors and information sources to Soldiers and small units.  Specifically, the research focuses on (1) multi-modal sensor fusion for detection and classification of human activities and infrastructures such as personnel, vehicles, machinery, RF emissions, chemicals, and computers in hidden and confined spaces, (2) interoperability and networking of disparate sensors and information sources, (3) distributed information for decision-making, and (4) approaches for fusing results of processed outputs of multi-modal sensors, such as visible, infrared (IR), and hyperspectral imagers, and acoustic, magnetic, and electric field sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.252"
                                            },
                                            "Text": {
                                                "val": "Developed focused infrasonic classification methods and integrate them with long-range sound propagation models to increase classification accuracy; developed algorithms to provide automated tipping and cueing at each sensor array for incorporation into the analyst?s common operating picture; developed tools for creating and visualizing a multi-sensor 3-dimensional (3D) common operating picture for real-time data geo-registration and fusion of heterogeneous data from multiple aerial and ground-based passive and active imaging sensors for increased situational awareness; developed tools for multimodal biometrics and human activity recognition using unconstrained video; explored scene representation models for optimized, real time implementation; developed theory for inference and subjective networks that benchmark performance against other uncertain reasoning methods; developed higher level fusion of event tracking from sensor and social media data in uncertain environments via subjective logic Bayesian networks; and developed robust capability for communications, sensors and data management and information fusion for a large network of ground sensors. In support of the Artificial Intelligence (AI) Task Force at Carnegie Mellon University (CMU), developed the Automated Threat Recognition (ATR) from Mobile Cooperative and Autonomous Sensors (MCAS) system which will use a network of autonomous air and ground-based sensors, identify and geolocate threats in an area of interest, aggregate and distribute the target data, and make recommendations and predictions based on the combined threat picture.  Additional efforts were initiated at Texas A&M University to demonstrate basic collaborative situational awareness between air and ground vehicles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RF Sensing for Concealed\/Low-Signature Threat Detection"
                                    },
                                    "Description": {
                                        "val": "This effort develops the technical underpinnings of ultra-wideband (UWB) radar and other active and passive RF sensing modalities for several key Army concealed and low-signature target detection requirements, including landmine and improvised explosive device (IED) detection, sensing through-the-wall, foliage penetration, unmanned aerial system (UAS) detection, other electronic threat detection, and obstacle avoidance for autonomous navigation. This research uses a combination of advanced computational electromagnetic models and algorithms, radar measurements, active and passive RF sensing technologies, and advanced signal processing techniques to define the performance boundaries of state-of-the-art airborne and ground-based UWB radar and other RF sensing modalities for concealed and low-signature target detection and classification."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.967"
                                            },
                                            "Text": {
                                                "val": "Reduced sensor size with on-board signal processing for automated detection and tracking; investigated the benefits of cooperative RF sensing in complex environments; and assessed the processing constraints introduced by distributed sensing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Laser Protection Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort develops new materials and devices for the protection of Army sensors and eyes behind day-view optical sights from a variety of laser threats including high-power continuous wave and ultrashort (femto-second) pulsed lasers. This research utilizes a combination of technologies based on the nature of the different threats, as well as the fundamental differences in sensors operating over different frequency ranges. Passive organic and inorganic optical limiter materials that block specific frequency bands of light will be investigated and developed for the visible and short-wave infrared (SWIR) spectrum, and active man-made material-based solutions will be investigated for uncooled sensors in the long-wave IR (LWIR). Vulnerability of sensors and optical sensor systems will be studied against high-power and ultrashort pulsed laser threats to determine protection requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.054"
                                            },
                                            "Text": {
                                                "val": "Improved multi-chromophore solid-state optical limiter based on previous experimental results; investigated femtosecond limiter concepts in the mid-wave infrared; and conducted experiments to validate high power continuous wave laser protection concepts. These combined efforts will enable transmission of low light intensities, while blocking laser radiation with excessively high irradiance hence preventing sensor damage."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Mode Air Defense Radar"
                                    },
                                    "Description": {
                                        "val": "This research supports the current and future technical challenges associated with air defense radar technology. In particular, this effort will analyze current and emerging RF spoofing, RF jamming, and RF signature management technologies to determine their impact on the performance of air defense radars. Electromagnetic modeling, RF measurements, and experiments will be used to identify mitigation techniques for spoofing and jamming, and to identify useful signature management technologies. This will also include research in electronic devices, sub-assembly design, and laboratory experiments to advance the state-of-the-art of air defense radars operating in contested electronic environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.5"
                                            },
                                            "Text": {
                                                "val": "Adapted front end RF technologies for next generation fires radars."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.03"
                                            },
                                            "Text": {
                                                "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "SA1"
                    },
                    "ProjectTitle": {
                        "val": "Sensors and Electronic Initiatives (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "48.5"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "48.500"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional add"
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding provided for Sensors and Electronic Initiatives."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Advanced Space Data Exp & Integ"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "9.5"
                                        },
                                        "Text": {
                                            "val": "Advanced Space Data Exp & Integ"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Agile Manufacturing Materials Processing (CCDC)"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "14.98"
                                        },
                                        "Text": {
                                            "val": "Agile Manufacturing Materials Processing (CCDC)"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Space-Small Sat Tech Dev"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "20"
                                        },
                                        "Text": {
                                            "val": "Tactical Space-Small Sat Tech Dev"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Open Campus Initiative (CCDC)"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4"
                                        },
                                        "Text": {
                                            "val": "Open Campus Initiative (CCDC)"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun (CCDC)"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.02"
                                        },
                                        "Text": {
                                            "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun (CCDC)"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TS1"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Space Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.416"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "3.416"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0602146A Network C3I Technology Project:\n* Project AO5 Tag Track and Locate Small Satellites Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project researches, evaluates, and adapts technologies for space-based and high altitude applications for Army tactical ground forces. Applied research efforts include the design and development of sensors and electronic components for communications, signal and information processing, target acquisition, position\/navigation, and threat warning within space and high altitude environments. The applied research and technology evaluations conducted under this Project leverage other Department of Defense (DoD) space science and technology applications to support Army space force enhancement and cooperative satellite payload development.  \n\nWork in this Project complements and is fully coordinated with PE 0603006A (Command, Control, Communications Advanced Technology).\n  \nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Space and Missile Defense Command in Huntsville, AL.\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Space Research"
                                    },
                                    "Description": {
                                        "val": "This effort designs, develops, and evaluates space-based technologies, components, and tools that lead to smaller, lighter, more responsive payloads and applications. These technologies allow for the rapid integration and development of tactical payloads in support of responsive space environments. Work related to standard Army networks is done in coordination with the Communications-Electronics Research Development and Engineering Center (CERDEC) and Army Cyber Center of Excellence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.289"
                                            },
                                            "Text": {
                                                "val": "Refined tag, track and locate capabilities for ground objects of interest, advance space-based data exploitation technologies and components, space-based signal detection\/processing\/dissemination technologies, and software algorithms to enable cohesive exploitation from single or multiple small satellite platforms. Designed and refined small satellite\/payload components focused on the improvement of warfighter tag, track, and location capabilities to include planning for tasking, processing, exploitation, and dissemination."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space and Analysis Lab"
                                    },
                                    "Description": {
                                        "val": "This effort provides an in-house capability to design and conduct analytic evaluations of space and high altitude technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.127"
                                            },
                                            "Text": {
                                                "val": "Developed in-house research capabilities for small satellite\/payload and component design, development and validation for tactical spacecraft; and assessed new technologies for spacecraft components."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TS2"
                    },
                    "ProjectTitle": {
                        "val": "Robotics Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.135"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "9.135"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0602145A Next Generation Combat Vehicle Technology Project:\n* Project BF8 Artificial Intelligence & Machine Learning Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs, evaluates, and investigates autonomous technologies to enable robotics to assist military missions.  Technical efforts are focused on advancing perception for autonomous ground and air mobility, intelligent vehicle control and behaviors, human-robot interaction, robotic manipulation, and improved mobility for unmanned vehicles of scales from micro-systems through tactical combat vehicles. The Project provides the underpinning research of the Robotics Collaborative Technology Alliance (CTA), a cooperative arrangement with industry and academia to conduct a concerted, collaborative effort advancing key enabling robotic technologies required for future unmanned systems.  The Robotics CTA research is funded in PE0601104A (University and Industry Research Centers) \/ Project H09 (Robotics CTA). \n\nThis Project leverages basic research conducted under PE 0601102A (Defense Research Sciences) \/ Project T63 (Robotics Autonomy, Manipulation and Portability Rsh) and PE 0601104A (University and Industry Research Centers \/ Project H09 (Robotics CTA) and transitions knowledge and emerging technologies to PE 0603005A (Combat Vehicle and Automotive Advanced Technology) for maturation and demonstration.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering focus areas, and the Army Modernization Strategy.  The Ground Portfolio technology investments are improving logistics throughput and surge capability supporting maneuver forces (Leader-Follower technology) and allow experimentation with manned and unmanned teams to develop the advantages that inform\/protect the maneuver force.\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Robotics CTA"
                                    },
                                    "Description": {
                                        "val": "Conduct applied research to provide essential capabilities for advanced perception, intelligent control and tactical behavior, human-robot interaction, robotic manipulation, and unique mobility for unmanned systems to conduct multiple military missions for a full range of robots from man-portable to larger systems. Research focuses on new sensor and sensor processing algorithms for rapid detection and classification of objects in cluttered and unknown environments, enabling autonomous mobility and intelligent tactical behavior by future unmanned systems; implementing adaptive control strategies that will enable unmanned systems to display intelligent tactical behavior, formulation of control strategies that will facilitate use of unmanned systems in populated environments and minimize the cognitive workload on Soldier operators enabling more dexterous manipulation of objects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.207"
                                            },
                                            "Text": {
                                                "val": "Demonstrated cognitive architecture with the integrated capabilities of perception, intelligent control and tactical behavior, human-robot interaction, robotic manipulation, and unique mobility.  A limbed robot employing dynamic locomotion solely through electromotive rotary actuators was assessed with the Robotics CTA cognitive architecture for autonomous capability.  Perception and intelligence for a dynamic limbed platform was demonstrated to show its capacity for teaming in an optempo scenario.  Whole body manipulation was employed in conjunction with the cognitive architecture to demonstrate the ability to perform environment interactions autonomously in ad hoc scenarios."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Perception and Intelligent Control"
                                    },
                                    "Description": {
                                        "val": "Advance perception and intelligent control technologies required to achieve autonomous tactical behaviors, based on the environment, and other objective capabilities for future unmanned vehicles of multiple size scales and to transition this technology to advanced development programs being conducted under PE 0603005A (Combat Vehicle and Automotive Advanced Technology) \/ Project 515 (Robotic Ground Systems) for integration into test bed systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.5"
                                            },
                                            "Text": {
                                                "val": "Integrated a map-based and an ontology focused World Model to provide a more complete architecture for reasoning and understanding the environment.  Cognitive approaches to perception were implemented on robotic platforms and methods for artificial intelligence assessment were employed to ensure future unmanned systems can offer transparency in their cognitive processes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Robotic Vehicle Mobility and Propulsion Technology"
                                    },
                                    "Description": {
                                        "val": "Advance the speed and agility of unmanned vehicles in complex three-dimensional environments through exploration of advanced and unconventional mobility and propulsion technologies integrated with innovative application of perceptual and reasoning capabilities. Ground robotic platforms may have legs, may be able to climb or may even be robots restricted to small confined spaces.  Research will focus on developing actuation mechanism that intelligently achieve movement while minimizing the use of energy to ensure longer range and endurance of the system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.418"
                                            },
                                            "Text": {
                                                "val": "Explored novel mechanics and perception technology to enable robust, resilient, and self-sustaining mobility of ground vehicle platforms.  Research was conducted in embedded and inherent sensing, actuation, control of complex structural dynamics, and cognitive\/perceptual architectures.  Embedded and inherent sensing was also investigated as a technique to enable locally-controlled reflexive and intuitive behaviors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.01"
                                            },
                                            "Text": {
                                                "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}