{
    "id": "2021-Army-PB-2040-JBOOK-8f7fdbb59cb85b132b0478715b87ff02c7eb359f73f79d73e48c9151ed5a28f2-0",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603001A"
        },
        "ProgramElementTitle": {
            "val": "Warfighter Advanced Technology"
        },
        "R1LineNumber": {
            "val": "43"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "40.501"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "40.501"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year 2020 (FY20) this Program Element (PE) was realigned with continuity of effort to the following PE:\n*\t0603118A Soldier Lethality Advanced Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE provides Soldiers and Small Combat Units with the most effective personal clothing, equipment, combat rations, shelters, and logistical support items with the least weight and sustainment burden. This PE supports the maturation and demonstration of technologies associated with aerial delivery of personnel and cargo, rapid ammunition\/munitions deployability and resupply, combat rations and combat feeding equipment, combat clothing and personal equipment (including protective equipment such as personal armor, helmets, and eyewear), and expeditionary base camps with an emphasis on emerging operating environments and missions that require expeditionary maneuver. The Projects focus on the challenge of integrating clothing and individual equipment on the Soldier to effectively bridge the gap between humans, technology, and equipment design. The Projects in this PE adhere to Tri-Service Agreements on clothing, textiles, and food with coordination provided through the Cross-Service Warfighter Equipment Board, the Soldier as a System Integrated Concepts Development Team, and the Department of Defense (DoD) Combat Feeding Research and Engineering Board.\n\nWork in this PE is related to, and fully coordinated with, PE 0602786A (Warfighter Technology), PE 0602105A (Materials Technology), PE 0602618A (Ballistics Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602787A (Medical Technology), PE 0602716A (Human Factors Engineering Technology), PE 0602308A (Advanced Concepts and Simulation), PE 0603015A (Next Generation Training and Simulation Systems), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603710A (Night Vision Advanced Technology), PE 0602784A (Military Engineering Technology), PE 0603734A (Military Engineering Advanced Technology), PE 0603125A (Combating Terrorism Technology Development), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.  All FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy. \n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "41.795"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "40.501"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.294"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.294"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "242"
                    },
                    "ProjectTitle": {
                        "val": "Airdrop Equipment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.597"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.597"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned to: \nProgram Element (PE) 0603118A Soldier Lethality Advanced Technology: \n* Project BE5 Personnel & Airdrop Safety Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates equipment and innovative techniques for precision aerial delivery of cargo and personnel. Aerial delivery is a key capability for rapid force projection and global precision delivery. These efforts are designed to advance state of the art precision delivery technologies such as parachutes, guidance, navigation, and control (GNC) components and subsystems, tracking sensors, software algorithms, and safety rigging which integrate with currently equipped aircraft, unmanned aerial systems (UAS), and advanced rotary wing aircraft. These efforts provide the Warfighter with highly accurate, timely cargo\/payload delivery and resupply in all terrain and weather conditions. Precision delivery\/resupply reduces vulnerability of ground Soldiers, aircraft, and aircrew. Precision aerial delivery supports remote warfare with activities such as placement of battlefield sensors, reduction of Soldier load, and initial delivery of key expeditionary base camp assets. Demonstrated technologies transition to Product Manager (PM) Force Sustainment Systems (PM FSS), PM-Soldier Clothing and Individual Equipment (PM SCIE) as well as other Army PMs.\n\nWork in this Project is fully coordinated with PE 0602786A (Warfighter Technology) and supports Anti-Access\/Area Denial (A2\/AD) and manned-unmanned teaming (MUM-T) operational concepts by demonstrating precision aerial delivery and airdrop from non-traditional platforms.\n \nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. All FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy. \n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Airdrop\/Aerial Delivery"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates parachute materials and designs, precision guidance and navigation software and hardware, and tracking sensors and safety devices to increase the accuracy of delivering cargo to remote locations and\/or complex terrains. This effort also provides technologies that increase safety during personnel insertions into theaters of operation. This work further evolves breakthroughs from PE 0602786A (Warfighter Technology) \/ Project 283 (Airdrop Adv Tech) and is coordinated with PE 0602786A (Warfighter Technology) \/ Project VT4 (Expeditionary Mobile Base Camp Technology). This effort supports capability demonstrations for the Army Top Challenge of easing overburdened Soldiers in small units through the use of tactical aerial resupply technologies, and supporting A2\/AD and MUM-T operational concepts by demonstrating airdrop from non-traditional platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.597"
                                            },
                                            "Text": {
                                                "val": "Demonstrated precision aerial delivery software and hardware components in a GPS denied\/degraded environment as well as in Dense, Urban, Complex Terrain."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "C07"
                    },
                    "ProjectTitle": {
                        "val": "Joint Service Combat Feeding Tech Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.219"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.219"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0603118A Soldier Lethality Advanced Technology: \n* Project BE2 Joint Service Combat Feeding Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates technologies for military combat feeding systems and combat rations. Areas of emphasis include: enhanced nutrient composition to maximize cognitive and physical performance on the battlefield; cutting edge food stabilization and preservation techniques that increase the variety and quality of rations used by the Joint Services; novel ration packaging solutions to minimize degradation of combat rations during storage; field portable biosensors for food-borne pathogen detection and identification as well as predictive modeling tools to protect the Warfighter from food-borne illnesses. This Project demonstrates combat feeding equipment with reduced logistics (in component parts, weight, volume, fuel, and water) and labor requirements, while improving the quality of food service. The Project, a Department of Defense (DoD) program for which the Army has Executive Agent responsibility, provides technology development for Joint Service Combat Feeding. The DoD Combat Feeding Research and Engineering Board provides oversight for this project. Demonstrated field feeding equipment is transitioned to Product Manager Force Sustainment Systems (PM FSS), Product Manager Combat Support Equipment (PM CSE), Naval Sea Systems Command (NAVSEA)\/Naval Supply Systems Command (NAVSUP), and\/or United States Air Force Basic Expeditionary Airfield Resources (BEAR) Program Office. Demonstrated ration technologies are transitioned to the Combat Feeding Directorate for Advanced Component Development & Prototypes under PE 0603747A (Soldier Support and Survivability).\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy. \n\nWork in this Project complements and is fully coordinated with PE 0602787A (Medical Technology) and PE 0602786A (Warfighter Technology).\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Service Combat Feeding Technical Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates novel nutritional biochemistry, food processing, and packaging technologies to enhance nutrition, improve food stabilization, and optimize ration packaging to support Warfighter physical and cognitive performance on the battlefield. This effort will demonstrate technologies in support of the Defense Health Agency Veterinary Services (DHA VS) to improve field detection and identification capabilities of chemical and biological threats in foods. This effort provides new threat detection tools and sensors for food inspectors. This effort also demonstrates equipment and energy technologies to expand the capability and reduce the logistics footprint of field feeding systems. This work further evolves breakthroughs from PE 0602786A (Warfighter Technology) \/ Project H99 (Joint Service Combat Feeding Technology) and is coordinated with PE 0602787A (Medical Technology) \/ Project 869 (Warfighter Health Prot & Perf Stnds)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.219"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated ration components to improve readiness, performance and recovery from strenuous exercise to prevent energy deficits that negatively impact mission outcomes; validated food pathogen enrichment methods to identify food pathogens prior to consumption; demonstrated prototype refrigeration technologies to reduce the use of conventional refrigerants."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FF6"
                    },
                    "ProjectTitle": {
                        "val": "Individual Protection"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.175"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "11.175"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0603118A Soldier Lethality Advanced Technology:\n* Project AY9 Body Armor & Integrated Headborne Advanced Tech\n* Project AZ6 Soldier Signature Management Advanced Technology\n* Project AZ8 Soldier Squad Small Arms Armaments Adv Tech\n* Project BB3 Dismounted Soldier Survivability Equip\/Tech Integ"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures, demonstrates, and integrates Soldier protective clothing and equipment required to enhance Soldier survivability from multiple battlefield threats, impact unit readiness, and potentially debilitate Soldiers. Threats are characterized as combat threats (e.g. flame and thermal, blast and ballistic, multispectral sensors, and laser threats), environmental threats (e.g. cold, heat, wet, vector, water contamination, concealment, antimicrobial, etc.), and Soldier system components and system limitations (e.g. size, weight, and bulk). This effort includes the demonstration and validation of integrated technologies, novel subsystems\/systems, and test methods related to the development of personnel armor, helmets, hearing protection, eyewear, uniforms, hand-wear, footwear, and other clothing and individual equipment items. Efforts apply human systems integration principles and practices to protective equipment designs to advance the understanding of trade-offs between protection, lethality and mobility.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. All FY20 realignments to this Project are due to financial restructuring in support of Army Modernization Priorities. \n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier\/Small Unit Multi-Threat Protection"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on maturing and demonstrating multifunctional protective component materials, sub-systems, protection technologies, and test methodologies that have the potential to significantly increase protection afforded by Soldier clothing and individual protective equipment. This effort also focuses on the maturation and demonstration of ballistic, blast, and integrated protection technologies that support tradeoff optimization in component design. Work includes small arms and fragmentation protection, flame and thermal, environmental, and multispectral concealment capabilities as well as novel hydration and water purification technologies for the individual Soldier. This work is fully coordinated with PE 0602786A (Warfighter Technology) \/ Project H98 (Clothing & Equipm Tech), PE 0602716A (Human Factors Engineering Technology) \/ Project H70 (Human Fact Eng Sys Dev), and PE 0602705A (Electronics and Electronic Devices) \/ Project H94 (Elec & Electronic Dev). Demonstrated technologies transition to various Program Executive Office (PEO) Soldier Product Managers. This effort supports Force Protection capability demonstrations for Soldiers and Small Units."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.775"
                                            },
                                            "Text": {
                                                "val": "Demonstrated an optimized material solution specifically designed to maximize Soldier protection in austere and extreme cold environments to enable Soldiers to operate effectively for extended mission durations and reduce traumatic injury induced by extreme cold climates; optimized materiel solutions for thermal signature management that reduces the probability of Soldier detection in response to the increase of sensors and Soldier-borne technologies; optimized and demonstrated performance of advanced textile printing capabilities at the component level that can impart multiple functionalities (signature management, vector protection, flame resistance, etc.) in a single, more cost-effective process and more durable capability; advanced insect vector repellent testing capabilities in order to assess vector protection material performance at the system level quantify operational effectiveness to mitigate transmission of infectious diseases; developed novel scientific-based test methods to correlate material, system and Soldier performance to inform future requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Ballistic and Blast Protection"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on maturing and demonstrating ballistic and blast personal protection capabilities worn by the individual Soldier and validating advanced test methods of personal protective equipment against small arms, fragmentation and blast threats. These developmental efforts focus on the objective of significantly increase the survivability afforded by Soldier individual protective equipment by increasing sub-system and system material performance against intended threats, reduce sub-system and system weight and inform future requirements linking threat lethality to Soldier survivability. This work is fully coordinated with PE 0602786A (Warfighter Technology) \/ Project H98 (Clothing & Equipm Tech), PE 0602716A (Human Factors Engineering Technology) \/ Project H70 (Human Fact Eng Sys Dev), and PE 0602705A (Electronics and Electronic Devices) \/ Project H94 (Elec & Electronic Dev). Demonstrated technologies transition to various PEO Soldier Product Managers. This effort supports Force Protection capability demonstrations for Soldiers and Small Units."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.4"
                                            },
                                            "Text": {
                                                "val": "Optimized and matured helmet forming processes, material layups, and architectures to manufacture helmets with state of the art, high performance polyethylene materials to demonstrate ballistic performance improvements in prototype helmets designed for small arms threats; exploited ballistic fiber, tape and sheet goods materials in helmet processing techniques to control material layup to reduce inefficiencies in standard processing and exploit gains in ballistic protection and weight reduction; continued the development of an innovative ballistic helmet test methodology to improve behind-helmet blunt trauma measurement capabilities and correlate data with head\/brain injury to inform future survivability requirements for protective helmets; developed helmet and torso non-destructive safety evaluation technology to produce a capability that will assess personal protective equipment efficacy; optimized and matured head-borne shock tube test methodology as a means to improve blast-over pressure profiles that can be correlated to operational blast environment conditions; integrated hearing protection into eyewear platforms to enhance individual Soldier hearing protection and maximize operational situational awareness in head-borne protection platforms; exploited existing and emerging ballistic resistant materials in new system designs and architectures against emerging small arms threats to define near term performance trade space."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J50"
                    },
                    "ProjectTitle": {
                        "val": "Future Warrior Technology Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "21.34"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "21.340"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to: \nProgram Element (PE) 0603118A Soldier Lethality Advanced Technology:\n* Project BB6 Physical Augmentation: Adv Tech for Field Demo\n* Project BB8 Soldier Centric Advanced Technology \n* Project BC1 Human Performance Adv Tech for Mobility & Lethality\n* Project BD7 Soldier Sys Interfaces\/Integration-Sensor Adv Tech\n* Project BD9 Soldier & Sm Unit Tactical Energy Adv Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures, demonstrates, and integrates lightweight and multifunctional materials and components to provide the Soldier and small units with the most effective protection and mobility systems. This Project also invests in understanding the trade-offs of integrating state-of-the-art technology with Soldiers' personal protection, electronics connectivity, power and energy, user interfaces and display content, and other mission specific equipment that seeks to reduce physical weight, cognitive burden, and sustainment needs of the small unit. This Project develops, matures, and maintains a Soldier Systems Engineering Architecture (SSEA) framework that represents human factors consideration in development of major Army platforms. Efforts in this Project focus on integrating and demonstrating system- level personal protection, durable Soldier protective clothing and individual equipment, environmental threats, and power management solutions. In addition, special focus is on understanding and demonstrating the impacts of physical and cognitive load on Soldier mission performance by implementing strategies to reduce load and\/ or optimize loads to reduce injuries, and the creation of user interfaces that mitigate the impact of increasing technologies and sensors worn and carried by Soldiers. These efforts integrate geographically dispersed laboratory environments to conduct comprehensive assessments and report the technical viability of Soldier system solutions and conducts field demonstrations to obtain relevant feedback for user acceptance and performance validation. This Project also matures and demonstrates mission command and power and energy technologies for the dismounted Soldier and small unit operating in a networked operating environment.\n\nEfforts in this Project support the Under Secretary of Defense for Research and Engineering Science and Technology (S&T) priorities and the Army Modernization Strategy. All FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy. \n\nWork in this Project complements and is fully coordinated with Program Element (PE) 0602786A (Warfighter Technology), PE 0602618A (Ballistics Technology), PE 0602105A (Materials Technology), PE 0602787A (Medical Technology), PE 0602716A (Human Factors Engineering Technology), PE 0602308A (Advanced Concepts and Simulation), PE 0603015A (Next Generation Training and Simulation Systems), PE 0602705A (Electronics and Electronic Devices), PE 0603710A (Night Vision Advanced Technology), PE 0602624A (Weapons and Munitions Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), and PE 0603004A (Weapons and Munitions Advanced Technology).\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier and Small Unit Mission Command\/Situational Awareness (SA) and Power and Energy Integration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates mission command and power and energy technologies for the dismounted Soldier and small unit. The goal is to fully support the situational awareness mission information tools and power needs of a dismounted mission in an electronically equipped battlefield. This effort is fully coordinated with PE 0602705A (Electronics and Electronic Devices) \/ Projects H11 (Tactical And Component Power Technology) and H94 (Elec & Electronic Dev), and PE 0603710A (Night Vision Advanced Technology) \/ Project K70 (Night Vision Adv Tech)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.462"
                                            },
                                            "Text": {
                                                "val": "Matured Soldier wearable power sources and energy harvesting components to reduce the overall weight of Soldier carried power equipment; characterized the power profile of Soldier-worn electronic component technologies within a Soldier system level configuration and against approved mission scenarios; demonstrated advanced Global Positioning System (GPS) denied navigation and environmental sensing algorithms for Soldier borne sensor platforms; matured and demonstrated highly mobile expeditionary maneuver platform technology that includes signature management\/decoy and high mobility mission command applications that enable on-demand resupply capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Interfaces"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates low-cognitive workload user interfaces for display and control of dismounted Soldier mission command systems to enhance interactions of Soldiers and systems required to react effectively on the battlefield. Applies human systems engineering principles to develop design guidelines and techniques for integrating Soldiers and complex technical systems by assessing Soldier responses and capabilities in operational contexts. Matures and validates human performance metrics to design\/assess systems and user interfaces to ensure that interactions between humans and machines provides effective operation and control to aid Soldier decision-making processes. Technologies, metrics, and tools developed in this effort will transition to PEO Product Managers and Training and Doctrine Command (TRADOC) and be integrated into the SSEA and Systems Integration Laboratory environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.68"
                                            },
                                            "Text": {
                                                "val": "Validated single joint (ankle) exoskeleton for reduced metabolic cost and demonstrate operational efficacy for utilization in loaded walking\/running; matured single and\/or multi-joint exo systems for enhanced mobility and endurance; matured exoskeleton technologies for Soldier tasks such as Logistics (e.g. low mobility lift assist technology) and Infantry (high mobility tactical maneuvering for dismount application); demonstrated Soldier\/squad optimization utilizing novel technologies\/platforms with validated measures\/metrics of human performance by demonstrating the operational impact of decreasing metabolic cost with a device that assists propulsion during locomotion while carrying an external load; provided knowledge product with findings from study that examined tactical timelines for measures of human and operational performance at the small unit level to inform future system development aimed at optimizing Soldier performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Sensors and Robotics Architectures"
                                    },
                                    "Description": {
                                        "val": "This effort builds and matures architectures that link dismounted Soldiers to air and ground robotics platforms. Enables small Soldiers-borne and operated autonomous systems that function as scouts, load carriers, resupply platforms, and\/or communication nodes to enable greater reach and expeditionary dismounted maneuver. Applies complex Human Soldier Integration principles to air and ground control and teleoperation for emerging robotic vehicles and sensors display content. Integrates reconnaissance and surveillance sensors and robotics with Nett Warrior system. Technologies, metrics, and tools developed in this effort will transition to PEO Product Managers and TRADOC and be integrated into the Soldier Systems architecture and Systems Integration Laboratory environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.182"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated sensors and robotics architectures that enable dismounted linkages and ease of integration for existing and emerging ground and aerial robots; matured Soldier-organic data management and distribution technologies for integration into Soldier-borne electronic devices, sensors, and robotics; developed an integration architecture of sensors and robotics for the Nett Warrior system to increase situational awareness and stand-off protection; identified common sensors that convey alerts and summary data within a sensor configuration that synthesizes data from multiple sensors; increase image and sensing product quality and timeliness from small unit sensors and robotic platforms; identified commercial virtual environment software to assess Nett Warrior and sensor and robotic interfaces in a dynamic mission context."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.016"
                                            },
                                            "Text": {
                                                "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J52"
                    },
                    "ProjectTitle": {
                        "val": "WARFIGHTER ADVANCED TECHNOLOGY INITIATIVES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.5"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.500"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Warfighter Advanced Technology development."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Non-Centroidal Helmets"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "2.5"
                                        },
                                        "Text": {
                                            "val": "Non-Centroidal Helmets"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "XW6"
                    },
                    "ProjectTitle": {
                        "val": "Small Unit Expeditionary Maneuver"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.67"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.670"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0603118A Soldier Lethality Advanced Technology:\n* Project BE5 Personnel & Airdrop Safety Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project funds the maturation, validation and demonstration of innovative technologies which provide maneuver capabilities such as precision aerial delivery of cargo and personnel and expeditionary maneuver platforms to enable and enhance mission command and human performance in response to emerging operational environments that require expeditionary logistics for aggregated and disaggregated Soldiers and units. Technologies that allow dismounted units to move to positions of advantage rapidly, and then to operate for hours, days, weeks without resupply while sustaining a high tempo for periods of up to seven days. Efforts funded in this Project support all Military Services, the Special Operations Command, and the Defense Logistics Agency. Demonstrated technologies transition to a variety of partners, including Product Manager Force Sustainment Systems (PdM-FSS), Product Manager Combat Support Equipment (PM CSE), and\/or Naval Sea Systems Command (NAVSEA)\/Naval Supply Systems Command (NAVSUP). \n \nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. All FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy. \n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Small Unit Expeditionary Maneuver"
                                    },
                                    "Description": {
                                        "val": "This effort optimizes technologies that enable Soldier and Small Unit survivability, mission readiness and effectiveness during highly mobile, dispersed operations that may occur in the absence of conventional logistics support. This effort matures and demonstrates technologies that enhance equipment, materiel, and personnel aerial delivery in an Anti-Access\/Area Denial (A2\/AD) environment; stabilization techniques and nutrient compositions to maximize the Warfighter?s physical and cognitive performance; and technologies to enhance field detection and identification capabilities of chemical and biological threats in foods."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.67"
                                            },
                                            "Text": {
                                                "val": "Demonstrated and supported the transition of advanced personnel airdrop safety technologies and cargo airdrop from non-traditional platforms in support of interoperability with manned-unmanned teaming (MUM-T) assets."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}