{
    "id": "2021-Navy-PB-1319-MJBOOK-0-0-744c7ee94c2cc798fbfd935e35baade9caa8a86b67e6f22ecedd75220314848f-6",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602235N"
        },
        "ProgramElementTitle": {
            "val": "Common Picture Applied Research"
        },
        "R1LineNumber": {
            "val": "7"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "40.559"
            },
            "CurrentYear": {
                "val": "42.846"
            },
            "BudgetYearOne": {
                "val": "48.001"
            },
            "BudgetYearOneBase": {
                "val": "48.001"
            },
            "BudgetYearTwo": {
                "val": "50.698"
            },
            "BudgetYearThree": {
                "val": "52.435"
            },
            "BudgetYearFour": {
                "val": "55.167"
            },
            "BudgetYearFive": {
                "val": "56.271"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Activities and efforts in this program examine concepts and technologies that enable the transformation to Distributed Maritime Operations (DMO). Network centric capabilities rely on information to connect assets and provide timely and accurate understanding of the environment. The mission area requirements for rapid, accurate decision-making; dynamic, efficient, mission- focused communications and networks; and pervasive and persistent sensing drive network centric S&T investments.  \n\nToday's Sailors and Marines are enabled by Naval Science and Technology (S&T). Since 1946, the Office of Naval Research (ONR) has fostered scientific research related to the maintenance of maritime superiority and national defense. ONR manages the Department of the Navy's (DON) portfolio of naval Basic and Applied research, and Advanced Technology Development investments to ensure naval forces can effectively deter conflict, but when called upon, fight, win and come home safe. Current investments hedge against uncertainty, providing solutions to commanders today, and options for the future. The Naval S&T budget supports higher guidance defined by the National Defense Strategy, and responds to requirements identified by the Secretary of the Navy through research priorities set by the Chief of Naval Research, coordinated across the Naval Research Enterprise (NRE), and outlined in the Naval R&D Framework. \n\nThis Program Element (PE) funds Applied Research, which is the systematic study to understand the means to meet a recognized and specific need. Most of the work in this PE can be classified between Technology Readiness Level (TRL) 2 (technology concept and\/or application formulation) and TRL 4 (component and\/or breadboard validation in laboratory environments).\n\nDue to the number of efforts in this Program Element (PE), the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "36.348"
                },
                "CurrentYear": {
                    "val": "49.297"
                },
                "BudgetYearOne": {
                    "val": "49.431"
                },
                "BudgetYearOneBase": {
                    "val": "49.431"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "40.559"
                },
                "CurrentYear": {
                    "val": "42.846"
                },
                "BudgetYearOne": {
                    "val": "48.001"
                },
                "BudgetYearOneBase": {
                    "val": "48.001"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "4.211"
                },
                "CurrentYear": {
                    "val": "-6.451"
                },
                "BudgetYearOne": {
                    "val": "-1.430"
                },
                "BudgetYearOneBase": {
                    "val": "-1.430"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-6.451"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "4.808"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.597"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.430"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.430"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: The program decrease in FY21 of $1.430 million is from reduced investment in the areas of Cyber Superiority and Information Superiority as part of the annual reassessment and adjustment of the ONR Science and Technology portfolio."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Common Picture Applied Research"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "40.559"
                        },
                        "CurrentYear": {
                            "val": "42.846"
                        },
                        "BudgetYearOne": {
                            "val": "48.001"
                        },
                        "BudgetYearOneBase": {
                            "val": "48.001"
                        },
                        "BudgetYearTwo": {
                            "val": "50.698"
                        },
                        "BudgetYearThree": {
                            "val": "52.435"
                        },
                        "BudgetYearFour": {
                            "val": "55.167"
                        },
                        "BudgetYearFive": {
                            "val": "56.271"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Activities and efforts in this program examine concepts and technologies that enable the transformation to network centric warfare. Network centric capabilities rely on information to connect assets and provide timely and accurate understanding of the environment. The mission area requirements for rapid, accurate decision-making; dynamic, efficient, mission-focused communications and networks; and pervasive and persistent sensing drive network centric Science and Technology S&T investments.\n\nThe activities described in this Program Element (PE) address future Navy and Marine Corps capabilities needed to maintain maritime superiority and ensure national security. They are based on input from Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, OPNAV and Headquarters Marine Corps) and are designed to exploit breakthroughs in science and technology in order to deliver maximum warfighting benefit to our sailors and marines. These efforts are aligned with shared priorities throughout the whole of RDT&E in order to quickly advance new capabilities from discovery to deployment across the warfighting domains."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Communication and Networks"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop high throughput dynamic wireless communications and network technologies critical to the mission performance and robustness of naval communications for widely dispersed, mobile air, land, surface and submerged platforms. These platforms are often Size, Weight and Power (SWaP) limited, and will operate under constraints of cluttered Radio Frequency (RF) spectrum, harsh Electro-Magnetic Interference (EMI) and Beyond Line Of Sight (BLOS) conditions. The technical payoff is increased network data rates, interoperability across heterogeneous radios, dynamic bandwidth management, and greater mobile network connectivity. The operational payoff is that warfighters from the operational command to the tactical edge have near real-time access to information, knowledge and decision-making necessary to perform their tasks, including coalition and allied forces. Emphasis is on tactical edge communications and networks to fully realize net-centric warfare, bridging the Global Information Grid (GIG) and the 'disadvantaged user', e.g., small-deck combatants, submarines, unmanned vehicles, distributed sensors and ground units in urban and RF challenged environments.  \n\nThe current specific objectives are:\n\nRadios and Apertures:\n- Develop technologies for high band radio, electrically-small and actively scanned antennas, addressing critical issue of radio spectrum bandwidth efficiency, spectrum contention and clutter, agile frequency communications with dynamic spectrum access, all-digital front-end with wide dynamic range, power amplifier efficiency, multipath effects, saltwater propagation and Beyond Line Of Sight (BLOS) communications. \n- Develop algorithms and signal processing for space-time-frequency diversity communications, including measures for electronic protection, such as low-intercept, antijam waveforms and modulation.\n- Develop affordable antenna technologies for small size and weight, high radiation efficiency, and wideband operation with rapid beam-steering.\n- Develop alternatives to Radio Frequency (RF) communications in airborne and terrestrial environments as well as high data rate underwater communications for undersea warfare (distributed sensor netting, unmanned underwater vehicle data exfiltration, submarine Communications at Speed and Depth) using Electro-Optic\/Infra-Red (EO\/IR) technologies.\n- Develop secure, high bandwidth communications systems and the exploitation of existing and emerging network protocols that will avail development of new, Low Earth Orbit (LEO) based data transport mechanisms.\n\nTactical Networking and Network Control\/Management: \n- Develop advanced networking techniques for robust, highly dynamic environments; interoperable networks for secure communications and protocols, bandwidth and network management techniques that manage and allocate bandwidth across tactical and theater levels in support of net-centric operations.\n- Develop rapidly auto-configuring and self-organizing networks with efficient and survivable routing, secure authentication, mobility management and Quality-of-Service guarantee, while optimizing network resources.\n- Address low bandwidth, synchronization and reliability for Service Oriented Architecture (SOA)\/Middleware Architecture in both Mobile Ad-hoc Networks (MANET) and infrastructure-based Internet Protocol (IP) backbone networks. \n- Develop cognitive network planning and operations engines whose criteria are based directly on mission objectives, while self-adapting and managing the spectrum allocation and radio resources in such a way that network operations, SOA community of interest, and computer network defense are integrated to form a single common tactical network picture that requires a minimum of human intervention and skill."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.224"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.223"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Communications and Networks: Continue ongoing research and related thrusts in antenna technology to include electrically small antennas, wideband multifunction antennas, compatibility of phased array antennas with naval platforms and marine environments, directional beam forming\/steering techniques, and special-purpose submarine communication antenna systems; radio communications to include anti-jam and low-probability-of-intercept techniques, Satellite communications (SATCOM) performance enhancements, interference mitigation, adaptive equalization, bandwidth efficient modulation, cognitive radio for dynamic spectrum management, and high data rate tactical communications techniques including communications at speed and depth (for submarines); and wireless networks to include mobile ad-hoc wireless networking algorithms\/protocols, end-to-end Quality-of-Service, joint\/coalition interoperability, service oriented tactical networking, mission-based policy and network controls and management.\n\nInitiate new efforts and research supporting the development of a transmission signal waveform that is less detectable, but operates with higher capacity for a given range, than existing waveforms.\n\nInformation Technology:  Continue work to provide secure, resilient, effective network-centric and information warfare capability for the Navy\/Marine Corps by addressing deficiencies and science gaps in tactical networks. These capabilities address unique military environment and application challenges enabling new mission concepts requiring minimal human intervention. Current work and near-term plans focus on three specific objectives: dynamic network structural analytics and adaptation; robust network organization and transport, distributed group collaboration and discovery; and adaptive signaling and sensing to improve military wireless communications. Current research projects will deliver technology for high assurance Field-Programmable Gate Array (FPGA) application design, technology for increasing the performance of low powered networks by using compressed sensing technology, and technology to improve the design of distributed and cooperative Intelligence, Surveillance and Reconnaissance (ISR), Integrated Cyber and Electronic Warfare (ICE) operations in denied and contested Electromagnetic environments.\nDevelop a transmission signal waveform that is less detectable, but operates with higher capacity for a given range, than existing waveforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.158"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.158"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Communication and Networks:\n-Complete research on communications payloads for small satellites.\n-Complete research on software-defined networking techniques for tactical operations.\n-Continue research on communications with low probability of detection.\n-Continue research on novel path computation algorithms and autonomous distributed network control.\n-Initiate research on efficient approaches for wideband, multi-beam, high-power communications.\n-Initiate research on optical beam distortion and phase front corrections with machine learning and neural networks.\n-Initiate research on quantum techniques for secure underwater magnetic and optical communications systems.\n-Initiate research on artificial intelligence approaches to establish network policies based on Commander Intent."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2020 to FY 2021 is due to completion of research on communications payloads for small satellites and software-defined networking techniques for tactical operations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Applied Information Sciences for Decision Making"
                                    },
                                    "Description": {
                                        "val": "The goal of this activity is to develop enablers for decision making and mission execution in order to achieve battlespace superiority. It focuses on the development of algorithms and software technologies that identify and integrate informational content from multiple sources, leading to decision aids that support user-cognitive processes. Because persistent sensors are generating massive amounts of data, the focus is on technologies that not only integrate information from diverse sources, but also provide indications of information significance in ways that support the user's decision needs, regardless of location and operational situation. To achieve this, it must be possible to automate understanding of the battlespace by identifying objects, determining relationships among the objects, recognizing activities, assessing intent, and automatically generating courses of action with associated risks and uncertainty. Effort will also be devoted to developing technology for increasing assurance and security for Consultation, Command and Control (C3) information systems and technology for improving information discovery and information presentation in such systems. The Nano Electronics Technology activity is focused on developing ultra-low power, higher performance computing devices and components that are based on novel functionalities of nanometer scale materials and are enabled by improved understanding of nanomaterials, new devices and circuit design concepts, as well as new architectures uniquely suited for nanoscale systems. Applied research in artificial intelligence focuses on the unique challenges of the Naval domain by providing intelligent decision aids while operating in the complex spatio-temporal environments of distributed Naval forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.663"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "28.885"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Quantum Information Sciences: Conduct research of Quantum Key Distribution (QKD) protocols and implementations for the purpose of understanding the security implications for QKD in the maritime environment, the development of protocols that simultaneously minimize leakage of information to the environment and the creation of secure networks, as well as schemes to maximize the information carried by a continuous or discrete variable. Conduct research into interconversion of optical and mechanical quantum states for memory and potential processing tasks.\n\nComputational Methods for Decision Making: Conduct research of Information Integration, Automated Image Understanding, and Resource Optimization for the purpose of developing innovative methods for combining traditional and non-traditional data from sensors and disparate sources to provide the best estimate of objects, events, and conditions in the battlespace, in terms of their identity, associated error or uncertainty, context, impact, while inferring relationships and their intentions; developing automated, image and signal intelligence understanding tools based on rigorous mathematical and statistical methods that lead to improved change detection, improve object and activity detection and recognition capabilities, context and scene understanding, and inferring of the threat levels to support decision making and persistent and adaptive surveillance; and developing automated decision-support tools based on mathematically rigorous techniques (e.g., mathematical optimization) that support decision-making to ensure the best use of scarce and\/or expensive resources, achieving optimal allocations for large complex scenarios, including ones that contain uncertainty, in drastically reduced amounts of time. Develop methods that support decision making in networked sensor management and allocation to ensure sensor assets are deployed in an optimal, or near optimal, manner. The amount of data that the decision makers are facing today is much larger than any time before in human history. In addition, the data is much more complex, heterogeneous and fast changing. Analysis of such large and complex datasets is beyond the cognitive abilities of any single decision maker. The aim of this thrust is to develop new methods for extraction and analysis of relevant information from large-scale datasets, and to develop new tools for distributed information sharing and decision-making. To achieve this aim, it is required to advance fundamental understanding of networks (such as social and organizational networks), and to integrate rigorous methods from mathematical and computational sciences with methods from social sciences. Imitate new research to study the interplay of three phenomena, heterogeneous and dynamically generated input data from various sources, online decisions, and online learning. Develop methods for integrating massive amounts of diverse data, and present useful information to a tactical commander for planning. Develop new ways to extract and understand human\/content interactions to build an algorithm of personalized learning actions for learning and training purposes.\n\nNanoscale Electronics Technology: Conduct research in novel nanometer scale (feature size near or below 10nm) logic\/memory devices and related circuits and architectures to deliver ultra-low power, light weight and high performance computational capability for autonomous vehicles and individual warfighters. Initiate exploration of ultra-low power computing applications utilizing mixed signal neuromorphic chips.\n\nCyber Defense: Conduct research in cyber systems, leveraging results from basic research program, developing and evaluating technical approaches for future naval capabilities. The program investigates technologies for enhancing efficiency, robustness and cyber resiliency for all classes of computing systems in naval enterprise systems as well as Navy's real-time safety critical cyber physical systems. Continue efforts to matures technologies and continue work to introduce new capabilities into many cyber security areas, such as automated cryptographic design exploration, cyber decoys and disinformation, automated Commercial Off-The- Shelf (COTS) cyber attack surface reduction, intrinsic cyber attack resilient industrial control systems, and many more. Addressing the root cause of cyber vulnerability and reducing reliance to operator is one of the main theme of the program.\n\nData Analytics: Conduct research in new approaches to support tactical decision making and assured networked command and control. This is performed by producing distributed situation assessment of a commander's environment through development of a common tactical picture; developing collaborative, distributed mission plans; monitoring and dynamically replanning mission execution as required; understanding their environment by being able to access distributed heterogeneous enterprise information stores intelligently through use of autonomic software; effectively using sensor information and making resource allocation decisions and information operations. Specific research involves real-time computing, decision aids and collaborative workspaces; secure distributed architectures; and information warfare methods to protect secure information. Initiate new research efforts supporting the development of a set of Assured Command and Control (AC2) applications that can operate in challenging communications environments.\n\nElectromagnetic Warfare:  Continue efforts to research and develop technologies for advancing the state-of-the-art in being able to uniquely identify target of interest in very complex environments using passive technologies to assure high confidence to the decision maker when combined with other information sources. This is being accomplished by expanding specific emitter identification technologies into areas detecting previously unaddressed and unexplored to maintain battlespace superiority.\n\nInformation Technology: Objective is to improve the operational capability and security of Naval decision support systems and decrease the cost of these systems through transformative advances in information management that enables agility and timely, accurate decision making. The military capability from this task area is technology to support improved situational awareness and operational effectiveness, improved techniques for dealing with information-intensive applications, and information management processes that improve the speed and accuracy of decisions and actions. \n\nNew research projects will deliver technology for Deep Learning networks that can explain their decisions, improved hydraulic efficiency for meso-scale robotic systems, and adaptive memory for long duration autonomous systems. \n\nApplied research on artificial intelligence in support of: Collaborative complex decision-making; Developing artificial intelligence technologies that actively inform and assist different stages of the decision making process; Developing interfaces and dialogue systems for human-machine teaming; Developing agile intelligent cognitive electronic warfare algorithms and architectures; Integrating artificial intelligence with robotic systems for human-machine collaboration and robot training; and Predictive maintenance (digital twin) for Naval platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "34.384"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "34.384"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Quantum Information Sciences:\n- Complete research of Quantum Key Distribution (QKD) protocols and implementations for the purpose of understanding\nthe security implications for QKD in the maritime environment, the development of protocols that simultaneously minimize\nleakage of information to the environment and the creation of secure networks, as well as schemes to maximize the\ninformation carried by a continuous or discrete variable.\n- Continue quantum communication research as it applies to practical approaches to secure key generation that include\ntechnologically limited eavesdropper assumptions.\n- Continue research into interconversion of optical and mechanical quantum states for memory and potential processing\ntasks.\n- Initiate research into the application of on-chip optical processing with quantum states of light for suppressing noise for measurement and communication devices.\n\nComputational Methods for Decision Making: \n- Complete methods for camera array-based imaging for recognition of objects occluders such as trees and shrubs.\n- Complete methods for learning patterns of activity in relatively limited spaces (e.g., street intersections, building entrances) from long-duration surveillance imagery.\n- Complete methods for agent-based models for identification of inefficiencies in decision-making in large organizational networks.\n- Complete agent-based modeling of collective humane performance.\n- Complete application of mathematical methods, development of mathematical tools, and construction of computer software for solving specific resource allocation problems. \n- Continue methods for robust recognition of activities in surveillance videos based on the integration of plan recognition and short-duration action recognition.\n- Continue methods for recognition of activities in urban and semi-urban areas from surveillance video based on weakly supervised deep learning techniques.\n- Continue methods based on probabilistic (and-or) graphs for modeling events and activities toward automated understanding of data acquired by Naval information systems.\n- Continue methods based on computer vision, deep learning, and reasoning for detection, tracking, and reacquisition of small vessels in (intermittent) aerial surveillance imagery for interdiction of sea-borne smuggling.\n- Continue development of methods for large-scale coordination and aggregation of individual preferences.\n- Continue development of methods for adaptive training on individual and group levels.\n- Continue development of methods for large-scale assessment and evaluation of distributed information.\n- Continue development of methods for continuous learning and expertise assessment.\n- Continue development of mathematical models, theory, and solution methods for most effectively allocating scarce resources (funds, information, personnel, equipment) within competitive environments.\n- Initiate development of methods for Unmanned Aerial Vehicle (UAV)-based video surveillance along roads and rivers that are partially occluded by tree canopies using a marsupial system consisting of a large UAV capable of long-duration flight and several small quadcopters.\n- Initiate analysis of information flow and dynamics of influence in large networks.\n- Initiate development of tools for structured and distributed deliberation and decision-making.\n- Initiate development of secure and privacy-preserving tools for information sharing.\n- Initiate development of visual sense making capabilities for distributed Navy teams to successfully run operations in increasingly contested, diverse, multi-expertise, and highly data driven decisional contexts.\n- Initiate a research emphasis on defender-attacker-defender problems that seek strategies for obtaining resilient operational systems under the threat of attack.\n\nNanoscale Electronics Technology: \n- Continue research on Two-Dimensional (2D) materials and related device and circuit functions. Specifically, the program will push the limit of 2D semiconductor transistors through van der Waals integration, explore surface and interface engineering of 2D heterostructures, devise and test devices and circuits with graded 2D materials, and also explore flexible wearable electronic system by exploiting large scale graphene and other 2D materials.  \n\nCyber Defense: \n- Complete initial research and development on security and resilience for cyber physical systems and automated Commercial Off-The- Shelf (COTS) cyber attack surface reduction.\n- Continue to conduct research in cyber systems, leveraging results from basic research program, developing and evaluating technical approaches for future naval capabilities. The program investigates technologies for enhancing efficiency, robustness and cyber resiliency for all classes of computing systems in naval enterprise systems.\n- Continue efforts to mature technologies and continue work to introduce new capabilities into many cyber security areas, such as automated cryptographic design exploration, cyber decoys and disinformation, and many more. \n- Addressing the root cause of cyber vulnerability and reducing reliance to operator is one of the main themes of the program.\n\nData Analytics: \n- Finalize research into new approaches to support tactical decision making and assured networked command and control. \n- Finalize the development of resilient networking capabilities that are designed to operate in challenging communications environments during wartime employment applying Machine learning to automate routing decisions in low bandwidth environments. \n- Finalize refinement of Assured Command and Control (AC2) applications with the addition of artificial intelligence to operate in challenging wartime networked environments to enable production of distributed situation assessment of a commander's environment through development of a common tactical picture that:\n   1. develops collaborative, distributed mission plans; monitoring and dynamically re-planning mission execution as required; understanding their environment by being able to access distributed heterogeneous enterprise information stores intelligently.\n   2. effectively uses sensor information and makes resource allocation decisions and information operations during wartime. \n- Finalize specific research involving real-time adaptable networking, computing, decision aids and collaborative workspaces; secure distributed architectures; and information warfare methods to protect secure information. \n- Conduct a proof of concept in a FY21:  Fleet Exercise and Red-Cell event to enable smooth technology transition to Programs Of Record (POR) and rapid Fleet employment.\n\nScience of Artificial Intelligence:\n- Further develop principled computational frameworks for integrating domain knowledge and machine learning for fast robust learning of diverse, complex concepts and tasks with light supervision. Domain knowledge includes physical models, as well as rules, relations and semantic descriptions. \n- Create a unified framework for perception and planning for resources distributed across multiple platforms (agents, platforms, autonomous systems or vehicle swarms) to exploit the massive, diverse data obtained, while subject to communication limitations. \n- Explore new brain-inspired artificial intelligence algorithms and architectures that provide richer computational capabilities than current deep learning networks and to model compact neuromorphic hardware suitable for edge computing and signal processing in Naval platforms."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increases from FY 2020 to FY 2021 reflects the increased emphasis and investment in Artificial Intelligence related applied research associated with advancing naval capabilities for decision making tools, systems, and supporting technologies.  This funding increase is also responsive to the CNO Design for Maritime Supremacy 2.0,  instructing ONR to advance and guide AI fundamental research enabling: AI verification methods; long-duration missions for Naval unmanned surface ships; AI processing at the tactical edge; intelligent agents that rapidly learn, generate high-volume course of action excursions and assist humans in making collaborative, complex decisions, and achieve the goal of enabling our sailors and marines to make better decisions faster than our adversaries in dynamic environments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Source Integration and Combat Identification"
                                    },
                                    "Description": {
                                        "val": "This activity addresses Theater Air And Missile defense (TAMD), and responds to warfighter needs for rapid, high confidence Combat Identification (CID) of air and missile threats at long range, using real time and non-real time threat attributes and intelligence information."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.535"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.550"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic Warfare:\nContinue efforts to improve Radio Frequency (RF) detection of targets at High Frequency (HF) frequencies as precursors to adversary air attacks and improvements in HF surface wave radar array geometries. Continue work on concepts for rapidly assessing concurrent multiple missiles with multiple EW responses to provide for rapid high quality assessment in this complex environment.\n\nExpand ship signatures analysis for certain threat categories to determine how to mitigate vulnerabilities and develop methods for robust countermeasures employment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.723"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.723"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic Warfare:  \n\nThe research being conducted by three projects in this area address Theater Air and Missile Defense (TAMD), and responds to warfighter needs for rapid, high confidence identification of air and missile threats at long range, using real time and non-real time threat attributes and intelligence information.\n\nCurrent efforts include: \n- Extending a previously developed technology to discover features of ship signatures vulnerable to certain threat detections and determine how to mitigate these.\n- Using models to determine the enhanced radar cross section of Hyper Velocity Vehicles (HVV) and provide improved prediction and interpretation from HVV flights for early detection\/identification and performance evaluation of these vehicles.\n- Efficient broadband two-dimensional high frequency transmit arrays for Over-The-Horizon (OTH) Radar to enable two dimensional transmit beam steering, adaptive transmit side lobe control and reduced prime power requirements for long range detection of objects in the environment."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No significant changes from FY 2020 to FY 2021; no programmatic impact."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Space Exploitation"
                                    },
                                    "Description": {
                                        "val": "The Tactical Space Exploitation initiative explores the application of new space craft technologies on small, light-weight and low-cost satellites, to enhance naval warfighting capabilities by taking advantage of the global access, revisit and connectivity provided by orbital platforms.\n\nSpacecraft Technology: Affordable, expendable payload and bus technologies will be developed, which will serve as building blocks for future responsive space systems: payloads, bus technologies and significant space robotic technologies that address on-orbit inspection, servicing, repair and assembly, and mission-life extension."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.137"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.188"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Space Research and Spacecraft Technology: Continue efforts to advanced, high-payoff technologies that will preserve, protect, and enhance space capabilities in the performance of functions that are of critical importance to Navy-Marine Corps operations while also reducing the cost of DoD space activities.\n\nNext-Generation Sensing: Continue efforts to develop a single pixel camera architecture for passive microwave imaging, maintaining currently delivered spatial resolution and calibration performance while significantly reducing current aperture diameter.  \n\nSpacecraft Technology: Continue work to develop a new capability for local Space Situational Awareness (SSA) with a novel system that detects and tracks objects in close proximity to a satellite that is equipped with this capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.736"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.736"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Space Research and Spacecraft Technology:\n\nTo perform early-applied discovery Research and Development (R&D) to ensure Navy-Marine Corps access to critical space-associated capabilities on the ground, at sea, and in a contested space environment. Research thrusts include spacecraft R&D in five strategic cross-cutting areas that lead to the fielding of systems which perform functions critically important to operations. These areas are: (1) Advanced Space Platform Technologies, such as development of new and prototype space systems that are tailored to specific threats, including technologies which reduce cost, mass, power and\/ or extend on-orbit lifetimes, and sub-systems that advance propulsion and control capabilities towards precision maneuvering while minimizing fuel; (2) Next-generation Payloads and Sensors, including space robotic capabilities to address on-orbit inspection, servicing, repair, assembly, and mission life extension; (3) Connectivity for disadvantaged users that is rugged, high-bandwidth and space based; (4) Space Weather, and (5) Space Situational Awareness. \n\nCurrent efforts include:  \n- Developing and validating models of cathode breakdown and plasma formation to demonstrate reliable, repeatable cathode ignition using plasma heating, which will benefit the Navy by enabling instant ignition within seconds for responsive, low-power operation aboard highly mobile small satellites.\n- Developing a Global Positioning System (GPS)-denied satellite autonomous navigation system that can operate for years with no input from operators or external systems and still perform a useful mission; developing a simulation tool capable of predicting the change in the aerodynamic performance of hypersonic vehicles after impact with atmospheric cloud formations over a range of mission scenarios and weather conditions.\n- Demonstrating the successful completion of a robotic assembly task using a formally stable haptic feedback scheme in the presence of communication latency that allows an operator to feel how the robot is moving, rather than rely only on camera views or simulations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No significant changes from FY 2020 to FY 2021; no programmatic impact."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}