{
    "id": "2021-DefenseInformationSystemsAgency-PB-0400-MJBOOK-0-0-932446e5ad2da735ef901828833d759d030ff2fcbbd6698be685bef843d0fdb7-19",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-DISA-U_RDTE_MasterJustificationBook_Defense_Information_Systems_Agency_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Information_Systems_Agency_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Defense Information Systems Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0305208K"
        },
        "ProgramElementTitle": {
            "val": "Distributed Common Ground\/Surface Systems"
        },
        "R1LineNumber": {
            "val": "241"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Information Systems Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "56.127"
            },
            "PriorYear": {
                "val": "2.848"
            },
            "CurrentYear": {
                "val": "2.981"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "As the sole joint interoperability certification agent, the Joint Interoperability Test Command (JITC) established and maintains a Distributed Development and Test Enterprise (T&E) for the Department of Defense (DoD) Distributed Common Ground\/Surface System (DCGS) program, as directed by the Office of the Under Secretary of Defense Intelligence (OUSD(I)).  DCGS is an integral and critical component of the overall DoD Intelligence, Surveillance, and Reconnaissance interoperability and data integration strategy which provides world-wide capabilities to receive, process, exploit, and disseminate data from airborne and national reconnaissance sensors\/platforms and commercial sources."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "2.970"
                },
                "CurrentYear": {
                    "val": "2.981"
                },
                "BudgetYearOne": {
                    "val": "3.050"
                },
                "BudgetYearOneBase": {
                    "val": "3.050"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "2.848"
                },
                "CurrentYear": {
                    "val": "2.981"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.122"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-3.050"
                },
                "BudgetYearOneBase": {
                    "val": "-3.050"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.122"
                                },
                                "BudgetYearOne": {
                                    "val": "-3.050"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.050"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease of -$0.122 in FY19 achieved through efficiencies gained in evolving T&E infrastructure.\n\nThe decrease of -$3.050 in FY 2021 is due to transfer of program from Budget Activity (BA) 7 to BA 6 to accurately align the mission of the program."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "NF1"
                    },
                    "ProjectTitle": {
                        "val": "Distributed Common Ground\/Surface Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "56.127"
                        },
                        "PriorYear": {
                            "val": "2.848"
                        },
                        "CurrentYear": {
                            "val": "2.981"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Joint Interoperability Test Command (JITC) coordinates with the Military Services and Defense Intelligence Agencies to conduct Joint\/Distributed Common Ground\/Surface System (DCGS) testing and analysis, including event coordination, configuration, instrumentation and integration functions on the Distributed Development and Test Enterprise (DDTE).  Under the DCGS Governance, this effort, referred to as the DCGS Test and Evaluation (T&E) Focus Team (FT), is composed of three parts:  the DDTE Focus Group, providing and sustaining a distributed development network; the Strategy Focus Group, looking at current and future net-enabled enterprise T&E methods; and the Execution Focus Group, which leverages the Strategy Focus Group’s methodologies in executing DCGS Enterprise assessment events, such as the annual DCGS demonstration, ENTERPRISE CHALLENGE.  These efforts improve systems engineering and T&E throughout all phases of the DCGS life-cycle, resulting in improved capabilities to share net-centric data and services between the DCGS Programs of Record (PoRs) and the overarching Defense Intelligence Information Enterprise (DI2E).\n\nOperates and maintains the DDTE, providing DCGS PoRs a virtual, operationally-relevant assessment environment maintaining connectivity between Service facilities, National Agency capabilities, and Coalition partners.  DDTE allows robust integration of modeling and simulation T&E capabilities across Joint DCGS events without introducing vulnerabilities to operational Command and Control networks and has enabled improvements in systems engineering, instrumentation and T&E throughout all phases of the DCGS life cycle. \n\nDCGS PoRs and Coalition partners use the DDTE network, which supports the net-centric maturity assessment of the DCGS Enterprise under the DCGS Governance, to integrate architecture, standards, and capabilities for implementation of the DCGS Integration Backbone and support the migration to net-centricity, including DCGS Enterprise services for the Military Departments, DCGS-Special Operations Forces and the DCGS Intelligence Community.  National Agency capabilities supporting DCGS include Geospatial Intelligence, Signals Intelligence, Measurement and Signature Intelligence and Human Intelligence, which are integrated and tested in the DDTE domain."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Distributed Common Ground\/Surface Systems (DCGS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.848"
                                            },
                                            "Text": {
                                                "val": "Continue to revise and evolve T&E data collection techniques and analysis strategies in support of DCGS Enterprise community members acquisition programs’ interoperability as they integrate capabilities and services solutions to address the operational gaps identified in the Office of the Under Secretary of Defense for Intelligence (OUSD(I)) sponsored Distributed Common Ground\/Surface System Enterprise Capabilities Based Assessment.  Continue to plan, develop and execute enterprise-level data collection during multiple yearly test events.  Continue to support DDTE, provide enhanced functionality, expand T&E capability, and perform automated evaluations of net-centric capabilities with improved assessment methodologies and practices due to incorporating new technologies such as cloud computing, mobile technology, and “big data”.  Continue enhancement of instrumentation and automated data collection tools to support testing on multiple network domains and enclaves where the DCGS PoRs, National Agencies and Coalition Partners test and operate.  Continue to develop T&E methodology and tools to support testing of enterprise cybersecurity solutions to determine if they comply with standards, support interoperability between the DCGS PoRs, and meet the DCGS Enterprise cybersecurity requirements.  Continue to conduct compliance testing of data, metadata, and web services against established standards to enhance the sharing and promote reuse of net centric solutions.  Continuing to expand Testing as a Service (TaaS) capabilities that enable DCGS entities and other Communities of Interest (COIs) to test for standards compliance during the development and acquisition processes.  All data collected by these assessment efforts are reflected in an annual DCGS Enterprise Assessment Report that delineates how well the DCGS Enterprise shows progress over time in meeting the capabilities and closing the gaps reflected in the 2016 DCGS Enterprise Initial Capabilities Document."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.981"
                                            },
                                            "Text": {
                                                "val": "Continue to revise and evolve test and evaluation (T&E) data collection techniques and analysis strategies in support of DCGS Enterprise community members acquisition programs’ interoperability as they integrate capabilities and services solutions to address the operational gaps identified in the OUDS(I) sponsored Distributed Common Ground\/Surface System Enterprise Capabilities Based Assessment.  Continue to plan, develop and execute enterprise-level data collection during multiple yearly test events.  Continue to support DDTE, provide enhanced functionality, expand T&E capability, and perform automated evaluations of net-centric capabilities with improved assessment methodologies and practices due to incorporating new technologies such as cloud computing, mobile technology, and “big data”.  Continue enhancement of instrumentation and automated data collection tools to support testing on multiple network domains and enclaves where the DCGS PoRs, National Agencies and Coalition Partners test and operate.  Continue to develop T&E methodology and tools to support testing of enterprise cybersecurity solutions to determine if they comply with standards, support interoperability between the DCGS PoRs, and meet the DCGS Enterprise cybersecurity requirements.  Continue to conduct compliance testing of data, metadata, and web services against established standards to enhance the sharing and promote reuse of net centric solutions.  Continuing to expand TaaS capabilities that enable DCGS entities and other COIs to test for standards compliance during the development and acquisition processes.  All data collected by these assessment efforts are reflected in an annual DCGS Enterprise Assessment Report that delineates how well the DCGS Enterprise shows progress over time in meeting the capabilities and closing the gaps reflected in the 2016 DCGS Enterprise Initial Capabilities Document."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease of -$2.981 from FY 2020 to FY 2021 is due to transfer of program from BA 7 to BA 6 to accurately align the mission of the program."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "In-House Contracts"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "22.963"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "24.963"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering & Technical Services 1"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Interop"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft Huachuca"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.763"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.763"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering & Technical Services 2"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NGMS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft Huachuca"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "12.927"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "12.927"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering & Technical Services 3"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NGIT"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft  Huachuca"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.612"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.612"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering & Technical Services 4"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.173"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.173"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering & Technical Services 5"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TASC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Andover, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.887"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.887"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering & Technical Services 6"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.802"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.848"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.981"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.631"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "DCGS"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "DCGS T&E IPT"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Connectivity to Other Testbeds & Test Event Conduct"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "DDT&E Operation and Maintenance Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}