{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-855515f7cbe1443b1cc76e32ff869263061a887974718017fcc8f688288c6578-75",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605161D8Z"
        },
        "ProgramElementTitle": {
            "val": "Nuclear Matters"
        },
        "R1LineNumber": {
            "val": "157"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "32.441"
            },
            "PriorYear": {
                "val": "4.854"
            },
            "CurrentYear": {
                "val": "8.307"
            },
            "BudgetYearOne": {
                "val": "16.552"
            },
            "BudgetYearOneBase": {
                "val": "16.552"
            },
            "BudgetYearTwo": {
                "val": "16.901"
            },
            "BudgetYearThree": {
                "val": "17.277"
            },
            "BudgetYearFour": {
                "val": "17.617"
            },
            "BudgetYearFive": {
                "val": "17.816"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FYDP funding increases are addressing the need for technical experts to assist with the Nuclear Deterrent Enterprise Review Group and nuclear deterrent modeling and analysis to help make data-driven decisions for nuclear modernization efforts."
        },
        "ProgramElementMissionDescription": {
            "val": "The mission of Nuclear Matters is to ensure the continued credibility, effectiveness, safety, and security of the U.S. deterrent in order to deter nuclear and non-nuclear attack; assure U.S. allies and partners; achieve U.S. objectives if deterrence fails; and hedge against an uncertain future. Nuclear Matters serves as the DoD focal point for the modernization and sustainment of the U.S. nuclear weapons stockpile, as well as for a wide range of nuclear counter-terrorism and counter-proliferation issues. \n\nThe funds for this program are used to support research, development, test and evaluation efforts as well as studies and analyses for nuclear weapons modernization, sustainment; security; use control; nuclear weapons stockpile safety; and survivability requirements. Funds are also used to develop and implement plans for stockpile transformation; infrastructure analyses and assessments; DoD-National Nuclear Security Administration (NNSA) Nuclear Weapons Council (NWC) activities, as mandated by Title 10 USC, section 179; radiological and nuclear emergency response efforts; and management of international programs of nuclear cooperation, particularly with respect to enhancing international nuclear safety and security.  Nuclear Matters is also responsible for policy development and implementation for personnel reliability; nuclear weapons, nuclear command and control, and special nuclear materials security; use control; nuclear weapons transportation; physical security equipment; countering nuclear threats; and nuclear and radiological incident response. Additionally, Nuclear Matters serves as the focal point for DoD activities and initiatives related to the dual missions of sustaining a safe, secure, and effective nuclear deterrent and countering the threat from nuclear terrorism and nuclear proliferation.  \n\nNuclear Matters is leading a Tri-Lab effort (Los Alamos National Laboratory, Lawrence Livermore National Laboratory, and Sandia National Laboratories) to provide data-driven, mission engineering support to integrated portfolio management for 21st Century nuclear deterrent sustainment and modernization. The United States is modernizing all three legs of its nuclear triad and is also reconstituting its nuclear weapons production capability at roughly the same time, while simultaneously sustaining weapons and systems that have aged well beyond their original design lives. The Nuclear Weapons Council and the Nuclear Deterrent Enterprise Review Group need to manage the transition from legacy Cold War delivery systems and weapons to replacement systems and warheads and make decisions that will affect U.S. national security through the end of the 21st Century. To field a modern, threat-informed nuclear deterrent that will keep pace with evolving adversary capabilities, it is necessary to quantify and compare the relative performance contributions of a variety of military characteristics and weapons options to make data-driven decisions concerning the future of the U.S. nuclear deterrent.\n\nThis Program Element can fund travel to support the requirements of this program.\n\nThis appropriation will finance work, including manpower, performed by a government agency or by private individuals or organizations under a contractual or grant arrangement with the government who conduct research (systematic study directed toward fuller scientific knowledge or understanding of the subject studied), development (systematic use of the knowledge and understanding gained from research, for the production of useful materials, devices, systems, or methods, including the design and development of prototypes and processes) and test and evaluation efforts."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.039"
                },
                "CurrentYear": {
                    "val": "8.307"
                },
                "BudgetYearOne": {
                    "val": "8.869"
                },
                "BudgetYearOneBase": {
                    "val": "8.869"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.854"
                },
                "CurrentYear": {
                    "val": "8.307"
                },
                "BudgetYearOne": {
                    "val": "16.552"
                },
                "BudgetYearOneBase": {
                    "val": "16.552"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.185"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "7.683"
                },
                "BudgetYearOneBase": {
                    "val": "7.683"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.184"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "7.700"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.700"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Cancelled Accounts"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.001"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.017"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.017"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding was increased in FY 2021 to address nuclear deterrent modeling and analysis to help make data-driven decisions for nuclear modernization efforts."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "161"
                    },
                    "ProjectTitle": {
                        "val": "Nuclear Matters"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "32.441"
                        },
                        "PriorYear": {
                            "val": "4.854"
                        },
                        "CurrentYear": {
                            "val": "8.307"
                        },
                        "BudgetYearOne": {
                            "val": "16.552"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.552"
                        },
                        "BudgetYearTwo": {
                            "val": "16.901"
                        },
                        "BudgetYearThree": {
                            "val": "17.277"
                        },
                        "BudgetYearFour": {
                            "val": "17.617"
                        },
                        "BudgetYearFive": {
                            "val": "17.816"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The mission of the Nuclear Matters program is to sustain the U.S. nuclear deterrent posture, counter nuclear threats, and to develop nuclear and conventional physical security equipment. The funds for this program are used to support developmental and test and evaluation efforts as well as studies and analyses for nuclear weapons security; use control; nuclear weapons stockpile safety, survivability and performance; nuclear threat reduction and office management.  \n\nFunds are also used to develop and implement plans for stockpile transformation; infrastructure analyses, assessments and models; NWC activities, as mandated by Title 10 USC, section 179; radiological and nuclear emergency response efforts; and management of international programs of nuclear cooperation, particularly with respect to enhancing international nuclear safety and security.  \n\nNuclear Matters is also responsible for policy development and implementation for personnel reliability; nuclear weapons, nuclear command and control, and special nuclear materials security; use control; nuclear weapons transportation; physical security equipment; countering nuclear threats; and nuclear and radiological incident response.\n\nThis appropriation will finance work, including manpower, performed by a government agency or by private individuals or organizations under a contractual or grant arrangement with the government who conduct research (systematic study directed toward fuller scientific knowledge or understanding of the subject studied), development (systematic use of the knowledge and understanding gained from research, for the production of useful materials, devices, systems, or methods, including the design and development of prototypes and processes) and test and evaluation efforts.\n\nThis Program Element can fund travel to support the requirements of this program."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Nuclear Weapons Council"
                                    },
                                    "Description": {
                                        "val": "The NWC is a joint Department of Defense (DoD) and Department of Energy (DOE)\/National Nuclear Security Administration (NNSA) organization established by Congress to facilitate cooperation and coordination between the two Departments as they fulfill their dual agency responsibilities for U.S. nuclear weapons stockpile management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.559"
                                            },
                                            "Text": {
                                                "val": "- Oversee the activities on the Congressionally mandated Joint DoD-DOE Nuclear Weapons Council and its support committees to include the Nuclear Weapons Council Standing and Safety Committee, the Compartmented Advisory Committee and the Action Officer group"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.475"
                                            },
                                            "Text": {
                                                "val": "- Oversee the activities on the Congressionally mandated Joint DoD-DOE NWC and its support committees to include the NWC Standing and Safety Committee, the Compartmented Advisory Committee and the Action Officer group"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.475"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.475"
                                            },
                                            "Text": {
                                                "val": "- Continue to oversee the activities on the Congressionally mandated Joint DoD-DOE NWC and its support committees to include the Nuclear Weapons Council Standing and Safety Committee, the Compartmented Advisory Committee and the Action Officer group"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "International Programs"
                                    },
                                    "Description": {
                                        "val": "The United States also participates in several international programs of cooperation regarding nuclear weapons with foreign governments and regional defense organizations that involve unclassified and classified information exchanges.  In general, these agreements are designed to promote safety and security, advance stockpile stewardship and collaborate in counter-proliferation efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.191"
                                            },
                                            "Text": {
                                                "val": "- Execute confidence building programs of cooperation with international partners.\n- Sponsor international partners at national-level nuclear weapons accident\/incident exercises."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "- Execute confidence building programs of cooperation with international partners through Tri and Bi-lateral annual, bi-annual, and monthly engagements under Mutual Defense Agreements.\n- Sponsor international partners at national-level nuclear weapons accident\/incident exercises, workshops, render safe exercises through tri-lateral engagements under Mutual Defense Agreements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "- Continue to confidence building programs of cooperation with international partners through Tri and Bi-lateral annual, bi-annual, and monthly engagements under Mutual Defense Agreements.\n- Continue to sponsor international partners at national-level nuclear weapons accident\/incident exercises, workshops, render safe exercises through tri-lateral engagements under Mutual Defense Agreements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nuclear Surety"
                                    },
                                    "Description": {
                                        "val": "Because of their political and military importance, destructive power, and the potential consequences of an accident or unauthorized act, nuclear weapons and nuclear weapon systems require special consideration--nuclear surety-- and must be protected against risks and threats inherent in their peacetime and wartime environments. Oversight of the DoD nuclear surety program is provided by Deputy Assistant Secretary of Defense for Nuclear Matters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.660"
                                            },
                                            "Text": {
                                                "val": "- Conduct OSD oversight and provide direction for actions taken under DoDD 4540.5, \"Transportation of Nuclear Weapons\"; DoDD S-5210.81, \"United States Nuclear Weapons Command and Control, Safety, and Security\"; DoDD S-3150.7, \"Controlling the Use of Nuclear Weapons\"; DoDD 5210.42 and 5210.42-R, \"The DoD Personnel Reliability Program'; and DoDD 5210.41 and S-5210.41-M, \"Physical Security of Nuclear Weapons.\"\n- Support activities that support nuclear surety policy and provide OSD oversight of the Nuclear Surety program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.745"
                                            },
                                            "Text": {
                                                "val": "- Conduct OSD oversight and provide direction for actions taken under DoDI 4540.05,Transportation of U.S. Nuclear Weapons; DoDD S-5210.81, United States Nuclear Weapons Command and Control, Safety, and Security; DoDI S-3150.07, Controlling the Use of Nuclear Weapons and DoDI S-5210.82, Protection Nuclear Weapons Coding Equipment; DoDI 5210.42, “Nuclear Weapons Personnel Reliability Assurance” and DoDM 5210.42, Nuclear Weapons Personnel Reliability Program\"; and DoDD 5210.41, Security Policy for Protecting Nuclear Weapons, DoDI O-5210.63, DoD Procedures for Security of Nuclear Reactors and Special Nuclear Materials, and DoD S-5210.92M, Physical Security for Nuclear Command and Control (NC2) Facilities.\n\n- Manage the DoD Nuclear Exercise Program to inform risk based decisions and development of policy affecting nuclear security policy across the DoD Components by directing the DoD Force-on-Force Program; an exercise that evaluates the effectiveness of nuclear security policy through testing, evaluation, and analyses."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.745"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.745"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct OSD oversight and provide direction for actions taken under DoDI 4540.05,Transportation of U.S. Nuclear Weapons; DoDD S-5210.81, United States Nuclear Weapons Command and Control, Safety, and Security; DoDI S-3150.07, Controlling the Use of Nuclear Weapons and DoDI S-5210.82, Protection Nuclear Weapons Coding Equipment; DoDI 5210.42, “Nuclear Weapons Personnel Reliability Assurance” and DoDM 5210.42, Nuclear Weapons Personnel Reliability Program\"; and DoDD 5210.41, Security Policy for Protecting Nuclear Weapons, DoDI O-5210.63, DoD Procedures for Security of Nuclear Reactors and Special Nuclear Materials, and DoD S-5210.92M, Physical Security for Nuclear Command and Control (NC2) Facilities.\n\n- Continue to manage the DoD Nuclear Exercise Program to inform risk based decisions and development of policy affecting nuclear security policy across the DoD Components by directing the DoD Force-on-Force Program; an exercise that evaluates the effectiveness of nuclear security policy through testing, evaluation, and analyses."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Stockpile Transformation"
                                    },
                                    "Description": {
                                        "val": "To meets its security needs and those of its allies, the U.S. will need a safe, secure, and reliable nuclear deterrent for the foreseeable future.  There's increased risk, absent nuclear testing, in assuring long-term safety and reliability of today’s aging stockpile—the legacy warheads left over from the Cold War.  Today’s nuclear weapons complex is not sufficiently “responsive” to technical problems in the stockpile, or to potential emerging threats.  The task is to ensure the U.S. nuclear weapons stockpile and supporting infrastructure, meets long-term national security needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.223"
                                            },
                                            "Text": {
                                                "val": "- Conduct life cycle activities in support of the nuclear weapons stockpile under DoDD 3150.1, \"Nuclear Weapons Life Cycle\" and DoDI 5030.55, \"DoD Procedures for Joint DoD-DOE Nuclear Weapons Life Cycle Activities.\n- Manage DoD RDT&E activities for nuclear warheads to include B61, W76, W78, W80(0,1), B83, W87, W88 Weapons.\n- Support studies for warhead replacement."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.126"
                                            },
                                            "Text": {
                                                "val": "- Conduct life cycle activities in support of the nuclear weapons stockpile under DoDD 3150.01, Joint DoD-DOE\/NNSA Nuclear Weapon Life-Cycle Activities and DoDM 5030.55, DoD Procedures for Joint DoD-DOE Nuclear Weapons Life Cycle Activities.\n- Manage DoD RDT&E activities for nuclear warheads to include B61, W76, W78, W80, B83, W87, W88 Weapons.\n- Support studies for warhead replacement."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.062"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.062"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct life cycle activities in support of the nuclear weapons stockpile under DoDD 3150.01, Joint DoD-DOE\/NNSA Nuclear Weapon Life-Cycle Activities and DoDM 5030.55, DoD Procedures for Joint DoD-DOE Nuclear Weapons Life Cycle Activities.\n- Continue to manage DoD RDT&E activities for nuclear warheads to include B61, W76, W78, W80, B83, W87, W88 Weapons.\n- Continue to support studies for warhead replacement."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 to FY 2021 decrease of $0.064 is the result of planned program changes in OUSD(A&S)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability and Weapons of Mass Destruction (WMD)"
                                    },
                                    "Description": {
                                        "val": "In the 2010 Quadrennial Defense Review, the SECDEF directed the Department to rebalance its policy, doctrine, and capabilities to better support six key missions.  The fifth on the list of key missions is to prevent proliferation and counter WMD.  This project directly supports the nation’s defense strategy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.711"
                                            },
                                            "Text": {
                                                "val": "Continue to:\n- Oversee the Nuclear Defense Portfolio.\n- Plan and coordinate the activities of the National Nuclear Forensics Steering Committee and Working Group.\n- Develop OSD-wide approach to overseeing Global Nuclear Defense missions within DoD."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.711"
                                            },
                                            "Text": {
                                                "val": "- Oversee the Nuclear Defense Portfolio.\n- Plan and coordinate the activities of the National Nuclear Forensics Steering Committee and Working Group.\n- Develop OSD-wide approach to overseeing Global Nuclear Defense missions within DoD."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.711"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.711"
                                            },
                                            "Text": {
                                                "val": "- Continue to oversee the Nuclear Defense Portfolio.\n- Continue to plan and coordinate the activities of the National Nuclear Forensics Steering Committee and Working Group.\n- Continue to develop OSD-wide approach to overseeing Global Nuclear Defense missions within DoD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nuclear Matters Support"
                                    },
                                    "Description": {
                                        "val": "Support to Nuclear Matters includes the following:\n\n- Managing the operational, technical, and administrative support for the NWC and its subordinate bodies for a Safe, Secure, Effective, and Credible Nuclear Deterrent.\n- Developing and coordinating all reports to the President and Congress as mandated by public law including the Report on\nStockpile Assessments, Nuclear Weapons Stockpile Memorandum, NWC Certification of the NNSA Budget, Nuclear Weapons\nStockpile Report, Joint Surety Report. Stockpile Stewardship and Management Plan, and Report on Platform Assessment.\n- Developing technical content for briefings, reports, and decision letters; guides documents through coordination; and resolves issues within and between the agencies.\n- Maintaining official records of NWC and subordinate body proceedings and other official documents.\n- Reviewing and documenting Freedom of Information Act and Mandatory Declassification Requests (Annual average of over 500 nuclear-related requests)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.698"
                                            },
                                            "Text": {
                                                "val": "- Submit annual reports to the President and the Congress.\n- Continue to oversee DoD\/DOE relationship regarding the survivability and surety of the national nuclear stockpile.\n- Continue as DoD Sigma 15 Approval Authority (Interface with DOE\/NNSA).\n- Continue to address Freedom of Information Act and Mandatory Declassification Requests."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.675"
                                            },
                                            "Text": {
                                                "val": "- Submit annual reports to the President and the Congress.\n- Oversee DoD\/DOE relationship regarding the survivability and surety of the national nuclear stockpile.\n- Serve as DoD Sigma 15 Approval Authority (Interface with DOE\/NNSA).\n- Continue to adjudicate Freedom of Information Act and Mandatory Declassification Requests"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.676"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.676"
                                            },
                                            "Text": {
                                                "val": "- Continue to submit annual reports to the President and the Congress.\n- Continue to oversee DoD\/DOE relationship regarding the survivability and surety of the national nuclear stockpile.\n- Continue as DoD Sigma 15 Approval Authority (Interface with DOE\/NNSA).\n- Continue to address Freedom of Information Act and Mandatory Declassification Requests."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physical Security and PPBE Support"
                                    },
                                    "Description": {
                                        "val": "This support addresses program management, evaluation, and resourcing functions associated with the Physical Security Enterprise & Analysis Group (PSEAG), the Security Policy Verification Committee (SPVC), and Nuclear Threat Reduction (NTR) programs. This support also includes Planning, Programming, Budgeting and Execution (PPBE) for the Office of the Assistant Secretary of Defense for Nuclear, Chemical, and Biological Defense Programs and the Office of the Deputy Assistant Secretary of Defense for Nuclear Matters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.812"
                                            },
                                            "Text": {
                                                "val": "- Support the Physical Security Enterprise & Analysis Group\n- Support the Security Policy Verification Committee \n- Provide all Planning, Programming, budgeting and Execution support for the Nuclear Matters' portfolio"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.875"
                                            },
                                            "Text": {
                                                "val": "- Assist with coordinating, planning and executing nuclear and conventional physical security development, test, evaluation and deployment of projects executed by the Military Departments by ensuring joint capability gaps are identified and to avoid duplication of effort across the DoD to maximize use of limited funds.\n\n- Assist Nuclear Matters and the PSEAG pursue a joint-layered defense approach to Counter-Unmanned systems (C-UxS) by integrating sensors and systems into physical security architectures and command and control systems to address this threat.\n\n- Coordinate efforts across DoD, interagency and international partners to develop C-UxS solutions that address the entire kill chain (Detect, Track, Identify, and Defeat) that support valid requirements while eliminating duplication of effort, pursuing the use of government and commercial off-the-shelf (GOTS\/COTS) products, ensuring systems integration, and promoting interoperability and sustainability.   \n\n- Support all phases of the PPBE process and meet all mandated timelines for submission of related documents; contribute to the development of PPBE policy guidance for OASD(NCB); providing programmatic, business, financial, and policy assessments to the OASD(NCB); Maintaining and updating OASD(NCB) related funding profiles in official DoD financial databases and systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.983"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.983"
                                            },
                                            "Text": {
                                                "val": "Continue to support the following:\n- Assist with coordinating, planning and executing nuclear and conventional physical security development, test, evaluation and deployment of projects executed by the Military Departments by ensuring joint capability gaps are identified and to avoid duplication of effort across the DoD to maximize use of limited funds.\n\n- Assist Nuclear Matters and the PSEAG pursue a joint-layered defense approach to Counter-Unmanned systems (C-UxS) by integrating sensors and systems into physical security architectures and command and control systems to address this threat.\n\n- Coordinate efforts across DoD, interagency and international partners to develop C-UxS solutions that address the entire kill chain (Detect, Track, Identify, and Defeat) that support valid requirements while eliminating duplication of effort, pursuing the use of government and commercial off-the-shelf (GOTS\/COTS) products, ensuring systems integration, and promoting interoperability and sustainability.   \n\n- Support all phases of the PPBE process and meet all mandated timelines for submission of related documents; contribute to the development of PPBE policy guidance for OASD(NCB); providing programmatic, business, financial, and policy assessments to the OASD(NCB); Maintaining and updating OASD(NCB) related funding profiles in official DoD financial databases and systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 to FY 2021 increase of $2.125 million is the result of an add in the scope of work for C-UxS, physical security test and evaluation and SharePoint design and analysis."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nuclear Deterrent Enterprise Review Group (NDERG)"
                                    },
                                    "Description": {
                                        "val": "The NDERG is the principal integrated civilian-military governance body for the  Department of Defense (DoD) Nuclear Enterprise. This oversight body, chaired by the Deputy Secretary of Defense and including the Vice Chairman of the Joint Chiefs of Staff and other senior leaders across the Department of Defense nuclear enterprise, was created to oversee and make decisions regarding implementation of recommendations from both the internal and external DoD nuclear enterprise reviews. The NDERG, in FY 2019, expanded its responsibility to provide advice and assistance to the Deputy Secretary of Defense on matters pertaining to management, operations, and health of the DoD Nuclear Enterprise. In addition, the NDERG will provide a forum for strategic-level coordination and integration of issues arising from the Department's other functional oversight committees and councils related to the nuclear enterprise.\n\nThe NDERG meets on a biennial basis and provides a forum for senior Defense leaders to identify, track, coordinate, and address issues, risks, and opportunities across the nuclear enterprise to ensure that outcomes of the 2014 Nuclear Enterprise Reviews, and outcomes of 2018 Nuclear Posture Review related to the health, management, and operations of the DoD Nuclear Enterprise, are pursued to completion."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "- The NDERG will oversee and synchronize all actions across the nuclear enterprise, including those from the Nuclear Posture Review (NPR) and any future reviews and\/or assessments of any portion of the nuclear enterprise and is supported in its responsibilities by a next level down committee which meets on a quarterly basis and the action officer’s group, which meets monthly.\n\n- The NDERG, as recommended by the Deputy Secretary of Defense, will utilize the DoD Advana Shared Service Support to build a Nuclear Enterprise Dashboard (NED). The NED will be an automated nuclear enterprise-wide system capable for a variety of users to deduce insights, brief senior leadership, and improve the health of the nuclear enterprise. (Note: estimated cost is $2.99M for the most reliable, highest quality of control and assurance of data)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop the NED to allow the Nuclear Community to gain immediate access to data, reducing build costs, development risks, and timeline to begin creating insights from NE data.  Link NED to other Common Enterprise Databases to benefit from best practices and lessons learned from other DoD users, reducing the “learning cure” and speeding development timelines. (Note: estimated cost is $2.99M for the most reliable, highest quality of control and assurance of data).  \n\n- Continue to oversee and synchronize all actions across the nuclear enterprise, including those from the NPR and any future reviews and\/or assessments of any portion of the nuclear enterprise and is supported in its responsibilities by a next level down committee which meets on a quarterly basis and the action officer’s group, which meets monthly."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nuclear Incident Response and North Atlantic Treaty Organization (NATO)"
                                    },
                                    "Description": {
                                        "val": "In accordance with Presidential Policy Directive 35, US Nuclear Weapons Command and Control, Safety and Security and the DoD implementer, DoDD S-5210.81, the DoD will establish policy on nuclear weapons procedures for responding to U.S. nuclear weapons accidents and incidents and serve as the technical adviser to the Secretary of Defense in the event of a nuclear accident or incident.  Coordinates with other U.S. Government Agencies and allies to ensure their standards complement DoD efforts for responding to accidents and incidents.\n\nRegularly consult with NATO allies through the High Level Group (HLG—the senior advisory body to the NATO Nuclear Planning Group) subject matter experts and supports the Assistant Secretary of Defense for nuclear, Chemical and Biological Defense in their role as Vice-Chair of the HLG, comprised of national policy makers at the director level, and experts from Allied capitals."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "- Serve as Chair of the Nuclear Weapons Accident and Incident Subcommittee tasked in Federal response plans and national directives with the responsibility to coordinate and execute U.S. nuclear weapons incident and accident response policy.\n\n- Coordinate overseas nuclear weapon storage and deployment issues with the Department of State, Combatant Commands, Services, and other DoD organizations.\n\n- Direct the Nuclear Weapon Accident and Incident Exercises for the DoD, in coordination and cooperation with other U.S. Government Agencies (to include state\/local\/tribal) and NATO Partners."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "- Continue to Serve as Chair of the Nuclear Weapons Accident and Incident Subcommittee tasked in Federal response plans and national directives with the responsibility to coordinate and execute U.S. nuclear weapons incident and accident response policy.\n\n- Continue to coordinate overseas nuclear weapon storage and deployment issues with the Department of State, Combatant Commands, Services, and other DoD organizations.\n\n- Continue Nuclear Weapon Accident and Incident Exercises for the DoD, in coordination and cooperation with other U.S. Government Agencies (to include state\/local\/tribal) and NATO Partners."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nuclear Deterrent Model"
                                    },
                                    "Description": {
                                        "val": "In order to overcome evolving threats to the U.S. nuclear deterrent, the NWC must understand the trade space, payoffs, challenges, and increases or decreases in effectiveness related to decisions regarding nuclear warheads and their associated delivery systems and platforms. Nuclear Matters is providing data-driven decision making and mission engineering support using a Tri-Lab effort (Los Alamos National Laboratory, Lawrence Livermore National Laboratory, and Sandia National Laboratories) that uses advanced physics-based and stochastic analytics to provide NWC decision makers with threat-informed choices regarding U.S. nuclear deterrent modernization and sustainment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.200"
                                            },
                                            "Text": {
                                                "val": "Continue to expand and improve the nuclear deterrent model with analysis results that respond to the Nuclear Weapons Council in support of their strategic planning to include modernization strategies and stockpile composition assessments and investment tradeoffs.\n\nUtilize the model to develop stockpile options, provide data to drive decisions concerning nuclear weapons program prioritization, and evaluate the capacity of the NNSA Nuclear Security Enterprise to support DoD military requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 to FY 2021 increase of $4.2 million is the result of planned program changes in OUSD(A&S)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nuclear Modernization"
                                    },
                                    "Description": {
                                        "val": "Assist with data driven decision making for nuclear modernization leveraging organizations like the Institution of Defense Analyses"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "- Assist with data driven decision making for nuclear modernization leveraging organizations like the Institution of Defense Analyses"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 to FY 2021 increase of $2.0 million is the result of planned program changes in OUSD(A&S)."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}