{
    "id": "2021-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-9035d21372bc28631c31031b85da2fbd962d290bf8d6ca6eecbc49021508de49-82",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605804D8Z"
        },
        "ProgramElementTitle": {
            "val": "Development Test & Evaluation"
        },
        "R1LineNumber": {
            "val": "172"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "98.912"
            },
            "PriorYear": {
                "val": "19.417"
            },
            "CurrentYear": {
                "val": "22.203"
            },
            "BudgetYearOne": {
                "val": "27.198"
            },
            "BudgetYearOneBase": {
                "val": "27.198"
            },
            "BudgetYearTwo": {
                "val": "27.634"
            },
            "BudgetYearThree": {
                "val": "25.999"
            },
            "BudgetYearFour": {
                "val": "26.536"
            },
            "BudgetYearFive": {
                "val": "26.971"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2021, OSD(R&E) added the Cybersecurity DT&E for Weapon Systems project (Project Code 048) to provide needed Cybersecurity test strategies\/plans to the acquisition\/development process."
        },
        "ProgramElementMissionDescription": {
            "val": "Program Element (PE) 0605804D8Z establishes the dedicated funding line to carry out the duties in accordance with Title 10 U.S.C. Section 133a, FY 2018 National Defense Authorization Act (NDAA) section 838, and Department of Defense Instruction (DoDI) 5000.02 Change 4 dated August 31, 2018.  Specific responsibilities are outlined in DoDI 5134.17 Change 3 dated October 15, 2018.  The Director, Developmental Test and Evaluation (DT&E) is the principal advisor to the Secretary of Defense; the Under Secretary of Defense, Research and Engineering (USD(R&E)); and the Under Secretary of Defense, Acquisition and Sustainment (USD(A&S)) on Development Test and Evaluation (DT&E) in the Department of Defense (DoD).\n\nProgram Element 0605804D8Z supports the three strategic lines of effort within the National Defense Strategy (NDS).  The Office of the USD(R&E) (OUSD(R&E) engages with acquisition and rapid prototype programs to provide test planning expertise, including cybersecurity DT&E, and decision-quality data at major program reviews to help them succeed in modernizing key capabilities to Build a More Lethal Force.  OUSD(R&E) serves as the T&E acquisition career field Functional Leader to enhance the experience and qualification of the 8,700+ member DoD T&E workforce to Cultivate Workforce Talent and support priority emerging technologies.  OUSD(R&E) ensures programs meet interoperability requirements to deepen interoperability and Strengthen Alliances.  The PE also works to streamline T&E policy and guidance to improve test efficiency, and reduce acquisition cost and schedule to Reform the Department for Greater Performance and Affordability.\n\nProgram Element (PE) 0605804D8Z supports and improves the DT&E efforts of Major Defense Acquisition Program (MDAP), Major Automated Information System (MAIS) \/ Priority Defense Business Systems, Rapid Prototyping\/Fielding efforts, and other Special Interest (SI) acquisition programs designated by USD(R&E) or USD(A&S) as they progress through the acquisition\/development lifecycle; lead the defense acquisition workforce Test and Evaluation (T&E) career field; and support development of policy and guidance for the conduct of DT&E within the DoD.  Beginning in FY 2021, OUSD(R&E) established project 048, “Cybersecurity DT&E for Weapon Systems”, to provide dedicated resources to support MDAP and Rapid Prototyping\/Fielding Program Managers, Chief Developmental Testers, and Lead DT&E Organizations in the development of comprehensive, efficient, and innovative Cybersecurity DT&E strategies\/plans to support key acquisition milestones and engineering\/programmatic decisions."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.133"
                },
                "CurrentYear": {
                    "val": "22.203"
                },
                "BudgetYearOne": {
                    "val": "22.248"
                },
                "BudgetYearOneBase": {
                    "val": "22.248"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "19.417"
                },
                "CurrentYear": {
                    "val": "22.203"
                },
                "BudgetYearOne": {
                    "val": "27.198"
                },
                "BudgetYearOneBase": {
                    "val": "27.198"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.716"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "4.950"
                },
                "BudgetYearOneBase": {
                    "val": "4.950"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.713"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Transfer to PE 0605142D8Z"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.850"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.850"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments and DoD priorities"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.003"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.180"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.180"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.020"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.020"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Cybersecurity DT&E for Weapon Systems"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "7.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The $4.949 million adjustment in FY 2021 is the net of a $1.850 million transfer of the DT&E Engineering Policy effort to Program Element 0605142D8Z (Systems Engineering) for proper alignment and execution, a $7.000 million increase for Cybersecurity DT&E for Weapon Systems security strategies\/plans, and a $0.201 million reduction for economic assumptions and other DoD priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "804"
                    },
                    "ProjectTitle": {
                        "val": "Development Test & Evaluation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "98.912"
                        },
                        "PriorYear": {
                            "val": "19.417"
                        },
                        "CurrentYear": {
                            "val": "22.203"
                        },
                        "BudgetYearOne": {
                            "val": "20.198"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.198"
                        },
                        "BudgetYearTwo": {
                            "val": "20.634"
                        },
                        "BudgetYearThree": {
                            "val": "18.999"
                        },
                        "BudgetYearFour": {
                            "val": "19.536"
                        },
                        "BudgetYearFive": {
                            "val": "19.971"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides resources to support MDAP and Rapid Prototyping\/Fielding Program Managers, Chief Developmental Testers, and Lead DT&E Organizations in the development of comprehensive, efficient, and innovative DT&E strategies\/plans to support key acquisition milestones and engineering\/programmatic decisions.  This project also supports the OUSD(R&E) to manage the Test & Evaluation (T&E) career field and curriculum for the DoD acquisition workforce, and develop policy and guidance for the conduct of DT&E within DoD.  On behalf of the OUSD(R&E) this project executes the following activities:\n\n- Support acquisition programs in the development of comprehensive, efficient, and innovative test strategies.  Ensure that developmental test strategies are documented in Test and Evaluation Master Plans (TEMPs).  Review and approve\/disapprove the DT&E strategy\/plans within the TEMP.\n- Support rapid prototyping, rapid fielding, and technology demonstrations efforts in the development of tailored comprehensive, efficient, and innovative DT&E strategies\/plans.\n- Review and oversee developmental test processes across the services, especially during the formative stages of programs, to include prototyping and experimentation.\n- Provide DT&E subject matter experts to assist programs in building Developmental Evaluation Frameworks (DEFs) for inclusion in the TEMP.\n- Provide cybersecurity subject matter experts and assist programs in conducting Cybersecurity Table Top Exercises to identify potential threat vectors and associated risks early in development and focus Cybersecurity DT&E efforts (In FY 2021, this effort will move to Project 048).\n- For ACAT ID programs, provide independent DT&E Sufficiency Assessments prior to Milestone B and C decisions with the goal of reducing discovery of performance issues later in the acquisition cycle.\n- When requested by the Secretary or Deputy Secretary of Defense, provide independent developmental test assessments in support of USD(A&S) and Service Major Defense Acquisition Programs.\n- Support the development of independent technical risk assessments and advise the Secretary on the progress toward meeting Key Performance Parameters, technology maturation, reliability growth projections, interoperability, and cybersecurity posture before any decision to grant Milestone A or B approval, or enter into low-rate initial production or full-rate production for ACAT ID programs or when requested by the Secretary.\n- Serve as the Functional Leader for the T&E acquisition career field.  Support OUSD(R&E) to establish, oversee, and maintain the education, training, and experience requirements including competencies and certification standards to enhance the T&E acquisition workforce.  Monitor and facilitate Defense Acquisition University (DAU) updates of T&E courses to ensure the curriculum supports the certification standards and provides the appropriate education and training.\n- Manage the Scientific Test and Analysis Techniques Center of Excellence (STAT COE).  Over the last four years, the STAT COE has supported over 40 Acquisition Program Managers in the development of statistically optimized test programs.  These efforts have resulted in 175 more efficient and effective test plans and a test cost avoidance of about $160.000 million.\n- Support OUSD(R&E) to develop policy and guidance that ensures efficient and effective DT&E across the DoD, including policy and guidance for developmental testing of interoperability and cybersecurity in coordination with the Joint Staff and DoD Chief Information Officer (CIO).\n- Identify DoD test infrastructure gaps and support development of the OUSD(R&E) test resources strategic plan.\n- Ensure that the DT&E activities are fully integrated into, and consistent with, the DoD Systems Engineering and development planning processes.\n- Evolve the DT&E 'state of practice' to keep pace with emerging technologies and improve test efficiency to field systems faster.\n- Coordinate with Director, Operational Test and Evaluation to improve T&E efficiency and make best use of integrated testing.\n- Beginning in FY 2021, Cybersecurity efforts in this project will be moved to project 048.\n- Beginning in FY 2021, USD(R&E) consolidated all policy and workforce efforts under the SE Program Element 0605142D8Z.  T&E Policy and Workforce efforts will be managed and funded from that PE with support from this PE."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Development Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "This program supports and improves the DT&E efforts of Major Defense Acquisition Program (MDAP), Major Automated Information System (MAIS) \/ Priority Defense Business Systems, Rapid Prototyping\/Fielding efforts, and other Special Interest (SI) acquisition programs as they progress through the acquisition\/development lifecycle; lead the defense acquisition workforce T&E career field; and support development of policy and guidance for the conduct of DT&E within the DoD."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.417"
                                            },
                                            "Text": {
                                                "val": "- Work with Acquisition Program Managers, Chief Developmental Testers, and Lead DT&E organizations to improve DT&E planning and develop comprehensive and efficient DT&E strategies\/plans through the use of disciplined Developmental Evaluation Framework Matrices and Scientific Test and Analysis Techniques (STAT).\n- Continue to implement the DT&E 'Shift Left' initiative that focuses on ensuring DT&E strategies\/plans are developed in advance of releasing Technology Maturation and Risk Reduction (TMRR) and Engineering and Manufacturing Development (EMD) RFPs, and increasing the amount and quality of data available to support production decisions with specific focus on cybersecurity, interoperability, and reliability.\n- Review\/approve all TEMPs submitted to support milestone reviews.  Ensure DT&E planning is complete prior to the start of DT&E activities.\n- Refine DT&E policies and methodologies addressing DT&E across all Acquisition programs.\n- Publish independent DT&E Sufficiency Assessments for ACAT ID MDAP programs prior to Milestone B and C decisions with the goal of reducing discovery of performance issues later in the acquisition cycle.\n- When requested by the Secretary or Deputy Secretary of Defense, provide independent developmental test assessments in support of USD(A&S) and Service Major Defense Acquisition Programs.\n- Promote the application of sound DT&E and related technical disciplines across the Department's acquisition community and programs.\n- Support USD (R&E) by developing DT&E related policy & guidance.\n- Convene the T&E Key Leadership Position Certification Board to review T&E key leadership candidates.\n- Serve as Functional Leader of the T&E acquisition workforce.\n- Review the DAU T&E education, training, and experience requirements including competencies and certification standards; position category description(s); and content of the DAU courses.  Provide direction on needed changes.\n- Manage the Scientific Test and Analysis Techniques Center of Excellence (STAT COE) and work with the Services to identify funding to sustain the STAT COE.\n- Prepare reports to Congress as required."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.203"
                                            },
                                            "Text": {
                                                "val": "- Work with Acquisition Program Managers, Chief Developmental Testers, and Lead DT&E organizations to improve DT&E planning and develop comprehensive and efficient DT&E strategies\/plans through the use of disciplined Developmental Evaluation Framework Matrices and Scientific Test and Analysis Techniques (STAT).\n- Continue to support rapid prototyping, rapid fielding, and technology demonstrations efforts in the development of tailored comprehensive, efficient, and innovative DT&E strategies\/plans.\n- Continue to implement the OUSD(R&E) 'Shift Left' initiative that focuses on ensuring DT&E strategies\/plans are developed in advance of releasing Technology Maturation and Risk Reduction (TMRR) and Engineering and Manufacturing Development (EMD) Request For Proposals (RFPs), and increasing the amount and quality of data available to support production decisions with specific focus on cybersecurity, interoperability, and reliability.\n- Review\/approve all TEMPs submitted to support milestone reviews.  Ensure DT&E planning is complete prior to the start of DT&E activities.\n- Refine DT&E policies and methodologies addressing DT&E across all Acquisition programs.\n- For ACAT ID programs, publish independent DT&E Sufficiency Assessments prior to Milestone B and C decisions with the goal of reducing discovery of performance issues later in the acquisition cycle.\n- When requested by the Secretary or Deputy Secretary of Defense, provide independent developmental test assessments in support of USD(A&S) and Service Major Defense Acquisition Programs.\n- Promote the application of sound DT&E and related technical disciplines across the Department's acquisition community and programs.\n- Serve as Functional Leader of the T&E acquisition workforce.\n- Review the DAU T&E education, training, and experience requirements including competencies and certification standards; position category description(s); and content of the DAU courses.  Provide direction on needed changes.\n- Develop implementation plan to evolve the DT&E 'state of practice' to keep pace with emerging technologies and improve test efficiency to field systems faster."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.198"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.198"
                                            },
                                            "Text": {
                                                "val": "- Work with Acquisition Program Managers, Chief Developmental Testers, and Lead DT&E organizations to improve DT&E planning and develop comprehensive and efficient DT&E strategies\/plans through the use of disciplined Developmental Evaluation Framework Matrices and Scientific Test and Analysis Techniques (STAT).\n- Continue to support rapid prototyping, rapid fielding, and technology demonstrations efforts in the development of tailored comprehensive, efficient, and innovative DT&E strategies\/plans.\n- Continue to implement the OUSD(R&E) 'Shift Left' initiative that focuses on ensuring DT&E strategies\/plans are developed in advance of releasing Technology Maturation and Risk Reduction (TMRR) and Engineering and Manufacturing Development (EMD) RFPs, and increasing the amount and quality of data available to support production decisions with specific focus on cybersecurity, interoperability, and reliability.\n- Review\/approve all TEMPs submitted to support milestone reviews.  Ensure DT&E planning is complete prior to the start of DT&E activities.\n- Refine DT&E policies and methodologies addressing DT&E across all Acquisition programs.\n- For ACAT ID programs, publish independent DT&E Sufficiency Assessments prior to Milestone B and C decisions with the goal of reducing discovery of performance issues later in the acquisition cycle.\n- When requested by the Secretary or Deputy Secretary of Defense, provide independent developmental test assessments in support of USD(A&S) and Service Major Defense Acquisition Programs.\n- Promote the application of sound DT&E and related technical disciplines across the Department's acquisition community and programs.\n- Serve as Functional Leader of the T&E acquisition workforce.\n- Review the DAU T&E education, training, and experience requirements including competencies and certification standards; position category description(s); and content of the DAU courses.  Provide direction on needed changes.\n- Implement initiatives that evolve the DT&E 'state of practice' to keep pace with emerging technologies and improve test efficiency to field systems faster."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Realignment of program priorities."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "048"
                    },
                    "ProjectTitle": {
                        "val": "Cybersecurity DT&E for Weapon Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "7.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.000"
                        },
                        "BudgetYearTwo": {
                            "val": "7.000"
                        },
                        "BudgetYearThree": {
                            "val": "7.000"
                        },
                        "BudgetYearFour": {
                            "val": "7.000"
                        },
                        "BudgetYearFive": {
                            "val": "7.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Beginning in FY 2021, this project will provide dedicated resources to support MDAP and Rapid Prototyping\/Fielding Program Managers, Chief Developmental Testers, and Lead DT&E Organizations in the development of comprehensive, efficient, and innovative Cybersecurity DT&E strategies\/plans to support key acquisition milestones and engineering\/programmatic decisions.  On behalf of the OUSD(R&E) this project executes the following activities:\n\n- Support acquisition programs in the development of comprehensive, efficient, and innovative Cybersecurity DT&E strategies.  Ensure that Cybersecurity DT&E strategies are documented in Test and Evaluation Master Plans (TEMPs).  Review and approve\/disapprove the Cybersecurity DT&E strategy\/plans within the TEMP.\n- Support rapid prototyping, rapid fielding, and technology demonstrations efforts in the development of tailored comprehensive, efficient, and innovative Cybersecurity DT&E strategies\/plans.\n- Review and oversee Cybersecurity DT&E processes across the services, especially during the formative stages of programs, to include prototyping and experimentation.\n- Provide Cybersecurity DT&E subject matter experts to assist programs in building Developmental Evaluation Frameworks (DEFs) for inclusion in the TEMP.\n- Provide Cybersecurity subject matter experts and assist programs in conducting Cybersecurity Table Top Exercises to identify potential threat vectors and associated risks early in development and focus Cybersecurity DT&E efforts.\n- Provide Cybersecurity subject matter experts to assist programs with Phases 1 and 2 of the DoD Cybersecurity T&E Process and to develop Cybersecurity DT&E test objectives aligned to Cybersecurity requirements for security standards, cyber survivability and operational resilience.\n- Support the development of independent technical risk assessments and advise the Secretary on the Cybersecurity, cyber survivability, and resilience posture before any decision to grant Milestone A or B approval, or enter into low-rate initial production or full-rate production for ACAT ID programs or when requested by the Secretary.\n- Support OUSD(R&E) to develop Cybersecurity policy and guidance that ensures efficient and effective Cybersecurity DT&E across the DoD and in coordination with the Joint Staff and DoD Chief Information Officer (CIO).\n- Identify DoD Cybersecurity test infrastructure gaps and support development of the OUSD(R&E) test resources strategic plan.\n- Ensure that the Cybersecurity DT&E activities are fully integrated into, and consistent with, the DoD Systems Engineering and development planning processes.\n- Evolve the Cybersecurity DT&E 'state of practice' to keep pace with emerging technologies and improve test efficiency to field systems faster.\n- Coordinate with Director, Operational Test and Evaluation to improve Cybersecurity T&E efficiency and make best use of integrated testing."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cybersecurity DT&E for Weapon Systems"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY2021, This program supports and improves the Cybersecurity DT&E efforts of Major Defense Acquisition Program (MDAP), Major Automated Information System (MAIS) \/ Priority Defense Business Systems, Rapid Prototyping\/Fielding efforts, and other Special Interest (SI) acquisition programs as they progress through the acquisition\/development lifecycle; and support development of policy and guidance for the conduct of Cybersecurity DT&E within the DoD."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "- Work with Acquisition Program Managers, Chief Developmental Testers, and Lead DT&E organizations to improve Cybersecurity DT&E planning and develop comprehensive and efficient DT&E strategies\/plans through the use of disciplined Developmental Evaluation Framework Matrices and Scientific Test and Analysis Techniques (STAT).\n- Support rapid prototyping, rapid fielding, and technology demonstrations efforts in the development of tailored comprehensive, efficient, and innovative Cybersecurity DT&E strategies\/plans.\n- Implement the OUSD(R&E) 'Shift Left' initiative that focuses on ensuring Cybersecurity DT&E strategies\/plans are developed in advance of releasing Technology Maturation and Risk Reduction (TMRR) and Engineering and Manufacturing Development (EMD) RFPs, and increasing the amount and quality of data available to support production decisions.\n- Refine Cybersecurity DT&E policies and methodologies addressing Cybersecurity DT&E across all Acquisition programs.\n- When requested by the Secretary or Deputy Secretary of Defense, provide independent Cybersecurity developmental test assessments in support of USD(A&S) and Service Major Defense Acquisition Programs.\n- Promote the application of sound Cybersecurity DT&E and related technical disciplines across the Department's acquisition community and programs.\n- Implement initiatives that evolve the Cybersecurity DT&E 'state of practice' to keep pace with emerging technologies and improve test efficiency to field systems faster.\n- Implement initiatives to guide acquisition programs for how to use Cybersecurity T&E planning and analysis and Cybersecurity tests to identify and mitigate cyber risk in supply chains, development environments, tools and processes.\n- Collaborate with the Intelligence communities to improve cyber intelligence support to Cybersecurity DT&E.\n- Work with Lead DT&E organizations to improve Cybersecurity DT&E workforce capability and retention as well as capacity to support earlier integrated contractor and government Cybersecurity DT&E."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Establish Cybersecurity DT&E for Weapon Systems in PE 0605804D8Z\/048."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}