{
    "id": "2021-Army-PB-2040-JBOOK-7f1ee284016a103cbd6a4d63ea727aa617711f15268cf669f26149e7ae172ad5-19",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602307A"
        },
        "ProgramElementTitle": {
            "val": "Advanced Weapons Technology"
        },
        "R1LineNumber": {
            "val": "25"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "43.454"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "43.454"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020, this Program Element (PE) is realigned with continuity of effort to the following PE:\n* 0602150A Air and Missile Defense Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE investigates enabling technologies for High Energy Laser (HEL) weapons.  Project 042 develops component technologies such as efficient, high energy, solid state lasers; advanced beam control components; and lethality \/ effectiveness measurements that enable better models and simulations for future HEL weapon designs.   \n\nWork in this PE is related to, and fully complements, efforts in PE 0601101A (In-House Laboratory Independent Research), PE 0602120A (Sensors and Electronic Survivability), PE 0603004A (Weapons and Munitions Advanced Technology) and Air Force PE 0602890F (HEL Research).\n  \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.   \n  \nWork is performed by the United States Army Space and Missile Defense Command\/Army Forces Strategic Command (USASMDC \/ ARSTRAT) in Huntsville, AL, and the High Energy Laser Systems Test Facility at White Sands Missile Range, NM."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "44.468"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "43.454"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.014"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.014"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "042"
                    },
                    "ProjectTitle": {
                        "val": "High Energy Laser Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "28.454"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "28.454"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned to:\nProgram Element (PE) 0602150A Air and Missile Defense Technology \n* Project AC9 High Energy Laser Tactical Vehicle Demonstrator Technology\n* Project AD2 High Energy Laser (HEL) Enabling and Support Technology\n* Project AD9 Close Combat High Energy Laser Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and develops advanced technologies for High Energy Laser (HEL) weapon systems to enable more efficient laser systems with greater power output. This includes technologies to support development of alternate laser sources, precision optical pointing and tracking components, adaptive optics to overcome laser degradation due to atmospheric effects, and thermal management systems to remove excess heat.  In addition, this effort validates laser lethality performance and conducts analyses against a variety of targets and investigates the impact of low-cost laser countermeasures.  This project includes laboratory efforts for HEL applied research as well as concepts analysis for United States Army Space and Missile Defense Command\/Army Forces Strategic Command (USASMDC\/ARSTRAT) Technical Center competencies in directed energy, missile defense, and space technical areas. Solid State Laser (SSL) efforts continue to leverage other funds provided by the HEL Joint Technology Office (JTO), the Air Force, and the Navy to develop multiple technical approaches that reduce program risk and maintain competition. \n \nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Solid State Laser Effects"
                                    },
                                    "Description": {
                                        "val": "This effort provides the underlying data required to support high energy laser weapon system effectiveness analyses. This activity includes the full spectrum of lethality testing from fundamental physics investigations to the engagement of flying targets in relevant scenarios. This activity is primarily executed at the Solid State Laser Testbed (SSLT) facility at White Sands Missile Range, New Mexico."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.051"
                                            },
                                            "Text": {
                                                "val": "Completed vulnerability modules and lethality database inputs for UAS Groups 1, 2, and 3. Continued development of lethality database input for rocket, artillery, and mortar (RAM) threats supporting HEL Tactical Vehicle Demonstrator (TVD). Began investigating lethal\/aimpoint on manned fixed- and rotary-wing aircraft."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Beam Control Component Development"
                                    },
                                    "Description": {
                                        "val": "This effort investigates technologies to enable lighter, more agile beam control systems that are robust enough to be used in Army platforms. This work is done in collaboration with the HEL JTO and other Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.419"
                                            },
                                            "Text": {
                                                "val": "Completed Critical Design Review (CDR) for the BCS for the High Energy Laser Tactical Vehicle Demonstrator (HEL TVD). Validated performance of a state-of-the-art adaptive optics (AO) subsystem on a test range using the Mobile Beam Control System Integration Laboratory (MBC SIL), a key knowledge point for HEL TVD development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Efficiency Laser Development"
                                    },
                                    "Description": {
                                        "val": "This effort develops component technologies that increase SSL efficiencies, which will lead to reductions in size and weight for multiple subsystems that greatly improve the ability to integrate SSL systems into Army weapon platforms. This work is done in collaboration with the HEL JTO and other Services. Selected laser design will be fabricated and integrated onto an Army platform to demonstrate a high energy laser system functionality and is fully coordinated with PE 0603004A (Weapons and Munitions Advanced Technology) \/ Project L96 (High Energy Laser Technology Demo)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.951"
                                            },
                                            "Text": {
                                                "val": "Completed 100kW laser subsystem build in support of the High Energy Laser Tactical Vehicle Demonstrator (HEL TVD) effort."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HEL Research and Development and Concepts Analysis Laboratories"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on developing in-house expertise through SSL assessments and starting in FY15, other USASMDC\/ARSTRAT technical core competencies, including air and missile defense, responsive space, and small satellites."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.033"
                                            },
                                            "Text": {
                                                "val": "Completed analysis of laboratory level experiments to validate ETS performance against baseline requirements. Completed collecting field data to support model verification. Developed initial algorithms for advance adaptive optics."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NA5"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Weapons Components (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "15.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional increase for Program increase"
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding provided for Advanced Weapons Components applied research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "High energy laser technology"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "High energy laser technology"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "COE in high energy and laser and optical technology"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "COE in high energy and laser and optical technology"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}