{
    "id": "2021-Army-PB-2040-JBOOK-8f7fdbb59cb85b132b0478715b87ff02c7eb359f73f79d73e48c9151ed5a28f2-4",
    "meta": {
        "filename": "2021-BASE_RDTE-2021-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2021.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603005A"
        },
        "ProgramElementTitle": {
            "val": "Combat Vehicle and Automotive Advanced Technology"
        },
        "R1LineNumber": {
            "val": "47"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "171.448"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "171.448"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year 2020 (FY20) this Program Element (PE) was realigned with continuity of effort to the following PEs:\n? 0603119A Ground Advanced Technology\n? 0603462A Next Generation Combat Vehicle Advanced Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE matures, integrates and demonstrates combat and tactical vehicle automotive technologies that enable a lighter, more mobile and more survivable force. This PE executes the Army's Combat Vehicle Prototyping program to mature, integrate and demonstrate ground vehicle leap ahead technologies in support of future combat vehicles. Project 221 (Combat Vehicle Survivability) matures, integrates and demonstrates protection and survivability technologies such as active protection systems, advanced vehicle armors, blast mitigation and occupant safety devices to address both current and emerging advanced threats to ground vehicles. Project 441 (Combat Vehicle Mobility) matures and demonstrates advanced ground vehicle power and mobility technologies such as powertrains, power generation and storage, water and fuel logistics, and running gear subsystems for military ground vehicles to enable a more efficient, mobile and deployable force. Project 497 (Combat Vehicle Electro) matures, integrates, and demonstrates vehicle electronics hardware (computers, sensors, communications systems, displays, and vehicle command\/control\/driving mechanisms) and software that result in increased crew efficiencies, vehicle performance, reduced size, weight, and power (SWaP) burdens and vehicle maintenance costs. Project 515 (Robotic Ground Systems) matures and demonstrates unmanned ground vehicle (UGV) technologies with a focus on sensors, perception hardware and software, and robotic control algorithms that enable UGV systems to maneuver on and off road at speeds which meet mission requirements with minimal human intervention.\n\nWork in this PE is coordinated with, PE 0602105A (Materials Technology), 0602120A (Sensors and Electronic Survivability), 0602601A (Combat Vehicle and Automotive Technology), 0602618A (Ballistics Technology), 0602624A (Weapons and Munitions Technology), 0602705A (Electronics and Electronic Devices), 0602784 (Military Engineering Technology), 0603001A (Warfighter Advanced Technology), 0603004A (Weapons and Munitions Advanced Technology), 0603005 (Combat Vehicle and Automotive Advanced Technology), 0603125A (Combating Terrorism Technology Development), 0603270A (Electronic Warfare Technology), 0603313A (Missile and Rocket Advanced Technology), 0603734 (Military Engineering Advanced Technology), 0604115A (Technology Maturation Initiatives), and 0708045A (Manufacturing Technology).  \n\nBeginning in FY20, work in this PE is related to, and fully coordinated with PE 0602145A (Next Generation Combat Vehicle Technology), 0603119A (Ground Advanced Technology), and PE 0603462A (Next Generation Combat Vehicle Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. All FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this PE is performed by the United States Army Futures Command."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "176.622"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "171.448"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.174"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.6"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.574"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "221"
                    },
                    "ProjectTitle": {
                        "val": "Combat Veh Survivablty"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "56.726"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "56.726"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0603462A Next Generation Combat Vehicle Advanced Technology\n* Project BG7 Ground Systems Active Defense (GSAD) Advanced Tech\n* Project BH1 Survivability Systems Controls Advanced Technology\n* Project BH4 Ground Vehicle Holistic Defense Adv Tech \n* Project BI5 Materials Application & Integration Adv Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures, integrates, and demonstrates protection and survivability technologies such as active protection systems (APS), advanced vehicle armors, blast mitigation and occupant safety devices to address both current and emerging advanced threats to ground vehicles. This Project integrates complimentary survivability technologies to enable advanced protection suites, providing greater survivability and protection against emerging threats. This Project executes the Army's APS program to mature and demonstrate APS technologies in order to increase protection against current and emerging advanced threats while maintaining or reducing vehicle weight by reducing reliance on armor through the use of other means such as sensing, warning, hostile fire detection and active countermeasures. This Project develops an APS Common Architecture that defines the component interface standards and component specifications enabling adaptable APS solutions that can be integrated across Army vehicle platforms as required.\n\nWork in this Project supports the Army Science and Technology Ground Maneuver Portfolio.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY20 realignments are due to financial restructuring in support of Army Modernization Priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Armor Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures, fabricates, integrates, and evaluates advanced ground vehicle armor systems such as advanced passive kinetic energy armor, explosive reactive armor, electromagnetic armor, and adaptive armor. The goal is to optimize armor system technologies and integration methodologies to reduce overall armor system weight; create and mature scalable \/ modular \/ common armor system integration standards for the advanced armor technologies; create armor system test & evaluation standards for advanced armor technologies and leverages the standards for armor component and armor system maturation; refine armor modeling and simulation system engineering process to incorporate advances in armor technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.964"
                                            },
                                            "Text": {
                                                "val": "Validated integrated subsystem performance for passive (B-kit) and reactive armor (C-kit) against weight and cost objectives; prepared for ballistic performance testing of the B-kit and C-kit armor subsystems; matured adaptive armor solution and optimize for integration with Modular Active Protection System (MAPS) surrogate subsystems into subsystem demonstrator to maximize performance; verified refined subsystem design through modeling and simulation; conducted a demonstration of adaptive armor solutions to verify ballistic performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blast Mitigation"
                                    },
                                    "Description": {
                                        "val": "This effort fabricates and matures advanced survivability and protection components, tools, and subsystems for enhanced protection against vehicle mines, improvised explosive devices (IEDs) and other underbody blast threats, and vehicle collision and rollover events that result from blast events. This effort also integrates and improves occupant protection\ntechnologies such as seats and restraints. This effort creates the laboratory capability needed to enable expeditious performance evaluation through modeling & simulation (M&S), experimentation, and instrumented test of blast mitigating technologies in such areas as active and passive exterior\/hull\/cab\/kits, interior energy absorbing capabilities for seats, floors, restraints, and sensors for active blast mitigating technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.174"
                                            },
                                            "Text": {
                                                "val": "Conducted component design improvements for seats, restraints, flooring, structures and active blast technologies based on component level test results.  Assessed blast technology form, fit and function in an integrated blast mitigation system prior to system level integration. Fabricated seats, restraints, flooring, structures and active blast components that wereintegrated into a system demonstrator for vehicle section durability and blast testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vehicle Fire Protection"
                                    },
                                    "Description": {
                                        "val": "This effort matures, integrates, and demonstrates technologies to minimize vehicle and crew vulnerabilities to fires in current and future military ground vehicles. Supporting technologies include modeling & simulation, sensor systems, software, chemical agents, fire-resistant materials, and hardware components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.628"
                                            },
                                            "Text": {
                                                "val": "Continued to evaluate no\/low global warming potential fire protection agents through full scale testing. Matured vehicle fire protection concepts for the next generation of combat vehicles to improve integration feasibility and effectiveness. Developed concepts and technologies to conduct fuel containment and fire prevention."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hit Avoidance Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures, integrates, and demonstrates hard-kill (physical countermeasure) and soft-kill (non-kinetic countermeasure such as electronic jamming or spoofing) Active Protection System (APS) components and integrated systems to verify the APS Common Architecture and reduce integrating risk on current systems. In demonstrating hard-kill and soft kill-active protection technologies, requirements, and specifications will be matured for future integration onto tactical and combat vehicle platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.365"
                                            },
                                            "Text": {
                                                "val": "Completed Modular Active Protection System Controller (MAC) software updates based on improvements required from previous demonstrations and testing. Integrated updated software into the MAC. Completed a virtual demonstration of hard-kill systems integrated on current vehicle platforms. Completed the integration of the MAC to demonstrate and validate a soft-kill and hard-kill APS configuration on a demonstrator platform against various threats in various environmental conditions; completed fabrication and integration of soft-kill and hard-kill system with the MAC on a platform demonstrator. Completed demonstration and testing of a layered soft-kill and hard-kill active protection system integrated on a platform demonstrator to validate MAC modularity and system performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "System Design Optimization for Lightweighting"
                                    },
                                    "Description": {
                                        "val": "This effort will focus on optimization of platform design to reduce weight in both traditional and novel methods. This effort will demonstrate best practices in cost-conscious, multi-material design for components to reduce ground vehicle weight, as well as demonstrate holistic weight reduction with informed system and component-level design decisions. This will be accomplished by using and evaluating design tools, advanced materials, manufacturing processes and assembly technologies to design lightweight systems, develop lightweight components and enhance the ability to use novel approaches for lightweighting. This effort leverages lessons learned from prior and ongoing individual component efforts within industry, academia and Department of Defense (DoD)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.465"
                                            },
                                            "Text": {
                                                "val": "Assessed the modeling and simulation data to provide metrics validating the value of Lightweighting to improve transportability, increase fuel economy and increase size, weight, power and cost. Continued to evaluate advanced materials and their ability to optimize weight while maintaining or improving performance. Conducted Modeling & Simulation to evaluate the impact of lightweight materials on vehicle subsystem loading."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Description": {
                                        "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.13"
                                            },
                                            "Text": {
                                                "val": "FY 2018 NDAA SEC 825 MDAP Cost Overrun"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "441"
                    },
                    "ProjectTitle": {
                        "val": "Combat Vehicle Mobilty"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "25.773"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "25.773"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0603119A Ground Advanced Technology\n* Project BK9 Ground System Fluids and Fuels Adv Tech\nPE 0603462A Next Generation Combat Vehicle Advanced Technology\n* Project BF7 Crew Augmentation and Optimization Adv Tech\n* Project BG4 Adv Mobility Experimental Prototype Adv Tech Demo\n* Project BH6 Platform Electrification and Mobility Adv Tech\n* Project BI8 All-Electric Combat Powertrain Advanced Technology\n* Project BJ1 Vehicle System Security Advanced Technology\n* Project BJ6 Hydrogen Based Combat System Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates advanced mobility and onboard electrical power technologies for combat and tactical vehicles to enable lightweight, agile, deployable, fuel efficient and survivable ground vehicles. Technologies include advanced propulsion, engines, transmissions, power, and electrical components and subsystems. This Project will also mature and demonstrate advanced mechanical and electrical power generation systems to increase available onboard electrical power to enable future capabilities such as next generation communications and networking, improvised explosive device jamming systems and next generation sensor devices can be supported on combat and tactical vehicles. This Project also matures and demonstrates water and fuel logistics technologies.\n\nWork in this Project supports the Army Science and Technology Ground Maneuver portfolio.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Onboard Vehicle Electric Power Component Development:"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on meeting the Army's demand for more onboard vehicle electric power (OBVP) to enable technologies such as advanced survivability systems, situational awareness systems and the Army network. This effort matures, integrates, and demonstrates onboard vehicle power components to include electrical power generation machines and associated power converters  such as high temperature inverters and converters, advanced control algorithms, and high efficiency power conversion (mechanical to electrical) components. Additionally, it matures and integrates advanced electric machines such as Integrated Starter Generator and their controls for mild hybrid (System that integrated electric machines to assist internal combustion engines for propulsion) electric propulsion and high power electric generation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.838"
                                            },
                                            "Text": {
                                                "val": "Continued to exploit SIL system optimization, performance, and reliability pushing components to higher powertrain operating temperatures and finalizing OBVP system communication\/ network architecture; integrated and optimized advanced OBVP system with an advanced powertrain to include thermal management and define interface with vehicle power management controls; optimized control algorithms for intelligent engine start\/stop for the minimization of idle fuel usage."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Running Gear:"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates running gear components and advanced suspension technologies to increase vehicle mobility and durability in response to increased ground vehicle platform weights. Components and subsystems include new elastomer compounds, lightweight, survivable track systems and road wheels, advanced compensating track tensioners, advanced damping suspension technologies, Electronic Stability Control (ESC) systems, and preview sensing technologies linked to advanced suspension designs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.14"
                                            },
                                            "Text": {
                                                "val": "Continued to mature and demonstrate an integrated advanced track and suspension solution for a medium combat vehicle; optimized the advanced track and suspension solution to provide increased mobility at a reduced weight; demonstrated and improved durability and exploited new design to reduce maintenance tasks as compared to currently fielded track solutions; fabricated components to demonstrate an integrated system for design optimization of an advanced medium combat vehicle running gear system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Vehicle Subsystem Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort contributes to the Army's ground platform risk reduction efforts which seek to address technical and integration challenges in the areas of mobility, survivability, and vehicle architecture and systems integration. The primary focus of this activity is to mature and demonstrate a series of subsystem demonstrators building off of previous investment in ground combat acquisition and technology programs with the purpose of maturing key technologies to refine and inform future platform requirements and reduce risks in critical ground combat vehicle technology areas. Specifically, this effort focuses on maturing and demonstrating ground combat vehicle mobility technologies such as powertrain subsystems and systems integration technologies such as vehicle structures and concept demonstrators. This effort seeks to optimize platform efficiency and growth potential to ensure the combat fleet is able to accept new technologies as they are developed to bring advanced capability for the Warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.112"
                                            },
                                            "Text": {
                                                "val": "Fabricated advanced propulsion components such as advanced engine, advanced transmission, and advanced thermal management system; continued to optimize next generation combat vehicle with advanced technologies and lessons learned to allow for flexible, scalable and modular technologies; integrated and optimized components from powertrain to demonstrate advanced technologies, capabilities, and improved performance; validated mobility and occupant protection analyses, trade studies, and concepts to inform the advanced combat vehicle survivability demonstrator; continued to evaluate and optimize concept platform configurations to reduce gaps in operational capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energy Storage Systems Development:"
                                    },
                                    "Description": {
                                        "val": "The goal of this work is to mature energy storage systems to both enable silent watch capability and increased survivability through power brick energy storage components for pulse power electromagnetic armor. This is accomplished through the maturation and demonstration of advanced ground vehicle energy storage devices such as advanced chemistry batteries, high energy density capacitors, and power brick batteries for pulse power. This effort leverages commercial industry battery development efforts to reduce battery volume and weight while improving their energy and power densities. This effort also matures and optimizes a common specification for battery management systems to improve the battery state of charge indicator accuracy and battery state of health information to reduce the frequency of battery replacement and optimize starting, lighting, and ignition functions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.137"
                                            },
                                            "Text": {
                                                "val": "Continued to optimize advanced form factor (6T) Lithium-ion battery pack system level performance and durability to decrease recharge time, weight, and volume; improved the integrated battery management system and demonstrated optimized combat vehicle power management synchronization and safety; continued to demonstrate safe logistical transportation of Lithium-ion battery packs with the Navy, improve the Li-ion specification, and inform combat vehicle standardized interfaces to reduce logistics costs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Propulsion and Thermal Technologies:"
                                    },
                                    "Description": {
                                        "val": "This effort matures high power density engines and transmission systems needed to offset increasing combat vehicle weights (armor), increased electrical power generation needs (onboard communications, surveillance and exportable power), improved fuel economy (fuel cost and range), enhanced mobility (survivability), and reduced cooling system burden (size and heat dissipation). This effort also matures thermal management including heat energy recovery, propulsion and cabin thermal management sub-systems to utilize waste heat energy and meet objective power and mobility requirements on combat and tactical vehicles. Lastly, this effort maximizes efficiencies within propulsion and thermal systems to reduce thermal burden on the vehicle while providing the same or greater performance capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.793"
                                            },
                                            "Text": {
                                                "val": "Completed interface and software maturation of opposed piston engine, advanced thermal management, advanced combat transmission for integration into advanced combat propulsion system; optimized the control strategy for each component and develop supervisory controls for integration of the advanced propulsion system; completed design of components needed to integrate the advanced combat propulsion system into hull for demonstration; demonstrated and validated advanced propulsion system controls calibration and efficient operation to meet combat vehicle electrical power and mobility requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Force Projection:"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on reducing the logistics footprint, improving fuel efficiency, and ensuring mobility by maturing and demonstrating technologies in areas such as water purification, generation, quality monitoring, storage and distribution and wastewater treatment and reuse; petroleum quality monitoring, filtration, storage and distribution, hydraulic fluids; alternative fuels and fuel additives; lubricants, oil, powertrain fluids and coolants."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.206"
                                            },
                                            "Text": {
                                                "val": "Continued to demonstrate energy efficient waste water treatment and recycling technologies to support sustainability logistics basing; continued to optimize performance of synthetic fuel blends made from non-petroleum sources to determine suitability for military ground systems that will allow for an increase in energy security; validated that the fuel efficient gear oils maintain and improve vehicle axle durability and provide extended performance time over current gear oil, as well as limited slip performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Crew Augmentation"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on optimizing crew station technologies while reducing crew sizes that will provide the same overall performance by exploiting human interaction technologies, automations, machine intelligence and customization to permit soldiers to achieve performance beyond today?s constrained ground vehicle environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.547"
                                            },
                                            "Text": {
                                                "val": "Matured software and demonstrated simulations to provide workload, span of control and mission performance data to show improved soldier performance through customization, machine augmented, information sorting, and weapon engagement software and algorithms; continued demonstrating that crew size reduction can provide the same overall performance by validating technical assessments that will provide a strong knowledgebase to support future crew stations efforts."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "497"
                    },
                    "ProjectTitle": {
                        "val": "Combat Vehicle Electro"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.993"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "6.993"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0603462A Next Generation Combat Vehicle Advanced Technology\n* Project BH8 Enhanced VETRONICS Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures, integrates, and demonstrates vehicle electronics hardware such as computers, sensors, communications systems, displays, and vehicle command\/control\/driving mechanisms as well as vehicle software to enhance crew performance, increase vehicle fuel efficiency, reduced Size, Weight, and Power (SWaP) burdens and reduce vehicle maintenance costs. This Project also advances open system architectures (power and data) for military ground vehicles to enable common interfaces, standards and hardware implementations. The overall vehicle system architecture is known as the Vehicle Integration for Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance \/ Electronic Warfare (C4ISR\/EW) Interoperability (VICTORY), which is a long term technology effort that provides an open architecture that will allow platforms to accept future technologies without the need for significant re design as new technologies are developed and integrated. Additionally this Project matures autonomy architectures that enable the ease of integration of autonomous subsystem technologies into future and existing tactical and combat vehicle architectures. Technical challenges include: software and algorithm development for increased levels of automation for both manned and unmanned systems, secure vehicle data networks, interoperability of intra vehicle systems, and implementation of advanced user interfaces.\nOvercoming these technical challenges enables improved and increased span of collaborative vehicle operations, efficient workload management, commander's decision aids, embedded simulation for battlefield visualization and fully integrated virtual test\/evaluation.\n\nWork in this Project supports the Army Science and Technology Ground Maneuver portfolio.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Vehicle Electronics Integration Technologies:"
                                    },
                                    "Description": {
                                        "val": "This effort matures, demonstrates and implements next generation military ground vehicle electronics and electrical power open architectures for future ground combat and tactical vehicle systems. Mature and demonstrate technologies to include: next generation video\/data networking and computing equipment, Silicon Carbide high voltage power electronics and low voltage smart power distribution. Technologies will reduce currently fielded vehicle overall size, weight and power concerns for vehicle electronics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.803"
                                            },
                                            "Text": {
                                                "val": "Validated the matured technology demonstration designs and technologies from the Vehicle Electronics Architecture Research System Integration Laboratory in a current combat vehicle platform to validate enhanced performance specifications for open power, data, network interface requirements, standards and architecture design. Validate integrated Silicon Carbide (SiC) power system functionality."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vehicle Electronics Architecture and Standards:"
                                    },
                                    "Description": {
                                        "val": "This effort matures technologies and standards for existing and future combat and tactical ground vehicles. Open commercial standards will be evaluated and modified for use in military ground vehicles and possible inclusion in the Army's open, non-proprietary intra-vehicle data network e.g., VICTORY.  This effort will also evaluate standards and components for suitability of integration into vehicle platforms. This effort also supplements the design of electronic architectures to support the efficient integration of electronic components into vehicle systems through the use of open standards. Additionally, this effort matures and expands the VICTORY effort to interface with the Modular Active Protection System (MAPS) Architecture."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.015"
                                            },
                                            "Text": {
                                                "val": "Validated the open data and power architecture capabilities as the Vehicle Electronics Architecture Mobility Demonstrator is prepared for demonstration. Validated the MAPS standard interface definitions to mature compliant systems that support the efficient integration of electronics components into vehicle systems through the use of open standards."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Vehicle Architecture:"
                                    },
                                    "Description": {
                                        "val": "This project matures, integrates, and demonstrates an improved, optimized autonomy-enabled distribution architecture that eases integration of new and emerging technologies across the full spectrum of operational and tactical supply movement operations. This project addresses systems integration challenges by providing the appropriate fault tolerant architecture design artifacts that will allow ease of integration for autonomy enablement kits, autonomy enablement software, and end-to-end sustainment and tactical ground resupply capability through use of open systems interfaces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.175"
                                            },
                                            "Text": {
                                                "val": "Continued to mature and validate the common system architecture for autonomous vehicles by demonstrating autonomous vehicle architecture, algorithm software modules, a common interface and hardware and software integration across the full spectrum of operational and tactical supply movement operations."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "515"
                    },
                    "ProjectTitle": {
                        "val": "Robotic Ground Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "24.956"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "24.956"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020 (FY20) this Project was realigned to:\nProgram Element (PE) 0603462A Next Generation Combat Vehicle Advanced Technology\n* Project BF2 Autonomous Ground Resupply (AGR) Adv Tech\n* Project BF4 Combat Vehicle Robotics Adv Tech\n* Project BK1 Autonomous Mobility Adv Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates technologies to enable Unmanned Ground Vehicles (UGV) including sensor technologies, perception hardware and software, and control technologies that allow the Soldier to perform mission tasks more efficiently. Challenges addressed include: obstacle avoidance, overcoming perception limitations, intelligent situational behaviors, command and control by Soldier operators, frequency of human intervention, operations in adverse weather, and autonomy enabled vehicles protecting themselves and their surroundings from intruders. Mature technologies are incorporated onto existing, Army owned UGV technology demonstrators so that performance of the enabling technologies can be evaluated.\n\nThe approach builds upon, complements, and does not duplicate previous and ongoing investments conducted under the Joint Robotics Program Office. Work in this Project supports the Army Science and Technology Ground Maneuver Portfolio. Ground Maneuver Portfolio investments are greatly improving logistics throughput and surge capability supporting maneuver forces (Leader Follower technology) and allow experimentation with manned and unmanned teams to develop the advantages that inform\/protect the maneuver force (Robotic Wingman JCTD).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY20 realignments are due to financial restructuring in support of Army Modernization Priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unmanned Ground Systems Technology:"
                                    },
                                    "Description": {
                                        "val": "This effort matures, integrates, and demonstrates advanced robotic and autonomous technologies for the tactical and combat vehicle fleets. Unmanned ground systems technologies can be employed to overcome critical Army challenges to include automated resupply and sustainment, and reduced physical and cognitive burden. Challenges can be met by utilizing relevant technologies such as behavior algorithms, autonomy kits, sensor integration, advanced navigation and planning, object and local environment manipulation, local situational awareness, advanced perception, vehicle and pedestrian safety, and robotic command and control."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.955"
                                            },
                                            "Text": {
                                                "val": "Matured and developed an improved and optimized unmanned ground vehicle distribution system that integrates new and emerging technologies across the full spectrum of operational and tactical supply movement operations.  Continued to optimize common interfaces and open architecture.  Matured hardware-in-the-loop simulators to optimize cargo and vehicle configurations and implementations of autonomous ground resupply on realistic routes.  Continued to improve test and evaluation procedures for robotic systems utilizing modeling and simulation tools that will increase vehicle and pedestrian safety along with robotic control and command."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Ground Vehicle Architecture Integration and Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort matures, integrates, and demonstrates advanced robotic and autonomous foundational architecture and the technologies to enable tactically relevant unmanned ground systems. Technologies focused on creating an open Autonomous Ground Vehicle Reference Architecture for all future unmanned platforms, improved tactical and maneuver intelligence and behavior algorithms based off the architecture, sensor integration and advanced perception for off road, manned and unmanned teaming for the tactical environment, and enabling the integration of weapons and vehicle self-protection capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.001"
                                            },
                                            "Text": {
                                                "val": "Matured and developed an improved and optimized unmanned ground vehicle distribution system that integrates new and emerging technologies across the full spectrum of operational and tactical supply movement operations.  Continued to optimize common interfaces and architecture for all future autonomous ground vehicle development. Matured and defined open architecture design, data buses and messages. Exploited automation software and algorithms to increase platform autonomy in complex environments and mission applications. Matured and demonstrated scalable autonomy in a single material solution agnostic of platform."
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "533"
                    },
                    "ProjectTitle": {
                        "val": "Ground Vehicle Demonstrations (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "57"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "57.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "These are Congressional Interest Items"
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program increase - lightweight technology for ground combat and tactical vehicles"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Program increase - lightweight technology for ground combat and tactical vehicles"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program increase - advanced water harvesting technology"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Program increase - advanced water harvesting technology"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program increase - fuel cell research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Program increase - fuel cell research"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program increase - airless tire technology demonstration"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4"
                                        },
                                        "Text": {
                                            "val": "Program increase - airless tire technology demonstration"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program increase - HMMWV automotive enhancements"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Program increase - HMMWV automotive enhancements"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program increase - HMMWV autonomy"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "3"
                                        },
                                        "Text": {
                                            "val": "Program increase - HMMWV autonomy"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program increase - HMMWV power system"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "2"
                                        },
                                        "Text": {
                                            "val": "Program increase - HMMWV power system"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program increase - HMMWV torque monitoring"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "3"
                                        },
                                        "Text": {
                                            "val": "Program increase - HMMWV torque monitoring"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program increase - multi-sensor augmented reality system"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Program increase - multi-sensor augmented reality system"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program increase - combat vehicle weight reduction initiative"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Program increase - combat vehicle weight reduction initiative"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}